var tests = {
  "tests": [
      {
          "qID": 1,
          "qName": "Патологический процесс, в основе которого лежат нарушения тканевого (клеточного) метаболизма, ведущие к структурным изменениям – это …",
          "rA": [
              "дистрофия"
          ],
          "wA": [
              "апоптоз",
              "гипоксия",
              "гиперемия",
              "опухоль"
          ]
      },
      {
          "qID": 2,
          "qName": "К нелетальным повреждениям клеток и тканей относятся …",
          "rA": [
              "дистрофия"
          ],
          "wA": [
              "некроз",
              "апоптоз",
              "гангрена"
          ]
      },
      {
          "qID": 3,
          "qName": "К летальным повреждениям клеток и тканей относятся …",
          "rA": [
              "некроз",
              "апоптоз"
          ],
          "wA": [
              "дистрофия",
              "атрофия"
          ]
      },
      {
          "qID": 4,
          "qName": "В зависимости от локализации выделяют патологические накопления (дистрофии) …",
          "rA": [
              "внутриклеточные (паренхиматозные)",
              "внеклеточные (стромально-сосудистые)"
          ],
          "wA": [
              "минеральные",
              "врожденные"
          ]
      },
      {
          "qID": 5,
          "qName": "Патологические накопления (дистрофии), при которых отложения продуктов нарушенного обмена наблюдаются и в паренхиме, и в строме пораженной ткани, называются …",
          "rA": [
              "смешанными"
          ],
          "wA": [
              "стромально-сосудистыми",
              "паренхиматозными",
              "наследственными"
          ]
      },
      {
          "qID": 6,
          "qName": "По химической природе накапливающихся веществ дистрофии бывают …",
          "rA": [
              "белковые",
              "жировые",
              "углеводные",
              "минеральные"
          ],
          "wA": [
              "гормональные"
          ]
      },
      {
          "qID": 7,
          "qName": "Морфогенетическим механизмами патологических накоплений (дистрофий) являются …",
          "rA": [
              "инфильтрация",
              "декомпозиция",
              "трансформация",
              "извращенный синтез"
          ],
          "wA": [
              "экссудация"
          ]
      },
      {
          "qID": 8,
          "qName": "Избыточное проникновение продуктов обмена из крови и лимфы в клетки и межклеточное вещество с последующим их накоплением – это …",
          "rA": [
              "инфильтрация"
          ],
          "wA": [
              "трансформация",
              "декомпозиция (фанероз)",
              "извращенный синтез"
          ]
      },
      {
          "qID": 9,
          "qName": "Распад ультраструктур клеток и межклеточного вещества – это …",
          "rA": [
              "декомпозиция (фанероз)"
          ],
          "wA": [
              "трансформация",
              "инфильтрация",
              "извращенный синтез"
          ]
      },
      {
          "qID": 10,
          "qName": "Образование несвойственных организму веществ – это …",
          "rA": [
              "извращенный синтез"
          ],
          "wA": [
              "трансформация",
              "декомпозиция (фанероз)",
              "инфильтрация"
          ]
      },
      {
          "qID": 11,
          "qName": "Превращение продуктов одного вида обмена в другой – это …",
          "rA": [
              "трансформация"
          ],
          "wA": [
              "декомпозиция",
              "инфильтрация",
              "извращенный синтез"
          ]
      },
      {
          "qID": 12,
          "qName": "К внутриклеточным накоплениям приводят:",
          "rA": [
              "недостаточное выведение метаболитов",
              "невозможность выведения экзогенных веществ",
              "ускорение образования естественных метаболитов"
          ],
          "wA": [
              "ускоренное выведение экзогенных веществ",
              "ускоренное выделение продуктов метаболизма"
          ]
      },
      {
          "qID": 13,
          "qName": "Вакуоли с жидкостью в цитоплазме клеток появляются при … дистрофии",
          "rA": [
              "гидропической"
          ],
          "wA": [
              "зернистой",
              "гиалиново-капельной",
              "роговой"
          ]
      },
      {
          "qID": 14,
          "qName": "Для \"тигрового\" сердца характерно накопление в цитоплазме кардиомиоцитов …",
          "rA": [
              "жиров"
          ],
          "wA": [
              "белков",
              "солей кальция",
              "липофусцина",
              "углеводов"
          ]
      },
      {
          "qID": 15,
          "qName": "Для макроскопической картины жировой дистрофии миокарда характерны … сердца",
          "rA": [
              "увеличение размеров",
              "на разрезе глинистый вид",
              "расширение полостей"
          ],
          "wA": [
              "плотная консистенция"
          ]
      },
      {
          "qID": 16,
          "qName": "Жировая дистрофия печени чаще развивается по механизму …",
          "rA": [
              "инфильтрации",
              "трансформации"
          ],
          "wA": [
              "декомпозиции",
              "извращённого синтеза"
          ]
      },
      {
          "qID": 17,
          "qName": "К стромально-сосудистым белковым дистрофиям относятся …",
          "rA": [
              "мукоидное набухание",
              "фибриноидное набухание",
              "гиалиноз"
          ],
          "wA": [
              "некроз"
          ]
      },
      {
          "qID": 18,
          "qName": "Гиалиноз является исходом …",
          "rA": [
              "прогрессирующей дезорганизации соединительной ткани"
          ],
          "wA": [
              "жировой дистрофии клеток",
              "колликвационного некроза",
              "жировой инфильтрации стромы"
          ]
      },
      {
          "qID": 19,
          "qName": "Видами внеклеточных (стромально-сосудистых) патологических накоплений являются …",
          "rA": [
              "гиалиноз",
              "амилоидоз"
          ],
          "wA": [
              "гидропическая дистрофия",
              "фанероз"
          ]
      },
      {
          "qID": 20,
          "qName": "Ожирение сердца характеризует …",
          "rA": [
              "ожирение стромы миокарда",
              "ожирение субэпикардиальной клетчатки"
          ],
          "wA": [
              "выявление жира в цитоплазме кардиомиоцитов",
              "«тигровое» сердце"
          ]
      },
      {
          "qID": 21,
          "qName": "При смешанных дистрофиях продукты нарушенного обмена откладываются …",
          "rA": [
              "в паренхиме органов",
              "в строме органов",
              "в стенках сосудов",
              "в капсуле органов"
          ],
          "wA": []
      },
      {
          "qID": 22,
          "qName": "По смешанному типу обычно откладываются …",
          "rA": [
              "пигменты",
              "минералы"
          ],
          "wA": [
              "липиды",
              "углеводы"
          ]
      },
      {
          "qID": 23,
          "qName": "К гемоглобиногенным пигментам относятся …",
          "rA": [
              "гемосидерин",
              "билирубин",
              "солянокислый гематин"
          ],
          "wA": [
              "меланин",
              "липофусцин"
          ]
      },
      {
          "qID": 24,
          "qName": "При гемохроматозе отмечается избыточное накопление в тканях …",
          "rA": [
              "гемосидерина"
          ],
          "wA": [
              "гемомеланина",
              "билирубина",
              "липофусцина",
              "холестерина"
          ]
      },
      {
          "qID": 25,
          "qName": "Гемосидерин придает органам (тканям) … цвет",
          "rA": [
              "бурый"
          ],
          "wA": [
              "черный",
              "желтый",
              "красный",
              "серый"
          ]
      },
      {
          "qID": 26,
          "qName": "К протеиногенным (тирозиногенным) пигментам относятся …",
          "rA": [
              "адренохром",
              "меланин"
          ],
          "wA": [
              "липофусцин",
              "липохром",
              "билирубин"
          ]
      },
      {
          "qID": 27,
          "qName": "Местный гипермеланоз развивается при …",
          "rA": [
              "меланоме",
              "невусе"
          ],
          "wA": [
              "альбинизме",
              "аддисоновой болезни"
          ]
      },
      {
          "qID": 28,
          "qName": "Аддисонова (бронзовая) болезнь – это проявление …",
          "rA": [
              "общего гипермеланоза"
          ],
          "wA": [
              "общего гипомеланоза",
              "местного гипермеланоза",
              "местного гипермеланоза"
          ]
      },
      {
          "qID": 29,
          "qName": "Альбинизм – это проявление …",
          "rA": [
              "общего гипомеланоза"
          ],
          "wA": [
              "общего гипермеланоза",
              "местного гипермеланоза",
              "местного гипермеланоза"
          ]
      },
      {
          "qID": 30,
          "qName": "Видами патологического обызвествления являются …",
          "rA": [
              "дистрофическое",
              "метастатическое"
          ],
          "wA": [
              "некротическое",
              "атрофическое",
              "гипертрофическое"
          ]
      },
      {
          "qID": 31,
          "qName": "Некроз – это …",
          "rA": [
              "гибель клеток в живом организме"
          ],
          "wA": [
              "запрограмированная смерть клеток",
              "накопление продуктов нарушенного обмена веществ",
              "бесконтрольное размножение клеток"
          ]
      },
      {
          "qID": 32,
          "qName": "К изменениям клетки при некрозе относят …",
          "rA": [
              "кариопикноз",
              "кариорексис",
              "кариолизис",
              "плазмокоагуляцию"
          ],
          "wA": [
              "плазматическое пропитывание"
          ]
      },
      {
          "qID": 33,
          "qName": "Главным признаком мертвой клетки является …",
          "rA": [
              "отсутствие ядра"
          ],
          "wA": [
              "наличие в цитоплазме вакуолей с жидкостью",
              "разрушение межклеточных контактов",
              "зернистость цитоплазмы и ядра"
          ]
      },
      {
          "qID": 34,
          "qName": "Морфологическим подтверждением прижизненности некротических изменений является …",
          "rA": [
              "наличие демаркационной воспалительной реакции"
          ],
          "wA": [
              "исчезновение в мертвых клетках ядер",
              "распад цитоплазмы",
              "отложение солей кальция",
              "формирование апоптозных телец"
          ]
      },
      {
          "qID": 35,
          "qName": "Виды некроза в зависимости от причин …",
          "rA": [
              "травматический",
              "сосудистый",
              "аллергический"
          ],
          "wA": [
              "воспалительный",
              "дистрофический"
          ]
      },
      {
          "qID": 36,
          "qName": "Клинико-морфологическими формами некроза являются …",
          "rA": [
              "секвестр",
              "гангрена",
              "инфаркт"
          ],
          "wA": [
              "киста",
              "флегмона"
          ]
      },
      {
          "qID": 37,
          "qName": "Видами сухого некроза являются …",
          "rA": [
              "творожистый",
              "восковидный"
          ],
          "wA": [
              "колликвационный",
              "очаг серого размягчения"
          ]
      },
      {
          "qID": 38,
          "qName": "Типичной локализацией колликвационного некроза является …",
          "rA": [
              "головной мозг"
          ],
          "wA": [
              "сердце",
              "селезенка",
              "почка"
          ]
      },
      {
          "qID": 39,
          "qName": "Некроз тканей, соприкасающихся с внешней средой – это …",
          "rA": [
              "гангрена"
          ],
          "wA": [
              "апоптоз",
              "инфаркт",
              "секвестр"
          ]
      },
      {
          "qID": 40,
          "qName": "Участок мертвой ткани, не подвергающийся аутолизу – это …",
          "rA": [
              "секвестр"
          ],
          "wA": [
              "апоптоз",
              "инфаркт",
              "гангрена",
              "пролежень"
          ]
      },
      {
          "qID": 41,
          "qName": "Инфаркт – это …",
          "rA": [
              "ишемический некроз"
          ],
          "wA": [
              "трофоневротический некроз",
              "травматический некроз",
              "токсический некроз",
              "аллергический некроз"
          ]
      },
      {
          "qID": 42,
          "qName": "Непосредственной причиной инфаркта являются …",
          "rA": [
              "тромбоз сосудов",
              "эмболия сосудов",
              "длительный спазм сосудов"
          ],
          "wA": [
              "артериальная гиперемия",
              "«разъедание» сосудистой стенки"
          ]
      },
      {
          "qID": 43,
          "qName": "По морфологии инфаркт бывает …",
          "rA": [
              "белый (ишемический)",
              "красный (геморрагический)",
              "белый с геморрагическим венчиком"
          ],
          "wA": [
              "красный с ишемическим венчиком"
          ]
      },
      {
          "qID": 44,
          "qName": "Белый (ишемический) инфаркт чаще возникает в …",
          "rA": [
              "головном мозге"
          ],
          "wA": [
              "сердце",
              "почках",
              "легких",
              "кишечнике"
          ]
      },
      {
          "qID": 45,
          "qName": "Красный (геморрагический) инфаркт чаще возникает в …",
          "rA": [
              "легких",
              "кишечнике"
          ],
          "wA": [
              "сердце",
              "головном мозге",
              "почках"
          ]
      },
      {
          "qID": 46,
          "qName": "Белый (ишемический) инфаркт с геморрагическим венчиком чаще возникает в …",
          "rA": [
              "сердце",
              "почках"
          ],
          "wA": [
              "головном мозге",
              "легких",
              "кишечнике"
          ]
      },
      {
          "qID": 47,
          "qName": "Благоприятными исходами некроза являются …",
          "rA": [
              "оссификация",
              "инкапсуляция",
              "петрификация"
          ],
          "wA": [
              "гнойное расплавление"
          ]
      },
      {
          "qID": 48,
          "qName": "Исходом влажного некроза головного мозга может быть …",
          "rA": [
              "киста"
          ],
          "wA": [
              "петрификация",
              "оссификация",
              "рубцевание",
              "инкапсуляция"
          ]
      },
      {
          "qID": 49,
          "qName": "Организация - это исход некроза, характеризующийся …",
          "rA": [
              "замещением соединительной тканью"
          ],
          "wA": [
              "гнойным расплавлением",
              "отложением солей кальция",
              "образованием кисты"
          ]
      },
      {
          "qID": 50,
          "qName": "Апоптоз – это …",
          "rA": [
              "запрограмированная смерть клеток"
          ],
          "wA": [
              "гибель клеток в живом организме",
              "накопление продуктов нарушенного обмена веществ",
              "бесконтрольное размножение клеток"
          ]
      },
      {
          "qID": 51,
          "qName": "К нарушениям кровенаполнения органов (тканей) относятся …",
          "rA": [
              "гиперемия",
              "ишемия"
          ],
          "wA": [
              "тромбоз",
              "диапедез",
              "эмболия"
          ]
      },
      {
          "qID": 52,
          "qName": "Основной причиной артериального полнокровия является …",
          "rA": [
              "усиление притока крови"
          ],
          "wA": [
              "уменьшение притока крови",
              "затруднение оттока крови",
              "увеличение оттока крови",
              "остановка кровотока"
          ]
      },
      {
          "qID": 53,
          "qName": "Основной причиной венозного полнокровия является …",
          "rA": [
              "затруднение оттока крови"
          ],
          "wA": [
              "уменьшение притока крови",
              "усиление притока крови",
              "увеличение оттока крови",
              "остановка кровотока"
          ]
      },
      {
          "qID": 54,
          "qName": "Морфологическим проявлением острого венозного полнокровия в малом круге кровообращения является …",
          "rA": [
              "отек легких"
          ],
          "wA": [
              "бурая индурация легких",
              "анасарка",
              "гидроторакс"
          ]
      },
      {
          "qID": 55,
          "qName": "Фазы отека легких …",
          "rA": [
              "интерстициальная",
              "альвеолярная"
          ],
          "wA": [
              "интермедиарная",
              "паренхиматозная",
              "бронхиальная"
          ]
      },
      {
          "qID": 56,
          "qName": "При хроническом венозном полнокровии внутренние органы …",
          "rA": [
              "имеют плотную консистенцию",
              "увеличены в размерах",
              "имеют синюшный цвет"
          ],
          "wA": [
              "уменьшены в размерах",
              "имеют дряблую консистенцию"
          ]
      },
      {
          "qID": 57,
          "qName": "При хроническом венозном полнокровии легкие становятся … и …",
          "rA": [
              "плотными",
              "бурыми"
          ],
          "wA": [
              "темно-красными",
              "дряблыми"
          ]
      },
      {
          "qID": 58,
          "qName": "Причины изменения цвета и консистенции легких при бурой индурации …",
          "rA": [
              "склероз",
              "гемосидероз"
          ],
          "wA": [
              "амилоидоз",
              "некроз",
              "гипермеланоз"
          ]
      },
      {
          "qID": 59,
          "qName": "Признаками хронического венозного застоя в большом круге кровообращения являются …",
          "rA": [
              "анасарка",
              "асцит",
              "мускатная печень"
          ],
          "wA": [
              "легочная гипертензия",
              "кровохарканье"
          ]
      },
      {
          "qID": 60,
          "qName": "Признаками хронического венозного застоя в малом круге кровообращения являются …",
          "rA": [
              "легочная гипертензия",
              "кровохарканье"
          ],
          "wA": [
              "анасарка",
              "асцит",
              "мускатная печень"
          ]
      },
      {
          "qID": 61,
          "qName": "Образное название вида печени при хроническом венозном полнокровии …",
          "rA": [
              "мускатная"
          ],
          "wA": [
              "сальная",
              "саговая",
              "бурая",
              "глазурная"
          ]
      },
      {
          "qID": 62,
          "qName": "Для мускатной печени характерно …",
          "rA": [
              "полнокровие центральных отделов долек",
              "жировая дистрофия гепатоцитов на периферии долек"
          ],
          "wA": [
              "полнокровие периферических отделов долек",
              "жировая дистрофия гепатоцитов в центре долек"
          ]
      },
      {
          "qID": 63,
          "qName": "Кожные покровы при общем венозном полнокровии …",
          "rA": [
              "синюшные"
          ],
          "wA": [
              "ярко красные",
              "бледные",
              "желтушные"
          ]
      },
      {
          "qID": 64,
          "qName": "Асцит – это …",
          "rA": [
              "скопление отечной жидкости в брюшной полости"
          ],
          "wA": [
              "массивный распространенный отек подкожной клетчатки",
              "скопление отечной жидкости в плевральной полости",
              "скопление отечной жидкости в полости черепа"
          ]
      },
      {
          "qID": 65,
          "qName": "Анасарка – это …",
          "rA": [
              "массивный распространенный отек подкожной клетчатки"
          ],
          "wA": [
              "скопление отечной жидкости в брюшной полости",
              "скопление отечной жидкости в плевральной полости",
              "скопление отечной жидкости в полости черепа"
          ]
      },
      {
          "qID": 66,
          "qName": "Основной причиной местного малокровия (ишемии) является …",
          "rA": [
              "уменьшение притока крови"
          ],
          "wA": [
              "затруднение оттока крови",
              "усиление притока крови",
              "увеличение оттока крови"
          ]
      },
      {
          "qID": 67,
          "qName": "К ишемии могут привести …",
          "rA": [
              "закупорка артерии тромбом или эмболом",
              "длительный спазм сосудов",
              "перераспределение крови"
          ],
          "wA": [
              "усиление коллатерального кровотока"
          ]
      },
      {
          "qID": 68,
          "qName": "Острая ишемия ведет к …",
          "rA": [
              "инфаркту"
          ],
          "wA": [
              "кровотечению",
              "атрофии",
              "эмболии"
          ]
      },
      {
          "qID": 69,
          "qName": "Длительная (хроническая) ишемия ведет к …",
          "rA": [
              "атрофии"
          ],
          "wA": [
              "кровотечению",
              "инфаркту",
              "эмболии"
          ]
      },
      {
          "qID": 70,
          "qName": "Кровотечения по механизму разрыва сосуда характерны для …",
          "rA": [
              "ранения",
              "цереброваскулярных заболеваний"
          ],
          "wA": [
              "авитаминоза С",
              "гемофилии",
              "хронической язвы желудка"
          ]
      },
      {
          "qID": 71,
          "qName": "Кровотечение по механизму разъедания стенки сосуда характерно для …",
          "rA": [
              "хронической язвы желудка",
              "туберкулеза легких"
          ],
          "wA": [
              "авитаминоза С",
              "нарушения свертываемости крови",
              "родовой травмы"
          ]
      },
      {
          "qID": 72,
          "qName": "Диапедезное кровотечение развивается при …",
          "rA": [
              "повышении проницаемости сосудистой стенки"
          ],
          "wA": [
              "огнестрельном ранении",
              "раке легкого",
              "хронической язве желудка"
          ]
      },
      {
          "qID": 73,
          "qName": "Виды кровотечения в зависимости от вида поврежденного сосуда …",
          "rA": [
              "артериальное",
              "капиллярное",
              "венозное"
          ],
          "wA": [
              "аортальное",
              "лимфангиальное"
          ]
      },
      {
          "qID": 74,
          "qName": "Скопление свернувшейся крови в тканях с нарушением их целостности – это …",
          "rA": [
              "гематома"
          ],
          "wA": [
              "геморрагическое пропитывание",
              "экхимоз",
              "петехии"
          ]
      },
      {
          "qID": 75,
          "qName": "Скопление свернувшейся крови в тканях с сохранением их целостности – это …",
          "rA": [
              "геморрагическое пропитывание"
          ],
          "wA": [
              "гематома",
              "мелена",
              "гемоптоэ"
          ]
      },
      {
          "qID": 76,
          "qName": "Макроскопические характеристики тромба – …",
          "rA": [
              "шероховатая поверхность",
              "плотная консистенция"
          ],
          "wA": [
              "эластическая консистенция",
              "блестящая поверхность",
              "отсутствие связи с сосудистой стенкой"
          ]
      },
      {
          "qID": 77,
          "qName": "Макроскопические характеристики посмертного кровяного сгустка – …",
          "rA": [
              "эластическая консистенция",
              "блестящая поверхность",
              "отсутствие связи с сосудистой стенкой"
          ],
          "wA": [
              "шероховатая поверхность",
              "плотная консистенция"
          ]
      },
      {
          "qID": 78,
          "qName": "К местным факторам тромбообразования относятся …",
          "rA": [
              "замедление кровотока",
              "повреждение сосудистой стенки"
          ],
          "wA": [
              "усиление кровотока",
              "повышение сосудистой проницаемости",
              "нарушение свертываемости крови"
          ]
      },
      {
          "qID": 79,
          "qName": "К общим факторам тромбообразования относятся …",
          "rA": [
              "изменение состава крови",
              "нарушение свертываемости крови"
          ],
          "wA": [
              "усиление кровотока",
              "замедление кровотока",
              "повышение сосудистой проницаемости"
          ]
      },
      {
          "qID": 80,
          "qName": "Тромбы по составу делятся на …",
          "rA": [
              "красные",
              "белые",
              "смешанные"
          ],
          "wA": [
              "пристеночные",
              "обтурирующие"
          ]
      },
      {
          "qID": 81,
          "qName": "По отношению к просвету сосуда тромбы делятся на …",
          "rA": [
              "обтурирующие",
              "пристеночные"
          ],
          "wA": [
              "смешанные",
              "внутрисердечные",
              "флотирующие"
          ]
      },
      {
          "qID": 82,
          "qName": "Благоприятными исходами тромбоза являются …",
          "rA": [
              "организация",
              "асептический лизис"
          ],
          "wA": [
              "секвестрация",
              "тромбоэмболия",
              "септический лизис"
          ]
      },
      {
          "qID": 83,
          "qName": "Неблагоприятными исходами тромбоза являются …",
          "rA": [
              "отрыв тромба и тромбоэмболия",
              "септический лизис"
          ],
          "wA": [
              "организация",
              "канализация",
              "асептический лизис"
          ]
      },
      {
          "qID": 84,
          "qName": "Циркуляция в крови (лимфе) не встречающихся в норме частиц и закупорка ими сосудов – это …",
          "rA": [
              "эмболия"
          ],
          "wA": [
              "стаз",
              "тромбоз",
              "плазморрагия"
          ]
      },
      {
          "qID": 85,
          "qName": "Виды эмболии в зависимости от природы эмболов …",
          "rA": [
              "жировая",
              "тканевая"
          ],
          "wA": [
              "гемолитическая",
              "механическая",
              "паренхиматозная"
          ]
      },
      {
          "qID": 86,
          "qName": "Источником тромбоэмболии легочной артерии могут быть тромбы …",
          "rA": [
              "вен нижних конечностей",
              "вен малого таза",
              "ушка правого предсердия"
          ],
          "wA": [
              "воротной вены",
              "легочных вен"
          ]
      },
      {
          "qID": 87,
          "qName": "Причиной внезапной смерти при тромбоэмболии легочной артерии является …",
          "rA": [
              "пульмонокоронарный рефлекс"
          ],
          "wA": [
              "недостаточность коллатерального кровотока",
              "застой крови в большом круге кровообращения",
              "снижение минутного выброса левого желудочка"
          ]
      },
      {
          "qID": 88,
          "qName": "Пульмонокоронарный рефлекс при тромбоэмболии легочной артерии включает в себя …",
          "rA": [
              "спазм мускулатуры мелких бронхов",
              "спазм ветвей легочной артерии",
              "спазм коронарный артерий"
          ],
          "wA": [
              "спазм мускулатуры желудочно-кишечного тракта",
              "спазм легочных вен"
          ]
      },
      {
          "qID": 89,
          "qName": "Фазами воспаления являются …",
          "rA": [
              "пролиферация",
              "экссудация",
              "альтерация"
          ],
          "wA": [
              "транссудация",
              "организация"
          ]
      },
      {
          "qID": 90,
          "qName": "Фаза альтерации характеризуется …",
          "rA": [
              "дистрофией и некрозом тканей",
              "выделением медиаторов воспаления"
          ],
          "wA": [
              "накоплением экссудата",
              "выраженной гиперемией",
              "разрастанием соединительной ткани"
          ]
      },
      {
          "qID": 91,
          "qName": "В фазу экссудации отмечается …",
          "rA": [
              "воспалительная гиперемия",
              "повышение сосудистой проницаемости",
              "диапедез эритроцитов",
              "миграция лейкоцитов"
          ],
          "wA": [
              "размножение клеток гистиогенного и гематогенного происхождения"
          ]
      },
      {
          "qID": 92,
          "qName": "Фаза пролиферации характеризуется …",
          "rA": [
              "размножением клеток в зоне воспаления"
          ],
          "wA": [
              "повреждением ткани",
              "нарушением кровообращения",
              "образованием экссудата"
          ]
      },
      {
          "qID": 93,
          "qName": "Виды острого (экссудативного) воспаления …",
          "rA": [
              "серозное",
              "фибринозное",
              "гнойное"
          ],
          "wA": [
              "гранулематозное",
              "межуточное"
          ]
      },
      {
          "qID": 94,
          "qName": "Характерными особенностями серозного воспаления являются:",
          "rA": [
              "полная регенерация (реституция) в исходе",
              "незначительное количество клеточных элементов в экссудате"
          ],
          "wA": [
              "преобладание фибрина в составе экссудата",
              "неполная регенерация (субституция) в исходе",
              "частое образование свищей"
          ]
      },
      {
          "qID": 95,
          "qName": "Исходом серозного воспаления является …",
          "rA": [
              "рассасывание экссудата"
          ],
          "wA": [
              "цирроз органов",
              "обызвествление",
              "некроз",
              "ослизнение"
          ]
      },
      {
          "qID": 96,
          "qName": "Состав фибринозного экссудата …",
          "rA": [
              "большое количество белка",
              "небольшое количество лейкоцитов"
          ],
          "wA": [
              "большое количество жидкости",
              "небольшое количество белка",
              "большое количество лейкоцитов"
          ]
      },
      {
          "qID": 97,
          "qName": "Основными признаками фибринозного воспаления являются …",
          "rA": [
              "образование плёнки на воспалённой поверхности",
              "преобладание фибрина в экссудате"
          ],
          "wA": [
              "наличие слизи в экссудате",
              "скопление эритроцитов в экссудате",
              "стекание экссудата с воспалённой поверхности"
          ]
      },
      {
          "qID": 98,
          "qName": "Фибринозное воспаление в слизистой оболочке полости рта обычно носит характер …",
          "rA": [
              "дифтеритического"
          ],
          "wA": [
              "флегмонозного",
              "крупозного",
              "геморрагического",
              "гнилостного"
          ]
      },
      {
          "qID": 99,
          "qName": "Фибринозное воспаление в слизистой оболочке гортани и трахеи обычно носит характер …",
          "rA": [
              "крупозного"
          ],
          "wA": [
              "флегмонозного",
              "геморрагического",
              "гнилостного",
              "дифтеритического"
          ]
      },
      {
          "qID": 100,
          "qName": "Образное название сердца при фибринозном перикардите – …",
          "rA": [
              "волосатое"
          ],
          "wA": [
              "тигровое",
              "бычье",
              "мускатное",
              "панцирное"
          ]
      }
  ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
