var tests = {
"tests":  [
{
  "qID": 1,
  "qName": "К заслугам основоположника микробиологии Р.Коха не относится:",
  "rA": [
    "Создание учения о фагоцитозе",
    ],
  "wA": [
    "Открытие возбудителя холеры",
    "Открытие возбудителя туберкулеза",
    "Получение альттуберкулина ",
    "Введение в практику анилиновых красителей"]
},
{
  "qID": 2,
  "qName": "Назовите расположение спор у возбудителя сибирской язвы:",
  "rA": [
    "центральное",
    ],
  "wA": [
    "субтерминальное",
    "Терминальное",
    ]
},{
  "qID": 3,
  "qName": "К основным структурам бактериальной клетки не относятся:",
  "rA": [
    "Споры",
    ],
  "wA": [
    "Клеточная стенка",
    "Цитоплазматическая мембрана",
    "Цитоплазма",
    "Нуклеоид"]
},{
  "qID": 4,
  "qName": "Протопласты  - это бактерии, лишенные клеточной стенки:",
  "rA": [
    "Полностью",
    ],
  "wA": [
    "Частично"]
},{
  "qID": 5,
  "qName": "Спорообразование происходит:",
  "rA": [
    "Во внешней среде",
    ],
  "wA": [
    "В организме человека",
    "В организме животного"]
},{
  "qID": 6,
  "qName": "Споры необходимы для:",
  "rA": [
    "Сохранение во внешней среде",
    ],
  "wA": [
    "Размножения",
  "Увеличения размеров клетки",
  "Передвижения"]
},{
  "qID": 7,
  "qName": "Для выявления зерен волютина используется окраска по:",
  "rA": [
    "Нейссеру",
    ],
  "wA": [
    "Бурри",
    "Граму",
    "Ожешко",
    "Цилю-Нильсену"]
},{
  "qID": 8,
  "qName": "Для выявления капсул используется окраска по:",
  "rA": [
    "Бурри",
    ],
  "wA": [
    "Нейссеру",
    "Граму",
    "Ожешко",
    "Цилю-Нильсену"]
},{
  "qID": 9,
  "qName": "Пигменты бактерий выполняют следующие функции, кроме:",
  "rA": [
    "Защита от действия инфракрасных лучей",
    ],
  "wA": [
    "Защита от действия света",
    "Выполнение каталитической функции",
    "Антибиотических свойств"]
},{
  "qID": 10,
  "qName": "По классификации Берджи возбудитель актиномикозов относится:",
  "rA": [
    "К бактериям",
    ],
  "wA": [
    "К дрожжеподобным грибам",
    "К плесневым грибам",
  "К вирусам"]
},{
  "qID": 11,
  "qName": "Из перечисленных микроорганизмов к эукариотам относятся:",
  "rA": [
    "Грибы",
    ],
  "wA": [
    "Бактерии",
    "Риккетсии",
    "Спирохеты",
    "Бактериофаги"]
},{
  "qID": 12,
  "qName": "Среди патогенных бактерий наиболее часто встречаются:",
  "rA": [
    "Факультативные анаэробы",
    ],
  "wA": [
    "Облигатные аэробы",
    "Облигатные анаэробы",
    "Микроаэрофилы",
    "Капнические"]
},{
  "qID": 13,
  "qName": "В лаг-фазе происходит:",
  "rA": [
    "Адаптация микроорганизмов к питательной среде",
    ],
  "wA": [
    "Быстрое размножение микроорганизмов",
    "Быстрая гибель микроорганизмов",
    "Выравнивание скорости размножения и скорости гибели"]
},{
  "qID": 14,
  "qName": "К ростовым факторам, необходимым для развития бактерий, не относится:",
  "rA": [
    "NaCl",
    ],
  "wA": [
    "Биотин",
    "Пуриновые основания",
    "Витамины",
    "Пиримидиновые основания"]
},{
  "qID": 15,
  "qName": "Назовите требование, которое не предъявляется к питательным средам:",
  "rA": [
    "Кислая рН – среды ",
    ],
  "wA": [
    "Слабощелочная рН",
    "Оптимальная влажность",
    "Стерильность",
    "Изотоничность"]
},{
  "qID": 16,
  "qName": "К дифференциально-диагностическим средам не относится:",
  "rA": [
    "Желчный бульон",
    ],
  "wA": [
    "Среда Эндо",
    "Среда Плоскирева",
    "Среда Ресселя",
    "Среда Олькеницкого"]
},{
  "qID": 17,
  "qName": "При культивировании анаэроба по Фортнеру анаэробиоз достигается за счет:",
  "rA": [
    "Роста аэробов",
    ],
  "wA": [
    "Горения свечи",
    "Вытеснения воздуха инертным газом",
    "Окисление кислорода на катализаторе"]
},{
  "qID": 18,
  "qName": "К функциям ферментов относятся все нижеуказанные, кроме:",
  "rA": [
    "Защищают от действия УФО",
    ],
  "wA": [
    "Участвуют в процессах питания",
    "Участвуют в процессах дыхания",
    "Являются факторами вирулентности ",
    "Участвуют в делении клетки"]
},
{
  "qID": 19,
  "qName": "К ферментам агрессии бактерий не относится:",
  "rA": [
    "Липаза",
    ],
  "wA": [
    "Карбоксилаза",
    "Коллагеназа",
    "РНК-аза",
    "Нейраминидаза"]
},{
  "qID": 20,
  "qName": "Назовите окислительно-восстановительный потенциал облигатных анаэробов:",
  "rA": [
    "0-12",
    ],
  "wA": [
    "0-20",
    "14-20",
  "15-18"]
},{
  "qID": 21,
  "qName": "Трансформация – это:",
  "rA": [
    "Передача фрагмента ДНК клетки – донора реципиенту между родственными видами.",
    ],
  "wA": [
    "Перенес генетической информации от донора к реципиенту с помощью умеренного бактериофага",
    "Контакт бактерий через половые пили",
    "Изменение свойств бактерий в результате включения в хромосому ДНК умеренного бактериофага"]
},{
  "qID": 22,
  "qName": "S-формы бактериальной популяции имеют следующие признаки, кроме:",
  "rA": [
    "Выделяются у хронических больных ",
    ],
  "wA": [
    "Дают гладкие колонии",
    "Типичны по биохимическим свойствам",
    "Имеют типичную морфологию",
    "Выделяют в острой стадии болезни"]
},{
  "qID": 23,
  "qName": "Плазмиды - это:",
  "rA": [
    "Внехромосомные генетические структуры бактерий",
    ],
  "wA": [
    "Разновидность включений в цитоплазму",
    "Аналог цитоплазматического ретикулума",
  "Продукты обмена веществ"]
},{
  "qID": 24,
  "qName": "Антибиотикоустойчивость определяется:",
  "rA": [
    "R – плазмидой",
    ],
  "wA": [
    "F – плазмидой ",
    "Бактериальной плазмидой",
    "Транспозоном",
    "Is-последовательностью"]
},{
  "qID": 25,
  "qName": "В конъюгации участвует:",
  "rA": [
    "Пили 2 типа",
    ],
  "wA": [
    "Пили 1 типа",
  "Пили 4 типа",
  "Пили 3 типа"]
},{
  "qID": 26,
  "qName": "Способность бактерий к конъюгации связана с наличием:",
  "rA": [
    "Половых пилей",
    ],
  "wA": [
    "Пилей общего типа",
    "Жгутиков",
  "Восинок"]
},{
  "qID": 27,
  "qName": "Конъюгация генетически детерминирована",
  "rA": [
    "F – плазмидой ",
    ],
  "wA": [
    "Профагом",
    "Хромосомной мутацией",
  "Ent-плазмидой"]
},{
  "qID": 28,
  "qName": "Объектами изучения санитарной микробиологии не являются:",
  "rA": [
    "Испражнения",
    ],
  "wA": [
    "Вода",
    "Почва",
    "Воздух",
    "Пищевые продукты"]
},{
  "qID": 29,
  "qName": "К формам антагонистических типов взаимодействия между микробами не относится:",
  "rA": [
    "Метабиоз",
    ],
  "wA": [
    "Антибио",
    "Паразитизм",
    "Хищничество",
    "Конкуренция"]
},{
  "qID": 30,
  "qName": "Санитарно-показательные бактерии должны отвечать следующим требованиям, кроме одного:",
  "rA": [
    "Должны иметь другие природные резервуары",
    ],
  "wA": [
    "Должны постоянно содержаться в выделениях человека",
    "Должны выделяться в больших количествах",
    "Срок выживания их во внешней среде должен быть равен сроку выживания патогенных микробов, выводимых из организма теми же путями",
    "Не должны размножаться в окружающей среде"]
},{
  "qID": 31,
  "qName": "В ротовой полости могут быть обнаружены следующие микробы кроме:",
  "rA": [
    "Bacillus  anthracis",
    ],
  "wA": [
    "Leptothrix buccalis",
    "B. maximus buccalis",
    "Borrelia buccalis",
    "Treponema microdentium"]
},{
  "qID": 32,
  "qName": "Для выявления дисбактериоза кишечника не выявляют количество:",
  "rA": [
    "Сальмонелл",
    ],
  "wA": [
    "Кишечных палочек ",
    "Кокков",
    "Бифидобактерий",
    "Дрожжеподобных грибов"]
},{
  "qID": 33,
  "qName": "Для восстановления нормальной микрофлоры толстого кишечника не применяют:",
  "rA": [
    "Антибиотики",
    ],
  "wA": [
    "Колибактерин",
    "Лактобактерин",
    "Бификол",
    "Бифидумбактерин"]
},{
  "qID": 34,
  "qName": "Специфическая микрофлора продукта питания это – ",
  "rA": [
    "Микробы, используемые для приготовления того или иного продукта",
    ],
  "wA": [
    "Случайные микроорганизмы из внешней среды",
    "Микроорганизмы, вызывающие порч у продукта",
    "Патогенные микроорганизмы"
    ]
},{
  "qID": 35,
  "qName": "К формам антагонистических отношений между микробами в биоценозах относится:",
  "rA": [
    "Хищничество",
    ],
  "wA": [
    "Комменсализм",
    "Вирофория",
    "Мутуализм",
    "Синергизм"]
},{
  "qID": 36,
  "qName": "Дисбактериозом кишечника называют:",
  "rA": [
    "Количественные и качественные изменения собственной микрофлоры кишечника",
    ],
  "wA": [
    "Количественные и качественные изменения кишечной палочки в кишечнике",
  "Качественные изменения кишечной палочки",
  "Количественные изменения соотношения кишечной микрофлоры"]
},{
  "qID": 37,
  "qName": "Коли-титр водопроводной воды должен быть:",
  "rA": [
    "Больше 333",
    ],
  "wA": [
    "Меньше 333",
    "333",
    "111",
    "Меньше 111"]
},{
  "qID": 38,
  "qName": "Санитарно-показательными микробами для почвы являются:",
  "rA": [
    "Клостридии ",
    ],
  "wA": [
    "Вирусы",
    "Микоплазмы",
    "Сарцины"]
},{
  "qID": 39,
  "qName": "В кишечнике практически здоровых людей должны преобладать микроорганизмы:",
  "rA": [
    "Анаэробы",
    ],
  "wA": [
    "Аэробы",
    "Микроаэрофильные",
    "Факультативно-анаэробные"]
},{
  "qID": 40,
  "qName": "Аутохтонная микрофлора воды водоемов представлена всем, кроме:",
  "rA": [
    "Патогенных энтеробактерий",
    ],
  "wA": [
    "Бацилл",
    "Кокков",
    "Извитых форм",
    "Грибков и актиномицетов"]
},{
  "qID": 41,
  "qName": "Основные факторы самоочищения водоемов все, кроме:",
  "rA": [
    "Повышенной температуры воды",
    ],
  "wA": [
    "Антагонизма микробов",
    "Бактериофагии",
    "Действия УФО",
    "Наличия органических субстратов"]
},{
  "qID": 42,
  "qName": "К факторам, способствующим размножению микробов ротовой полости относятся все вышеуказанные, кроме:",
  "rA": [
    "Санация Зубов",
    ],
  "wA": [
    "Курение",
    "Зубо-десневые карманы",
    "Несъемные зубные протезы",
    "Расстройство слюноотделения"]
},{
  "qID": 43,
  "qName": "Назовите микробы, не входящие в состав нормальной микрофлоры толстого кишечника:",
  "rA": [
    "Шигеллы",
    ],
  "wA": [
    "Лактобактерии",
    "Бифидобактерии",
    "Катенобактерии",
    "Бактероиды"]
},{
  "qID": 44,
  "qName": "Санитарно-показательными микробами для воды являются:",
  "rA": [
    "Кишечные палочки",
    ],
  "wA": [
    "Стафилококки",
    "Вирусы",
    "Вибрионы",
    "Микоплазмы"]
},{
  "qID": 45,
  "qName": "Назовите питательную среду для определения бифидобактерий:",
  "rA": [
    "Блаурокка",
    ],
  "wA": [
    "Среда Эндо",
    "Левенштейна-Йенсена",
    "Плоскирева",
    "Щелочной агар"]
},{
  "qID": 46,
  "qName": "Лактобактерин – это:",
  "rA": [
    "Препарат из молочнокислых бактерий",
    ],
  "wA": [
    "Препарат из живых кишечных палочек М-17",
    "Препарат из спор сенной палочки",
    "Препарат из бифидобактерий"]
},{
  "qID": 47,
  "qName": "Бификол – это:",
  "rA": [
    "Препарат из бифидобактерий и кишечной палочки",
    ],
  "wA": [
    "Препарат из живых кишечных палочек М-17",
    "Препарат из спор сенной палочки",
    "Препарат из молочнокислых бактерий",
    "Препарат из бифидобактерий"]
},{
  "qID": 48,
  "qName": "Стерилизация сухим жаром проводится:",
  "rA": [
    "В печи Пастера",
    ],
  "wA": [
    "В автоклаве",
    "На водяной бане",
    "В аппарате Коха",
    "С помощью УФО"]
},{
  "qID": 49,
  "qName": "Температура размножения мезофиллов:",
  "rA": [
    "20-45 градусов",
    ],
  "wA": [
    "0-20 градусов ",
    "45-70 градусов",
    "70-100 градусов"]
},{
  "qID": 50,
  "qName": "Назовите аппаратуру для стерилизации паром под давлением:",
  "rA": [
    "Автоклав",
    ],
  "wA": [
    "Спиртовка",
    "Водяная баня",
    "Печь Пастера",
    "Аппарат Коха"]
},
{
  "qID": 51,
  "qName": "Пастеризацию используют для стерилизации:",
  "rA": [
    "Молочных продуктов",
    ],
  "wA": [
    "Споросодержащего материала",
    "Стеклянной посуды",
    "Питательных сред",
    "Бактериальных петель"]
},{
  "qID": 52,
  "qName": "Текучим паром стерилизуют:",
  "rA": [
    "Среды с аминокислотами",
    ],
  "wA": [
    "Простые питательные среды",
    "Бактериологические петли",
    "Пипетки, пробирки, колбы",]
},{
  "qID": 53,
  "qName": "При стерилизации жидкостей, портящихся при нагревании, используют:",
  "rA": [
    "Бактерицидные фильтры",
    ],
  "wA": [
    "Дезинсекцию",
    "Сухой жар ",
    "Автоклавирование",
    "Прокаливание"]
},{
  "qID": 54,
  "qName": "В сухожаровом шкафу применяют температуру",
  "rA": [
    "170 градусов",
    ],
  "wA": [
    "20 градусов",
    "37 градусов",
    "75 градусов",
    "120 градусов"]
},{
  "qID": 55,
  "qName": "Для стерилизации одноразовых пластмассовых изделий медицинского назначения в промышленности применяют:",
  "rA": [
    "Гамма – излучение",
    ],
  "wA": [
    "Дробную стерилизацию",
    "Стерилизацию текучим паром",
    "УФО – излучение"]
},{
  "qID": 56,
  "qName": "Назовите базовое природное соединение для получения пенициллинов:",
  "rA": [
    "6 – аминопенициллановая каслота",
    ],
  "wA": [
    "Лактамное кольцо",
    "Феноксиметилпенициллин ",
    "Оксациллин",
    "ПАСК"]
},{
  "qID": 57,
  "qName": "Сульфаниламидные препараты получают:",
  "rA": [
    "Путем химического синтеза",
    ],
  "wA": [
    "Экстракцией из бактерий-продуцентов",
    "Экстракцией из грибов – продуцентов",
    "Экстракцией из актиномицетов – продуцентов",
    "Из растений"]
},{
  "qID": 58,
  "qName": "Препарат можно использовать, если химиотерапевтический индекс:",
  "rA": [
    "Больше 1",
    ],
  "wA": [
    "Равен 0",
    "Меньше 1",
  "Меньше 2"]
},{
  "qID": 59,
  "qName": "Антибиотики вызывают следующие побочные действия, кроме:",
  "rA": [
    "Воспалительных реакций",
    ],
  "wA": [
    "Развития аллергических реакций",
    "Дисбактериоза",
    "Нарушение формирования полноценного иммунитета"]
},
{
  "qID": 60,
  "qName": "Для инфекционных заболеваний не характерно:",
  "rA": [
    "Передаются по наследству",
    ],
  "wA": [
    "Имеют этиологический фактор",
    "Протекают циклично",
    "Обладают контагиозностью",
    "Для лечения и профилактики используются биологические препараты"]
},
{
  "qID": 61,
  "qName": "К способам снижения вирулентности микроорганизмов не относится:",
  "rA": [
    "Пассаж патогенного микроба через восприимчивый организм",
    ],
  "wA": [
    "Редкие пересевы на искусственных питательных средах",
    "Длительное культивирование микроба на неблагоприятных питательных средах",
    "Действие бактериофага",
    "Метод генетических скрещиваний"]
},
{
  "qID": 62,
  "qName": "Назовите небелковые токсины:",
  "rA": [
    "Эндотоксины",
    ],
  "wA": [
    "Мембранотоксины",
    "Цитотоксины",
    "Эксфолиатины",
    "Эритрогенины"]
},
{
  "qID": 63,
  "qName": "Для вирусных инфекций не характерно:",
  "rA": [
    "Стадия токсинемии",
    ],
  "wA": [
    "Лимфотропность",
    "Персистенция",
    "Стадия вирусемии",
    "Образование внутриклеточных включений"]
},
{
  "qID": 64,
  "qName": "Инфекционные заболевания не передаются:",
  "rA": [
    "Наследственным путем",
    ],
  "wA": [
    "Фекально-оральным путем",
    "Трансплацентарным путем",
    "Трансмиссивным путем",
    "Аэрогенным путем"]
},
{
  "qID": 65,
  "qName": "Исходами инфекционного заболевания являются все кроме:",
  "rA": [
    "Септицемия",
    ],
  "wA": [
    "Бактерионосительство",
    "Хроническая форма",
    "Летальный исход",
    "Выздоровление"]
},
{
  "qID": 66,
  "qName": "К факторам бактериальной инвазии относится:",
  "rA": [
    "Нейраминидаза",
    ],
  "wA": [
    "Плазмида",
    "Медиатор",
    "Эндотоксин"]
},
{
  "qID": 67,
  "qName": "Назовите единицы измерения вирулентности:",
  "rA": [
    "Минимальная смертельная доза",
    ],
  "wA": [
    "Единицы связывания",
    "Миллилитры",
    "Международные единицы",
    "Антигенные единицы"]
},
{
  "qID": 68,
  "qName": "Свойства экзотоксинов – это:",
  "rA": [
    "Являются белками",
    ],
  "wA": [
    "Не обладают тропизмом",
    "Термостабилен",
    "Участвуют в развитии вирусных инфекций"]
},
{
  "qID": 69,
  "qName": "Токсинемия – это:",
  "rA": [
    "Циркуляция токсинов в крови",
    ],
  "wA": [
    "Возврат штаммов болезни",
    "Циркуляция микробов в крови",
    "Повторное заражение после выздоровления",
    "Повторное заражение на фоне инфекционного процесса"]
},
{
  "qID": 70,
  "qName": "Скрытый период болезни – это:",
  "rA": [
    "Инкубационный период",
    ],
  "wA": [
    "Бактерионосительство",
    "Продром",
    "Реконвалесценция",
    "Суперинфекция"]
},
{
  "qID": 71,
  "qName": "К бактериальным экзотоксинам относится:",
  "rA": [
    "Гемолизин",
    ],
  "wA": [
    "Рибонуклеаза",
    "Пептидогликан",
    "Бактериофаг",
    "Пермеаза"]
},
{
  "qID": 72,
  "qName": "Бактериемия – это:",
  "rA": [
    "Циркуляция микробов в крови",
    ],
  "wA": [
    "Циркуляция токсинов в крови",
    "Повторное заражение тем же микробом после выздоровления",
    ". Возврат симптомов болезни",
    "Длительное нахождение вируса в организме"]
},
{
  "qID": 73,
  "qName": "Назвать оптимальный метод при диагностике бактериемии:",
  "rA": [
    "Посев на жидкие элективные среды",
    ],
  "wA": [
    "Окраска мазков по Граму",
    "Посев на плотные среды с кровью",
    "Биопроба",
    "Серологические реакции"]
},
{
  "qID": 74,
  "qName": "Наибольшее эпидемиологическое значение при воздушно-пылевом пути принадлежит:",
  "rA": [
    "Мелкокапельной фазе аэрозоля",
    ],
  "wA": [
    "Крупнокапельной фазе аэрозоля",
    "Фазе бактериальной пыли"]
},
{
  "qID": 75,
  "qName": "Внутрибольничная инфекция чаще возникает",
  "rA": [
    "В соматических больницах",
    ],
  "wA": [
    "В инфекционных больницах",
  "В санаториях",
  "В аптеках"]
},
{
  "qID": 76,
  "qName": "Рецидив - это:",
  "rA": [
    "Возврат симптомов болезни",
    ],
  "wA": [
    "Повторное заражение тем же микробом после выздоровления",
    "Циркуляция токсинов в крови",
    "Циркуляция микробов в крови",
    "Длительное нахождение вируса в организме"]
},
{
  "qID": 77,
  "qName": "Механизм передачи кишечных инфекций:",
  "rA": [
    "Фекально-оральный",
    ],
  "wA": [
    "Трансплацентарный",
    "Трансмиссивный",
    "Контактный",
    "Воздушно капельный"]
},
{
  "qID": 78,
  "qName": "При антропонозных инфекциях источниками являются:",
  "rA": [
    "Человек",
    ],
  "wA": [
    "Животные",
    "Почва",
    "Воздух",
    "Предметы обихода"]
},
{
  "qID": 79,
  "qName": "Трансмиссивный механизм – это заражение через:",
  "rA": [
    "Кровососущих насекомых",
    ],
  "wA": [
    "Плаценту",
    "Воздух",
    "Предметы обихода",
    "Пищу, воду"]
},
{
  "qID": 80,
  "qName": "Капельный способ реакции агглютинации применяется с целью:",
  "rA": [
    "Для идентификации возбудителя",
    ],
  "wA": [
    "Для определения антител",
    "Для определения Ig M" ,
    "Для определения Ig G"]
},
{
  "qID": 81,
  "qName": "Реакция агглютинации Видаля применяется для серодиагностики :",
  "rA": [
    "Брюшного тифа",
    ],
  "wA": [
    "Чумы",
    "Холеры",
  "Дизентерии",
  "Колиэнтерита"]
},
{
  "qID": 82,
  "qName": "К факторам ингибирующим фагоцитоз относятся:",
  "rA": [
    "Капсула",
    ],
  "wA": [
    "Жгутики",
    "Экзотоксин",
  "Пили",
  "Тейхоевые кислоты"]
},
{
  "qID": 83,
  "qName": "Реакция Кумбса применятся для обнаружения:",
  "rA": [
    "Неполных антител при бруцеллезе",
    ],
  "wA": [
    "Опсонинов",
    "Вида микроорганизма",
    "Серовара микроорганизма",
    "Антитоксинов"]
},
{
  "qID": 84,
  "qName": "Реакция опсонизации применяется для",
  "rA": [
    "Выявления противобруцеллезных антител в испытуемой сыворотке",
    ],
  "wA": [
    "Выявление антител к вирусам",
    "Идентификация микробных антигенов",
    "Установление серовара бактерий",
    "Установление серогруппы бактерий"]
},
{
  "qID": 85,
  "qName": "Ускоренным методом диагностики инфекционных заболеваний является:",
  "rA": [
    "Непрямом методе флюоресцирующих антител",
    ],
  "wA": [
    "Бактериологический",
    "Микроскопический метод",
    "Биологический"]
},
{
  "qID": 86,
  "qName": "Иммуноглобулинами активности инфекционного процесса являются:",
  "rA": [
    "Ig M",
    ],
  "wA": [
    "IgМ и IgG ",
    "IgG",
  "Ig A, Ig E",
  "Ig A"]
},
{
  "qID": 87,
  "qName": "Иммуноглобулинами формирования постинфекционного иммунитета являются:",
  "rA": [
    "IgG",
    ],
  "wA": [
    "IgМ и IgG",
    "Ig M",
  "Ig A, Ig E",
  "Ig D"]
},
{
  "qID": 88,
  "qName": "Биологический метод – это:",
  "rA": [
    "Заражение восприимчивых лабораторных животных",
    ],
  "wA": [
    "Метод посевов ",
    "Метод изучения сывороток",
    "Изучение морфологических свойств",
    "Изучение тинкториальных свойств"]
},
{
  "qID": 89,
  "qName": "К неспецифическим факторам антибактериальной защиты организма относятся все перечисленные кроме:",
  "rA": [
    "Антителообразования",
    ],
  "wA": [
    "Воспалительной реакции",
    "Фагоцитоза",
    "Лизоцима",
    "Системы комплемента"]
},
{
  "qID": 90,
  "qName": "Противовирусная активность более выражена у интерферонов:",
  "rA": [
    "альфа-интерферон",
    ],
  "wA": [
    "гамма-интерферон",
    "бетта-интерферон",
  "лямбда-интерферон"]
},
{
  "qID": 91,
  "qName": "При инфекционных заболеваниях в основном встречается иммунный ответ:",
  "rA": [
    "Смешанного типа",
    ],
  "wA": [
    "Клеточного типа",
    "Гуморального типа",
  "Отсутствует иммунный ответ "]
},
{
  "qID": 92,
  "qName": "При вирусных инфекциях фагоцитоз",
  "rA": [
    "НеЗавершенный",
    ],
  "wA": [
    "Завершенный",
  "Отсутствует иммунный ответ ",
  "Смешанный"]
},
{
  "qID": 93,
  "qName": "Для постановки кожно-аллергических проб используют следующий тип аллергических реакций:",
  "rA": [
    "Клеточно-опосредованный",
    ],
  "wA": [
    "Анафилактический ",
    "Цитотоксический",
    "Иммунокомплексный"]
},
{
  "qID": 94,
  "qName": "Охарактеризовать рост стафилококка на питательных средах: ",
  "rA": [
    "Колонии с золотистым пигментом",
    ],
  "wA": [
    "Ползучий рост",
    "Бесцветные колонии",
    "Колонии и питательная среда окрашены в синий цвет",
    "Красные колонии"]
},
{
  "qID": 95,
  "qName": "Назвать питательные среды, используемые для культивирования стафилококка",
  "rA": [
    "Желточно-солевой агар",
    ],
  "wA": [
    "Щелочной агар",
    "Желчный бульон",
    "Сахарный бульон",
    "Ацетамидная среда"]
},
{
  "qID": 96,
  "qName": "Cтафилококки не способны продуцировать: ",
  "rA": [
    "Эндотоксин",
    ],
  "wA": [
    "Только энтеротоксины",
    "Только гемолизины",
    "Несколько токсинов одновременно"]
},
{
  "qID": 97,
  "qName": "Грам – являются:",
  "rA": [
    "Гонококки",
    ],
  "wA": [
    "Микрококки",
    "Сарцины",
    "Стрептококки",
    "Стафилококки"]
},
{
  "qID": 98,
  "qName": "Наиболее часто заболевания человека вызывают следующие роды семейства Micrococcaceae:",
  "rA": [
    "Стафилококки",
    ],
  "wA": [
    "Микрококки",
    "Стоматококки",
    "Планококки"]
},
{
  "qID": 99,
  "qName": "Для штамма золотистого стафилококка характерно наличие:",
  "rA": [
    "Всех ферментов",
    ],
  "wA": [
    "Термолабильной ДНК-азы",
    "Гиалуронидаза",
    "Плазмокоагулаза"]
},
{
  "qID": 100,
  "qName": "При заборе крови необходимо соблюдать следующие правила, кроме:",
  "rA": [
    "Проведения забора крови из внутрисосудистого катетера",
    ],
  "wA": [
    "Проведения забора крови специальным шприцом",
    "Посева крови в питательную среду у постели больного",
    "Соблюдение асептических условий"]
},
{
  "qID": 101,
  "qName": "Назовите элективную среду для стафилококков:",
  "rA": [
    "Агар с 10% хлористого натрия",
    ],
  "wA": [
    "Агар с 6,5% хлористого натрия",
    "Сывороточный агар",
    "Щелочной агар",
    "Шоколадный агар"]
},
{
  "qID": 102,
  "qName": "Идентификация стафилококка  не проводится по:",
  "rA": [
    "Росту на бессывороточном агаре",
    ],
  "wA": [
    "Ферменту плазмокоагулазе",
    "Капсулообразованию",
    "Цвету колонии на среде Плоскирева",
    "Аллергической пробе"]
},
{
  "qID": 103,
  "qName": "Какие патогенные микробы могут быть обнаружены в гнойной ране:",
  "rA": [
    "Эшерихии",
    ],
  "wA": [
    "Франциселлы",
    "Бруцеллы",
    "Коринебактерии"]
},
{
  "qID": 104,
  "qName": "После перенесения дифтерии иммунитет:",
  "rA": [
    "Антитоксический, антибактериальный",
    ],
  "wA": [
    "Инфекционный",
    "Нестирильный",
    "Слабо напряженный"]
},
{
  "qID": 105,
  "qName": "Для профилактики внутрибольничных инфекций необходимо все перечисленное, кроме:",
  "rA": [
    "Проведения вакцинации больных",
    ],
  "wA": [
    "Соблюдения нормы санитарно-показательных микроорганизмов для лечебных учреждений",
    "Проведения контроля стерильности лекарственных средств",
    "Повышения качества медицинского обслуживания больных",
    "Проведения бактериологического исследования персонала"]
},
{
  "qID": 106,
  "qName": "Назовите основной метод диагностики хронической гонореи:",
  "rA": [
    "РСК Борде-Жангу",
    ],
  "wA": [
    "Микроскопия мазков",
    "РСК Вассермана",
    "Аллергическая проба",
    "Биопроба"]
},
{
  "qID": 107,
  "qName": "Назовите метод диагностики острой гонореи:",
  "rA": [
    "Микроскопия мазков",
    ],
  "wA": [
    "РСК Борде-Жангу",
    "РСК Вассермана",
    "Аллергическая проба",
    "Биопроба"]
},
{
  "qID": 108,
  "qName": "Терминальное расположение спор характерно для:",
  "rA": [
    "Clostridium tetani",
    ],
  "wA": [
    "Bacillus anthracis",
    "Сlostridium botulinum",
    "Bacillus subtilis",
    "Bacillus cereus"]
},
{
  "qID": 109,
  "qName": "Основной фактор патогенности возбудителя ботулизма:",
  "rA": [
    "Экзотоксин",
    ],
  "wA": [
    "Жгутики",
    "Эндотоксин",
    "Капсула",
    "Протеолитические ферменты"]
},
{
  "qID": 110,
  "qName": "Для экстренной профилактики и лечения анаэробных инфекции используют:",
  "rA": [
    "Антитоксические сыворотки",
    ],
  "wA": [
    "Интерферон",
    "Анатоксин",
    "Живую вакцину"]
},
{
  "qID": 111,
  "qName": "Менингококк растет:",
  "rA": [
    "При 37% на сывороточном агаре",
    ],
  "wA": [
    "При 37% на бессывороточном агаре",
    "при 22% на сывороточном агаре",
    "На кровяном агаре",
    "На желточно- солевом агаре"]
},
{
  "qID": 112,
  "qName": "Возбудителями коклюша являются:",
  "rA": [
    "Бордетеллы",
    ],
  "wA": [
    "Иерсинии", 
    "Шигеллы",
    "Франциселлы",
    "Серрации"]
},
{
  "qID": 113,
  "qName": "Дифтерийный анатоксин применяется:",
  "rA": [
    "Для создания активного антитоксического иммунитета",
    ],
  "wA": [
    "В лечебных целях",
    "С целью диагностики",
    "Для идентификации бактерий",
    "Для создания пассивного иммунитета"]
},
{
  "qID": 114,
  "qName": "При бактериоскопической диагностике туберкулеза используют:",
  "rA": [
    "Метод Циль - Нильсена",
    ],
  "wA": [
    "Метод Бурри",
    "Метод Нейссера",
    "Метод «висячей капли",
    "Метод Грамма"]
},
{
  "qID": 115,
  "qName": "Исследуемым материалом при менингите является все, кроме:",
  "rA": [
    "Мочи",
    ],
  "wA": [
    "Крови",
    "Носоглоточного материала",
    "Ликвора"]
},
{
  "qID": 116,
  "qName": "Вакцина БЦЖ - это:",
  "rA": [
    "Ослабленная культура M.bovis",
    ],
  "wA": [
    "Убитая культура",
    "Ослабленная культура",
    "Убитая культура",
    "Химическая вакцина"]
},
{
  "qID": 117,
  "qName": "Менингококк не вызывает:",
  "rA": [
    "Колиэнтерит",
    ],
  "wA": [
    "Менингит",
    "Назофарингит",
    "Артрит",
    "Сепсис"]
},
{
  "qID": 118,
  "qName": "Противодифтерийная антитоксическая сыворотка применяется:",
  "rA": [
    "Для создания пассивного иммунитета",
    ],
  "wA": [
    "Для создания активного иммунитета",
    "С целью диагностики"]
},
{
  "qID": 119,
  "qName": "При бактериологической диагностике дифтерии используют:",
  "rA": [
    "Среду Клауберга",
    ],
  "wA": [
    "Среду Левенштейна - Йенсена",
    "Сахарный агар",
    "Среду Плоскирева",
    "МПБ"]
},
{
  "qID": 120,
  "qName": "Назовите морфологические признаки коринебактерии дифтерии:",
  "rA": [
    "палочки с булавовидными утолщениями, расположенные под углом",
    ],
  "wA": [
    "Ветвящиеся тонкие нити",
    "Кислотоустойчивые полиморфные палочки", 
    "Грамотрицательные диплококки",
    "Палочки овоидной формой с биполярной окраской"]
},
{
  "qID": 121,
  "qName": "Для создания активного антитоксического иммунитета против дифтерии используют:",
  "rA": [
    "Дифтерийный анатоксин",
    ],
  "wA": [
    "Убитую вакцину",
    "Противодифтерийную антитоксическую сыворотку",
    "Дифтерийный токсин",
    "Ослабленную культуру коринебактерий"]
},
{
  "qID": 122,
  "qName": "Для создания клеточного иммунитета  используют:",
  "rA": [
    "БЦЖ вакцину",
    ],
  "wA": [
    "Убитую вакцину",
    "Противодифтерийную антитоксическую сыворотку",
    "Дифтерийный  анатоксин"]
},
{
  "qID": 123,
  "qName": "Для ранней диагностики брюшного тифа исследуют:",
  "rA": [
    "Кровь",
    ],
  "wA": [
    "мочу",
    "Мокроту",
    "Испражнения",
    "Слизь из зева"]
},
{
  "qID": 124,
  "qName": "Назовите среду обогащения для сальмонелл:",
  "rA": [
    "Среда Раппопорт",
    ],
  "wA": [
    "МПА",
    "Среда Плоскирева",
    "Среда Эндо",
    "Среда Левина"]
},
{
  "qID": 125,
  "qName": "Наиболее устойчивы во внешней среде шигеллы вида:",
  "rA": [
    "Зонне",
    ],
  "wA": [
    "Дизентерии",
    "Флекснера", 
    "Бойда"]
},
{
  "qID": 126,
  "qName": "Назвать род  бактерий, не способный к пигментообразованию:",
  "rA": [
    "Shigella",
    ],
  "wA": [
    "Sarcina",
    "Pseudomonas",
    "Staphylococcus"]
},
{
  "qID": 127,
  "qName": "Наиболее часто заболевания мочевыводящей системы вызывают:",
  "rA": [
    "Chlamidia  trachomatis",
    ],
  "wA": [
    "Микобактерии",
    "Условно – патогенные энтеробактерии", 
    "Сальмонеллы",
    "Шигеллы"]
},
{
  "qID": 128,
  "qName": "Назовите характер роста протея:",
  "rA": [
    "Ползучий рост",
    ],
  "wA": [
    "Колонии с красным пигментом",
    "Колонии питательная среда окрашена в синий свет",
    "Колонии с золотистым пигментом",
    "Колонии бесцветные"]
},
{
  "qID": 129,
  "qName": "Назовите дифференцирующий признак для Klebsiella  pneumoniae",
  "rA": [
    "Капсулообразование",
    ],
  "wA": [
    "Пигментообразование",
    "Плазмокоагулазная активность", 
    "Рост на кровяном агаре"]
},
{
  "qID": 130,
  "qName": "Плазмиды среди бактерии не распространяются:",
  "rA": [
    "От бактерии к вирусам",
    ],
  "wA": [
    "По вертикали",
    "По горизонтали",
    "Между бактериями разных родов"]
},
{
  "qID": 131,
  "qName": "Возбудители особоопасных инфекций относятся к группе риска:",
  "rA": [
    "1 - я",
    ],
  "wA": [
    "2 - я",
    "3 – я",
    "4 - я"]
},
{
  "qID": 132,
  "qName": "Работа с возбудителями особоопасных инфекций  проводятся в лаборатории",
  "rA": [
    "Базовых",
    ],
  "wA": [
    "Специальных",
    "Особого режима",
    "Режимных"]
},
{
  "qID": 133,
  "qName": "Какой путь передачи возбудителя наиболее часто вызывает развитие эпидемии:",
  "rA": [
    "Аэрогенный",
    ],
  "wA": [
    "Трансмиссивный",
    "Половой",
  "Алиментарный"]
},
{
  "qID": 134,
  "qName": "Какая из нижеперечисленных бактерий не является возбудителем зоонозов:",
  "rA": [
    "Bacillus subtilis",
    ],
  "wA": [
    "Brucella melitensis",
    "Francisella tularensis",
    "Bacillus anthracis",
    "Yersinia pestis"]
},
{
  "qID": 135,
  "qName": "Для возбудителя холеры характерны:",
  "rA": [
    "Монотрихи",
    ],
  "wA": [
    "Образуют споры",
    "Образуют капсулы",
    "Лофотрихи",
    "Перитрихи"]
},
{
  "qID": 136,
  "qName": "Назовите путь передачи холеры:",
  "rA": [
    "Алиментарный",
    ],
  "wA": [
    "Воздушно - капельный",
    "Трансмиссивный",
    "Воздушно - полевой",
    "Вертикальный"]
},
{
  "qID": 137,
  "qName": "К какому виду инфекции относится холера:",
  "rA": [
    "Особо опасная",
    ],
  "wA": [
    "Госпитальная",
    "Зоонозная",
    "Аутоинфекция",
    "Хроническая"]
},
{
  "qID": 138,
  "qName": "К семейству Spirochaetaceae относятся следующие роды, кроме:",
  "rA": [
    "Leptospira",
    ],
  "wA": [
    "Spirochaeta",
    "Borrelia",
    "Treponema"]
},
{
  "qID": 139,
  "qName": "К патогенным спирохетам не относится род:",
  "rA": [
    "Crystyspira",
    ],
  "wA": [
    "Borrelia",
    "Treponema",
    "Leptospira"]
},
{
  "qID": 140,
  "qName": "Какой из дрожжеподобных грибов чаще вызывает кандидоз:",
  "rA": [
    "Candida albicans",
    ],
  "wA": [
    "Candida tropicalis",
    "Candida krusei",
    "Candida pseudotropicalis"]
},{
  "qID": 141,
  "qName": "Элективной средой для Candida albicans является:",
  "rA": [
    "Среда Сабуро",
    ],
  "wA": [
    "Среда Эндо",
    "Среда Плоскирева",
    "Среда Левина",
    "Среда Клауберга"]
},{
  "qID": 142,
  "qName": "Септицемия-это:",
  "rA": [
    "Размножение бактерии в крови",
    ],
  "wA": [
    "Размножение бактерии во внутренних органах ",
    "Размножение бактерии во внутренних органах и в крови",
    "Циркуляция токсинов в крови"]
},{
  "qID": 143,
  "qName": "Низшие грибы образуют:",
  "rA": [
    "Мицелий не септированный ",
    ],
  "wA": [
    "Мицелий септированный",
  "Мицелий септированный и несептированный",
  "Не образуют мицелий"]
},{
  "qID": 144,
  "qName": "К прокариотам не относятся:",
  "rA": [
    "Простейшие",
    ],
  "wA": [
    "Микоплазмы",
    "Хламидии",
    "Спирохеты",
    "Цианобактерии"]
},{
  "qID": 145,
  "qName": "Для культивирования хламидий  используют:",
  "rA": [
    "Культуру ткани",
    ],
  "wA": [
    "Сывороточный агар",
    "Среду Эндо",
    "Сахарный агар",
    "Среду Клауберга"]
},{
  "qID": 146,
  "qName": "Хламидии относятся:",
  "rA": [
    "К грамотрицательным бактериям",
    ],
  "wA": [
    "К вирусам",
    "К грамположительным бактериям",
  "К грибам"]
},{
  "qID": 147,
  "qName": "Колонии микоплазмы являются:",
  "rA": [
    "В виде «глазуньи»",
    ],
  "wA": [
    "Появляются через 24 часа",
    "Округлой формы",
    "R-колонии"]
},{
  "qID": 148,
  "qName": "Какой из указанных методов не применяется в диагностике вирусных инфекций:",
  "rA": [
    "Бактериоскопический",
    ],
  "wA": [
    "Серологический",
    "Вирусоскопический",
    "Заражение лабораторных животных",
    "Метод тканевых культур"]
},{
  "qID": 149,
  "qName": "Полуперевиваемые тканевые культуры получают из:",
  "rA": [
    "Ткани эмбриона человека",
    ],
  "wA": [
    "Нормальной ткани человека",
    "Нормальной ткани животного",
    "Опухолевой ткани"]
},{
  "qID": 150,
  "qName": "Перевиваемые тканевые культуры получают из:",
  "rA": [
    "Опухолевой ткани",
    ],
  "wA": [
    "Ткани эмбриона человека",
    "Нормальной ткани животного",
    "Нормальной ткани человека"]
},{
  "qID": 151,
  "qName": "Вирусы отличаются от риккетсий:",
  "rA": [
    "Дизъюнктивным способом размножения",
    ],
  "wA": [
    "Сферической формой",
    "Палочковидной формой",
    "Внутриклеточным паразитизмом",
    "Сперматозоидной формой"]
},{
  "qID": 152,
  "qName": "Каким методом нельзя определить размеры вириона:",
  "rA": [
    "Иммунодиффузии в агар",
    ],
  "wA": [
    "Ультрафильтрации",
    "Седиментации",
    "Ультрацентрифугированием"]
},{
  "qID": 153,
  "qName": "Какое семейство вирусов не относится к ДНК-содержащим?",
  "rA": [
    "Picornoviridae",
    ],
  "wA": [
    "Poxviridaeт",
    "Herpesviridae",
    "Adenoviridae",
    "Hepadnoviridae"]
},{
  "qID": 154,
  "qName": "Какое семейство вирусов не относится к РНК-содержащим?",
  "rA": [
    "Adenoviridae",
    ],
  "wA": [
    "Bunyamviridae",
    "Togaviridae",
    "Picornoviridae",
    "Rhabdoviridae"]
},{
  "qID": 155,
  "qName": "Какая стадия отсутствует в репродукции вирусов:",
  "rA": [
    "Бинарное деление",
    ],
  "wA": [
    "Неспецифическая адсорбция",
    "Специфическая адсорбция",
    "Синтез вирусных белков",
    "Сборка вириона"]
},{
  "qID": 156,
  "qName": "Персистенция вирусов – это:",
  "rA": [
    "Длительное пребывание вирусов в организме",
    ],
  "wA": [
    "Появление антител к антигенам вируса",
    "Исследование сыворотки крови",
  "Вирусемия"]
},{
  "qID": 157,
  "qName": "Какой из методов не применяется при культивировании вирусов:",
  "rA": [
    "Культивирование на элективных средах",
    ],
  "wA": [
    "Заражение  восприимчивых животных",
    "Заражение куриного эмбриона",
    "Культивирование в первичных тканевых культурах",
    "Культивирование в перевиваемых тканевых культурах"]
},{
  "qID": 158,
  "qName": "Какой из методов не используется при индикации вирусов:",
  "rA": [
    "Реакция опсонизации",
    ],
  "wA": [
    "Определение ЦПД",
    "Реакция гемадсорбции",
    "Реакция гемагглютинации",
    "Бляшкообразование"]
},{
  "qID": 159,
  "qName": "Первично-трипсинизированные культуры клеток выдерживают:",
  "rA": [
    "5-10 пассажей",
    ],
  "wA": [
    "10-15 пассажей",
    "15-20 пассажей",
    "20-25 пассажей",
    "25-30 пассажей"]
},
{
  "qID": 160,
  "qName": "Перевиваемые тканевые культуры обладают следующими свойствами, кроме одного:",
  "rA": [
    "Применяется в течение одной генерации",
    ],
  "wA": [
    "Получаются из опухолевых клеток",
    "Используются в научных целях",
    "Используются в диагностических целях"]
},
{
  "qID": 161,
  "qName": "Суперкапсид входит в состав:",
  "rA": [
    "Сложных вирусов",
    ],
  "wA": [
    "Простых вирусов",
    "Цитоплазматической мембраны",
    "Клеточной стенки"]
},
{
  "qID": 162,
  "qName": "Бактериофаги – это:",
  "rA": [
    "Вирусы бактерий",
    ],
  "wA": [
    "Антибиотико-подобные вещества, бактериального происхождения",
    "Антибиотико-подобные вещества, синтезируемые растениями",
  "Антимикробные вещества животного происхождения"]
},
{
  "qID": 163,
  "qName": "Строение бактериофага характеризуют следующие структуры, кроме:",
  "rA": [
    "Рибосомы",
    ],
  "wA": [
    "Хвост",
    "Нити",
    "Базальная пластинка",
    "НК"]
},
{
  "qID": 164,
  "qName": "Результат взаимодействия умеренного бактериофага с бактериальной клеткой – это:",
  "rA": [
    "Лизогенизация",
    ],
  "wA": [
    "Лизис",
    "Увеличение скорости деления клеток",
  "Фаговая конверсия"]
},
{
  "qID": 165,
  "qName": "Результат взаимодействия вирулентного бактериофага с бактериальной клеткой это:",
  "rA": [
    "Лизис",
    ],
  "wA": [
    "Лизогенизация",
    "Увеличение скорости деления клеток",
  "Фаговая конверсия",
  "Вирогения"]
},
{
  "qID": 166,
  "qName": "Какие размеры имеет вирус гриппа:",
  "rA": [
    "100 нм",
    ],
  "wA": [
    "30 нм",
    "250 нм",
    "350 нм",
    "200 нм"]
},
{
  "qID": 167,
  "qName": "Возбудитель кори отличается от других парамиксовирусов:",
  "rA": [
    "Отсутствием нейраминидазы",
    ],
  "wA": [
    "наличием нейраминидазы",
  "Отсутствием гемагглютинина",
  "Отсутствием РНК"]
},
{
  "qID": 168,
  "qName": "Укажите, какие структуры образуют геном ВИЧ:",
  "rA": [
    "Однонитевая РНК",
    ],
  "wA": [
    "Две нити + РНК",
    "ДНК",
    "Сегментированная РНК"]
},
{
  "qID": 169,
  "qName": "Укажите клеточные популяции, наиболее чувствительные к инфицированию ВИЧ:",
  "rA": [
    "Т – хелперы",
    ],
  "wA": [
    "Эндотелиоциты",
    "Гепатоциты",
    "Нейроны",
    "В - лимфоциты"]
},
{
  "qID": 170,
  "qName": "ВИЧ не передается:",
  "rA": [
    "Аэрогенным путем",
    ],
  "wA": [
    "Парентерально ",
    "Трансплацентарно",
    "Половым путем"]
},
{
  "qID": 171,
  "qName": "К какому семейству принадлежит ВИЧ:",
  "rA": [
    "Ретровирусы",
    ],
  "wA": [
    "Арбовирусы",
    "Гепадновирусы",
    "Аденовирусы",
    "Тогавирусы"]
},
{
  "qID": 172,
  "qName": "Назовите фермент, который имеет ВИЧ:",
  "rA": [
    "Обратная транскриптаза",
    ],
  "wA": [
    "ДНК - аза",
    "РНК – аза",
    "Нейраминидаза",
    "Гемагглютинин"]
},
{
  "qID": 173,
  "qName": "Патогенным для человека являются следующие серотипы  вируса полиомиелита:",
  "rA": [
    "1 - 3тип",
    ],
  "wA": [
    "4 тип",
    "5 тип",
    "7 тип"]
},
{
  "qID": 174,
  "qName": "Для какого заболевания характерно наличие в клетках телец Бабеша – Негри:",
  "rA": [
    "Бешенство",
    ],
  "wA": [
    "Ветряная оспа",
    "Клещевой энцефалит",
    "Краснуха",
    "Аденовирусная инфекция"]
},
{
  "qID": 175,
  "qName": "Отметьте свойства, характерные для вирусов герпеса:",
  "rA": [
    "Вызывает латентную инфекцию",
    ],
  "wA": [
    "Имеют РНК",
    "Нет суперкапсида",
    "Простой вирус"]
},
{
  "qID": 176,
  "qName": "Видоспецифический антиген Vibrio  cholerae :",
  "rA": [
    "О-антиген",
    ],
  "wA": [
    "Н- антиген",
    "К-антиген",
  "Vi-антиген"]
},
{
  "qID": 177,
  "qName": "При идентификации Pseudomonas aeruginosa не учитывают:",
  "rA": [
    "Тинкториальные и морфологические признаки",
    ],
  "wA": [
    "Пигментообразование",
    "Специфического запаха",
    "Рост при 42 градусах"]
},
{
  "qID": 178,
  "qName": "Вирус натуральной оспы не образует:",
  "rA": [
    "Тельца Бабеша-Негри",
    ],
  "wA": [
    "Внутриядерные включения",
    "Бляшки на хорионаллантоисной оболочке",
  "Тельца Гварниери"]
},
{
  "qID": 179,
  "qName": "Цитотоксины блокируют:",
  "rA": [
    "Синтез белка клеток",
    ],
  "wA": [
    "Функцию тканевых систем",
    "активность ферментов",
  "функцию лейкоцитов"]
},
{
  "qID": 180,
  "qName": "Эритрогенин синтезирует:",
  "rA": [
    "Streptococcus pyogenes ",
    ],
  "wA": [
    "Bordetella  pertussis",
    "Вирусы",
    "Грибы",
    "Микоплазмы"]
},
{
  "qID": 181,
  "qName": "Назвать питательную среду для идентификации Escherichia coli:",
  "rA": [
    "Среда Эндо",
    ],
  "wA": [
    "Среда Сабуро",
    "Желточно – солевой агар",
    "Среда Китта – Тароции",
    "Среда Плоскирева"]
},
{
  "qID": 182,
  "qName": "В семейство Bacillaceae входят микроорганизмы:",
  "rA": [
    "Спорообразующие",
    ],
  "wA": [
    "Капсулообразующие",
    "Грамм (-)-ные",
  "Грам (+) ные"]
},
{
  "qID": 183,
  "qName": "Токсины - блокаторы функции тканевых систем:",
  "rA": [
    "Энтеротоксины",
    ],
  "wA": [
    "Гемолизины",
    "Гистотоксины",
    "Эксофолиатины"]
},
{
  "qID": 184,
  "qName": "Токсины- блокаторы функции тканевых систем:",
  "rA": [
    "Тетаноспазмин Cl tetani",
    ],
  "wA": [
    "Тетанолизины Cl tetani",
    "Гемолизины",
    "Лейкоцидины"]
},
{
  "qID": 185,
  "qName": "Для оценки уровня микробного обсеменения воздуха в операционной не применяется:",
  "rA": [
    "Определение бактерий группы кишечных палочек",
    ],
  "wA": [
    "Определение золотистых стафилококков",
    "Определение количества бактерий ",
  "Определение термофилов"]
},{
  "qID": 186,
  "qName": "Наиболее эпидемиологическое значение при воздушно-пылевом передачи инфекции принадлежит:",
  "rA": [
    "Мелкокапельной фазе аэрозоля ",
    ],
  "wA": [
    "Крупнокапельной фазе аэрозоля ",
    "Бактериальной пыли",
  "Мелкодисперсной фазе"]
},
{
  "qID": 187,
  "qName": "Отметьте вируса, заражение которым опасно для беременных в отношении возникновения уродства плода:",
  "rA": [
    "Вирус краснухи",
    ],
  "wA": [
    "Аденовирусы ",
    "Вирус кори",
    "Вирус Коксаки"]
},
{
  "qID": 188,
  "qName": "Медленные вирусные инфекции не характеризуются :",
  "rA": [
    "коротким инкубационным периодом",
    ],
  "wA": [
    "Длительным инкубационным периодом",
    "поражением ЦНС",
    "медленным прогрессированием болезни",
    "летальным исходом"]
},
{
  "qID": 189,
  "qName": "Прионы являются возбудителями :",
  "rA": [
    " Конформационных болезней(неправильное сворачивание клеточного белка)",
    ],
  "wA": [
    "Медленной вирусной инфекции",
    "Вироидных инфекций",
    "Микозов"]
},
{
  "qID": 190,
  "qName": "Прионы не передаются:",
  "rA": [
    " Аэрогенным путем",
    ],
  "wA": [
    "Алиментарным путем",
    "При гемотрансфузии",
    "Через иммунобиологические препараты"]
},
{
  "qID": 191,
  "qName": "Морфологию бактерий изучают:",
  "rA": [
    " Микроскопическим методом",
    ],
  "wA": [
    "Бактериологическим методом",
    "Биологическим методом ",
    "ПЦР"]
},
{
  "qID": 192,
  "qName": "Методы изучения культуральных признаков бактерий:",
  "rA": [
    "Бактериологическим методом",
    ],
  "wA": [
    "Иммерсионной микроскоп ",
    "Микроскопическим методом",
    "Биологическим методом ",
    "ПЦР"]
},
{
  "qID": 193,
  "qName": "Цитолиз гепатоцитов при гепатите В происходит в основном за счет: ",
  "rA": [
    "Иммунологических реакций",
    ],
  "wA": [
    "Репродукции вирусов",
  "Вирогении",
  "Лизогении"]
},
{
  "qID": 194,
  "qName": "Не является специфическим маркером активности гепатита В ",
  "rA": [
    "HBc ag",
    ],
  "wA": [
    "HBs ag",
    "HBe ag",
    "ДНК вируса "]
},
{
  "qID": 195,
  "qName": "Специфическим маркером формирования иммунитета против гепатита В  является наличие в крови: ",
  "rA": [
    "anti HBs антител",
    ],
  "wA": [
    "anti.HBe антител ",
    "anti HBc  антител",
    "anti HBs Ig G"]
},
{
  "qID": 196,
  "qName": "Не является специфическим маркером формирования хронического гепатита В  :",
  "rA": [
    "HBe ag",
    ],
  "wA": [
    "HBs ag",
    "ДНК вируса ",
  "HBc ag"]
},
{
  "qID": 197,
  "qName": "Специфическим маркером активности гепатита D является наличие в крови :",
  "rA": [
    "HD ag",
    ],
  "wA": [
    "HBs ag",
    "HBc ag",
    "ДНК вируса "]
},
{
  "qID": 198,
  "qName": "Специфическим маркером формирования иммунитета против гепатита D  являются наличие в крови: ",
  "rA": [
    "anti. HD ag Ig G",
    ],
  "wA": [
    "anti HBs антител",
    "anti. HD ag  антител ",
    "anti HBc  антител",
    "anti HBs Ig G"]
},
{
  "qID": 199,
  "qName": "Не являются специфическим маркером активности гепатита A: ",
  "rA": [
    "Ig G",
    ],
  "wA": [
    "РНК вируса",
    "Антигена вируса",
    "Ig М"]
},
{
  "qID": 200,
  "qName": "Специфическими маркерами формирования иммунитета против  гепатита A  являются наличие в крови :",
  "rA": [
    "Ig G",
    ],
  "wA": [
    "РНК вируса",
    "Антигена вируса",
    "Ig М"]
},
{
  "qID": 201,
  "qName": "Не является специфическим маркером активности гепатита Е ",
  "rA": [
    "Ig G",
    ],
  "wA": [
    "РНК вируса",
    "Антиген вируса",
    "Ig М"]
},
{
  "qID": 202,
  "qName": "Ранняя диагностика гепатита А – это выявление:",
  "rA": [
    "Антигена вируса в фекалиях",
    ],
  "wA": [
    "Антигена вируса в крови",
    "Ig М",
    "Ig G"]
},
{
  "qID": 203,
  "qName": "Специфическими маркерами формирования иммунитета против  гепатита Е  являются наличие в крови :",
  "rA": [
    "Ig G",
    ],
  "wA": [
    "РНК вируса",
    "Антигена вируса",
    "Ig М"]
},
{
  "qID": 204,
  "qName": "Специфическими маркерами формирования вирусоносительства  гепатитом  В  являются наличие в крови :",
  "rA": [
    "HBs ag",
    ],
  "wA": [
    "HBe ag",
    "HBc ag",
    "ДНК вируса "]
},
{
  "qID": 205,
  "qName": "Споры необходимы бактериям для:",
  "rA": [
    "Сохранения во внешней среде",
    ],
  "wA": [
    "Размножения",
    " Сопротивления защитным силам микроорганизма ",
  "Подавления клеток иммунной системы"]
},
{
  "qID": 206,
  "qName": "Для выявления зерен волютина используется окраска по:",
  "rA": [
    "Нейссеру",
    ],
  "wA": [
    "Бурри",
    "Граму",
    "Цилю-Нильсону",
    "Ожешко"]
},
{
  "qID": 207,
  "qName": "Для выявления капсул используется окраска по:",
  "rA": [
    "Бурри",
    ],
  "wA": [
    "Граму",
    "Цилю-Нильсону",
    "Нейссеру",
    "Ожешко"]
},
{
  "qID": 208,
  "qName": "Пигменты бактерий выполняют следующие функции, кроме:",
  "rA": [
    "Защита от действия инфракрасных лучей",
    ],
  "wA": [
    "Защита от действия света",
    "Выполнение каталитической функции",
    "Антибиотические свойства"]
},
{
  "qID": 209,
  "qName": "Бактериальную клетку от эукариотной отличают следующие признаки:",
  "rA": [
    "Отсутствие ядерной мембраны",
    ],
  "wA": [
    "Наличие эндоплазматической сети",
    "Наличие цитоплазматической мембраны",
  "Наличие комплекса Гольджи"]
},
{
  "qID": 210,
  "qName": "Пастеризацию используют для стерилизации:",
  "rA": [
    "Молочных продуктов",
    ],
  "wA": [
    "Бактериальных петель",
    "Питательных сред",
    "Стеклянной посуды",
    "Споросодержащего материала"]
},
{
  "qID": 211,
  "qName": "Текущим паром стерилизуют",
  "rA": [
    "Среды с аминокислотами",
    ],
  "wA": [
    "Простые питательные среды",
    "Бактериологические петли",
    "Пипетки, пробки, колбы"]
},
{
  "qID": 212,
  "qName": "В лаг-фазе происходит:",
  "rA": [
    "адаптация микроорганизмов к питательной среде",
    ],
  "wA": [
    "быстрое размножение микроорганизмов",
    "быстрая гибель микроорганизмов",
    "выравнивание скорости размножения и скорости гибели"]
},
{
  "qID": 213,
  "qName": "Для стерилизации одноразовых пластмассовых изделий медицинского назначения в промышленности применяют:",
  "rA": [
    "гамма излучение",
    ],
  "wA": [
    "УФО-излучение",
    "дробную стерилизацию",
    "стерилизацию текучим паром "]
},
{
  "qID": 214,
  "qName": "Спорообразованием размножаются:",
  "rA": [
    "Актиномицеты",
    ],
  "wA": [
    "Бактерии",
    "Микоплазмы",
    "Микобактерии"]
},
{
  "qID": 215,
  "qName": "Назовите микробы, не входящие в состав нормальной микрофлоры толстого кишечника:",
  "rA": [
    "шигеллы",
    ],
  "wA": [
    "лактобактерии",
    "бифидобактерии",
    "катенобактерии",
    "бактероиды"]
},
{
  "qID": 216,
  "qName": "Назовите микробы, не входящие в состав факультативной микрофлоры толстого кишечника:",
  "rA": [
    "бледная трепонема",
    ],
  "wA": [
    "клостридии",
    "синегнойная палочка",
    "энтеробактерии",
    "грибы кандида"]
},
{
  "qID": 217,
  "qName": "Санитарно-показательными микробами для воды являются:",
  "rA": [
    "кишечная палочка",
    ],
  "wA": [
    "иерсении",
    "вирусы",
    "вибрионы",
    "микоплазмы"]
},
{
  "qID": 218,
  "qName": "Коли-титр водопроводной воды должен быть:",
  "rA": [
    "больше 333",
    ],
  "wA": [
    "меньше 333",
    "333",
    "111",
    "меньше 111"]
},
{
  "qID": 219,
  "qName": "Санитарно-показательными микробами для почвы являются:",
  "rA": [
    "клостридии",
    ],
  "wA": [
    "вирусы",
    "стафиллококки",
    "микоплазмы",
    "сарцины"]
},
{
  "qID": 220,
  "qName": "Комменсализм – это форма симбиоза, при которой:",
  "rA": [
    "один организм живет за счет другого, не причиняя ему вреда",
    ],
  "wA": [
    "оба партнера получают взаимную выгоду",
  "Продукты жизнедеятельности одного организма используются другим"]
},
{
  "qID": 221,
  "qName": "Метабиоз – это форма симбиоза, при которой:",
  "rA": [
    "один организм продолжает процесс, вызванный другим",
    ],
  "wA": [
    "два партнера получают взаимную выгоду",
  "один организм живет за счет другого, не причиняя ему вреда"]
},
{
  "qID": 222,
  "qName": "Микробный пейзаж тела человека представлен микробами, кроме:",
  "rA": [
    "амминифицирующими микробами",
    ],
  "wA": [
    "транзиторными микробами",
    "условно-патогенными микробами",
    "постоянно живущими микробами"]
},
{
  "qID": 223,
  "qName": "В кишечнике практически здоровых людей должны преобладать микроорганизмы:",
  "rA": [
    "анаэробные",
    ],
  "wA": [
    "аэробные",
    "микроаэрофильные",
    "факультативно-аэробные"]
},
{
  "qID": 224,
  "qName": "Оксидоредуктазы:",
  "rA": [
    "Катализируют окислительно-восстановительные реакции",
    ],
  "wA": [
    "Отщепляет химические группы не гидролитическим путем",
    "Вызывают расщепление протеинов, углеводов, липидов путем присоединения молекулы воды",
    "Способствуют реакциям биосинтеза",
    "Осуществляют перенос отдельных атомов от молекул к молекулам"]
},
{
  "qID": 225,
  "qName": "Механизмы персистенции,  кроме:",
  "rA": [
    "Спорообразования",
    ],
  "wA": [
    "Инактивация факторами ",
    "Капсула",
    "К-антиген ",
    "Антигенная мимикрия "]
},
{
  "qID": 226,
  "qName": "Поступление питательных веществ в клетку не происходит путем:",
  "rA": [
    "Переноса отдельных атомов от молекул к молекулам",
    ],
  "wA": [
    "Активного транспорта",
    "Простой диффузии",
    "Транслокации групп"]
},
{
  "qID": 227,
  "qName": "Пассивный транспорт идет :",
  "rA": [
    "Без затрат энергии",
    ],
  "wA": [
    "С затратой энергии",
    "С участием пермиаз",
  "С участием транслокации групп"]
},
{
  "qID": 228,
  "qName": "Экзоферменты:",
  "rA": [
    "Катализируют внутриклеточный метаболизм",
    ],
  "wA": [
    "Не выделятся в окружающую среду",
    "Не расщепляют макромолекул",
  "Являются липополисахаридами"]
},
{
  "qID": 229,
  "qName": "Основной питательной средой являются:",
  "rA": [
    "Мясопептонный агар",
    ],
  "wA": [
    "Кровяной агар",
    "Сывороточный МПА",
    "Сахарный МПБ"]
},
{
  "qID": 230,
  "qName": "Антигенами аденовирусов являются все,  кроме:",
  "rA": [
    "Н-антиген",
    ],
  "wA": [
    "А-антиген",
    "С-антиген",
    "В-антиген"]
},
{
  "qID": 231,
  "qName": "Ферменты агрессии:",
  "rA": [
    "Коллагеназа",
    ],
  "wA": [
    "Не разрушают ткани",
    "Не разрушают клеток",
    "Эндоферменты"]
},
{
  "qID": 232,
  "qName": "При подозрении на лептоспироз не исследуют:",
  "rA": [
    "Мазок из зева",
    ],
  "wA": [
    "Кровь",
    "Мочу",
    "Ликвор",
    "Воду"]
},
{
  "qID": 233,
  "qName": "Для специфической профилактики инфекции применяются,  кроме:",
  "rA": [
    "Антибиотики",
    ],
  "wA": [
    "Сыворотки",
    "Гамма-глобулин",
    "Бактериофаги"]
},
{
  "qID": 234,
  "qName": "Назовите путь передачи холеры",
  "rA": [
    "Алиментарный",
    ],
  "wA": [
    "Воздушно - капельный",
    "Трансмиссивный",
    "Воздушно - полевой",
    "Вертикальный"]
},
{
  "qID": 235,
  "qName": "К какому виду инфекции относится холера:",
  "rA": [
    "Особо опасная",
    ],
  "wA": [
    "Госпитальная",
    "Зоонозная",
    "Аутоинфекция",
    "Хроническая"]
},
{
  "qID": 236,
  "qName": "Какой путь передачи возбудителя наиболее часто вызывает развитие эпидемии:",
  "rA": [
    "Аэрогенный",
    ],
  "wA": [
    "Трансмиссивный",
    "Половой",
  "Вертикальный"]
},
{
  "qID": 237,
  "qName": "Какая из нижеперечисленных бактерий не является возбудителем зоонозов:",
  "rA": [
    "Bacillus subtilis",
    ],
  "wA": [
    "Brucella melitensis",
    "Francisella tularensis",
    "Bacillus anthracis",
    "Yersinia pestis"]
},
{
  "qID": 238,
  "qName": "Вакцины-это:",
  "rA": [
    "Антиген",
    ],
  "wA": [
    "Антитела",
    "Сыворотка",
  "Бактериофаги"]
},
{
  "qID": 239,
  "qName": "Из чего не получают вакцины:",
  "rA": [
    "Из иммунных сывороток",
    ],
  "wA": [
    "Из микроорганизмов",
    "Из вирусов",
    "Из токсинов"]
},
{
  "qID": 240,
  "qName": "Механизм действия  альфа-интерферона: ",
  "rA": [
    "Ингибирование синтеза белка",
    ],
  "wA": [
    "Ингибирование адсорбции вируса",
    "Ингибирование раздевания вируса",
  "Ингибирование слияния вируса с клеткой"]
},{
  "qID": 241,
  "qName": "Методы определения антибиотико чувствительности,  кроме:",
  "rA": [
    "Биологический",
    ],
  "wA": [
    "Метод индикаторных дисков",
    "Метод серийных разведений",
  "Серологический"]
},{
  "qID": 242,
  "qName": "Фаговая конверсия-это:",
  "rA": [
    "Приобритение токсигенности",
    ],
  "wA": [
    "Потеря вирулентности ",
    "Потеря токсигенности",
  "Приобретение чувствительности"]
},{
  "qID": 243,
  "qName": "Антибиотики вызывают следующие побочные действия, кроме:",
  "rA": [
    "Воспалительных реакций",
    ],
  "wA": [
    "Развития аллергических реакций",
    "Дисбактериоза",
    "Нарушение формирования полноценного иммунитета",
    "Токсических реакций"]
},{
  "qID": 244,
  "qName": "Антибиотики - это:",
  "rA": [
    "Продукты метоболизма бактерий",
    ],
  "wA": [
    "Продукты метоболизма лейкоцитов ",
    "Продукты метоболизма вирусов",
    "Продукты метоболизма простейших"]
},{
  "qID": 245,
  "qName": "Плазмиды – это:",
  "rA": [
    "Фрагмент ДНК",
    ],
  "wA": [
    "Разновидность включений в цитоплазму",
    "Аналог цитоплазматического ретикулума",
    "РНК"]
},{
  "qID": 246,
  "qName": "Антибиотикоустойчивость определяется:",
  "rA": [
    "R-плазмидой",
    ],
  "wA": [
    "F-плазмидой",
    "Бактериальной плазмидой ",
    "Транспозоном",
    "IS-последовательностью"]
},{
  "qID": 247,
  "qName": "В конъюгации участвует:",
  "rA": [
    "Пили 2 типа",
    ],
  "wA": [
    "Пили 1 типа",
    "Умеренные фаги",
    "Профаги"]
},{
  "qID": 248,
  "qName": "Способность бактерий к конъюгации связана с наличием: ",
  "rA": [
    "Половых пилей",
    ],
  "wA": [
    "Жгутиков",
    "Пилей общего типа",
    "РНК"]
},{
  "qID": 249,
  "qName": "Конъюгация генетически детерминирована ",
  "rA": [
    "F-плазмидой ",
    ],
  "wA": [
    "Профагом",
    "Хромосомной мутацией",
    "Транспозонами"]
},{
  "qID": 250,
  "qName": "Стерилизация сухим жаром проводится:",
  "rA": [
    "В печи Пастера",
    ],
  "wA": [
    "В автоклаве",
    "На водяной бане",
    "В аппарате Коха",
    "С помощью УФО"]
},{
  "qID": 251,
  "qName": "Оптимальная температура для возбудителя чумы:с",
  "rA": [
    "25 градусов",
    ],
  "wA": [
    "37градусов",
    "42 градусов",
  "50 градусов"]
},{
  "qID": 252,
  "qName": "Основные признаки плазмид , кроме:",
  "rA": [
    "Расположение   только в  составе хромосомы",
    ],
  "wA": [
    "Автономность репликации",
    "Трансмиссивность",
    "Расположение в составе хромосомы и в цитоплазме"]
},{
  "qID": 253,
  "qName": "Локализация персистенции вируса полиомиелита:",
  "rA": [
    "Эпителии кишечника",
    ],
  "wA": [
    "Макрофаги",
    "ЦНС",
    "фибробласты"]
},{
  "qID": 254,
  "qName": "Грамотрицательные бактерии:",
  "rA": [
    "энтеробактерии",
    ],
  "wA": [
    "коринебактерии",
    "микобактерии",
    "бациллы"]
},{
  "qID": 255,
  "qName": "Грамположительные бактерии:",
  "rA": [
    "бациллы",
    ],
  "wA": [
    "менингококки",
    "кишечные палочки",
    "вибрионы",
    "спирохеты"]
},{
  "qID": 256,
  "qName": "Живая вакцина против полиомиелита содержит:",
  "rA": [
    "Раствор высокодисперсных антигенов ",
    ],
  "wA": [
    "Смесь двух типов вируса",
    "Взвесь убитых вирусов ",
  "Клеточные культуры"]
},{
  "qID": 257,
  "qName": "Энтеровирус типа 70 не имеет тропизма к:",
  "rA": [
    "эпителиям  кожи",
    ],
  "wA": [
    "эпителиям конъюнктивы",
    "эпителиям роговицы",
    "нейронам спинного мозга"]
},{
  "qID": 258,
  "qName": "Энтеровирус типа 71 вызывает",
  "rA": [
    "Асептический менингит и энцефалит",
    ],
  "wA": [
    "Конъюнктивит",
    "ОРВИ",
    "Пневмонию"]
},{
  "qID": 259,
  "qName": "Первый принцип лабораторной диагностики инфекционных заболеваний:",
  "rA": [
    "Обнаружение возбудителя",
    ],
  "wA": [
    "Определение спецефических изменений в организме",
    "Определение антител",
    "Определение ГЗТ"]
},
{
  "qID": 260,
  "qName": "К второму  принципу лабораторной диагностики инфекционных заболеваний не относятся:",
  "rA": [
    "Обнаружение ДНК вирусов",
    ],
  "wA": [
    "Определение специфических изменений в организме",
    "Определение антител",
    "Определение ГЗТ"]
},
{
  "qID": 261,
  "qName": "Is-последовательности  - это:",
  "rA": [
    "ФрагментДНК",
    ],
  "wA": [
    "Фрагмент РНК",
    "Разновидность включений в цитоплазму",
    "Аналог цитоплазматического ретикулума "]
},
{
  "qID": 262,
  "qName": " Вирус натуральной оспы не передается",
  "rA": [
    "Половым путем",
    ],
  "wA": [
    "Воздушно-капельным путем",
    "Воздушно-пылевым путем",
    "Контактно-бытовым путем"]
},
{
  "qID": 263,
  "qName": "Вирус натуральной оспы характеризуется наличием: ",
  "rA": [
    "Образованием телец Гварниери",
    ],
  "wA": [
    "РНК",
    "Образованием телец Бабеша-Негри",
    "Обратной траскриптазы"]
},
{
  "qID": 264,
  "qName": " РСК Борде-Жангу  используются для серодиагностики :",
  "rA": [
    "Хронической гонореи",
    ],
  "wA": [
    "Сифилиса",
    "Острой гонореи",
    "Брюшного тифа"]
},
{
  "qID": 265,
  "qName": "РСК Вассермана  используются для серодиагностики  :",
  "rA": [
    "Сифилиса",
    ],
  "wA": [
    "Острой гонореи",
    "Хронической гонореи",
    "Бршного тифа"]
},
{
  "qID": 266,
  "qName": "Ранняя диагностика брюшного тифа:",
  "rA": [
    "Выделение гемокультуры в 1 неделю заболевания",
    ],
  "wA": [
    "Выделение гемокультуры",
    "Выделение копрокультуры",
    "Выделение уринокультуры"]
},
{
  "qID": 267,
  "qName": "Эффекторы специфической антимикробной защиты:",
  "rA": [
    "Антитела",
    ],
  "wA": [
    "Антигены",
    "Фагоциты",
    "Комплемент"]
},
{
  "qID": 268,
  "qName": "Специфические антиадгезины в системе колонизационной резистентности слизистых оболочек:",
  "rA": [
    "Антитела",
    ],
  "wA": [
    "Лизоцим",
    "Фагоциты",
    "Комплемент"]
},
{
  "qID": 269,
  "qName": "Не являются антимикробными факторами секретов слизистых оболочек:",
  "rA": [
    "Апаптоз микроорганизмов",
    ],
  "wA": [
    "Лизоцим",
    "Лактоферрин",
    "Катионные белки",
    "Нормальная микрофлора"]
},
{
  "qID": 270,
  "qName": "Положительные аллергические пробы выявляют:",
  "rA": [
    "Наличие возбудителя в организме",
    ],
  "wA": [
    "Наличие стерильного иммунитета",
    "Гуморального иммунитета",
    "Врожденного иммунитета"]
},
{
  "qID": 271,
  "qName": "Механизм антивирусной активности антител:",
  "rA": [
    "Антителозависимая цитотоксичность",
    ],
  "wA": [
    "Подавление вирогении",
    "МНС-зависимое распознавание инфицированных клеток",
  "Подавление лизогении"]
},
{
  "qID": 272,
  "qName": "Факторы, функциональная кооперация которых является основной при внутримакрофагальных инфекциях:",
  "rA": [
    "Т-лимфоциты",
    ],
  "wA": [
    "Антитела",
    "Нейтрофилы",
    "Комплемент"]
},
{
  "qID": 273,
  "qName": "Эффекторы антитоксического иммунитета:",
  "rA": [
    "Антитела",
    ],
  "wA": [
    "Макрофаги",
    "Комплемент",
    "Т-лимфоциты"]
},
{
  "qID": 274,
  "qName": "Факторы, функциональная кооперация которых не является основой иммунитета против пиогенных инфекций:",
  "rA": [
    "Т-лимфоциты",
    ],
  "wA": [
    "Нейтрофилы",
    "Антитела",
    "Комплемент"]
},
{
  "qID": 275,
  "qName": "Основной метод микробиологической диагностики прионных болезней:",
  "rA": [
    "Вирусологический",
    ],
  "wA": [
    "Микроскопический",
    "Метод Здродовского",
    "Метод Романовского-Гимзе"]
},
{
  "qID": 276,
  "qName": "Прионы  - это:",
  "rA": [
    "особые инфекционные агенты белковой природы",
    ],
  "wA": [
    "РНК-содержащие частицы.",
    "нитевидные микроорганизмы",
    "Риккетсии ",
   ]
},
{
  "qID": 277,
  "qName": "Болезнь Лайма вызывает: ",
  "rA": [
    "Borrelia burgdorferi    ",
    ],
  "wA": [
    "Mycobacterium кansasii",
    "Mycobacterium  leprae",
    "Mycobacterium  avium",
    "арестанское уркаганское единство "]
},
{
  "qID": 278,
  "qName": "Основной микроскопический метод выявления возбудителя Лаймы",
  "rA": [
    "метод Романовского-Гимзе",
    ],
  "wA": [
    "метод ожешка",
    "метод здоровского",
    "метод грама ",
    ]
},
{
  "qID": 279,
  "qName": "Профилактика болезни Лайма основана на",
  "rA": [
    "Предупреждение укусов клещей  ",
    ],
  "wA": [
    "Введении лепромина А",
    "Вакцинопрофилактика (убитая вакцина)  ",
	  "Введение вакцины"
    ]
},
{
  "qID": 280,
  "qName": "Для лабораторной диагностики 1-й стадии болезни Лайма используют материал:",
  "rA": [
    "Cоскоб с очагов кожных поражений ",
    ],
  "wA": [
    "кровь",
    "сыворотка крови",
    "мед дно",
  "Спинно-мозговую жидкость"]
},
{
  "qID": 281,
  "qName": "Природным резервуаром возбудителя болезни Лайма является: ",
  "rA": [
    "Мелкие грызуны, олени и лоси",
    ],
  "wA": [
    "человек",
    "Иксодовый клещ",
	  "Птицы"
    ]
},
{
  "qID": 282,
  "qName": "На месте укуса клеща при  болезни Лайма образуется:",
  "rA": [
    "Красная папула                         ",
    ],
  "wA": [
    "Мягкий шанкр",
    "Экзема",
    
    "Твердый шанкр"]
},
{
  "qID": 283,
  "qName": "Borrelia burgdorferi  относятся к:                                           ",
  "rA": [
    "Извитым формам                    ",
    ],
  "wA": [
    
    "Палочковидным бактериям",
    "Нитевидным",
    "Коккам"]
},
{
  "qID": 284,
  "qName": "Какой вирус гепатита может передаваться через плаценту только в случае высокой вирусемии?",
  "rA": [
    "Вирус гепатита С",
    ],
  "wA": [
    "Вирус гепатита B",
    "Вирус гепатита A",
    "Вирус гепатита D",
    "Вирус гепатита E"]
},
{
  "qID": 285,
  "qName": "Начиная с какой стадии болезни Лайма осуществляется определение Ig M или нарастания титра IgG ",
  "rA": [
    "2-стадия",
    ],
  "wA": [
    "1-стадия",
    "3-стадия",
  "В стадию выздоровления"]
},
{
  "qID": 286,
  "qName": "Из какого биологического материала можно выделить  Listeria  interrogans в 1-ую неделю лептоспироза?:",
  "rA": [
    "Крови",
    ],
  "wA": [
    "Ликвора",
    "Мочит",
 
    "Испражнений"]
},
{
  "qID": 287,
  "qName": "Отличия вирусов ЕСНО от Коксаки:",
  "rA": [
    "Не вызывает заболевание у мышей  ",
    ],
  "wA": [
    
    "Наличие суперкапсида",
    "Наличие капсида",
    "Наличие РНК"]
},
{
  "qID": 288,
  "qName": "Метод обнаружения специфических изменений при гепатите А:",
  "rA": [
    "Определение антител в сыворотке крови",
    ],
  "wA": [
    "Выявление РНК вируса",
    "Выявление антигена вируса",
    "жизнь ворам",
    "смерть ворам"]
},
{
  "qID": 289,
  "qName": "2-й принцип лабораторной диагностики гепатита С: ",
  "rA": [
    "Определение антител в сыворотке крови",
    ],
  "wA": [
    "Выявление РНК вируса",
    "Выявление антигена вируса",
    "Выявление возбудителя"
    ]
},
{
  "qID": 290,
  "qName": "Источники заражения гепатитом Е:",
  "rA": [
    "Больной человек и вирусоноситель",
    ],
  "wA": [
    "Инфицированные пищевые продукты",
    "Животные (больные и вирусоносители ",
    "Вода",
   ]
},
{
  "qID": 291,
  "qName": "Пути заражения гепатитом Е:",
  "rA": [
    "Алиментарный",
    ],
  "wA": [
    "Парентеральный",
    "Вертикальный",
    "Трансмиссивный"]
},
{
  "qID": 292,
  "qName": "Специфическая профилактика гепатита А:",
  "rA": [
    "Инактивированная вакцина",
    ],
  "wA": [
    "Химическая вакцина",
    "Живая вакцина",
    "Рекомбинантная  вакцина"
    ]
},
{
  "qID": 293,
  "qName": "Основной  путь заражения гепатитом С:",
  "rA": [
    "Парентеральный",
    ],
  "wA": [
    "Алиментарный",
    "Трансмиссивный",
    "Контактно-бытовой",
    ]
},
{
  "qID": 294,
  "qName": "Иммунитет при гепатите С:",
  "rA": [
    "Слабонапряженный",
    ],
  "wA": [
    "Напряженный гуморальный",
    "люблю микру(нет).",
    "Напряженный клеточный",
    "Инфекционный"]
},
{
  "qID": 295,
  "qName": "Антигенная структура вируса гепатита С не включает следующих антигенов:",
  "rA": [
    "HBs ag",
    ],
  "wA": [
    "pE1 -2",
    "NS 2-5",
    "(С- core антигена)"]
},
{
  "qID": 296,
  "qName": "В хронически инфицированных клетках ДНК вируса гепатита В может находится:",
  "rA": [
    "В ДНК клетки- хозяина",
    ],
  "wA": [
    "В цитоплазме клеток",
    "В клеточной стенке гепатоцитов",
  "В митоходриях клеток"]
},
{
  "qID": 297,
  "qName": "Не могут  реплицироваться в внепеченочных клетках:",
  "rA": [
    "Вирус гепатита D",
    ],
  "wA": [
    "Вирус гепатита E",
    "Вирус гепатита C",
    "Вирус гепатита B",
    "Вирус гепатита A"]
},
{
  "qID": 298,
  "qName": "Специфическая профилактика гепатита D",
  "rA": [
    "Не разработана",
    ],
  "wA": [
    "Химическая вакцина",
    "Рекомбинантная  вакцина",
    "Инактивированная вакцина",
    "Живая вакцина"]
},
{
  "qID": 299,
  "qName": "У вируса гепатита D нет:",
  "rA": [
    "Собственного суперкапсида",
    ],
  "wA": [
    "Нуклеиновой кислоты",
    "РНК ",
    "Суперкапсида "]
},
{
  "qID": 300,
  "qName": "Основной фактор передачи вируса гепатита С  - это:",
  "rA": [
    "Кровь   ",
    ],
  "wA": [
    " Воздух",
    "Вода",
    "Молоко",
    "Пища"]
},
{
  "qID": 301,
  "qName": "Клеточная стенка бактерий:",
  "rA": [
    "Придает бактериям определенную форму",
   ],
  "wA": [
    "Постоянная структура клетки.",
    "Образуется при неблагоприятных условиях",
    "Состоит только из белка",
"Слизистое образование"]
},
{
  "qID": 302,
  "qName": "При окраске по Граму применяют:",
  "rA": [
    "Генцианвиолет",
    ],
  "wA": [
    "Метиленовый синий",
    "Везувин",
    "Азур-эозин",
    "Серную кислоту"]
},
{
  "qID": 303,
  "qName": "Кандида относятся к царству",
  "rA": [
    "Eucaryotae",
    ],
  "wA": [
    "Procariotae",
    "Vіra",
    "Anіmalіa",
"Protozoa"]
},
{
  "qID": 304,
  "qName": ". Метод, используемый для выявления патогенных простейших в крови",
  "rA": [
    "толстая капля",
    ],
  "wA": [
    "фиксированный неокрашенный мазокт",
    "висячая капля",
    "фиксированный окрашенный мазок",
"раздавленная капля"]
},
{
  "qID": 305,
  "qName": ". Чистая культура микробов, выделенная из определенного источника и отличающаяся от других представителей вида, называется:",
  "rA": [
    "штаммом",
    ],
  "wA": [
    "клоном",
    "колонией",
    "вариантом",
"подвидом"]
},
{
  "qID": 306,
  "qName": " Бактерии, не имеющие клеточную стенку:",
  "rA": [
    "микоплазмы",
    ],
  "wA": [
    "риккетсии",
    "хламидии",
    "актиномицеты",
    " спирохеты"]
},
{
  "qID": 307,
  "qName": "Шляпочные грибы с септированным мицелием",
  "rA": [
    "базидиомицеты",
    ],
  "wA": [
    "оомицет",
    "дейтеромицеты",
    "аскомицеты",
"зигомицеты"]
},
{
  "qID": 308,
  "qName": "С какой целью фиксируют мазки:",
  "rA": [
    "для прикрепления бактерий к предметному стеклу",
    ],
  "wA": [
    " для выявления жгутиков",
" для обезжиривания препаратов",
" для сохранения размеров бактерий",
    "для выявления капсулы	",]
},
{
  "qID": 309,
  "qName": "В каждой бактериологической лаборатории должны быть предусмотрены:",
  "rA": [
    "помещения для приготовления питательных сред и стерилизации посуды",
    ],
  "wA": [
    "боксы для работы с отдельными группами вирусов",
    "боксы для работы с отдельными группами микроскопических грибов",
  "учебные аудитории",
  "препараторская"]
},
{
  "qID": 310,
  "qName": "Что изучает медицинская микробиология:",
  "rA": [
    "Патогенные и условно патогенные микроорганизмы",
    ],
  "wA": [
    "Фотобактерии",
    "Растения",
    "Гельминты"]
},
{
  "qID": 311,
  "qName": "Заслуги Пастера в микробиологии",
  "rA": [
    "Разработка пастеризации",
    ],
  "wA": [
    "Открытие возбудителя холеры",
    "Воспроизвел экспериментальный сифилис",
    "Открытие возбудителя туберкулеза",
"Открыте вирусов"]
},
{
  "qID": 312,
  "qName": "Основной таксономической единицей в микробиологии является:",
  "rA": [
    "Bид",
    ],
  "wA": [
    
    "Род",
"Семейство",
"Порядок",
"Класс"]
},
{
  "qID": 313,
  "qName": ". Принципиальным отличием в организации прокариотической клетки от эукариотической является:",
  "rA": [
    "отсутствие внутриклеточных мембран",
    ],
  "wA": [
    "отсутствие рибосом",
    "отсутствие ЦПМ",
    "наличие клеточной стенки",
  "отсутствие внутриплазматических включений"]
},
{
  "qID": 314,
  "qName": "Значение спор у бацилл:",
  "rA": [
    "защищают микроорганизм от неблагоприятных воздействий",
    ],
  "wA": [
    "размножение бактерий",
    "не сохраняют вид в неблагоприятных условиях",
    "участие в адгезии микроорганизмов",
"накопление питательных веществ"]
},
{
  "qID": 315,
  "qName": "Для вирусов характерно:",
  "rA": [
    "Паразитируют внутри клетки",
    ],
  "wA": [
    "Размножаются делением",
    "Имеют клеточное строение",
    "Образуют споры",
  "Растут только в аэробных условиях"]
},
{
  "qID": 316,
  "qName": ". Строение вирусов изучается методом:",
  "rA": [
    "Электронной микроскопии",
    ],
  "wA": [
    "Световой микроскопии",
    "Люминесцентной микроскопии",
    "Фазово-контрастной микроскопией",
  "Темнопольной микроскопии"]
},
{
  "qID": 317,
  "qName": "Тканевые культуры используются для:",
  "rA": [
    "Выращивания вирусов",
    ],
  "wA": [
    "Постановки серологических реакций",
    "Выращивания грибов",
    "Получения антибиотиков",
    "Выращивания бактерий"]
},
{
  "qID": 318,
  "qName": "Методы обнаружения (индикации) вирусов на тканевых культурах:",
  "rA": [
    "Цитопатическое действие",
    ],
  "wA": [
    "Газообразование",
    "Коньюгация",
    "Трансформации",
    "Диссоциация"]
},
{
  "qID": 319,
  "qName": "Методы обнаружения (индикации) вирусов на курином эмбрионе:",
  "rA": [
    "Гемагглютинация",
    ],
  "wA": [
    "Трансформация",
    "Бляшкообразование",
"Иммунофлюоресценция",
"Гемадсорбция"]
},
{
  "qID": 320,
  "qName": "Какие методы применяют для титрования фага:",
  "rA": [
    "Грациа и Аппельмана",
    ],
  "wA": [
    "Райта и Вассермана",
    "Коха и Пастера",
"Дригальского и Видаля",
"Грация и Кротова"]
},
{
  "qID": 321,
  "qName": "Ученный впервые использовавший раствор карболовой кислоты для обеззараживания ран:",
  "rA": [
    "Листер",
    ],
  "wA": [
    "Кох",
    "Пастер",
    "Ивановский",
    "Флеминг"]
},
{
  "qID": 322,
  "qName": "Ученый, впервые сформулировавший понятия об активном и пассивном иммунитете:",
  "rA": [
    "Эрлих",
    ],
  "wA": [
    "Мечников",
    "Кох",
    "Пастер",
    "Леффлер"]
},
{
  "qID": 323,
  "qName": "Чистая культура это",
  "rA": [
    "Совокупность микроорганизмов одного вида",
    ],
  "wA": [
    "Совокупность микроорганизмов разных видов",
    "Совокупность микроорганизмов одного рода",
    "Совокупность микроорганизмов разных родов",
    "Совокупность грамотрицательных микроорганизмов"]
},
{
  "qID": 324,
  "qName": "Термостат используется для:",
  "rA": [
    "Выращивания микроорганизмов",
    ],
  "wA": [
    "Стерилизации лабораторной посуды",
    "Стерилизации хирургических инструментов",
    "Стерилизации питательных сред",
    "Стимуляции спорообразования бактери"]
},
{
  "qID": 325,
  "qName": "Размножение бактерий происходит путем:",
  "rA": [
    "Поперечным изоморфным делением",
    ],
  "wA": [
    "Продольным делением",
    "Почкованием",
    "Экзоспорами",
    "Образованием фильтрующих форм"]
},
{
  "qID": 326,
  "qName": "Питательная среда для культивирования анаэробов:",
  "rA": [
    "Среда Китта-Тароцци",
    ],
  "wA": [
    "МПА",
    "МПБ",
    "Среды Гисса",
    "Щелочной агар"]
},
{
  "qID": 327,
  "qName": "Лаг-фаза это:",
  "rA": [
    "Фаза адаптации и начала интенсивного роста",
    ],
  "wA": [
    "Фаза максимального роста и интенсивного деления",
    "Фаза, при которой число бактериальных клеток не увеличивается",
    "Фаза, при которой число жизнеспособных клеток неизменно и находится на максимальном уровне",
    "Фаза отмирания бактерий"]
},
{
  "qID": 328,
  "qName": "Фаза логарифмического роста:",
  "rA": [
    "Фаза максимального роста и интенсивного деления",
    ],
  "wA": [
    "Фаза начала адаптации и интенсивного роста",
    "Фаза, при которой число бактериальных клеток не увеличивается",
    "Фаза, при которой число жизнеспособных клеток неизменно и находится на максимальном уровне",
    "Фаза отмирания бактерий"]
},
{
  "qID": 329,
  "qName": "Максимальная стационарная фаза:",
  "rA": [
    "Число жизнеспособных клеток неизменно и находится на максимальном уровне",
    ],
  "wA": [
    "Фаза адаптации и начала интенсивного рост",
    "Фаза максимального роста и интенсивного деления",
    "Фаза, при которой число бактериальных клеток не увеличивается",
    "Фаза отмирания бактерий"]
},
{
  "qID": 330,
  "qName": "Культивирование аэробов предусматривает использование:",
  "rA": [
    "Термостата",
    ],
  "wA": [
    "Свечей Шарберлена",
    "Аппарата Аристовского",
    "Эксикатора",
    "Свечей Омелянского"]
},
{
  "qID": 331,
  "qName": "Конститутивные ферменты",
  "rA": [
    "Постоянно синтезируются в микробных клетках в определенных концентрациях",
    "Концентрация не зависит от наличия соответствующего субстрата",
    ],
  "wA": [
    "Концентрация резко вырастает при наличии соответствующего субстрата",
    "В отсутствии субстрата находятся в следовых количествах",
    "Относятся к факторам роста микроорганизмов"]
},
{
  "qID": 332,
  "qName": "У беременной женщины в сыворотке крови в ИФА обнаружили антитела к вирусу СПИД. Какой результат ИФА считается положительным и достаточным при СПИД:",
  "rA": [
    "из трех повторных - два анализа положительные",
    ],
  "wA": [
    "достаточно однократного положительного результата",
    "из трех повторных - один анализ положительный",
    "из двух повторных - два анализа положительных",
    "достаточно двухкратного положительного результата"]
},
{
  "qID": 333,
  "qName": "Пигменты микроорганизмов:",
  "rA": [
    "Предохраняют от воздействия УФ-лучей",
    ],
  "wA": [
    "Участвуют в получении энерги",
    "Участвуют в биологическом окислени",
    "Являются источником углерода",
    "Являются источником азота"]
},
{
  "qID": 334,
  "qName": "Ферменты патогенности бактерий:",
  "rA": [
    "Плазмокоагулаза",
  
    "Гиалуронидаза",
  
    "Лецитиназа",
 
    "Стрептокиназа",
    ],
  "wA": [
    "Пенициллиназа"]
},
{
  "qID": 335,
  "qName": "Определение сахаролитических ферментов производят при посеве на:",
  "rA": [
    "Среды Гисса",
    ],
  "wA": [
    "Кровяной агар",
    "Среду Китт-Тароцци",
    "Молоко",
    "Среду Вильсон-Блера"]
},
{
  "qID": 336,
  "qName": "Период генерации это:",
  "rA": [
    "Период в течении которого осуществляется деление клетки",
    ],
  "wA": [
    "Время адаптации микробов к к изменившимся условиям среды",
    "Период восстановления поврежденных структур",
    "Объединение с бактериальной хромосомой",
    "Период уменьшения скорости отмирания клеток"]
},
{
  "qID": 337,
  "qName": "При снятии петлей изолированной колонии с МПА установлено,что колония слизистая, тянется за петлей. Что можно сказать о микробе",
  "rA": [
    "Обладает слизистой капсулой",
    ],
  "wA": [
    "Образует спору",
    "Выделяет ацетилметилкарбинол",
    "Имеет фермент триптафаназу",
    "Способен утилизировать цитрат"]
},
{
  "qID": 338,
  "qName": "ПВ окрашенных мазках из мокроты больного воспалением легких обнаружены ланцетовидной формы попарно расположенные кокки фиолетового цвета с неокрашенной каймой вокруг. Что представляет собой эта кайма:",
  "rA": [
    "Капсулу",
    ],
  "wA": [
    "Споры",
    "Цитоплазматическую мембрану",
    "Оболочку",
    "Жировосковые вещества"]
},
{
  "qID": 339,
  "qName": "У гомосексуалиста на нижних конечностях наблюдаются высыпания, сосудистая опухлость, парное увеличение паховых лимфатических узлов, положительная ИФА. Укажите, какой метод необходимо использовать для окончательного диагноза ВИЧ- инфекции:",
  "rA": [
    "иммуноблотинг",
    ],
  "wA": [
    "радиоиммунный анализ",
    "РПГА",
    "реакцию коагуляции",
    "иммунофлюоресценция"]
},
{
  "qID": 340,
  "qName": ". L-формы бактерий:",
  "rA": [
    "Бактерии, утратившие клеточную стенку, но сохранившие способность к размножению",
    ],
  "wA": [
    "Протопласты",
    "Окружены пептидогликаном",
    "Имеют наружную мембрану",
    "Бактерии, имеющие ригидную клеточную стенку"]
},
{
  "qID": 341,
  "qName": "О чем свидетельствует наличие антител к вирусу СПИД:",
  "rA": [
    "человек заражен ВИЧ",
    ],
  "wA": [
    "у человека имеется иммунитет от возможного заражения СПИД",
    "человек находится в инкубационном периоде",
    "имеются оппортунистические инфекции",
    "наблюдается выздоровление"]
},{
  "qID": 342,
  "qName": "Значение спор у возбудителя сибирской язвы",
  "rA": [
    "Способствуют сохранению вида в неблагоприятных условиях",
    ],
  "wA": [
    "Участвуют в размножении",
    "Накопление дополнительных питательных веществ",
    "Являются признаками дегенерации клетки",
    "Участвуют в адгезии"]
},{
  "qID": 343,
  "qName": "В мазке обнаружены палочки, располагающиеся цепочкой с овальным красным, центрально расположенным образованием. Каким методом окрашен мазок:",
  "rA": [
    "Ожешко",
    ],
  "wA": [
    "Леффлера",
    "Грама",
    "Циль-Нильсена",
    "Бурри"]
},{
  "qID": 344,
  "qName": "Входные ворота при менингококковой инфекции:",
  "rA": [
    "слизистая оболочка верхних дыхательных путей",
    ],
  "wA": [
    "желудочно-кишечный тракт",
    "кожные покровы",
    "слизистая половых путей",
    "слизистая глаза"]
},{
  "qID": 345,
  "qName": "Простые методы окраски позволяют:",
  "rA": [
    "Изучить форму микробов",
    ],
  "wA": [
    "Выявить оболочку",
    "Окрасить капсулу",
    "Изучить структуру бактериальной клетки",
    "Окрасить жгутики"]
},{
  "qID": 346,
  "qName": "Что необходимо сделать для постановки диагноза СПИД:",
  "rA": [
    "ИФА",
    ],
  "wA": [
    "РНГА",
    "радиоиммунный анализ",
    "реакцию коагуляции",
    "иммунофлюоресценции"]
},{
  "qID": 347,
  "qName": "В мазке из культуры микробов под объективом видны скопления кокков по форме напоминающие пакеты или тюки синего цвета. Назовите эти кокки:",
  "rA": [
    "Сарцины",
    ],
  "wA": [
    "Стафилококки",
    "Микрококки",
    "Менингококки",
    "Стрептококки"]
},{
  "qID": 348,
  "qName": "Кислотоустойчивость характерна для:",
  "rA": [
    "Туберкулезной палочки",
    ],
  "wA": [
    "Дифтерийной палочки",
    "Брюшнотифозной палочки",
    "Стафилококков",
    "Риккетсий"]
},{
  "qID": 349,
  "qName": "Окрашивание по Циль-Нильсену применяют для выявления",
  "rA": [
    "Кислотоустойчивых бактерий",
    ],
  "wA": [
    "Спор",
    "Капсул",
    "Зерен волютина",
    "Цитоплазматической мембраны"]
},{
  "qID": 350,
  "qName": "Чем отличается метод темнопольной микроскопии от других методов:",
  "rA": [
    "Объект освещен косыми боковыми лучами не попадающими в объектив",
    ],
  "wA": [
    "Дает увеличение в 250 тысяч раз",
    "Используется для изучения структуры вирусов и бактерий",
    "Разрешающая способность микроскопа 0,2 мкм",
    "Разрешающая способность зависит от общего увеличения микроскопа"]
},{
  "qID": 351,
  "qName": "У больного температура 39 градусов, озноб, сильная головная боль, рвота, ригидность мышц затылка. Выделена чистая культура грамотрицательных бобовидных кокков, расположенных попарно. Какой берут материал на исследование при данном заболевании:",
  "rA": [
    "Спинно-мозговую жидкость",
    ],
  "wA": [
    "Мочу",
    "Слизь из носоглотки",
    "Кровь",
    "Испражнения"]
},{
  "qID": 352,
  "qName": "Морфологические особенности спирохет",
  "rA": [
    "Относятся к извитым формам бактерий",
    ],
  "wA": [
    "Наличие спор",
    "Оформленное ядро",
    "Наличие зерен волютина",
    "Сократимость протоплазмы"]
},{
  "qID": 353,
  "qName": "От других групп микроорганизмов актиномицеты отличаются тем, что:",
  "rA": [
    "Имеют вид длинных ветвящихся нитей",
    ],
  "wA": [
    "Грамотрицательные",
    "Кислотоустойчивые",
    "Имеют зерна волютина",
    "В составе пептидогликана обнаружены арабиноза, галактоза"]
},{
  "qID": 354,
  "qName": "N. menіngіtіdіs отличаются от непатогенных нейссерий:",
  "rA": [
    "Не растут при температуре 22 С",
    ],
  "wA": [
    "Положительной оксидазной пробой",
    "Не растут при температуре 37 С",
    "Грамотрицательны",
    "Вегетируют на слизистых верхних дыхательных путей"]
},{
  "qID": 355,
  "qName": "Для риккетсий характерно:",
  "rA": [
    "Полиморфизм",
    ],
  "wA": [
    "Подвижность",
    "Кислотоустойчивость",
    "Ригидная оболочка",
    "Наличие зерен волютина"]
},{
  "qID": 356,
  "qName": "Морфологические особенности хламидий:",
  "rA": [
    "Морфология зависит от стадии внутриклеточного развития",
    ],
  "wA": [
    "Кислотоустойчивые микроорганизмы",
    "Образование внутриклеточных включений",
    "В организме образуют капсулу",
    "Имеют только РНК"]
},{
  "qID": 357,
  "qName": "Для морфологии и строения грибов характерно:",
  "rA": [
    "Образование мицелия",
    ],
  "wA": [
    "Отсутствие клеточной стенки",
    "Образование капсулы",
    "Диффузно расположенная ядерная субстанция",
    "Наличие жировосковых веществ"]
},{
  "qID": 358,
  "qName": "Постинфекционный иммунитет при менингите:",
  "rA": [
    "Прочный антимикробный",
    ],
  "wA": [
    "Тканевой",
    "Непрочный",
    "Пассивный",
    "Антитоксический"]
},{
  "qID": 359,
  "qName": "Инкубационный период при Синдроме Приобретенного Иммунного Дефицита:",
  "rA": [
    "2-4 недели, до 10 лет больше",
    ],
  "wA": [
    "отсутствует",
    "характеризуется появлением слабости, поноса, ночных потов",
    "2-3 часа",
    "развитие осложнений"]
},
{
  "qID": 360,
  "qName": ". Расположение кокков в мазке-препарате зависит от:",
  "rA": [
    "деления в разных плоскостях",
    ],
  "wA": [
    "размеров кокков",
    "количества и расположения жгутиков",
    "различия в капсулообразовании",
    "процесса коньюгации"]
},
{
  "qID": 361,
  "qName": "Как называются кокки, распологающиеся в виде гроздьев винограда:",
  "rA": [
    "стафилококки",
    ],
  "wA": [
    "стрептококки",
    "сарцины",
    "бациллы",
    "микрококки"]
},
{
  "qID": 362,
  "qName": "Органелла бактерий, препятствующая фагоцитозу:",
  "rA": [
    "капсула",
    ],
  "wA": [
    "спора",
    "клеточная стенка",
    "жгутики",
    "цитоплазма"]
},
{
  "qID": 363,
  "qName": "Метод применяемый для окрашивания кислотоустойчивых бактерий:",
  "rA": [
    "Циль-Нильсена",
    ],
  "wA": [
    "Романовского-Гимза",
    "Грама",
    "Здродовского",
    "Бурри"]
},
{
  "qID": 364,
  "qName": "Метод окрашивания спирохет:",
  "rA": [
    "Романовского-Гимза",
    ],
  "wA": [
    "Грама",
    "Циль-Нильсена",
    "Здродовского",
    "Бурри"]
},
{
  "qID": 365,
  "qName": "Функции жгутиков:",
  "rA": [
    "обеспечивают подвижность",
    ],
  "wA": [
    "защищают бактерии от неблагоприятных внешних воздействий",
    "придают определенную форму бактериям",
    "осуществляют транспорт растворенных веществ в клетку",
    "участвуют в делении клетки"]
},
{
  "qID": 366,
  "qName": "Как называются кокки, располагающиеся цепочками:",
  "rA": [
    "стрептококки",
    ],
  "wA": [
    "микрококки",
    "сарцины",
    "стафилококки",
    "бациллы"]
},
{
  "qID": 367,
  "qName": "Длительность сохранения спор во внешней среде:",
  "rA": [
    "несколько лет",
    ],
  "wA": [
    "несколько часов",
    "несколько минут",
    "несколько дней",
    "несколько недель"]
},
{
  "qID": 368,
  "qName": "В каких единицах измеряются размеры бактерий:",
  "rA": [
    "микрометры",
    ],
  "wA": [
    "нанометры",
    "миллиметры",
    " сантиметры",
    "ангстремы"]
},
{
  "qID": 369,
  "qName": "Вирион представляет собой:",
  "rA": [
    "полноценную вирусную частицу",
    ],
  "wA": [
    "молекулу ДНК",
    "молекулу РНК",
    "капсид",
    "суперкапсид"]
},
{
  "qID": 370,
  "qName": "Размеры вириона измеряются в:",
  "rA": [
    "нанометрах",
    ],
  "wA": [
    "миллиметрах",
    "сантиметрах",
    "ангстремах",
    "микрометрах"]
},
{
  "qID": 371,
  "qName": "Клон",
  "rA": [
    "Культура микроорганизмов, полученная из одной особи",
    ],
  "wA": [
    "Совокупность особей одного вида.",
    "Культура, выделенная из определенного источника.",
    "Совокупность особей, имеющих один фенотип.",
    "Микробные особи одного вида, выращенные на питательной среде"]
},
{
  "qID": 372,
  "qName": "Бактерии",
  "rA": [
    "Микроорганизмы, не имеющие оформленного ядра",
    ],
  "wA": [
    "Относятся к эукариотам.",
    "Имеют ядерную оболочку.",
    "Имеют вирион.",
    "Мельчайшие, не видимые в световом микроскопе частицы"]
},
{
  "qID": 373,
  "qName": "Капсид состоит из :",
  "rA": [
    "капсомеров",
    ],
  "wA": [
    "липополисахаридной оболочки",
    "липопротеидной оболочки",
    "ДНК",
    "РНК"]
},
{
  "qID": 374,
  "qName": "Возбудитель ботулизма образует:",
  "rA": [
    "Нейротоксин",
    ],
  "wA": [
    "Гиалуронидазу",
    "Фибринолизин",
    "Тетанолизин",
    "Эндотоксин"]
},
{
  "qID": 375,
  "qName": "Аспергилла относятся к царству:",
  "rA": [
    "Eucaryotae",
    ],
  "wA": [
    "Procarіotae",
    "Vіra",
    "Protozoa",
    "Anіmalіa"]
},
{
  "qID": 376,
  "qName": "Адгезия",
  "rA": [
    "Способность прикрепляться к клеткам.",
    ],
  "wA": [
    "Защита от фагоцитоза.",
    "Способность к распространению возбудителя",
    "Способность размножаться на поверхности клеток.",
    "Способность проникать в клетки и ткани."]
},
{
  "qID": 377,
  "qName": "Экзотоксины",
  "rA": [
    "Термолабильные белки.",
    ],
  "wA": [
    "Липополисахариды",
    "Капсомеры",
    "Вещества, избирательно подавляющие жизнедеятельность микроорганизмов.",
    "природные антибиотики"]
},
{
  "qID": 378,
  "qName": "Эндотоксины",
  "rA": [
    "Термостабильные липополисахариды",
    ],
  "wA": [
    "Мембранотоксины",
    "Антиэлонгаторы",
    "Белковые вещества.",
    "Постоянно выделяются в окружающую среду."]
},
{
  "qID": 379,
  "qName": "Периоды инфекционного заболевания:",
  "rA": [
    "Реконвалесценция",
    ],
  "wA": [
    "Инвазия",
    "Манифестная",
    "Рекомбинация",
    "Септикопиемия"]
},
{
  "qID": 380,
  "qName": "Гонококки вызывают:",
  "rA": [
    "Гонорею",
    ],
  "wA": [
    "Ревматизм",
    "Гепатит",
    "Скарлатину",
    "Столбняк"]
},
{
  "qID": 381,
  "qName": "Для микроскопического метода диагностики гонореи берут:",
  "rA": [
    "Отделяемое из уретры",
    ],
  "wA": [
    "СМЖ",
    "Пунктат из бубона",
    "Кровь больного",
    "Испражнения"]
},
{
  "qID": 382,
  "qName": "Микробиологические методы исследования при гонококковых заболеваниях:",
  "rA": [
    "Микроскопия мазков из патологического материала",
    ],
  "wA": [
    "Реакция преципитации",
    "Заражение лабораторных животных",
    "Реакция нейтрализации",
    "Посев на щелочной агар"]
},
{
  "qID": 383,
  "qName": "Ускоренная диагностика газовой анаэробной инфекции:",
  "rA": [
    "Газово-жидкостная хроматография",
    ],
  "wA": [
    "Метод Ермольевой",
    "Выявляет наличие клостридий",
    "Реакция нейтрализации",
    "Биологический метод"]
},
{
  "qID": 384,
  "qName": "Входные ворота инфекции при гонорее:",
  "rA": [
    "Цилиндрический эпителий слизистой оболочки мочеполового тракта",
    ],
  "wA": [
    "Кровь",
    "Кожные покровы",
    "Слизистая оболочка кишечного тракта",
    "Слизистая оболочка трахеи и бронхов"]
},
{
  "qID": 385,
  "qName": "Диагностика острой гонореи:",
  "rA": [
    "Бактериоскопический метод",
    ],
  "wA": [
    "РСК",
    "Биологический метод",
    "Реакция агглютинации",
    "Аллергическая проба"]
},
{
  "qID": 386,
  "qName": "Заболевания, вызванные условно-патогенными микроорганизмами характеризуются:",
  "rA": [
    "Полиэтиологичностью",
    ],
  "wA": [
    "Строго выраженной органной локализацией.",
    "Отсутствием продромального периода",
    "Подавлением одной популяции другой.",
    "Одинаковым инкубационным периодом."]
},
{
  "qID": 387,
  "qName": "Инфекция",
  "rA": [
    "Заражение",
    ],
  "wA": [
    "Микробиоценоз",
    "Подавление жизнедеятельности одной популяции другой.",
    "Форма существования двух патогенных микробов",
    "Симбиоз нормальной микрофлоры с макроорганизмом"]
},
{
  "qID": 388,
  "qName": "Инфекционные заболевания характеризуются:",
  "rA": [
    "Цикличностью течения",
    ],
  "wA": [
    "Отсутствием контагиозности.",
    "Одинаковым инкубационным периодом",
    "Отсутствием продромального периода.",
    "Вызываются только бактериями."]
},
{
  "qID": 389,
  "qName": "Формы инфекции в зависимости от распространения микробов:",
  "rA": [
    "Очаговая",
    ],
  "wA": [
    "Острая",
    "Хроническая",
    "Эндогенная",
    "Рецидив"]
},
{
  "qID": 390,
  "qName": "Реинфекция",
  "rA": [
    "Повторное заражение тем же возбудителем после выздоровления",
    ],
  "wA": [
    "Повторное заражение бактериями другого вида",
    "возникает при заболеваниях со стойким иммунитетом",
    "Возникает за счет нормальной микрофлоры",
    "Повторное заражение тем же возбудителем до ликвидации первичного заболевания"]
},
{
  "qID": 391,
  "qName": "Формы инфекции по источнику возбудителя:",
  "rA": [
    "Зоонозная",
    ],
  "wA": [
    "Пандемия",
    "Латентная",
    "Бактериемия",
    "Экзогенная"]
},
{
  "qID": 392,
  "qName": "Рецидив",
  "rA": [
    "Возникновение болезни через некоторое время после ее прекращения за счет оставшихся в организме возбудителей.",
    ],
  "wA": [
    "Повторное заболевание после полного выздоровления за счет вторичного заражения извне.",
    "В организме вегетирует патогенный микроб, но заболевания не возникает",
    "Форма инфекции при которой к основному заболеванию присоединяется другое.",
    "Повторное заболевание той же инфекцией, наступившее до ликвидации первичного заболевания."]
},
{
  "qID": 393,
  "qName": "Укажите форму инфекции",
  "rA": [
    "Рецидив",
    ],
  "wA": [
    "Реконвалесценция",
    "Продром",
    "Сенсибилизация",
    "Мутуализм"]
},
{
  "qID": 394,
  "qName": "Выберите состояние, когда микроб попадает в кровь и размножается в ней:",
  "rA": [
    "Сепсис",
    ],
  "wA": [
    "Токсинемия",
    "Бактериемия",
    "Септикопиемия",
    "Лейкемия"]
},
{
  "qID": 395,
  "qName": "Сколько периодов при инфекционном заболевании:",
  "rA": [
    "Четыре",
    ],
  "wA": [
    "Три",
    "Пять",
    "Шесть",
    "Два"]
},
{
  "qID": 396,
  "qName": "Выберите и дополните определение: Суперинфекция - это…:",
  "rA": [
    "Если заболевание возобновилось до выздоровления в результате инфицирования тем же возбудителем.",
    ],
  "wA": [
    "Когда инфекция вызвана разными видами микробов.",
    "Когда заболевание возникает после клинического выздоровления без повторного заражения, за счет оставшихся в организме возбудителей",
    "Состояние, когда организм перенес какую-либо инфекцию и вторично заболевает в результате нового заражения тем же возбудителем.",
    "Когда к первоначальной, основной, уже развившейся болезни присоединяется другая, вызываемая новым возбудителем"]
},
{
  "qID": 397,
  "qName": "Выберите бактерии, которые секретируют энтеротоксины:",
  "rA": [
    "Холерный вибрион.",
    ],
  "wA": [
    "Бруцеллы",
    "Возбудитель чумы.",
    "Пневмококки",
    "Гонококк"]
},
{
  "qID": 398,
  "qName": "Для патогенных микробов характерны:",
  "rA": [
    "Нозологическая специфичность и органотропность.",
    ],
  "wA": [
    "Полиэтиологичность",
    "Отсутствие характерной клинической картины.",
    "Вызывают заболевания только на фоне первичного инфекционного заболевания",
    "Не имеют строго выраженной органной локализации"]
},
{
  "qID": 399,
  "qName": "Особенность вирусной инфекции",
  "rA": [
    "Облигатный внутриклеточный паразитизм",
    ],
  "wA": [
    "Короткий инкубационный период",
    "Развитие бактериемии",
    "Отсутствие взаимодействия между геномом вируса и геномом клетки макроорганизма.",
    "Отсутствием специфичности действия"]
},
{
  "qID": 400,
  "qName": "Самозаражение путем переноса возбудителя из одного биотопа в другой называется",
  "rA": [
    "аутоинфекция",
    ],
  "wA": [
    "реинфекция",
    "рецидив",
    "моноинфекция",
    "бактерионосительство"]
},
{
  "qID": 401,
  "qName": "Одновременное заражение различными возбудителями",
  "rA": [
    "микстинфекция",
    ],
  "wA": [
    "суперинфекция",
    "реинфекция",
    "моноинфекция",
    "вторичная инфекция"]
},
{
  "qID": 402,
  "qName": "Заражение только одним возбудителем",
  "rA": [
    "моноинфекция",
    ],
  "wA": [
    "микстинфекция",
    "суперинфекция",
    "реинфекция",
    "вторичная инфекция"]
},
{
  "qID": 403,
  "qName": "Целенаправленное передвижение фагоцитов в окружающей среде:",
  "rA": [
    "хемотаксис",
    ],
  "wA": [
    "инвазия",
    "агрессия",
    "адгезия",
    "пенетрация"]
},
{
  "qID": 404,
  "qName": "Патогенный фактор возбудителя, проявляющийся прикреплением к поверхности клетки",
  "rA": [
    "адгезия",
    ],
  "wA": [
    "агрессия",
    "инвазия",
    "хемотаксис",
    "пенетрация"]
},
{
  "qID": 405,
  "qName": "Антраксин",
  "rA": [
    "Аллерген",
    ],
  "wA": [
    "Анатоксин",
    "Экзотоксин",
    "Эндотоксин",
    "Гамма-глобулин"]
},
{
  "qID": 406,
  "qName": ". Патогенность Y.pestіs связана :",
  "rA": [
    "Мышиным токсином",
    ],
  "wA": [
    "Образованием гемагглютининов",
    "Продукцией гиалуронидазы",
    "Продукцией плазмокоагулазы",
    "Наличием цитохрома "]
},
{
  "qID": 407,
  "qName": "Остаточный патогенный фактор некоторых бактерии, проявляющийся после гибели микроба:",
  "rA": [
    "эндотоксин",
    ],
  "wA": [
    "экзотоксин",
    "антигены",
    "патогенные ферменты",
    "эксфолиативные токсины"]
},
{
  "qID": 408,
  "qName": "Характерные свойства эндотоксинов:",
  "rA": [
    "термостабильны",
    ],
  "wA": [
    "очень токсичны",
    "менее ядовиты",
    "термолабильны",
    "активные антигены"]
},
{
  "qID": 409,
  "qName": "Патогенный фактор, заключающийся в проникновении микроорганизма внутрь клеток макроорганизма:",
  "rA": [
    "инвазия",
    ],
  "wA": [
    "агрессия",
    "адгезия",
    "колонизация",
    "пенетрация"]
},
{
  "qID": 410,
  "qName": "Инфицирование тем же возбудителем, проходящее до выздоровления",
  "rA": [
    "суперинфекция",
    ],
  "wA": [
    "сепсис",
    "реинфекция",
    "вторичная инфекция",
    "рецидив"]
},
{
  "qID": 411,
  "qName": "Пирогенами являются:",
  "rA": [
    "эндотоксины",
    ],
  "wA": [
    "патогенные ферменты",
    "экзотоксины",
    "аллергены",
    "пурины"]
},
{
  "qID": 412,
  "qName": "К ферментам патогенности относятся",
  "rA": [
    "плазмокоагулаза",
    ],
  "wA": [
    "лигаза",
    "трансфераза",
    "полимераза",
    "липаза"]
},
{
  "qID": 413,
  "qName": "Что вызывает у новорожденного эксфолиативный токсин",
  "rA": [
    "Пузырчатку",
    ],
  "wA": [
    "Пупочный сепсис",
    "Диарею",
    "Конъюнктивит",
    "Плеврит "]
},
{
  "qID": 414,
  "qName": "Какой микроорганизм продуцирует эксфолиативный токсин?",
  "rA": [
    " Стафилококк",
    ],
  "wA": [
    "Стрептококк",
    "Гонококк",
    "Синегнойная палочка",
    "Энтеропатогенная кишечная палочка"]
},
{
  "qID": 415,
  "qName": "Какой микроорганизм вырабатывает эритрогенный токсин",
  "rA": [
    "Стрептококк",
    ],
  "wA": [
    "Гонококк",
    "Менингококк",
    "Синегнойная палочка",
    "Стафилококк"]
},
{
  "qID": 416,
  "qName": "Какой микроорганизм вызывает скарлатину",
  "rA": [
    "Стрептококки",
    ],
  "wA": [
    "Коринебактерии",
    "Стафилококки",
    "Клебсиеллы",
    "Сарцины"]
},
{
  "qID": 417,
  "qName": "Эритрогенный токсин индуцирует",
  "rA": [
    "Скарлатину",
    ],
  "wA": [
    "Пузырчатку",
    "Диарею",
    "Бленнорею",
    "Характерную сыпь"]
},
{
  "qID": 418,
  "qName": "Проба Шика это",
  "rA": [
    "Реакция нейтрализации токсина",
    ],
  "wA": [
    "Реакция связывания комплемента",
    "Реакция непрямой гемагглютинации",
    "Реакция агглютинации",
    "Реакция лизиса"]
},
{
  "qID": 419,
  "qName": "После введения разбавленного дифтерийного токсина, реакция оказалась отрицательной, выберите правильную трактовку результата анализа",
  "rA": [
    "У пациента имеется иммунитет к дифтерии",
    ],
  "wA": [
    "У пациента снижена резистентность",
    "У пациента наблюдается ареактивность иммунной системы",
    "Иммунитет к дифтерии отсутствует",
    "У пациента имеется гиперчувствительность к дифтерии"]
},
{
  "qID": 420,
  "qName": "Почему у безмикробных животных не созревает иммунная система:",
  "rA": [
    "Нет антигенного раздражения",
    ],
  "wA": [
    ") Не поступают протеины с пищей",
    "Эпителий кишечника не способен адгезировать микроорганизмы",
    "Отсутствуют стволовые клетке в организме гнотобионта",
    "Отсутствует тимус"]
},
{
  "qID": 421,
  "qName": "Что такое оппортунистическая инфекция:",
  "rA": [
    "Инфекция, вызываемая УПМ",
    ],
  "wA": [
    "Вирусная",
    "Протозойная",
    "Бактериальная",
    "Грибковая"]
},
{
  "qID": 422,
  "qName": "Способность к полноценному синтезу ІgG проявляется:",
  "rA": [
    "К первому году жизни",
    ],
  "wA": [
    "К моменту рождения",
    "К первому месяцу жизни",
    "К 5-6 месяцам",
    "К 5-6 годам"]
},
{
  "qID": 423,
  "qName": "Почему иммунная система беременной женщины не отторгает чужеродные клетки плода:",
  "rA": [
    "Плацента ограждает плод от проникновения Т- и В-лимфоцитов",
    ],
  "wA": [
    "Плацента пропускает ІgМ",
    "Плацента пропускает ІgА",
    "Плацента пропускает ІgG",
    "Плацента является механическим барьером для цитокинов"]
},
{
  "qID": 424,
  "qName": "Иммунитет при лептоспирозах",
  "rA": [
    "Постинфекционный",
    ],
  "wA": [
    "Протективный",
    "Тканевой",
    "Нестерильный",
    "Фагоцитарный"]
},
{
  "qID": 425,
  "qName": "Какие антитела могут проходить через плаценту от матери к плоду",
  "rA": [
    "Іg G",
    ],
  "wA": [
    "Іg M",
    "Іg A",
    "Іg E",
    "Іg D"]
},
{
  "qID": 426,
  "qName": "Классы иммуноглобулинов, обуславливающие пассивную иммунизацию плода",
  "rA": [
    "Іg G",
    ],
  "wA": [
    "Іg D",
    "Іg A",
    "Іg E",
    "Іg M"]
},
{
  "qID": 427,
  "qName": "Для палочек ботулизма характерно образование",
  "rA": [
    "Нейротоксина",
    ],
  "wA": [
    "Гиалуронидазы",
    "Плазмокоагулазы",
    "Тетаноспазмина",
    "Эндотоксина"]
},
{
  "qID": 428,
  "qName": "К – антиген бактерий входит в состав",
  "rA": [
    "капсулы",
    ],
  "wA": [
    "жгутиков",
    "клеточной стенки",
    "ЦПМ",
    "пилей"]
},
{
  "qID": 429,
  "qName": "Диагностические сыворотки используют для",
  "rA": [
    "постановки серологических реакций",
    ],
  "wA": [
    "лечения",
    "индикации микроорганизмов",
    "профилактики",
    "выявление микробов во внешней среде"]
},
{
  "qID": 430,
  "qName": "Назовите неправильный ответ при характеристике иммунных сывороток",
  "rA": [
    "иммунитет не вырабатывается",
    ],
  "wA": [
    "создается искусственный иммунитет",
    "используются для серотерапии",
    "проводится экстренная профилактика",
    "антитела нейтрализуют белковый токсин"]
},
{
  "qID": 431,
  "qName": "Аллергией называется",
  "rA": [
    "повышенная чувствительность организма",
    ],
  "wA": [
    "нарушение иммунного статуса",
    "нарушение структуры и функции органов и тканей",
    "наследственная предрасположенность к гиперфункции"]
},
{
  "qID": 432,
  "qName": "Инфекционная аллергия",
  "rA": [
    "гиперчувствительность замедленного типа",
    ],
  "wA": [
    "гиперчувствительность немедленного типа",
    "в основе лежит гуморальный ответ",
    "развивается при введении сывороток",
    "развивается при первичном введении антигена"]
},
{
  "qID": 433,
  "qName": "Для развития оппортунистических инфекций имеет значение",
  "rA": [
    "Иммунодефицитные состояния",
    ],
  "wA": [
    "Иммунологическая память",
    "Аутоиммунные заболевания",
    "Нарушение целостности покровов",
    "Иммунологический паралич"]
},
{
  "qID": 434,
  "qName": "Клиническая картина оппортунистических инфекций зависит от:",
  "rA": [
    "Локализации поражения",
    ],
  "wA": [
    "Возбудителя болезни",
    "Инвазивности возбудителя",
    "Способа заражения",
    "Интерференции фагоцитарного механизма"]
},
{
  "qID": 435,
  "qName": "Возбудителями ятрогенных инфекций являются",
  "rA": [
    "Условно-патогенные микробы",
    ],
  "wA": [
    "Зоонозные инфекции",
    "Только высоковирулентные возбудители",
    "Туберкулезная палочка",
    "Актиномицеты"]
},
{
  "qID": 436,
  "qName": "Для СПИДа характерным является",
  "rA": [
    "снижение Т – хелперов",
    ],
  "wA": [
    "увеличение продукции интерлейкина – 2",
    "увеличение продукции гамма-интерферона",
    "снижение В-лимфоцитов",
    "увеличение всех лимфоцитов"]
},
{
  "qID": 437,
  "qName": "Проявлением анафилактического типа аллергических реакции могут быть",
  "rA": [
    "анафилактический шок",
    ],
  "wA": [
    "аллергия при инфекционных заболеваниях",
    "контактная аллергия",
    "цитотоксическая реакция",
    "сывороточная болезнь"]
},
{
  "qID": 438,
  "qName": "Химические вакцины",
  "rA": [
    "представляют полноценные антигенные комплексы",
    ],
  "wA": [
    "содержат цельные микробные клетки",
    "получают из микробов при нагревании и обработке формалином",
    "высушивают методом лиофильной сушки",
    "приводят к выработке антитоксического иммунитета"]
},
{
  "qID": 439,
  "qName": "Тяжелая раневая инфекция, характеризующаяся поражением нервной системы",
  "rA": [
    "столбняк",
    ],
  "wA": [
    "сибирская язва",
    "полиомиелит",
    "менингит",
    "лейшманиоз"]
},
{
  "qID": 440,
  "qName": "Микоплазмы",
  "rA": [
    "Поражают мочеполовой тракт",
    ],
  "wA": [
    "Вызывают заболевания с острым течением",
    "Вызывают ОКИ",
    "Поражают слизистую тонкого кишечника",
    "Выявляются по ЦПД на культуре клеток"]
},{
  "qID": 441,
  "qName": "Какой период инфекционного заболевания характеризуется появлением первых неспецифических симптомов заболевания",
  "rA": [
    "продромальный",
    ],
  "wA": [
    "инкубационный",
    "разгар болезни",
    "реконвалесценции",
    "бактерионосительство"]
},{
  "qID": 442,
  "qName": "Какой период инфекционного заболевания характеризуется появлением специфических симптомов заболевания",
  "rA": [
    "разгар болезни",
    ],
  "wA": [
    "продромальный",
    "реконвалесценции",
    "бактерионосительство",
    "инкубационный"]
},{
  "qID": 443,
  "qName": "Период реконвалесценции характеризуется",
  "rA": [
    "прекращением размножения и гибелью возбудителя",
    ],
  "wA": [
    "сохранением возбудителя в организме",
    "адгезией микробов на чувствительных клетках организма",
    "появлением неспецифических симптомов заболевания",
    "адгезией микробов на чувствительных клетках организма"]
},{
  "qID": 444,
  "qName": "При первичном иммунном ответе первыми вырабатываются антитела класса",
  "rA": [
    "Іg M",
    ],
  "wA": [
    "Іg A",
    "Іg G",
    "Іg E",
    "Іg D"]
},{
  "qID": 445,
  "qName": "При вторичном иммунном ответе первыми вырабатываются антитела класса",
  "rA": [
    "Іg G",
    ],
  "wA": [
    "Іg M",
    "Іg E",
    "Іg D",
    "Іg A"]
},{
  "qID": 446,
  "qName": "Для лабораторной диагностики ботулизма используют",
  "rA": [
    "Реакцию нейтрализации на белых мышах",
    ],
  "wA": [
    "Реакцию агглютинации",
    "РПГА",
    "Аллергическую пробу",
    "Реакцию Асколи"]
},{
  "qID": 447,
  "qName": "Для лечения ботулизма используют",
  "rA": [
    "Поливалентную антитоксическую сыворотку",
    ],
  "wA": [
    "Бактериофаг",
    "Антимикробную сыворотку",
    "Антибиотики",
    "Аутовакцину"]
},{
  "qID": 448,
  "qName": "К антигенам бруцелл относится",
  "rA": [
    " Vі-антиген",
    ],
  "wA": [
    "Протективный",
    "Н-антиген",
    "К-антиген",
    "Пептидогликан"]
},{
  "qID": 449,
  "qName": "Что не относится к стадиям фагоцитоза",
  "rA": [
    "интеграция в геном клетки",
    ],
  "wA": [
    "хемотаксис",
    "адгезия",
    "эндоцитоз",
    "внутриклеточное переваривание"]
},{
  "qID": 450,
  "qName": "Бруцеллы характеризуются",
  "rA": [
    "Мелкими размерами",
    ],
  "wA": [
    "Грамположительной окраской",
    "Подвижностью",
    "Спорообразованием",
    "Не требовательны к питательным средам"]
},{
  "qID": 451,
  "qName": "Созревание Т-лимфоцитов происходит в",
  "rA": [
    "тимусе",
    ],
  "wA": [
    "селезенке",
    "костном мозге",
    "лимфоузлах",
    "печени"]
},{
  "qID": 452,
  "qName": "Созревание В-лимфоцитов происходит в",
  "rA": [
    "костном мозге",
    ],
  "wA": [
    "тимусе",
    "селезенке",
    "печени",
    "лимфоузлах"]
},{
  "qID": 453,
  "qName": "В реакции Райта выявляют",
  "rA": [
    "Агглютинины",
    ],
  "wA": [
    "Преципитины",
    "Тромбоцитобактерины",
    "Комплементсвязывающие антитела",
    "Гемолизины"]
},{
  "qID": 454,
  "qName": "Укажите типы аллергических реакций",
  "rA": [
    "все вышеуказанное",
    ],
  "wA": [
    "анафилактический",
    "цитотоксический",
    "иммунокомплексный",
    "клеточный"]
},{
  "qID": 455,
  "qName": "Аллергическое состояние при бруцеллезе выявляют с помощью",
  "rA": [
    "Пробы Бюрне",
    ],
  "wA": [
    "Пробы Манту",
    "Туберкулина",
    "Антраксина",
    "Люэтина"]
}
,{
  "qID": 456,
  "qName": "Профилактика бруцеллеза проводится с помощью:",
  "rA": [
    "Обезвреживания продуктов и сырья животного происхождения ",
    ],
  "wA": [
    "Бактериофага",
    "Убитой вакцины",
    "Гамма-глобулин",
    "Анатоксина "]
},{
  "qID": 457,
  "qName": "Укажите вакцину, полученную путем генной инженерии:",
  "rA": [
    "против гепатита В",
    ],
  "wA": [
    "СТИ",
    "БЦЖ",
    "менингококковая",
    "брюшнотифознаф"]
},{
  "qID": 458,
  "qName": "Какая из бруцелл чаще вызывает бруцеллез у коз и овец:",
  "rA": [
    "Brucella melіtensіs ",
    ],
  "wA": [
    "Brucella abortus ",
    "Brucella suіs ",
    "Brucella canіs",
    "Brucella ovіs"]
},{
  "qID": 459,
  "qName": "Бруцеллы:",
  "rA": [
    "Не образуют спор ",
    ],
  "wA": [
    "Лишены жгутиков",
    "Имеют капсулу ",
    "Не требовательны к питательным средам",
    "Размножаются быстро"]
},
{
  "qID": 460,
  "qName": "Укажите путь заражения псевдотуберкулезом",
  "rA": [
    "алиментарный ",
    ],
  "wA": [
    "воздушно-капельный",
    "половой ",
    "трансмиссивный",
    "вертикальный"]
},
{
  "qID": 461,
  "qName": "Bacillus anthracіs:",
  "rA": [
    "Грамположительные палочки с обрубленными концами",
    ],
  "wA": [
    "Грамотрицательные палочки с закругленными концами ",
    "Палочки, располагающиеся под углом",
    "Палочки, располагающиеся частоколом",
    "Имеют форму изогнутой палочки"]
},
{
  "qID": 462,
  "qName": "При заражении сибирской язвой наиболее опасны:",
  "rA": [
    "Мясо и мясные продукты",
    ],
  "wA": [
    "Вода",
    "Овощи ",
    "Рыбные продукты",
    "Птицы "]
},
{
  "qID": 463,
  "qName": "В пробе Пизу определяют разложение:",
  "rA": [
    "цистиназы",
    ],
  "wA": [
    "уреазы",
    "сахарозы",
    "глюкозы",
    "маннозы"]
},
{
  "qID": 464,
  "qName": "В пробе Закса определяют разложение:",
  "rA": [
    "мочевины ",
    ],
  "wA": [
    "галактозы ",
    "цистиназы ",
    "мальтозы ",
    "сахарозы "]
},
{
  "qID": 465,
  "qName": "Токсин, соединяющийся с поверхностными структурами нервных клеток и вызывающий судороги: ",
  "rA": [
    "тетаноспазмин",
    ],
  "wA": [
    "тетанолизин",
    "эксфолиатин ",
    "эритрогенин",
    "гемолизин"]
},
{
  "qID": 466,
  "qName": "Культуральные свойства M. bovіs: ",
  "rA": [
    "S-формы колоний, мелкие, серые",
    ],
  "wA": [
    "R-формы колонии, сухие с ароматным запахом ",
    "маслянистые ",
    "S-формы колоний, желтые",
    "в виде цветка маргаритки"]
},
{
  "qID": 467,
  "qName": "Лепромин применяется для постановки: ",
  "rA": [
    "Реакции Мицуды ",
    ],
  "wA": [
    "Пробы Манту",
    "Реакции Дика",
    "Реакции Шика",
    "Пробы Закса"]
},
{
  "qID": 468,
  "qName": "Кожно-аллергическая проба при бруцеллезе: ",
  "rA": [
    "Проба Бюрне",
    ],
  "wA": [
    "Проба Манту",
    "Проба Дика",
    "Проба Закса",
    "Проба Пизу"]
},
{
  "qID": 469,
  "qName": "Источники инфекции при сибирской язве:",
  "rA": [
    "Больные сельскохозяйственные животные",
    ],
  "wA": [
    "Грызуны",
    "Домашние птицы",
    "Больной человек",
    "Бактерионоситель"]
},
{
  "qID": 470,
  "qName": "Для выявления неполных антител при бруцеллезе используется реакция:",
  "rA": [
    "Кумбса ",
    ],
  "wA": [
    "Кунса",
    "РПГА",
    "Опсоно-фагоцитарная",
    "Проба Бюрне"]
},
{
  "qID": 471,
  "qName": "Сколько периодов различают в клинической картине сифилиса: ",
  "rA": [
    "четыре",
    ],
  "wA": [
    "один ",
    "два",
    "три",
    "пять"]
},
{
  "qID": 472,
  "qName": "Что характерно для первичного сифилиса: ",
  "rA": [
    "твердый шанкр",
    ],
  "wA": [
    "мягкий шанкр",
    "гумма",
    "сыпь",
    "поражение ЦНС"]
},
{
  "qID": 473,
  "qName": "Какая клиническая картина наблюдается при вторичном сифилисе: ",
  "rA": [
    "высыпания на коже",
    ],
  "wA": [
    "гуммы",
    "твердый шанкр",
    "спинная сухотка",
    "мягкий шакр"]
},
{
  "qID": 474,
  "qName": "В третьем периоде сифилиса появляются: ",
  "rA": [
    "гуммы",
    ],
  "wA": [
    "твердый шанкр",
    "высыпания на коже",
    "мягкий шанкр",
    "Поражается ЦНС"]
},
{
  "qID": 475,
  "qName": "Употребление каких продуктов является наиболее опасным при заражении бруцеллезом:",
  "rA": [
    "Молоко, брынза, масло, мясо",
    ],
  "wA": [
    "Вода",
    "Овощи ",
    "Птицы",
    "Рыбные продукты"]
},
{
  "qID": 476,
  "qName": "Возбудителя чумы открыл:",
  "rA": [
    "Иерсен",
    ],
  "wA": [
    "Готшлих",
    "Китазамо",
    "Леффлер",
    "Гикошима"]
},
{
  "qID": 477,
  "qName": "Какие антитела преобладают при первичном эпидемическом сыпном тифе: ",
  "rA": [
    "Іg М",
    ],
  "wA": [
    "Іg А ",
    "Іg Е",
    "Іg G ",
    "Іg D"]
},
{
  "qID": 478,
  "qName": "При болезни Брилля в крови преобладают: ",
  "rA": [
    "Іg G",
    ],
  "wA": [
    "Іg M",
    "Іg A",
    "Іg E",
    "Іg D"]
},
{
  "qID": 479,
  "qName": "Биологический метод диагностики эндемического сыпного тифа предусматривает заражение:",
  "rA": [
    "самцов морских свинок",
    ],
  "wA": [
    "кроликов ",
    "мышей",
    "крыс",
    "обезьян"]
},
{
  "qID": 480,
  "qName": "Возбудитель сифилиса относится к роду:",
  "rA": [
    "Treponema",
    ],
  "wA": [
    "Borrelіa ",
    "Bordetella",
    "Leptospіra",
    "Mycobacterіum"]
},
{
  "qID": 481,
  "qName": "Укажите семейство стафилококков: ",
  "rA": [
    "Mіcrococcaceae",
    ],
  "wA": [
    "Neіserіaceae ",
    "Streptococcaceae",
    "Bacіllaceae",
    "Brucellaceae"]
},
{
  "qID": 482,
  "qName": "Для стафилококков характерно:",
  "rA": [
    "Гроздевидное расположение",
    ],
  "wA": [
    "Ланцетовидная форма",
    "Грамотрицательная окраска",
    "Спорообразование",
    "Деление в одной плоскости"]
},
{
  "qID": 483,
  "qName": "Колонии стафилококков: ",
  "rA": [
    "Пигментированные, выпуклые с ровным краем",
    ],
  "wA": [
    "Плоские, прозрачные с неровным краем",
    "Мелкие в виде росинок",
    "В виде яичницы-глазуньи",
    "В виде капелек ртути"]
},
{
  "qID": 484,
  "qName": "Морфология кишечных палочек:",
  "rA": [
    "грамотрицательные средних размеров",
    ],
  "wA": [
    "грамположительные, крупные",
    "расположение цепочкой",
    "образование спор",
    "попарное расположение"]
},
{
  "qID": 485,
  "qName": "Стафилококки, вырабатывающие эксфоллиатин, вызывают:",
  "rA": [
    "Пузырчатку новорожденных",
    ],
  "wA": [
    "Скарлатину",
    "Пищевые отравлени",
    "Энтериты",
    "Сепсис"]
},
{
  "qID": 486,
  "qName": "Для диагностики стафилококкового сепсиса применяют:",
  "rA": [
    "Посев крови на сахарный бульон",
    ],
  "wA": [
    "Прямую микроскопию крови",
    "Посев крови на кровяной агар",
    "Посев крови на ЖСА",
    "Метод иммунофлюоресценции "]
},
{
  "qID": 487,
  "qName": "Для выявления источника инфекции при стафилококковых заболеваниях используют: ",
  "rA": [
    "Фаготипирование",
    ],
  "wA": [
    "РСК",
    "Реакцию преципитации",
    "Оценку токсичности",
    "Определение ферментативной активности"]
},
{
  "qID": 488,
  "qName": "На среде Плоскирева шигеллы образуют колонии:",
  "rA": [
    "бесцветные",
    ],
  "wA": [
    "темно-красные",
    "с гемолизом",
    "сине-черные",
    "зеленовато-бежевые"]
},
{
  "qID": 489,
  "qName": "Культуральные свойства возбудителя брюшного тифа:",
  "rA": [
    "на висмут-сульфит агаре- черные колонии",
    ],
  "wA": [
    "точечные колонии",
    "на среде Эндо- красные колонии",
    "на МПБ- пленка",
    "шероховатые колонии"]
},
{
  "qID": 490,
  "qName": "Морфологические особенности стрептококков:",
  "rA": [
    "Расположение в виде цепочек",
    ],
  "wA": [
    "Бобовидная форма ",
    "Гроздевидное расположение ",
    "В виде крыльев чайки",
    "Палочковидная форма "]
},
{
  "qID": 491,
  "qName": "Культуральные свойства стрептококков: ",
  "rA": [
    "Образуют мелкие зернистые колонии",
    ],
  "wA": [
    "Растут на простых средах",
    "На бульоне дают равномерное помутнение ",
    "Колони золотистого и белого цвета",
    "Температурный оптимум 42 градуса"]
},
{
  "qID": 492,
  "qName": "Возбудитель инфекционного заболевания, экзотоксин которого является самым сильным из всех биологических ядов: ",
  "rA": [
    "Clostrіdіum botulіnum",
    ],
  "wA": [
    "Yersіnіa pestіs",
    "Bacіllus cereus",
    "Vіbrіo cholerae",
    "Salmonella typhy"]
},
{
  "qID": 493,
  "qName": "Str. pyogenes не вызывает:",
  "rA": [
    "Энтерита",
    ],
  "wA": [
    "Ревматизма",
    "Гломерулонефрита",
    "Скарлатины",
    "Рожистого воспаления"]
},
{
  "qID": 494,
  "qName": "В патогенезе скарлатины играет роль:",
  "rA": [
    "Эритрогенный токсин",
    ],
  "wA": [
    "Энтеротоксин",
    "Лецитиназа",
    "Фибринолизин",
    "Плазмокоагулаза"]
},
{
  "qID": 495,
  "qName": "Защиту от фагоцитоза у стрептококков обеспечивает:",
  "rA": [
    "М-белок",
    ],
  "wA": [
    "Спора",
    "Белок А",
    "Капсид",
    "Хемотаксический фактор"]
},
{
  "qID": 496,
  "qName": "Возбудитель, вызывающий воздушно-капельную инфекцию, имеющий поверхностный антиген-гемагглютинин и специфический антиген-нейраминидазу",
  "rA": [
    "вирус гриппа",
    ],
  "wA": [
    "вирус полиомиелита",
    "вирус гепатита",
    "вирус бешенства",
    "вирус Коксаки"]
},
{
  "qID": 497,
  "qName": "Наличие антитоксического иммунитета против скарлатины у детей определяют реакцией:",
  "rA": [
    "Дика",
    ],
  "wA": [
    "Бюрне ",
    "Шика",
    "Манту",
    "Пирке"]
},
{
  "qID": 498,
  "qName": "Вирус полиомиелита характеризуется всем, кроме",
  "rA": [
    "крупный вирус",
    ],
  "wA": [
    "относится к пикорнавирусам",
    "содержат РНК",
    "обладает нейротропностью",
    "обладает ЦПД"]
},
{
  "qID": 499,
  "qName": "К путям передачи при СПИД относятся все, кроме: ",
  "rA": [
    "трансмиссивный",
    ],
  "wA": [
    "половой",
    "парентеральный",
    "заражение ребенка от матери",
    "загрязненный кровью инструментарий"]
},
{
  "qID": 500,
  "qName": "Назовите, для каких стрептококков характерно образование прозрачной зоны гемолиза на кровяном агаре: ",
  "rA": [
    "Str. pyogenes",
    ],
  "wA": [
    "Str. pneumonіae ",
    "Str. faecalіs",
    "Str. salіvarіus",
    "Str. mutans"]
}
]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Вот и тесты";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' ); // пример вывода: 404: Not Found
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html"});
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
