var tests = {
  "tests": [
      {
          "qID": 301,
          "qName": "Характерные морфологические признаки подострого гломерулонефрита …",
          "rA": [
              "пролиферация подоцитов и нефротелия наружного листка капсул клубочков",
              "облитерация капсул клубочков с формированием «полулуний»"
          ],
          "wA": [
              "пролиферация клеток клубочка",
              "фибриноидный некроз гломерулярных капилляров",
              "выраженное утолщение базальных мембран капилляров"
          ]
      },
      {
          "qID": 302,
          "qName": "Морфологические типы хронического гломерулонефрита …",
          "rA": [
              "мезангиокапиллярный",
              "мезангиопролиферативный",
              "фибропластический"
          ],
          "wA": [
              "иммунокомплексный",
              "экстракапиллярный"
          ]
      },
      {
          "qID": 303,
          "qName": "Пиелонефрит относится к группе …",
          "rA": [
              "интерстициальных болезней почки"
          ],
          "wA": [
              "воспалительных гломерулопатий",
              "невоспалительных гломерулопатий",
              "тубулопатий"
          ]
      },
      {
          "qID": 304,
          "qName": "Факторы, способствующие развитию пиелонефрита …",
          "rA": [
              "камни в мочевых путях",
              "гиперплазия предстательной железы",
              "беременность",
              "сахарный диабет"
          ],
          "wA": [
              "атеросклероз почечных артерий"
          ]
      },
      {
          "qID": 305,
          "qName": "Для острого пиелонефрита характерно",
          "rA": [
              "диффузная лейкоцитарная инфильтрация",
              "резкая гиперемия и отек стромы"
          ],
          "wA": [
              "атрофия паренхимы почки",
              "склероз стромы",
              "диффузная лимфомакрофагальная инфильтрация"
          ]
      },
      {
          "qID": 306,
          "qName": "Для хронического пиелонефрита характерно",
          "rA": [
              "атрофия паренхимы почки",
              "склероз стромы",
              "диффузная лимфомакрофагальная инфильтрация"
          ],
          "wA": [
              "диффузная лейкоцитарная инфильтрация",
              "резкая гиперемия и отек стромы"
          ]
      },
      {
          "qID": 307,
          "qName": "Осложнением пиелонефрита могут являться …",
          "rA": [
              "пионефроз",
              "паранефрит",
              "артериальная гипертензия"
          ],
          "wA": [
              "некротический нефроз",
              "гломерулонефрит"
          ]
      },
      {
          "qID": 308,
          "qName": "Стадиями острой почечной недостаточности являются:",
          "rA": [
              "шоковая",
              "олигоанурическая",
              "восстановления диуреза"
          ],
          "wA": [
              "уремическая",
              "латентная"
          ]
      },
      {
          "qID": 309,
          "qName": "Патологический процесс, характеризующийся разрастанием соединительной ткани с деформацией и уменьшением размеров почки называется:",
          "rA": [
              "нефросклероз"
          ],
          "wA": [
              "гипоплазия",
              "гипертрофия",
              "аплазия",
              "гидронефроз"
          ]
      },
      {
          "qID": 310,
          "qName": "Характерными морфологическими признаками уремии являются …",
          "rA": [
              "фибринозный перикардит",
              "катаральный гастрит"
          ],
          "wA": [
              "жировой гепатоз",
              "гнойный плеврит",
              "крупозная пневмония"
          ]
      },
      {
          "qID": 311,
          "qName": "Первично-сморщенная почка формируется при …",
          "rA": [
              "гипертонической болезни",
              "атеросклерозе почечных артерий"
          ],
          "wA": [
              "хроническом гломерулонефрите",
              "хроническом пиелонефрите",
              "амилоидозе почек"
          ]
      },
      {
          "qID": 312,
          "qName": "Вторично-сморщенная почка формируется при …",
          "rA": [
              "хроническом гломерулонефрите",
              "хроническом пиелонефрите",
              "амилоидозе почек"
          ],
          "wA": [
              "гипертонической болезни",
              "атеросклерозе почечных артерий"
          ]
      },
      {
          "qID": 313,
          "qName": "Для сахарного диабета I типа характерно …",
          "rA": [
              "связан с абсолютной недостаточностью инсулина",
              "наблюдается аутоиммунное повреждение островкового аппарата",
              "возникает обычно в детском и молодом возрасте"
          ],
          "wA": [
              "связан с относительной недостаточностью инсулина",
              "наблюдается нарушение усвоения инсулина клетками"
          ]
      },
      {
          "qID": 314,
          "qName": "Для сахарного диабета II типа характерно …",
          "rA": [
              "связан с относительной недостаточностью инсулина",
              "наблюдается нарушение усвоения инсулина клетками"
          ],
          "wA": [
              "связан с абсолютной недостаточностью инсулина",
              "наблюдается аутоиммунное повреждение островкового аппарата",
              "возникает обычно в детском и молодом возрасте"
          ]
      },
      {
          "qID": 315,
          "qName": "При сахарном диабете в поджелудочной железе наиболее часто определяются …",
          "rA": [
              "атрофия островкового аппарата",
              "аутоиммунный инсулит",
              "склероз"
          ],
          "wA": [
              "некроз",
              "гнойное воспаление"
          ]
      },
      {
          "qID": 316,
          "qName": "Диабетическую микроангиопатию характеризуют …",
          "rA": [
              "плазматическое пропитывание",
              "изменения артериол и капилляров",
              "гиалиноз"
          ],
          "wA": [
              "атеросклероз",
              "изменения в крупных артериях"
          ]
      },
      {
          "qID": 317,
          "qName": "При диабетической микроангиопатии наиболее часто страдают …",
          "rA": [
              "почки",
              "сетчатка глаз"
          ],
          "wA": [
              "печень",
              "головной мозг",
              "суставы"
          ]
      },
      {
          "qID": 318,
          "qName": "Диабетическую макроангиопатию характеризуют …",
          "rA": [
              "атеросклероз",
              "изменения в крупных артериях"
          ],
          "wA": [
              "плазматическое пропитывание",
              "изменения артериол и капилляров",
              "гиалиноз"
          ]
      },
      {
          "qID": 319,
          "qName": "Осложнения сахарного диабета …",
          "rA": [
              "хроническая почечная недостаточность",
              "гангрена стопы",
              "кетоацидоз",
              "инфаркт миокарда"
          ],
          "wA": [
              "амилоидоз"
          ]
      },
      {
          "qID": 320,
          "qName": "Макроскопически различают зоб …",
          "rA": [
              "узловатый",
              "диффузный",
              "смешанный"
          ],
          "wA": [
              "паренхиматозный",
              "коллоидный"
          ]
      },
      {
          "qID": 321,
          "qName": "Микроскопически различают зоб …",
          "rA": [
              "паренхиматозный",
              "коллоидный"
          ],
          "wA": [
              "узловатый",
              "диффузный",
              "смешанный"
          ]
      },
      {
          "qID": 322,
          "qName": "Для диффузного токсического зоба характерны …",
          "rA": [
              "увеличение размеров щитовидной железы",
              "уменьшение количества коллоида в фолликулах"
          ],
          "wA": [
              "уменьшение размеров щитовидной железы",
              "увеличение количества коллоида в фолликулах"
          ]
      },
      {
          "qID": 323,
          "qName": "Причиной развития эндемического зоба является …",
          "rA": [
              "дефицит йода"
          ],
          "wA": [
              "избыток йода",
              "избыток калия",
              "дефицит фтора",
              "избыток фтора"
          ]
      },
      {
          "qID": 324,
          "qName": "Фолликулы щитовидной железы при макро-микрофолликулярном (коллоидном) зобе …",
          "rA": [
              "имеют различные размеры и форму",
              "переполнены коллоидом"
          ],
          "wA": [
              "разрушены и склерозированы",
              "опустошены"
          ]
      },
      {
          "qID": 325,
          "qName": "Морфологическими формами хронического гастрита являются …",
          "rA": [
              "поверхностный",
              "атрофический"
          ],
          "wA": [
              "катаральный",
              "фибринозный",
              "гнойный"
          ]
      },
      {
          "qID": 326,
          "qName": "В зависимости от патогенеза выделяют типы хронического гастрита …",
          "rA": [
              "аутоиммунный",
              "неимунный (инфекционный)",
              "рефлюкс-гастрит"
          ],
          "wA": [
              "сосудистый"
          ]
      },
      {
          "qID": 327,
          "qName": "Для аутоиммунного гастрита характерными признаками являются …",
          "rA": [
              "поражается преимущественно фундальный отдел желудка",
              "выявляются антитела к париетальным клеткам желудочных желез"
          ],
          "wA": [
              "поражается преимущественно антральный отдел желудка",
              "не выявляются антитела к париетальным клеткам желудочным желез",
              "ассоциирован с хеликобактерной инфекцией"
          ]
      },
      {
          "qID": 328,
          "qName": "Для неиммунного (инфекционного) гастрита характерными признаками являются …",
          "rA": [
              "поражается преимущественно антральный отдел желудка",
              "не выявляются антитела к париетальным клеткам желудочным желез",
              "ассоциирован с хеликобактерной инфекцией"
          ],
          "wA": [
              "поражается преимущественно фундальный отдел желудка",
              "выявляются антитела к париетальным клеткам желудочных желез"
          ]
      },
      {
          "qID": 329,
          "qName": "Морфологические признаки хронического поверхностного гастрита …",
          "rA": [
              "дистрофические изменения ямочного эпителия",
              "лимфоплазмоцитарная инфильтрация слизистой оболочки"
          ],
          "wA": [
              "некрозы слизистой оболочки",
              "энтеролизация слизистой оболочки (кишечная метаплазия)",
              "уменьшение количества желез слизистой оболочки"
          ]
      },
      {
          "qID": 330,
          "qName": "Морфологические признаки хронического атрофического гастрита …",
          "rA": [
              "лимфоплазмоцитарная инфильтрация слизистой оболочки",
              "энтеролизация слизистой оболочки (кишечная метаплазия)",
              "уменьшение количества желез слизистой оболочки"
          ],
          "wA": [
              "эрозии и изъязвления слизистой оболочки",
              "некрозы слизистой оболочки"
          ]
      },
      {
          "qID": 331,
          "qName": "В этиологии язвенной болезни могут играть роль …",
          "rA": [
              "наследственные факторы",
              "алиментарные факторы",
              "неврогенные факторы",
              "гормональные факторы",
              "инфекционные факторы"
          ],
          "wA": []
      },
      {
          "qID": 332,
          "qName": "Местные факторы в патогенезе язвенной болезни желудка включают нарушение …",
          "rA": [
              "кислотно-пептического равновесия",
              "слизистого барьера"
          ],
          "wA": [
              "эндокринной регуляции",
              "нервной регуляции",
              "иммунных реакций"
          ]
      },
      {
          "qID": 333,
          "qName": "Общие факторы в патогенезе язвенной болезни желудка включают нарушение …",
          "rA": [
              "эндокринной регуляции",
              "нервной регуляции"
          ],
          "wA": [
              "кислотно-пептического равновесия",
              "слизистого барьера",
              "иммунных реакций"
          ]
      },
      {
          "qID": 334,
          "qName": "К стадиям морфогенеза язвенной болезни относят …",
          "rA": [
              "стадию эрозии",
              "стадию острой язвы",
              "стадию хронической язвы"
          ],
          "wA": [
              "стадию некроза",
              "стадию атрофии"
          ]
      },
      {
          "qID": 335,
          "qName": "Эрозия желудка – это …",
          "rA": [
              "дефект стенки, не проникающий за пределы слизистой оболочки"
          ],
          "wA": [
              "дефект стенки, проникающий за пределы слизистой оболочки, без явлений склероза",
              "дефект стенки, проникающий за пределы слизистой оболочки, с явлениями склероза",
              "сквозной дефект стенки желудка"
          ]
      },
      {
          "qID": 336,
          "qName": "Острая язва желудка – это …",
          "rA": [
              "дефект стенки, проникающий за пределы слизистой оболочки, без явлений склероза"
          ],
          "wA": [
              "дефект стенки, не проникающий за пределы слизистой оболочки",
              "дефект стенки, проникающий за пределы слизистой оболочки, с явлениями склероза",
              "сквозной дефект стенки желудка"
          ]
      },
      {
          "qID": 337,
          "qName": "Хроническая язва желудка – это …",
          "rA": [
              "дефект стенки, проникающий за пределы слизистой оболочки, с явлениями склероза"
          ],
          "wA": [
              "дефект стенки, не проникающий за пределы слизистой оболочки",
              "дефект стенки, проникающий за пределы слизистой оболочки, без явлений склероза",
              "сквозной дефект стенки желудка"
          ]
      },
      {
          "qID": 338,
          "qName": "Микроскопически в дне хронической язвы в стадии обострения определяются …",
          "rA": [
              "фибринозно-гнойный экссудат",
              "фибриноидный некроз",
              "грануляционная ткань",
              "фиброзная ткань"
          ],
          "wA": [
              "гиперпластические изменения эпителия"
          ]
      },
      {
          "qID": 339,
          "qName": "Микроскопически в дне хронической язвы в стадии ремиссии определяются …",
          "rA": [
              "грануляционная ткань",
              "фиброзная ткань"
          ],
          "wA": [
              "фибринозно-гнойный экссудат",
              "гиперпластические изменения эпителия",
              "фибриноидный некроз"
          ]
      },
      {
          "qID": 340,
          "qName": "Среди осложнений язвенной болезни желудка и двенадцатиперстной кишки выделяют …",
          "rA": [
              "малигнизацию",
              "воспалительные",
              "язвенно-рубцовые",
              "язвенно-деструктивные"
          ],
          "wA": [
              "инфекционные"
          ]
      },
      {
          "qID": 341,
          "qName": "К осложнениям язвенной болезни желудка относят …",
          "rA": [
              "кровотечение",
              "пенетрацию",
              "перфорацию",
              "рубцовую деформацию"
          ],
          "wA": [
              "атрофию"
          ]
      },
      {
          "qID": 342,
          "qName": "Проникновение язвенно-деструктивного процесса за пределы стенки желудка (двенадцатиперстной кишки) в соседние органы – это …",
          "rA": [
              "пенетрация"
          ],
          "wA": [
              "перфорация",
              "рубцовый стеноз",
              "полипоз",
              "малигнизация"
          ]
      },
      {
          "qID": 343,
          "qName": "Формирование сквозного дефекта стенки желудка (двенадцатиперстной кишки) в результате язвенно-деструктивного процесса – это …",
          "rA": [
              "перфорация"
          ],
          "wA": [
              "пенетрация",
              "рубцовый стеноз",
              "полипоз",
              "малигнизация"
          ]
      },
      {
          "qID": 344,
          "qName": "Для рака желудка предопухолевыми заболеваниями могут явиться …",
          "rA": [
              "хронический атрофический гастрит",
              "хроническая язва желудка",
              "аденоматозные полипы желудка"
          ],
          "wA": [
              "синдром Золлингера-Эллисона",
              "синдром Мэллори-Вейса"
          ]
      },
      {
          "qID": 345,
          "qName": "Гистологические типы рака желудка …",
          "rA": [
              "железистый (аденокарцинома)",
              "слизистый (перстневидноклеточный)",
              "фиброзный рак (скирр)"
          ],
          "wA": [
              "овсяноклеточный",
              "светлоклеточный"
          ]
      },
      {
          "qID": 346,
          "qName": "Морфологическими формами аппендицита являются …",
          "rA": [
              "острый поверхностный",
              "острый деструктивный",
              "хронический"
          ],
          "wA": [
              "гранулематозный",
              "некротический"
          ]
      },
      {
          "qID": 347,
          "qName": "К деструктивным формам острого аппендицита относятся …",
          "rA": [
              "флегмонозный",
              "гангренозный",
              "апостематозный"
          ],
          "wA": [
              "катаральный",
              "гранулематозный"
          ]
      },
      {
          "qID": 348,
          "qName": "Характерными признаками острого аппендицита являются …",
          "rA": [
              "инфильтрация стенки лейкоцитами",
              "наличие гнойного экссудата в просвете отростка",
              "гиперпластические процессы в лимфоидном аппарате отростка"
          ],
          "wA": [
              "склероз стенок сосудов",
              "склероз стенки отростка"
          ]
      },
      {
          "qID": 349,
          "qName": "Осложнениями аппендицита являются …",
          "rA": [
              "перфорация",
              "перитонит",
              "абсцессы печени"
          ],
          "wA": [
              "парапроктит",
              "панкреатит"
          ]
      },
      {
          "qID": 350,
          "qName": "В кишечнике рак наиболее часто поражает …",
          "rA": [
              "ободочную кишку",
              "прямую кишку"
          ],
          "wA": [
              "двенадцатиперстную кишку",
              "тощую кишку",
              "подвздошную кишку"
          ]
      },
      {
          "qID": 351,
          "qName": "Группу болезней, в основе которых лежат дистрофические и некротические изменения печеночной паренхимы, называют …",
          "rA": [
              "гепатозы"
          ],
          "wA": [
              "гепатиты",
              "циррозы печени",
              "желтухи",
              "поликистоз"
          ]
      },
      {
          "qID": 352,
          "qName": "Группу болезней, в основе которых лежат диффузные воспалительные изменения печени, называют …",
          "rA": [
              "гепатиты"
          ],
          "wA": [
              "гепатозы",
              "циррозы печени",
              "желтухи",
              "поликистоз"
          ]
      },
      {
          "qID": 353,
          "qName": "Группу болезней печени, в основе которых лежит необратимая структурная перестройка органа, называют …",
          "rA": [
              "циррозы печени"
          ],
          "wA": [
              "гепатозы",
              "гепатиты",
              "желтухи",
              "поликистоз"
          ]
      },
      {
          "qID": 354,
          "qName": "Массивный прогрессирующий некроз (токсическая дистрофия) печени может возникать при …",
          "rA": [
              "отравлении суррогатами алкоголя",
              "пищевых интоксикациях",
              "гестозах",
              "тиреотоксикозе"
          ],
          "wA": [
              "сердечной недостаточности"
          ]
      },
      {
          "qID": 355,
          "qName": "К стадиям массивного прогрессирующего некроза (токсической дистрофии) печени относятся …",
          "rA": [
              "стадия желтой дистрофии",
              "стадия красной дистрофии"
          ],
          "wA": [
              "стадия некроза",
              "стадия рубцевания",
              "стадия красного опеченения"
          ]
      },
      {
          "qID": 356,
          "qName": "Для стадии желтой дистрофии при массивном прогрессирующем некрозе печени характерно …",
          "rA": [
              "острая жировая дистрофия гепатоцитов",
              "жировой некроз гепатоцитов"
          ],
          "wA": [
              "обнажение и коллапс ретикулярной стромы",
              "резорбция жиробелкового детрита",
              "массивное разрастание соединительной ткани"
          ]
      },
      {
          "qID": 357,
          "qName": "Для стадии красной дистрофии при массивном прогрессирующем некрозе печени характерно …",
          "rA": [
              "обнажение и коллапс ретикулярной стромы",
              "резорбция жиробелкового детрита"
          ],
          "wA": [
              "острая жировая дистрофия гепатоцитов",
              "жировой некроз гепатоцитов",
              "массивное разрастание соединительной ткани"
          ]
      },
      {
          "qID": 358,
          "qName": "При жировом гепатозе печень …",
          "rA": [
              "увеличена",
              "дряблая",
              "желтая"
          ],
          "wA": [
              "уменьшена",
              "плотная"
          ]
      },
      {
          "qID": 359,
          "qName": "Микроскопические при жировом гепатозе обнаруживаются …",
          "rA": [
              "капли жира в цитоплазме гепатоцитов",
              "гибель отдельных гепатоцитов"
          ],
          "wA": [
              "массивные центролобулярные некрозы",
              "обязательное полнокровие центральных отделов долек",
              "лейкоцитарные инфильтраты в портальных трактах"
          ]
      },
      {
          "qID": 360,
          "qName": "Образное название печени при остром вирусном гепатите …",
          "rA": [
              "большая красная печень"
          ],
          "wA": [
              "гусиная печень",
              "мускатная печень",
              "большая желтая печень",
              "сморщенная печень"
          ]
      },
      {
          "qID": 361,
          "qName": "Характерные микроскопические признаки острого вирусного гепатита …",
          "rA": [
              "тельца Каунсильмена",
              "мостовидные некрозы гепатоцитов"
          ],
          "wA": [
              "ложные дольки",
              "перипортальный и междольковый фиброз",
              "жировая дистрофия гепатоцитов"
          ]
      },
      {
          "qID": 362,
          "qName": "Возможные исходы острого вирусного гепатита …",
          "rA": [
              "полное выздоровление",
              "носительство вируса",
              "переход в хроническую форму",
              "смерть от острой печеночной недостаточности"
          ],
          "wA": [
              "переход в цирроз печени"
          ]
      },
      {
          "qID": 363,
          "qName": "Формами хронического гепатита являются …",
          "rA": [
              "персистирующий",
              "активный"
          ],
          "wA": [
              "молниеносный",
              "безжелтушный",
              "бессимптомный"
          ]
      },
      {
          "qID": 364,
          "qName": "Основными гистологическими признаками хронического активного гепатита являются …",
          "rA": [
              "ступенчатые некрозы гепатоцитов",
              "мостовидные некрозы гепатоцитов",
              "повреждение пограничной пластинки дольки",
              "проникновение воспалительного инфильтрата внутрь печеночных долек"
          ],
          "wA": [
              "наличие воспалительного инфильтрата только в пределах портальных трактов"
          ]
      },
      {
          "qID": 365,
          "qName": "Основными гистологическим признаками персистирующего гепатита являются …",
          "rA": [
              "чёткая граница пограничной пластинки дольки",
              "наличие воспалительного инфильтрата только в пределах портальных трактов"
          ],
          "wA": [
              "некроз гепатоцитов",
              "выраженный меж- и внутридольковый фиброз",
              "проникновение воспалительного инфильтрата внутрь печеночных долек"
          ]
      },
      {
          "qID": 366,
          "qName": "К морфогенетическим типам цирроза печени относятся …",
          "rA": [
              "постнекротический",
              "портальный",
              "смешанный"
          ],
          "wA": [
              "крупноузловой",
              "мелкоузловой"
          ]
      },
      {
          "qID": 367,
          "qName": "К макроскопическим типам цирроза печени относятся …",
          "rA": [
              "крупноузловой",
              "мелкоузловой",
              "смешанный"
          ],
          "wA": [
              "постнекротический",
              "портальный"
          ]
      },
      {
          "qID": 368,
          "qName": "Макроскопически печень при циррозе …",
          "rA": [
              "плотная",
              "бугристая",
              "рыжего цвета"
          ],
          "wA": [
              "дряблая",
              "гладкая"
          ]
      },
      {
          "qID": 369,
          "qName": "Микроскопически цирроз печени характеризуется …",
          "rA": [
              "формированием соединительнотканных септ",
              "некрозом гепатоцитов",
              "появлением ложных долек",
              "нарушением гистоархитектоники печени"
          ],
          "wA": [
              "клеточным атипизмом гепатоцитов"
          ]
      },
      {
          "qID": 370,
          "qName": "Внепечёночные изменения при циррозе печени включают в себя …",
          "rA": [
              "геморрагический диатез",
              "асцит",
              "желтуху",
              "расширение порто-кавальных анастомозов"
          ],
          "wA": [
              "расширение печеночных вен"
          ]
      },
      {
          "qID": 371,
          "qName": "Осложнениями цирроза печени могут явиться …",
          "rA": [
              "печеночная кома",
              "пищеводное кровотечение",
              "асцит-перитонит",
              "развитие рака печени"
          ],
          "wA": [
              "гемолитическая анемия"
          ]
      },
      {
          "qID": 372,
          "qName": "К основным клинико-морфологическим формам туберкулеза относят …",
          "rA": [
              "первичный",
              "вторичный",
              "гематогенный"
          ],
          "wA": [
              "третичный",
              "лимфогенный"
          ]
      },
      {
          "qID": 373,
          "qName": "Первичный туберкулезный комплекс может локализоваться в …",
          "rA": [
              "легком",
              "кишечнике"
          ],
          "wA": [
              "головном мозге",
              "печени",
              "селезенке"
          ]
      },
      {
          "qID": 374,
          "qName": "Компонентами первичного туберкулезного комплекса являются …",
          "rA": [
              "лимфангит",
              "первичный аффект",
              "лимфаденит"
          ],
          "wA": [
              "каверна",
              "туберкулема"
          ]
      },
      {
          "qID": 375,
          "qName": "Варианты течения первичного туберкулеза …",
          "rA": [
              "затухание процесса и заживление первичных очагов",
              "прогрессирование процесса с генерализацией инфекции",
              "хроническое течение"
          ],
          "wA": [
              "переход в гематогенный туберкулез",
              "переход во вторичный туберкулез"
          ]
      },
      {
          "qID": 376,
          "qName": "Формы прогрессирования первичного туберкулеза …",
          "rA": [
              "лимфогенная генерализация",
              "гематогенная генерализация",
              "рост первичного аффекта",
              "смешанная форма"
          ],
          "wA": [
              "абсцедирование"
          ]
      },
      {
          "qID": 377,
          "qName": "Для гематогенного туберкулеза характерны …",
          "rA": [
              "преобладание продуктивных (гранулематозных) изменений",
              "склонность только к гематогенной генерализации"
          ],
          "wA": [
              "развивается в период инфицирования (при первой встрече с инфектом)",
              "преобладание экссудативно-некротических изменений",
              "склонность к гематогенной и лимфогенной генерализации"
          ]
      },
      {
          "qID": 378,
          "qName": "Разновидностями гематогенного туберкулёза являются …",
          "rA": [
              "генерализованный туберкулез",
              "туберкулез с преимущественно внелегочными поражениями"
          ],
          "wA": [
              "казеозная пневмония",
              "острый кавернозный туберкулёз",
              "инфильтративный туберкулёз"
          ]
      },
      {
          "qID": 379,
          "qName": "Милиарный туберкулез – это проявление …",
          "rA": [
              "генерализации первичного туберкулеза",
              "гематогенного туберкулеза"
          ],
          "wA": [
              "первичного туберкулезного комплекса",
              "хронически текущего первичного туберкулеза",
              "вторичного туберкулеза"
          ]
      },
      {
          "qID": 380,
          "qName": "Для вторичного туберкулеза характерны …",
          "rA": [
              "избирательно легочная локализация процесса",
              "контактный и интраканаликулярный путь распространения",
              "возникает в организме человека, перенесшего ранее первичный туберкулез"
          ],
          "wA": [
              "генерализованный характер поражения",
              "гематогенный путь распространения"
          ]
      },
      {
          "qID": 381,
          "qName": "Формами-фазами вторичного туберкулёза являются …",
          "rA": [
              "инфильтративный",
              "цирротический",
              "кавернозный"
          ],
          "wA": [
              "некротический",
              "туберкулезный сепсис"
          ]
      },
      {
          "qID": 382,
          "qName": "Для инфильтративного туберкулеза характерны …",
          "rA": [
              "преобладает экссудативно-некротическая тканевая реакция",
              "перифокальные изменения преобладают над казеозными",
              "при прогрессировании переходит в острую кавернозную форму"
          ],
          "wA": [
              "преобладает продуктивная тканевая реакция",
              "сопровождается казеозным лимфаденитом"
          ]
      },
      {
          "qID": 383,
          "qName": "Для острого кавернозного туберкулеза характерны …",
          "rA": [
              "быстрый распад легочной ткани с образованием полости",
              "частая локализация изменений в I-II сегментах легких",
              "бронхогенное обсеменение легких"
          ],
          "wA": [
              "массивный фиброзный процесс по периферии очагов",
              "лимфогенная генерализация процесса"
          ]
      },
      {
          "qID": 384,
          "qName": "К характерным осложнениям первичного туберкулеза относятся …",
          "rA": [
              "туберкулезный менингит",
              "плеврит"
          ],
          "wA": [
              "легочное кровотечение",
              "секвестрация, деформация костей и суставов",
              "крупозная пневмония"
          ]
      },
      {
          "qID": 385,
          "qName": "К характерным осложнениям гематогенного туберкулеза относятся …",
          "rA": [
              "туберкулезный менингит",
              "туберкулезный сепсис",
              "секвестрация, деформация костей и суставов"
          ],
          "wA": [
              "легочное кровотечение",
              "крупозная пневмония"
          ]
      },
      {
          "qID": 386,
          "qName": "К характерным осложнениям вторичного туберкулеза относятся …",
          "rA": [
              "легочное кровотечение",
              "эмпиема плевры",
              "пневмоторакс"
          ],
          "wA": [
              "туберкулезный менингит",
              "секвестрация, деформация костей и суставов"
          ]
      },
      {
          "qID": 387,
          "qName": "Для первичного сифилиса характерны …",
          "rA": [
              "формирование твердого шанкра во входных воротах инфекции",
              "регионарный лимфаденит"
          ],
          "wA": [
              "появление высыпаний (сифилидов) на коже и слизистых оболочках",
              "хроническое диффузное интерстициальное воспаление внутренних органов",
              "образование гумм"
          ]
      },
      {
          "qID": 388,
          "qName": "Морфологические характеристики твердого шанкра …",
          "rA": [
              "язва с плотными краями и лакированным дном",
              "лимфоплазмоцитарная инфильтрация",
              "пролиферация эндотелия мелких сосудов вплоть до облитерации их просвета"
          ],
          "wA": [
              "разрыхление ткани с массивными грануляциями на поверхности",
              "массивная нейтрофильная инфильтрация"
          ]
      },
      {
          "qID": 389,
          "qName": "Для вторичного сифилиса характерны …",
          "rA": [
              "появление высыпаний (сифилидов) на коже и слизистых оболочках"
          ],
          "wA": [
              "формирование твердого шанкра во входных воротах инфекции",
              "регионарный лимфаденит",
              "хроническое диффузное интерстициальное воспаление внутренних органов",
              "образование гумм"
          ]
      },
      {
          "qID": 390,
          "qName": "Для третичного сифилиса характерны …",
          "rA": [
              "хроническое диффузное интерстициальное воспаление внутренних органов",
              "образование гумм"
          ],
          "wA": [
              "формирование твердого шанкра во входных воротах инфекции",
              "регионарный лимфаденит",
              "появление высыпаний (сифилидов) на коже и слизистых оболочках"
          ]
      },
      {
          "qID": 391,
          "qName": "Характерные проявления висцерального сифилиса – …",
          "rA": [
              "сифилитический цирроз внутренних органов",
              "сифилитический мезаортит",
              "прогрессивный паралич",
              "спинная сухотка"
          ],
          "wA": [
              "твердый шанкр"
          ]
      },
      {
          "qID": 392,
          "qName": "Характерные признаки раннего врожденного сифилиса …",
          "rA": [
              "специфическая интерстициальная пневмония («белая пневмония»)",
              "специфический интерстициальный гепатит («кремниевая печень»)",
              "папулезные и пустулезные высыпания на коже"
          ],
          "wA": [
              "триада Гетчинсона (отверткообразные зубы, паренхиматозный кератит, глухота)",
              "абсцессы Дюбуа в тимусе"
          ]
      },
      {
          "qID": 393,
          "qName": "Характерные признаки позднего врожденного сифилиса …",
          "rA": [
              "триада Гетчинсона (отверткообразные зубы, паренхиматозный кератит, глухота)",
              "абсцессы Дюбуа в тимусе"
          ],
          "wA": [
              "специфическая интерстициальная пневмония («белая пневмония»)",
              "специфический интерстициальный гепатит («кремниевая печень»)",
              "папулезные и пустулезные высыпания на коже"
          ]
      },
      {
          "qID": 394,
          "qName": "Острые респираторные вирусные инфекции вызываются …",
          "rA": [
              "вирусом гриппа",
              "вирусом парагриппа",
              "респираторно-синцитиальным вирусом",
              "аденовирусом"
          ],
          "wA": [
              "вирусом Коксаки"
          ]
      },
      {
          "qID": 395,
          "qName": "Местные изменения при гриппе легкой степени тяжести характеризуются поражением …",
          "rA": [
              "носоглотки",
              "трахеи"
          ],
          "wA": [
              "терминальных бронхиол",
              "альвеол",
              "желудка"
          ]
      },
      {
          "qID": 396,
          "qName": "Воспаление в дыхательных путях при легкой форме гриппа носит … характер",
          "rA": [
              "серозный"
          ],
          "wA": [
              "гнойный",
              "гранулематозный",
              "геморрагический"
          ]
      },
      {
          "qID": 397,
          "qName": "Пневмония развивается при … формах гриппа",
          "rA": [
              "средней тяжести",
              "тяжелой"
          ],
          "wA": [
              "легкой",
              "латентной",
              "токсической"
          ]
      },
      {
          "qID": 398,
          "qName": "Характерными признаками пневмонии при гриппе средней тяжести являются:",
          "rA": [
              "интерстициальный характер",
              "лимфомакрофагальная инфильтрация"
          ],
          "wA": [
              "вирусно-бактериальная этиология",
              "гнойное воспаление",
              "гранулематозное воспаление"
          ]
      },
      {
          "qID": 399,
          "qName": "Вариантами тяжелой формы гриппа являются …",
          "rA": [
              "токсическая",
              "с легочными осложнениями"
          ],
          "wA": [
              "кардиоваскулярная",
              "почечная",
              "церебральная"
          ]
      },
      {
          "qID": 400,
          "qName": "Токсический вариант тяжелой формы гриппа характеризуется …",
          "rA": [
              "кровоизлияниями",
              "геморрагическим отеком легких"
          ],
          "wA": [
              "гнойным воспалением",
              "некротическим нефрозом",
              "катаральным воспалением"
          ]
      }
  ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' ); // пример вывода: 404: Not Found
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html"});
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
