var tests = {
  "tests": [
      {
          "qID": 401,
          "qName": "Характерными признаками пневмонии при тяжелой форме гриппа с легочными осложнениями являются …",
          "rA": [
              "вирусно-бактериальная этиология",
              "бронхопневмония",
              "гнойно-геморрагическое воспаление"
          ],
          "wA": [
              "интерстициальный характер",
              "гранулематозное воспаление"
          ]
      },
      {
          "qID": 402,
          "qName": "Образное название легкого при тяжелой форме гриппа с легочными осложнениями –  … легкое",
          "rA": [
              "«большое пестрое»"
          ],
          "wA": [
              "«большое красное»",
              "«большое сальное»",
              "«большое белое»"
          ]
      },
      {
          "qID": 403,
          "qName": "Ложный круп при парагриппе у детей связан с …",
          "rA": [
              "отеком гортани"
          ],
          "wA": [
              "бронхоспазмом",
              "обтурацией дыхательных путей фибринозными пленками",
              "обтурации дыхательных путей слизью"
          ]
      },
      {
          "qID": 404,
          "qName": "Коревую сыпь (экзантему) морфологически характеризует …",
          "rA": [
              "гиперемия",
              "лимфогистиоцитарная инфильтрация"
          ],
          "wA": [
              "гиалиноз дермы",
              "атрофия эпидермиса",
              "гигантские многоядерные клетки Пирогова-Лангханса"
          ]
      },
      {
          "qID": 405,
          "qName": "Пятна Филатова-Коплика обнаруживаются на …",
          "rA": [
              "внутренней поверхности щёк"
          ],
          "wA": [
              "ладонях и стопах",
              "разгибательных поверхностях предплечий",
              "языке",
              "голове"
          ]
      },
      {
          "qID": 406,
          "qName": "Периодами ГЛПС являются …",
          "rA": [
              "олигоанурический",
              "полиурический"
          ],
          "wA": [
              "протеинурический",
              "гематурический",
              "нефротический"
          ]
      },
      {
          "qID": 407,
          "qName": "Поражение почек при ГЛПС чаще наблюдается с … дня болезни",
          "rA": [
              "5-7"
          ],
          "wA": [
              "1-2",
              "10-12",
              "14-15"
          ]
      },
      {
          "qID": 408,
          "qName": "Макроскопические изменения почек при ГЛПС …",
          "rA": [
              "резкое увеличение размеров и массы",
              "пирамиды багрово-синюшные",
              "кора бледно-серая"
          ],
          "wA": [
              "сморщивание и уменьшение массы",
              "пирамиды бледно-серые"
          ]
      },
      {
          "qID": 409,
          "qName": "Микроскопические изменения почек при ГЛПС …",
          "rA": [
              "кровоизлияние и отек в строме пирамид",
              "дистрофия, некробиоз и десквамация эпителия канальцев",
              "острый гидронефроз в коре"
          ],
          "wA": [
              "диффузный гломерулосклероз",
              "лейкоцитарная инфильтрация стромы с формированием микроабсцессов"
          ]
      },
      {
          "qID": 410,
          "qName": "Характерные изменения гипофиза у умерших при ГЛПС …",
          "rA": [
              "некроз",
              "кровоизлияние"
          ],
          "wA": [
              "гиперплазия передней доли",
              "гиперплазия задней доли",
              "атрофия"
          ]
      },
      {
          "qID": 411,
          "qName": "Синдром Шихана при ГЛПС - это острая…недостаточность",
          "rA": [
              "гипофизарная"
          ],
          "wA": [
              "надпочечниковая",
              "почечная",
              "печеночная",
              "сердечная"
          ]
      },
      {
          "qID": 412,
          "qName": "Типовыми осложнениями ГЛПС являются …",
          "rA": [
              "инфекционно-токсический шок",
              "острая почечная недостаточность",
              "синдром ДВС"
          ],
          "wA": [
              "острая дыхательная недостаточность",
              "тромбоэмболический синдром"
          ]
      },
      {
          "qID": 413,
          "qName": "Основные особенности сепсиса …",
          "rA": [
              "полиэтиологичен",
              "не заразен",
              "не формируется иммунный ответ"
          ],
          "wA": [
              "имеет строго циклическое течение",
              "обязательно сопровождается бактериемией"
          ]
      },
      {
          "qID": 414,
          "qName": "Клинико-морфологическими формами сепсиса являются …",
          "rA": [
              "инфекционный эндокардит",
              "септицемия",
              "септикопиемия"
          ],
          "wA": [
              "инфекционный миокардит",
              "бактериемия"
          ]
      },
      {
          "qID": 415,
          "qName": "Общие изменения при сепсисе представлены …",
          "rA": [
              "дистрофией и межуточным воспалением паренхиматозных органов",
              "васкулитами",
              "гиперплазией лимфоидной и кроветворной тканей"
          ],
          "wA": [
              "инфекционным эндокардитом",
              "тромбофлебитом в области септического очага"
          ]
      },
      {
          "qID": 416,
          "qName": "Характерными признаками септицемии являются …",
          "rA": [
              "выраженная гиперергическая реакция",
              "острое или молниеносное течение",
              "общие изменения преобладают над местными"
          ],
          "wA": [
              "множественные метастатические абсцессы внутренних органов",
              "тромбобактериальная эмболия"
          ]
      },
      {
          "qID": 417,
          "qName": "Характерными признаками септикопиемии являются …",
          "rA": [
              "множественные метастатические абсцессы внутренних органов",
              "тромбобактериальная эмболия"
          ],
          "wA": [
              "выраженная гиперергическая реакция",
              "острое или молниеносное течение",
              "общие изменения преобладают над местными"
          ]
      },
      {
          "qID": 418,
          "qName": "Морфологическая картина септического эндокардита характеризуется … эндокардитом",
          "rA": [
              "полипозно-язвенным"
          ],
          "wA": [
              "возвратно-бородавчатым",
              "фибропластическим",
              "флегмонозно-язвенным"
          ]
      },
      {
          "qID": 419,
          "qName": "Септическую селезенку характеризуют …",
          "rA": [
              "увеличение размеров",
              "гиперплазия лимфоидного аппарата"
          ],
          "wA": [
              "уменьшение размеров",
              "атрофия лимфоидного аппарата",
              "множественные абсцессы"
          ]
      },
      {
          "qID": 420,
          "qName": "Во входных воротах при дифтерии воспаление имеет … характер",
          "rA": [
              "фибринозный"
          ],
          "wA": [
              "продуктивный",
              "гнойный",
              "геморрагический",
              "гнилостный"
          ]
      },
      {
          "qID": 421,
          "qName": "Для дифтерии зева характерны …",
          "rA": [
              "дифтеритическое воспаление",
              "образование массивных фибринозных пленок, прочно связанных с подлежащей тканью"
          ],
          "wA": [
              "крупозное воспаление",
              "образование рыхлых фибринозных пленок, легко отходящих от подлежащей ткани",
              "развитие истинного крупа"
          ]
      },
      {
          "qID": 422,
          "qName": "Для дифтерии дыхательных путей характерны …",
          "rA": [
              "крупозное воспаление",
              "образование рыхлых фибринозных пленок, легко отходящих от подлежащей ткани",
              "развитие истинного крупа"
          ],
          "wA": [
              "дифтеритическое воспаление",
              "образование массивных фибринозных пленок, прочно связанных с подлежащей тканью"
          ]
      },
      {
          "qID": 423,
          "qName": "Типичным местом локализации местных изменений при скарлатине является …",
          "rA": [
              "слизистая оболочка зева"
          ],
          "wA": [
              "бронхиолы",
              "кожа",
              "кишечник"
          ]
      },
      {
          "qID": 424,
          "qName": "Характерные местные проявления скарлатины …",
          "rA": [
              "резкая гиперемия зева и миндалин («пылающий зев»)",
              "катаральная и некротическая ангина",
              "регионарный лимфаденит"
          ],
          "wA": [
              "крупозный ларингит",
              "гнойно-геморрагическая пневмония"
          ]
      },
      {
          "qID": 425,
          "qName": "Характерные признаки сыпи при скарлатине …",
          "rA": [
              "мелкоточечная сыпь ярко-красного цвета",
              "покрывает всю поверхность тела, кроме носогубного треугольника",
              "в исходе – пластинчатое шелушение"
          ],
          "wA": [
              "крупнопятнистая папулезная сыпь",
              "покрывает лицо, шею, туловище и разгибательные поверхности конечностей"
          ]
      },
      {
          "qID": 426,
          "qName": "Второй период скарлатины может проявляться развитием …",
          "rA": [
              "гломерулонефрита",
              "ревматизма",
              "васкулита"
          ],
          "wA": [
              "крупозной пневмонии",
              "менингита"
          ]
      },
      {
          "qID": 427,
          "qName": "Формами менингококковой инфекции являются …",
          "rA": [
              "назофарингит",
              "менингит",
              "менингококцемия"
          ],
          "wA": [
              "аллергическая",
              "токсическая"
          ]
      },
      {
          "qID": 428,
          "qName": "Изменения при менингококковом менингите …",
          "rA": [
              "мозговые оболочки мутные, утолщены, покрыты гнойным налетом",
              "ткань мозга полнокровна, отечна"
          ],
          "wA": [
              "мозговые оболочки пропитаны кровью",
              "ткань мозга обильно инфильтрирована лейкоцитами",
              "в ткани мозга формируются множественные кисты"
          ]
      },
      {
          "qID": 429,
          "qName": "Характерные признаки сыпи при менингококковой инфекции …",
          "rA": [
              "возникает только при менингококцемии",
              "имеет геморрагический звездчатый характер",
              "располагается преимущественно на ягодицах, нижних конечностях, веках"
          ],
          "wA": [
              "возникает при любых формах менингококковой инфекции",
              "имеет крупнопятнистый папулезный вид"
          ]
      },
      {
          "qID": 430,
          "qName": "Синдром Уотерхауса-Фридериксена связан с …",
          "rA": [
              "массивными некрозами и кровоизлияниями в надпочечники"
          ],
          "wA": [
              "массивными некрозами и кровоизлияниями в гипофиз",
              "массивными некрозами и кровоизлияниями в головной мозг",
              "массивным гнойным менингитом",
              "острой почечной недостаточностью"
          ]
      },
      {
          "qID": 431,
          "qName": "При брюшном тифе чаще поражается …",
          "rA": [
              "подвздошная кишка"
          ],
          "wA": [
              "сигмовидная кишка",
              "двенадцатиперстная кишка",
              "слепая кишка",
              "прямая кишка"
          ]
      },
      {
          "qID": 432,
          "qName": "Для брюшного тифа характерны следующие изменения пейеровых бляшек …",
          "rA": [
              "мозговидное набухание",
              "некроз",
              "изъязвление",
              "в исходе процесса – склероз"
          ],
          "wA": [
              "атрофия"
          ]
      },
      {
          "qID": 433,
          "qName": "К осложнениям брюшного тифа относятся:",
          "rA": [
              "брюшнотифозный сепсис",
              "перитонит",
              "кишечное кровотечение"
          ],
          "wA": [
              "пилефлебитические абсцессы печени",
              "крупозная пневмония"
          ]
      },
      {
          "qID": 434,
          "qName": "При дизентерии (шигеллезе) чаще поражается …",
          "rA": [
              "сигмовидная кишка",
              "прямая кишка"
          ],
          "wA": [
              "пейеровы бляшки подвздошной кишки",
              "червеобразный отросток толстой кишки",
              "двенадцатиперстная кишка"
          ]
      },
      {
          "qID": 435,
          "qName": "При дизентерии (шигеллезе) выделяют стадии …",
          "rA": [
              "катарального колита",
              "фибринозного колита",
              "язвенного колита"
          ],
          "wA": [
              "мозговоидного набухания пейеровых бляшек",
              "некроза"
          ]
      },
      {
          "qID": 436,
          "qName": "При дизентерии (шигеллезе) в первой стадии имеет место … воспаление",
          "rA": [
              "катаральное"
          ],
          "wA": [
              "фибринозное",
              "геморрагическое",
              "гнойное",
              "продуктивное"
          ]
      },
      {
          "qID": 437,
          "qName": "Для второй стадии дизентерийного колита характерны … кишки.",
          "rA": [
              "фибринозное воспаление слизистой оболочки",
              "распространённые очаги некроза слизистой оболочки",
              "дистрофические и некротические изменения в нервно-мышечном аппарате"
          ],
          "wA": [
              "мозговидное набухание пейеровых бляшек",
              "образование глубоких язв в стенке кишки"
          ]
      },
      {
          "qID": 438,
          "qName": "Третья стадия дизентерийного колита характеризуется …",
          "rA": [
              "формированием язв"
          ],
          "wA": [
              "катаральным воспалением слизистой оболочки",
              "крупозным воспалением слизистой оболочки",
              "дифтеритическим воспалением слизистой оболочки",
              "рубцовыми изменениями в стенке кишки"
          ]
      },
      {
          "qID": 439,
          "qName": "Клинико-морфологическими формами сальмонеллеза являются:",
          "rA": [
              "брюшнотифозная",
              "интестинальная",
              "септическая"
          ],
          "wA": [
              "гепаторенальная",
              "лимфоидная"
          ]
      },
      {
          "qID": 440,
          "qName": "Стадиями холеры являются …",
          "rA": [
              "гастроэнтерит",
              "алгид",
              "серозный энтерит"
          ],
          "wA": [
              "проктит",
              "сигмоидит"
          ]
      },
      {
          "qID": 441,
          "qName": "В основе кариеса зубов лежит процесс …",
          "rA": [
              "дис- и деминерализации"
          ],
          "wA": [
              "воспаления",
              "венозного полнокровия",
              "образования репаративной гранулемы",
              "стаза"
          ]
      },
      {
          "qID": 442,
          "qName": "Кариесом чаще всего поражаются …",
          "rA": [
              "моляры"
          ],
          "wA": [
              "резцы",
              "клыки",
              "премоляры"
          ]
      },
      {
          "qID": 443,
          "qName": "В развитии кариеса активно участвуют …",
          "rA": [
              "лактобациллы",
              "оральные стрептококки"
          ],
          "wA": [
              "синегнойные палочки",
              "микобактерии туберкулеза",
              "золотистые стафилококки"
          ]
      },
      {
          "qID": 444,
          "qName": "К местным кариесогенным факторам относят …",
          "rA": [
              "зубной налет",
              "микроорганизмы полости рта"
          ],
          "wA": [
              "дефицит фтора в организме",
              "кариесогенную диету"
          ]
      },
      {
          "qID": 445,
          "qName": "К общим кариесогенным факторам относят …",
          "rA": [
              "дефицит фтора в организме",
              "кариесогенную диету"
          ],
          "wA": [
              "зубной налет",
              "микроорганизмы полости рта"
          ]
      },
      {
          "qID": 446,
          "qName": "К зубным отложениям относят:",
          "rA": [
              "зубной налет",
              "зубную бляшку",
              "зубной камень"
          ],
          "wA": [
              "зубной нарост"
          ]
      },
      {
          "qID": 447,
          "qName": "Кариес дентина протекает быстрее, чем кариес, эмали вследствие …",
          "rA": [
              "быстрого распространения микроорганизмов по дентинным канальцам"
          ],
          "wA": [
              "худшего кровоснабжения дентина",
              "менее активной репарации дентина",
              "более высокой концентрации в дентине неорганических солей"
          ]
      },
      {
          "qID": 448,
          "qName": "Стадиями кариеса являются …",
          "rA": [
              "начальная",
              "поверхностная",
              "глубокая"
          ],
          "wA": [
              "доклиническая",
              "терминальная"
          ]
      },
      {
          "qID": 449,
          "qName": "Макроскопически начальный кариес может быть представлен …",
          "rA": [
              "белым пятном",
              "пигментированным пятном"
          ],
          "wA": [
              "эрозией эмали",
              "образованием полостного дефекта в пределах эмали"
          ]
      },
      {
          "qID": 450,
          "qName": "Морфологические изменения при начальном кариесе представлены …",
          "rA": [
              "дис- и деминерализацией эмали",
              "нечеткостью границ эмалевых призм",
              "расширением межпризменных пространств"
          ],
          "wA": [
              "дистрофией и некрозом отростков одонтобластов",
              "формированием полостного дефекта с проникновением в дентин"
          ]
      },
      {
          "qID": 451,
          "qName": "Поверхностный кариес характеризуется ….",
          "rA": [
              "формированием полостного дефекта в пределах эмали"
          ],
          "wA": [
              "отсутствием макроскопических проявлений",
              "появлением белого пятна",
              "формированием полостного дефекта с распространением в дентин"
          ]
      },
      {
          "qID": 452,
          "qName": "Изменения дентина при поверхностном кариесе представлены …",
          "rA": [
              "появлением «мертвых путей»"
          ],
          "wA": [
              "деструкцией органической матрицы",
              "формированием полостного дефекта",
              "вскрытием зубной полости"
          ]
      },
      {
          "qID": 453,
          "qName": "Средний кариес характеризуется …",
          "rA": [
              "формированием полостного дефекта с распространением в дентин"
          ],
          "wA": [
              "отсутствием макроскопических проявлений",
              "появлением белого пятна",
              "формированием полостного дефекта в пределах эмали"
          ]
      },
      {
          "qID": 454,
          "qName": "В дне кариозной полости при среднем кариесе выделяют зоны …",
          "rA": [
              "размягченого дентина",
              "репаративного (заместительного) дентина",
              "прозрачного дентина"
          ],
          "wA": [
              "дистрофированного дентина",
              "нагноившегося дентина"
          ]
      },
      {
          "qID": 455,
          "qName": "Размягченный дентин характеризуется …",
          "rA": [
              "практически полным отсутствием минеральных веществ",
              "разрушением отростков одонтобластов"
          ],
          "wA": [
              "склерозом дентина",
              "формированием дентиклей",
              "наличием большого количества одонтобластов"
          ]
      },
      {
          "qID": 456,
          "qName": "Прозрачный (склерозированный) дентин характеризуется …",
          "rA": [
              "высокой степенью минерализации",
              "перитубулярным склерозом дентина",
              "интратубулярным склерозом дентина"
          ],
          "wA": [
              "разрушением отростков одонтобластов",
              "наличием большого количества одонтобластов"
          ]
      },
      {
          "qID": 457,
          "qName": "Репаративный (заместительный) дентин характеризуется …",
          "rA": [
              "слабой степенью минерализации",
              "наличием большого количества одонтобластов",
              "отсутствием дентинных трубочек"
          ],
          "wA": [
              "высокой степенью минерализации"
          ]
      },
      {
          "qID": 458,
          "qName": "Осложнениями кариеса являются …",
          "rA": [
              "пульпит",
              "периапикальный периодонтит"
          ],
          "wA": [
              "гингивит",
              "эпулис"
          ]
      },
      {
          "qID": 459,
          "qName": "К клинико-морфологическим формам острого пульпита относятся …",
          "rA": [
              "серозный",
              "гнойный"
          ],
          "wA": [
              "инфекционный",
              "фиброзный",
              "диффузный"
          ]
      },
      {
          "qID": 460,
          "qName": "К клинико-морфологическим формам хронического пульпита относятся …",
          "rA": [
              "гранулирующий",
              "фиброзный"
          ],
          "wA": [
              "гранулематозный",
              "диффузный гнойный"
          ]
      },
      {
          "qID": 461,
          "qName": "Воспалительная гиперемия и отек пульпы в проекции кариозной полости характерны для … пульпита",
          "rA": [
              "острого очагового серозного"
          ],
          "wA": [
              "острого очагового гнойного",
              "острого диффузного гнойного",
              "острого гангренозного"
          ]
      },
      {
          "qID": 462,
          "qName": "Массивная инфильтрация пульпы лейкоцитами в проекции кариозной полости характерна для … пульпита",
          "rA": [
              "острого очагового гнойного"
          ],
          "wA": [
              "острого очагового серозного",
              "острого диффузного гнойного",
              "острого гангренозного"
          ]
      },
      {
          "qID": 463,
          "qName": "Распространение лейкоцитарного инфильтрата по всей пульпе характерно для … пульпита",
          "rA": [
              "острого диффузного гнойного"
          ],
          "wA": [
              "острого очагового серозного",
              "острого очагового гнойного",
              "острого гангренозного"
          ]
      },
      {
          "qID": 464,
          "qName": "Некроз и гнилостное расплавление пульпы характерно для … пульпита",
          "rA": [
              "острого гангренозного"
          ],
          "wA": [
              "острого очагового серозного",
              "острого очагового гнойного",
              "острого диффузного гнойного"
          ]
      },
      {
          "qID": 465,
          "qName": "К морфологическим проявлениям острого периапикального периодонтита относятся …",
          "rA": [
              "точечные кровоизлияния в периапикальном периодонте",
              "выраженный отек периапикального периодонта",
              "лейкоцитарная инфильтрация периапикального периодонта"
          ],
          "wA": [
              "формирование гранулем в периапикальной области",
              "формирование кист в периапикальной области"
          ]
      },
      {
          "qID": 466,
          "qName": "К клинико-морфологическим формам острого периапикального периодонтита относятся …",
          "rA": [
              "серозный периодонтит",
              "гнойный периодонтит"
          ],
          "wA": [
              "гранулематозный периодонтит",
              "фиброзный периодонтит",
              "гранулирующий периодонтит"
          ]
      },
      {
          "qID": 467,
          "qName": "К морфологическим проявлениям острого гнойного периодонтита относятся …",
          "rA": [
              "воспалительная гиперемия верхушечного периодонта",
              "отек верхушечного периодонта",
              "массивная лейкоцитарная инфильтрация верхушечного периодонта"
          ],
          "wA": [
              "деструкция тканей костной лунки челюсти"
          ]
      },
      {
          "qID": 468,
          "qName": "К клинико-морфологическим формам хронического периапикального периодонтита относятся …",
          "rA": [
              "гранулематозный периодонтит",
              "фиброзный периодонтит",
              "гранулирующий периодонтит"
          ],
          "wA": [
              "серозный периодонтит",
              "гнойный периодонтит"
          ]
      },
      {
          "qID": 469,
          "qName": "Для хронического гранулирующего периодонтита характерно …",
          "rA": [
              "разрастание грануляционной ткани в области верхушки зуба"
          ],
          "wA": [
              "гнойная деструкция костной ткани зубной лунки",
              "гнойное расплавление тканей верхушечного периодонта",
              "формирование гранулем в области верхушки зуба"
          ]
      },
      {
          "qID": 470,
          "qName": "Для хронического гранулематозного периодонтита характерно …",
          "rA": [
              "формирование гранулем в области верхушки зуба"
          ],
          "wA": [
              "гнойная деструкция костной ткани зубной лунки",
              "гнойное расплавление тканей верхушечного периодонта",
              "разрастание грануляционной ткани в области верхушки зуба"
          ]
      },
      {
          "qID": 471,
          "qName": "Виды гранулем при хроническом гранулематозном периодонтите …",
          "rA": [
              "простая",
              "эпителиальная",
              "кистогранулема"
          ],
          "wA": [
              "воспалительная",
              "фиброзирующая"
          ]
      },
      {
          "qID": 472,
          "qName": "Для простой гранулемы периодонта характерно …",
          "rA": [
              "наличие островка грануляционной ткани, окруженного фиброзной капсулой"
          ],
          "wA": [
              "образование полости, выстланной многослойным плоским эпителием",
              "наличие островка грануляционной ткани, пронизанной тяжами многослойного плоского эпителия"
          ]
      },
      {
          "qID": 473,
          "qName": "Для сложной (эпителиальной) гранулемы периодонта характерно …",
          "rA": [
              "наличие островка грануляционной ткани, пронизанной тяжами многослойного плоского эпителия"
          ],
          "wA": [
              "образование полости, выстланной многослойным плоским эпителием",
              "наличие островка грануляционной ткани, окруженного фиброзной капсулой"
          ]
      },
      {
          "qID": 474,
          "qName": "Для кистогранулемы периодонта характерно …",
          "rA": [
              "образование полости, выстланной многослойным плоским эпителием"
          ],
          "wA": [
              "наличие островка грануляционной ткани, окруженного фиброзной капсулой",
              "наличие островка грануляционной ткани, пронизанной тяжами многослойного плоского эпителия"
          ]
      },
      {
          "qID": 475,
          "qName": "К осложнениям периапикального периодонтита относятся …",
          "rA": [
              "периостит челюсти",
              "остеомиелит челюсти",
              "регионарный лимфаденит",
              "одонтогенный гайморит"
          ],
          "wA": [
              "патологические переломы челюсти"
          ]
      },
      {
          "qID": 476,
          "qName": "К некариозным поражениям зубов относятся …",
          "rA": [
              "кислотный некроз зубов",
              "флюороз",
              "клиновидные дефекты"
          ],
          "wA": [
              "десмодонтоз",
              "эпулис"
          ]
      },
      {
          "qID": 477,
          "qName": "Развитие флюороза связано с избыточным поступлением в организм …",
          "rA": [
              "фтора"
          ],
          "wA": [
              "фосфора",
              "кальция",
              "натрия",
              "йода"
          ]
      },
      {
          "qID": 478,
          "qName": "Для второй степени одонтопатии при флюорозе характерно …",
          "rA": [
              "наличие пятен, занимающих до половины поверхности эмали"
          ],
          "wA": [
              "наличие пятен, занимающих более половины поверхности эмали",
              "наличие эрозий эмали"
          ]
      },
      {
          "qID": 479,
          "qName": "Для третьей степени одонтопатии при флюорозе характерно …",
          "rA": [
              "наличие пятен, занимающих более половины поверхности эмали"
          ],
          "wA": [
              "наличие пятен, занимающих до половины поверхности эмали",
              "наличие эрозий эмали"
          ]
      },
      {
          "qID": 480,
          "qName": "Главным признаком четвертой степени одонтопатии при флюорозе является …",
          "rA": [
              "наличие эрозий эмали"
          ],
          "wA": [
              "наличие пятен, занимающих до половины поверхности эмали",
              "наличие пятен, занимающих более половины поверхности эмали"
          ]
      },
      {
          "qID": 481,
          "qName": "К пародонтопатиям относятся …",
          "rA": [
              "пародонтоз",
              "эпулис",
              "гингивит"
          ],
          "wA": [
              "пульпит",
              "остеомиелит челюсти"
          ]
      },
      {
          "qID": 482,
          "qName": "Местными факторами риска развития пародонтопатий являются …",
          "rA": [
              "аномалии прикуса",
              "дефекты протезирования",
              "недостаточный уход за полостью рта"
          ],
          "wA": [
              "недостаток в организме фтора",
              "авитаминоз С"
          ]
      },
      {
          "qID": 483,
          "qName": "Общими факторами риска развития пародонтопатий являются …",
          "rA": [
              "сахарный диабет",
              "авитаминоз С"
          ],
          "wA": [
              "аномалии прикуса",
              "недостаточный уход за полостью рта",
              "дефекты протезирования"
          ]
      },
      {
          "qID": 484,
          "qName": "К неминерализованным зубным отложениям относятся …",
          "rA": [
              "зубной налет",
              "зубная бляшка"
          ],
          "wA": [
              "наддесневой зубной камень",
              "поддесневой зубной камень"
          ]
      },
      {
          "qID": 485,
          "qName": "К минерализованным зубным отложениям относятся …",
          "rA": [
              "наддесневой зубной камень",
              "поддесневой зубной камень"
          ],
          "wA": [
              "зубной налет",
              "зубная бляшка"
          ]
      },
      {
          "qID": 486,
          "qName": "Гингивитом называется …",
          "rA": [
              "воспалительное заболевание десны без нарушения целостности зубодесневого соединения"
          ],
          "wA": [
              "воспалительное заболевание десны с нарушением целостности зубодесневого соединения",
              "воспаление тканей пародонта с их прогрессирующей деструкцией",
              "дистрофические изменения в тканях пародонта без предшествующего воспаления",
              "опухолевидное поражения пародонта"
          ]
      },
      {
          "qID": 487,
          "qName": "Пародонтитом называется …",
          "rA": [
              "воспаление тканей пародонта с их прогрессирующей деструкцией"
          ],
          "wA": [
              "воспалительное заболевание десны без нарушения целостности зубодесневого соединения",
              "воспалительное заболевание десны с нарушением целостности зубодесневого соединения",
              "дистрофические изменения в тканях пародонта без предшествующего воспаления",
              "опухолевидные поражения пародонта"
          ]
      },
      {
          "qID": 488,
          "qName": "Пародонтозом называются …",
          "rA": [
              "дистрофические изменения в тканях пародонта без предшествующего воспаления"
          ],
          "wA": [
              "воспалительное заболевание десны без нарушения целостности зубодесневого соединения",
              "воспалительное заболевание десны с нарушением целостности зубодесневого соединения",
              "воспаление тканей пародонта с их прогрессирующей деструкцией",
              "опухолевидные поражения пародонта"
          ]
      },
      {
          "qID": 489,
          "qName": "Диагностическими признаками гингивита являются …",
          "rA": [
              "кровоточивость десны",
              "положительная проба Шиллера-Писарева"
          ],
          "wA": [
              "альвеолярная пиорея",
              "болезненность при надавливании на зуб",
              "деструкция межзубных перегородок на рентгенограмме челюсти"
          ]
      },
      {
          "qID": 490,
          "qName": "К клинико-морфологическим формам гингивита относятся …",
          "rA": [
              "катаральный",
              "язвенный",
              "гипертрофический"
          ],
          "wA": [
              "серозный",
              "гнойный"
          ]
      },
      {
          "qID": 491,
          "qName": "Характерные морфологические признаки язвенного гингивита …",
          "rA": [
              "поверхность десны покрыта фибринозным налетом",
              "часто сопровождается регионарным лимфаденитом"
          ],
          "wA": [
              "десна гладкая, блестящая, гиперемированная",
              "десна утолщена, плотная, синюшная"
          ]
      },
      {
          "qID": 492,
          "qName": "Характерные морфологические признаки гипертрофического гингивита …",
          "rA": [
              "десна утолщена, гладкая, блестящая",
              "десневые сосочки увеличены в размерах, набухшие"
          ],
          "wA": [
              "множественные кровоизлияния и эрозии в десне",
              "целостность зубодесневого соединения нарушена"
          ]
      },
      {
          "qID": 493,
          "qName": "Диагностические критерии пародонтита …",
          "rA": [
              "формирование зубодесневых карманов",
              "формирование пародонтальных карманов",
              "деструкция межзубных перегородок на рентгенограмме челюсти",
              "расшатывание и выпадение зубов"
          ],
          "wA": [
              "целостность зубодесневого соединения не нарушена"
          ]
      },
      {
          "qID": 494,
          "qName": "Характеристика пародонтального кармана …",
          "rA": [
              "заполняется остатками пищевых масс, микроорганизмами, слущенным эпителием",
              "при обострении может наблюдаться выделение гноя",
              "формируется в результате деструкции периодонтальной связки"
          ],
          "wA": [
              "формируется в результате атрофических изменений десны",
              "формируется в результате деструкции костной ткани челюсти"
          ]
      },
      {
          "qID": 495,
          "qName": "Критерии первой (легкой) степени тяжести пародонтита …",
          "rA": [
              "зубы неподвижны",
              "убыль костных краев зубной лунки не более трети величины корня зуба"
          ],
          "wA": [
              "глубина пародонтального кармана от 3,5 до 5 мм",
              "убыль костных краев зубной лунки не более четверти величины корня зуба"
          ]
      },
      {
          "qID": 496,
          "qName": "Критерии второй (среднетяжелой) степени тяжести пародонтита …",
          "rA": [
              "глубина пародонтального кармана от 3,5 до 5 мм",
              "убыль костных краев зубной лунки не более половины величины корня зуба"
          ],
          "wA": [
              "зубы неподвижны",
              "убыль костных краев зубной лунки не более трети величины корня зуба"
          ]
      },
      {
          "qID": 497,
          "qName": "Критерии третьей (тяжелой) степени тяжести пародонтита …",
          "rA": [
              "расшатывание и выпадение зубов",
              "убыль костных краев зубной лунки свыше половины величины корня зуба"
          ],
          "wA": [
              "глубина пародонтального кармана от 3,5 до 5 мм",
              "убыль костных краев зубной лунки не более половины величины корня зуба"
          ]
      },
      {
          "qID": 498,
          "qName": "Характерные признаки пародонтоза …",
          "rA": [
              "первичные изменения возникают в костной ткани челюсти",
              "воспалительные изменения в тканях пародонта отсутствуют",
              "сопровождается дистрофическими и деструктивными изменениями зубов"
          ],
          "wA": [
              "всегда начинается с острого или хронического гингивита",
              "сопровождается периоститом челюсти"
          ]
      },
      {
          "qID": 499,
          "qName": "Морфологические проявления пародонтоза …",
          "rA": [
              "истончение костных пластинок челюсти с расширением костно-мозговых пространств",
              "уплотнение и склероз тканей десны"
          ],
          "wA": [
              "секвестрация костной ткани челюсти",
              "отслоение надкостницы с формированием поднадкостничных абсцессов"
          ]
      },
      {
          "qID": 500,
          "qName": "К пародонтомам относятся …",
          "rA": [
              "пародонтальные кисты",
              "фиброматоз десен",
              "эпулисы"
          ],
          "wA": [
              "пародонтоз",
              "фиброзная дисплазия челюсти"
          ]
      }
  ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' ); // пример вывода: 404: Not Found
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
