var tests = {
"tests":  [
{
  "qID": 301,
  "qName": "Клеточная стенка бактерий:",
  "rA": [
    "Придает бактериям определенную форму",
   ],
  "wA": [
    "Постоянная структура клетки.",
    "Образуется при неблагоприятных условиях",
    "Состоит только из белка",
"Слизистое образование"]
},
{
  "qID": 302,
  "qName": "При окраске по Граму применяют:",
  "rA": [
    "Генцианвиолет",
    ],
  "wA": [
    "Метиленовый синий",
    "Везувин",
    "Азур-эозин",
    "Серную кислоту"]
},
{
  "qID": 303,
  "qName": "Кандида относятся к царству",
  "rA": [
    "Eucaryotae",
    ],
  "wA": [
    "Procariotae",
    "Vіra",
    "Anіmalіa",
"Protozoa"]
},
{
  "qID": 304,
  "qName": ". Метод, используемый для выявления патогенных простейших в крови",
  "rA": [
    "толстая капля",
    ],
  "wA": [
    "фиксированный неокрашенный мазокт",
    "висячая капля",
    "фиксированный окрашенный мазок",
"раздавленная капля"]
},
{
  "qID": 305,
  "qName": ". Чистая культура микробов, выделенная из определенного источника и отличающаяся от других представителей вида, называется:",
  "rA": [
    "штаммом",
    ],
  "wA": [
    "клоном",
    "колонией",
    "вариантом",
"подвидом"]
},
{
  "qID": 306,
  "qName": " Бактерии, не имеющие клеточную стенку:",
  "rA": [
    "микоплазмы",
    ],
  "wA": [
    "риккетсии",
    "хламидии",
    "актиномицеты",
    " спирохеты"]
},
{
  "qID": 307,
  "qName": "Шляпочные грибы с септированным мицелием",
  "rA": [
    "базидиомицеты",
    ],
  "wA": [
    "оомицет",
    "дейтеромицеты",
    "аскомицеты",
"зигомицеты"]
},
{
  "qID": 308,
  "qName": "С какой целью фиксируют мазки:",
  "rA": [
    "для прикрепления бактерий к предметному стеклу",
    ],
  "wA": [
    " для выявления жгутиков",
" для обезжиривания препаратов",
" для сохранения размеров бактерий",
    "для выявления капсулы	",]
},
{
  "qID": 309,
  "qName": "В каждой бактериологической лаборатории должны быть предусмотрены:",
  "rA": [
    "помещения для приготовления питательных сред и стерилизации посуды",
    ],
  "wA": [
    "боксы для работы с отдельными группами вирусов",
    "боксы для работы с отдельными группами микроскопических грибов",
  "учебные аудитории",
  "препараторская"]
},
{
  "qID": 310,
  "qName": "Что изучает медицинская микробиология:",
  "rA": [
    "Патогенные и условно патогенные микроорганизмы",
    ],
  "wA": [
    "Фотобактерии",
    "Растения",
    "Гельминты"]
},
{
  "qID": 311,
  "qName": "Заслуги Пастера в микробиологии",
  "rA": [
    "Разработка пастеризации",
    ],
  "wA": [
    "Открытие возбудителя холеры",
    "Воспроизвел экспериментальный сифилис",
    "Открытие возбудителя туберкулеза",
"Открыте вирусов"]
},
{
  "qID": 312,
  "qName": "Основной таксономической единицей в микробиологии является:",
  "rA": [
    "Bид",
    ],
  "wA": [
    
    "Род",
"Семейство",
"Порядок",
"Класс"]
},
{
  "qID": 313,
  "qName": ". Принципиальным отличием в организации прокариотической клетки от эукариотической является:",
  "rA": [
    "отсутствие внутриклеточных мембран",
    ],
  "wA": [
    "отсутствие рибосом",
    "отсутствие ЦПМ",
    "наличие клеточной стенки",
  "отсутствие внутриплазматических включений"]
},
{
  "qID": 314,
  "qName": "Значение спор у бацилл:",
  "rA": [
    "защищают микроорганизм от неблагоприятных воздействий",
    ],
  "wA": [
    "размножение бактерий",
    "не сохраняют вид в неблагоприятных условиях",
    "участие в адгезии микроорганизмов",
"накопление питательных веществ"]
},
{
  "qID": 315,
  "qName": "Для вирусов характерно:",
  "rA": [
    "Паразитируют внутри клетки",
    ],
  "wA": [
    "Размножаются делением",
    "Имеют клеточное строение",
    "Образуют споры",
  "Растут только в аэробных условиях"]
},
{
  "qID": 316,
  "qName": ". Строение вирусов изучается методом:",
  "rA": [
    "Электронной микроскопии",
    ],
  "wA": [
    "Световой микроскопии",
    "Люминесцентной микроскопии",
    "Фазово-контрастной микроскопией",
  "Темнопольной микроскопии"]
},
{
  "qID": 317,
  "qName": "Тканевые культуры используются для:",
  "rA": [
    "Выращивания вирусов",
    ],
  "wA": [
    "Постановки серологических реакций",
    "Выращивания грибов",
    "Получения антибиотиков",
    "Выращивания бактерий"]
},
{
  "qID": 318,
  "qName": "Методы обнаружения (индикации) вирусов на тканевых культурах:",
  "rA": [
    "Цитопатическое действие",
    ],
  "wA": [
    "Газообразование",
    "Коньюгация",
    "Трансформации",
    "Диссоциация"]
},
{
  "qID": 319,
  "qName": "Методы обнаружения (индикации) вирусов на курином эмбрионе:",
  "rA": [
    "Гемагглютинация",
    ],
  "wA": [
    "Трансформация",
    "Бляшкообразование",
"Иммунофлюоресценция",
"Гемадсорбция"]
},
{
  "qID": 320,
  "qName": "Какие методы применяют для титрования фага:",
  "rA": [
    "Грациа и Аппельмана",
    ],
  "wA": [
    "Райта и Вассермана",
    "Коха и Пастера",
"Дригальского и Видаля",
"Грация и Кротова"]
},
{
  "qID": 321,
  "qName": "Ученный впервые использовавший раствор карболовой кислоты для обеззараживания ран:",
  "rA": [
    "Листер",
    ],
  "wA": [
    "Кох",
    "Пастер",
    "Ивановский",
    "Флеминг"]
},
{
  "qID": 322,
  "qName": "Ученый, впервые сформулировавший понятия об активном и пассивном иммунитете:",
  "rA": [
    "Эрлих",
    ],
  "wA": [
    "Мечников",
    "Кох",
    "Пастер",
    "Леффлер"]
},
{
  "qID": 323,
  "qName": "Чистая культура это",
  "rA": [
    "Совокупность микроорганизмов одного вида",
    ],
  "wA": [
    "Совокупность микроорганизмов разных видов",
    "Совокупность микроорганизмов одного рода",
    "Совокупность микроорганизмов разных родов",
    "Совокупность грамотрицательных микроорганизмов"]
},
{
  "qID": 324,
  "qName": "Термостат используется для:",
  "rA": [
    "Выращивания микроорганизмов",
    ],
  "wA": [
    "Стерилизации лабораторной посуды",
    "Стерилизации хирургических инструментов",
    "Стерилизации питательных сред",
    "Стимуляции спорообразования бактери"]
},
{
  "qID": 325,
  "qName": "Размножение бактерий происходит путем:",
  "rA": [
    "Поперечным изоморфным делением",
    ],
  "wA": [
    "Продольным делением",
    "Почкованием",
    "Экзоспорами",
    "Образованием фильтрующих форм"]
},
{
  "qID": 326,
  "qName": "Питательная среда для культивирования анаэробов:",
  "rA": [
    "Среда Китта-Тароцци",
    ],
  "wA": [
    "МПА",
    "МПБ",
    "Среды Гисса",
    "Щелочной агар"]
},
{
  "qID": 327,
  "qName": "Лаг-фаза это:",
  "rA": [
    "Фаза адаптации и начала интенсивного роста",
    ],
  "wA": [
    "Фаза максимального роста и интенсивного деления",
    "Фаза, при которой число бактериальных клеток не увеличивается",
    "Фаза, при которой число жизнеспособных клеток неизменно и находится на максимальном уровне",
    "Фаза отмирания бактерий"]
},
{
  "qID": 328,
  "qName": "Фаза логарифмического роста:",
  "rA": [
    "Фаза максимального роста и интенсивного деления",
    ],
  "wA": [
    "Фаза начала адаптации и интенсивного роста",
    "Фаза, при которой число бактериальных клеток не увеличивается",
    "Фаза, при которой число жизнеспособных клеток неизменно и находится на максимальном уровне",
    "Фаза отмирания бактерий"]
},
{
  "qID": 329,
  "qName": "Максимальная стационарная фаза:",
  "rA": [
    "Число жизнеспособных клеток неизменно и находится на максимальном уровне",
    ],
  "wA": [
    "Фаза адаптации и начала интенсивного рост",
    "Фаза максимального роста и интенсивного деления",
    "Фаза, при которой число бактериальных клеток не увеличивается",
    "Фаза отмирания бактерий"]
},
{
  "qID": 330,
  "qName": "Культивирование аэробов предусматривает использование:",
  "rA": [
    "Термостата",
    ],
  "wA": [
    "Свечей Шарберлена",
    "Аппарата Аристовского",
    "Эксикатора",
    "Свечей Омелянского"]
},
{
  "qID": 331,
  "qName": "Конститутивные ферменты",
  "rA": [
    "Постоянно синтезируются в микробных клетках в определенных концентрациях",
    "Концентрация не зависит от наличия соответствующего субстрата",
    ],
  "wA": [
    "Концентрация резко вырастает при наличии соответствующего субстрата",
    "В отсутствии субстрата находятся в следовых количествах",
    "Относятся к факторам роста микроорганизмов"]
},
{
  "qID": 332,
  "qName": "У беременной женщины в сыворотке крови в ИФА обнаружили антитела к вирусу СПИД. Какой результат ИФА считается положительным и достаточным при СПИД:",
  "rA": [
    "из трех повторных - два анализа положительные",
    ],
  "wA": [
    "достаточно однократного положительного результата",
    "из трех повторных - один анализ положительный",
    "из двух повторных - два анализа положительных",
    "достаточно двухкратного положительного результата"]
},
{
  "qID": 333,
  "qName": "Пигменты микроорганизмов:",
  "rA": [
    "Предохраняют от воздействия УФ-лучей",
    ],
  "wA": [
    "Участвуют в получении энерги",
    "Участвуют в биологическом окислени",
    "Являются источником углерода",
    "Являются источником азота"]
},
{
  "qID": 334,
  "qName": "Ферменты патогенности бактерий:",
  "rA": [
    "Плазмокоагулаза",
  
    "Гиалуронидаза",
  
    "Лецитиназа",
 
    "Стрептокиназа",
    ],
  "wA": [
    "Пенициллиназа"]
},
{
  "qID": 335,
  "qName": "Определение сахаролитических ферментов производят при посеве на:",
  "rA": [
    "Среды Гисса",
    ],
  "wA": [
    "Кровяной агар",
    "Среду Китт-Тароцци",
    "Молоко",
    "Среду Вильсон-Блера"]
},
{
  "qID": 336,
  "qName": "Период генерации это:",
  "rA": [
    "Период в течении которого осуществляется деление клетки",
    ],
  "wA": [
    "Время адаптации микробов к к изменившимся условиям среды",
    "Период восстановления поврежденных структур",
    "Объединение с бактериальной хромосомой",
    "Период уменьшения скорости отмирания клеток"]
},
{
  "qID": 337,
  "qName": "При снятии петлей изолированной колонии с МПА установлено,что колония слизистая, тянется за петлей. Что можно сказать о микробе",
  "rA": [
    "Обладает слизистой капсулой",
    ],
  "wA": [
    "Образует спору",
    "Выделяет ацетилметилкарбинол",
    "Имеет фермент триптафаназу",
    "Способен утилизировать цитрат"]
},
{
  "qID": 338,
  "qName": "ПВ окрашенных мазках из мокроты больного воспалением легких обнаружены ланцетовидной формы попарно расположенные кокки фиолетового цвета с неокрашенной каймой вокруг. Что представляет собой эта кайма:",
  "rA": [
    "Капсулу",
    ],
  "wA": [
    "Споры",
    "Цитоплазматическую мембрану",
    "Оболочку",
    "Жировосковые вещества"]
},
{
  "qID": 339,
  "qName": "У гомосексуалиста на нижних конечностях наблюдаются высыпания, сосудистая опухлость, парное увеличение паховых лимфатических узлов, положительная ИФА. Укажите, какой метод необходимо использовать для окончательного диагноза ВИЧ- инфекции:",
  "rA": [
    "иммуноблотинг",
    ],
  "wA": [
    "радиоиммунный анализ",
    "РПГА",
    "реакцию коагуляции",
    "иммунофлюоресценция"]
},
{
  "qID": 340,
  "qName": ". L-формы бактерий:",
  "rA": [
    "Бактерии, утратившие клеточную стенку, но сохранившие способность к размножению",
    ],
  "wA": [
    "Протопласты",
    "Окружены пептидогликаном",
    "Имеют наружную мембрану",
    "Бактерии, имеющие ригидную клеточную стенку"]
},
{
  "qID": 341,
  "qName": "О чем свидетельствует наличие антител к вирусу СПИД:",
  "rA": [
    "человек заражен ВИЧ",
    ],
  "wA": [
    "у человека имеется иммунитет от возможного заражения СПИД",
    "человек находится в инкубационном периоде",
    "имеются оппортунистические инфекции",
    "наблюдается выздоровление"]
},{
  "qID": 342,
  "qName": "Значение спор у возбудителя сибирской язвы",
  "rA": [
    "Способствуют сохранению вида в неблагоприятных условиях",
    ],
  "wA": [
    "Участвуют в размножении",
    "Накопление дополнительных питательных веществ",
    "Являются признаками дегенерации клетки",
    "Участвуют в адгезии"]
},{
  "qID": 343,
  "qName": "В мазке обнаружены палочки, располагающиеся цепочкой с овальным красным, центрально расположенным образованием. Каким методом окрашен мазок:",
  "rA": [
    "Ожешко",
    ],
  "wA": [
    "Леффлера",
    "Грама",
    "Циль-Нильсена",
    "Бурри"]
},{
  "qID": 344,
  "qName": "Входные ворота при менингококковой инфекции:",
  "rA": [
    "слизистая оболочка верхних дыхательных путей",
    ],
  "wA": [
    "желудочно-кишечный тракт",
    "кожные покровы",
    "слизистая половых путей",
    "слизистая глаза"]
},{
  "qID": 345,
  "qName": "Простые методы окраски позволяют:",
  "rA": [
    "Изучить форму микробов",
    ],
  "wA": [
    "Выявить оболочку",
    "Окрасить капсулу",
    "Изучить структуру бактериальной клетки",
    "Окрасить жгутики"]
},{
  "qID": 346,
  "qName": "Что необходимо сделать для постановки диагноза СПИД:",
  "rA": [
    "ИФА",
    ],
  "wA": [
    "РНГА",
    "радиоиммунный анализ",
    "реакцию коагуляции",
    "иммунофлюоресценции"]
},{
  "qID": 347,
  "qName": "В мазке из культуры микробов под объективом видны скопления кокков по форме напоминающие пакеты или тюки синего цвета. Назовите эти кокки:",
  "rA": [
    "Сарцины",
    ],
  "wA": [
    "Стафилококки",
    "Микрококки",
    "Менингококки",
    "Стрептококки"]
},{
  "qID": 348,
  "qName": "Кислотоустойчивость характерна для:",
  "rA": [
    "Туберкулезной палочки",
    ],
  "wA": [
    "Дифтерийной палочки",
    "Брюшнотифозной палочки",
    "Стафилококков",
    "Риккетсий"]
},{
  "qID": 349,
  "qName": "Окрашивание по Циль-Нильсену применяют для выявления",
  "rA": [
    "Кислотоустойчивых бактерий",
    ],
  "wA": [
    "Спор",
    "Капсул",
    "Зерен волютина",
    "Цитоплазматической мембраны"]
},{
  "qID": 350,
  "qName": "Чем отличается метод темнопольной микроскопии от других методов:",
  "rA": [
    "Объект освещен косыми боковыми лучами не попадающими в объектив",
    ],
  "wA": [
    "Дает увеличение в 250 тысяч раз",
    "Используется для изучения структуры вирусов и бактерий",
    "Разрешающая способность микроскопа 0,2 мкм",
    "Разрешающая способность зависит от общего увеличения микроскопа"]
},{
  "qID": 351,
  "qName": "У больного температура 39 градусов, озноб, сильная головная боль, рвота, ригидность мышц затылка. Выделена чистая культура грамотрицательных бобовидных кокков, расположенных попарно. Какой берут материал на исследование при данном заболевании:",
  "rA": [
    "Спинно-мозговую жидкость",
    ],
  "wA": [
    "Мочу",
    "Слизь из носоглотки",
    "Кровь",
    "Испражнения"]
},{
  "qID": 352,
  "qName": "Морфологические особенности спирохет",
  "rA": [
    "Относятся к извитым формам бактерий",
    ],
  "wA": [
    "Наличие спор",
    "Оформленное ядро",
    "Наличие зерен волютина",
    "Сократимость протоплазмы"]
},{
  "qID": 353,
  "qName": "От других групп микроорганизмов актиномицеты отличаются тем, что:",
  "rA": [
    "Имеют вид длинных ветвящихся нитей",
    ],
  "wA": [
    "Грамотрицательные",
    "Кислотоустойчивые",
    "Имеют зерна волютина",
    "В составе пептидогликана обнаружены арабиноза, галактоза"]
},{
  "qID": 354,
  "qName": "N. menіngіtіdіs отличаются от непатогенных нейссерий:",
  "rA": [
    "Не растут при температуре 22 С",
    ],
  "wA": [
    "Положительной оксидазной пробой",
    "Не растут при температуре 37 С",
    "Грамотрицательны",
    "Вегетируют на слизистых верхних дыхательных путей"]
},{
  "qID": 355,
  "qName": "Для риккетсий характерно:",
  "rA": [
    "Полиморфизм",
    ],
  "wA": [
    "Подвижность",
    "Кислотоустойчивость",
    "Ригидная оболочка",
    "Наличие зерен волютина"]
},{
  "qID": 356,
  "qName": "Морфологические особенности хламидий:",
  "rA": [
    "Морфология зависит от стадии внутриклеточного развития",
    ],
  "wA": [
    "Кислотоустойчивые микроорганизмы",
    "Образование внутриклеточных включений",
    "В организме образуют капсулу",
    "Имеют только РНК"]
},{
  "qID": 357,
  "qName": "Для морфологии и строения грибов характерно:",
  "rA": [
    "Образование мицелия",
    ],
  "wA": [
    "Отсутствие клеточной стенки",
    "Образование капсулы",
    "Диффузно расположенная ядерная субстанция",
    "Наличие жировосковых веществ"]
},{
  "qID": 358,
  "qName": "Постинфекционный иммунитет при менингите:",
  "rA": [
    "Прочный антимикробный",
    ],
  "wA": [
    "Тканевой",
    "Непрочный",
    "Пассивный",
    "Антитоксический"]
},{
  "qID": 359,
  "qName": "Инкубационный период при Синдроме Приобретенного Иммунного Дефицита:",
  "rA": [
    "2-4 недели, до 10 лет больше",
    ],
  "wA": [
    "отсутствует",
    "характеризуется появлением слабости, поноса, ночных потов",
    "2-3 часа",
    "развитие осложнений"]
},
{
  "qID": 360,
  "qName": ". Расположение кокков в мазке-препарате зависит от:",
  "rA": [
    "деления в разных плоскостях",
    ],
  "wA": [
    "размеров кокков",
    "количества и расположения жгутиков",
    "различия в капсулообразовании",
    "процесса коньюгации"]
},
{
  "qID": 361,
  "qName": "Как называются кокки, распологающиеся в виде гроздьев винограда:",
  "rA": [
    "стафилококки",
    ],
  "wA": [
    "стрептококки",
    "сарцины",
    "бациллы",
    "микрококки"]
},
{
  "qID": 362,
  "qName": "Органелла бактерий, препятствующая фагоцитозу:",
  "rA": [
    "капсула",
    ],
  "wA": [
    "спора",
    "клеточная стенка",
    "жгутики",
    "цитоплазма"]
},
{
  "qID": 363,
  "qName": "Метод применяемый для окрашивания кислотоустойчивых бактерий:",
  "rA": [
    "Циль-Нильсена",
    ],
  "wA": [
    "Романовского-Гимза",
    "Грама",
    "Здродовского",
    "Бурри"]
},
{
  "qID": 364,
  "qName": "Метод окрашивания спирохет:",
  "rA": [
    "Романовского-Гимза",
    ],
  "wA": [
    "Грама",
    "Циль-Нильсена",
    "Здродовского",
    "Бурри"]
},
{
  "qID": 365,
  "qName": "Функции жгутиков:",
  "rA": [
    "обеспечивают подвижность",
    ],
  "wA": [
    "защищают бактерии от неблагоприятных внешних воздействий",
    "придают определенную форму бактериям",
    "осуществляют транспорт растворенных веществ в клетку",
    "участвуют в делении клетки"]
},
{
  "qID": 366,
  "qName": "Как называются кокки, располагающиеся цепочками:",
  "rA": [
    "стрептококки",
    ],
  "wA": [
    "микрококки",
    "сарцины",
    "стафилококки",
    "бациллы"]
},
{
  "qID": 367,
  "qName": "Длительность сохранения спор во внешней среде:",
  "rA": [
    "несколько лет",
    ],
  "wA": [
    "несколько часов",
    "несколько минут",
    "несколько дней",
    "несколько недель"]
},
{
  "qID": 368,
  "qName": "В каких единицах измеряются размеры бактерий:",
  "rA": [
    "микрометры",
    ],
  "wA": [
    "нанометры",
    "миллиметры",
    " сантиметры",
    "ангстремы"]
},
{
  "qID": 369,
  "qName": "Вирион представляет собой:",
  "rA": [
    "полноценную вирусную частицу",
    ],
  "wA": [
    "молекулу ДНК",
    "молекулу РНК",
    "капсид",
    "суперкапсид"]
},
{
  "qID": 370,
  "qName": "Размеры вириона измеряются в:",
  "rA": [
    "нанометрах",
    ],
  "wA": [
    "миллиметрах",
    "сантиметрах",
    "ангстремах",
    "микрометрах"]
},
{
  "qID": 371,
  "qName": "Клон",
  "rA": [
    "Культура микроорганизмов, полученная из одной особи",
    ],
  "wA": [
    "Совокупность особей одного вида.",
    "Культура, выделенная из определенного источника.",
    "Совокупность особей, имеющих один фенотип.",
    "Микробные особи одного вида, выращенные на питательной среде"]
},
{
  "qID": 372,
  "qName": "Бактерии",
  "rA": [
    "Микроорганизмы, не имеющие оформленного ядра",
    ],
  "wA": [
    "Относятся к эукариотам.",
    "Имеют ядерную оболочку.",
    "Имеют вирион.",
    "Мельчайшие, не видимые в световом микроскопе частицы"]
},
{
  "qID": 373,
  "qName": "Капсид состоит из :",
  "rA": [
    "капсомеров",
    ],
  "wA": [
    "липополисахаридной оболочки",
    "липопротеидной оболочки",
    "ДНК",
    "РНК"]
},
{
  "qID": 374,
  "qName": "Возбудитель ботулизма образует:",
  "rA": [
    "Нейротоксин",
    ],
  "wA": [
    "Гиалуронидазу",
    "Фибринолизин",
    "Тетанолизин",
    "Эндотоксин"]
},
{
  "qID": 375,
  "qName": "Аспергилла относятся к царству:",
  "rA": [
    "Eucaryotae",
    ],
  "wA": [
    "Procarіotae",
    "Vіra",
    "Protozoa",
    "Anіmalіa"]
},
{
  "qID": 376,
  "qName": "Адгезия",
  "rA": [
    "Способность прикрепляться к клеткам.",
    ],
  "wA": [
    "Защита от фагоцитоза.",
    "Способность к распространению возбудителя",
    "Способность размножаться на поверхности клеток.",
    "Способность проникать в клетки и ткани."]
},
{
  "qID": 377,
  "qName": "Экзотоксины",
  "rA": [
    "Термолабильные белки.",
    ],
  "wA": [
    "Липополисахариды",
    "Капсомеры",
    "Вещества, избирательно подавляющие жизнедеятельность микроорганизмов.",
    "природные антибиотики"]
},
{
  "qID": 378,
  "qName": "Эндотоксины",
  "rA": [
    "Термостабильные липополисахариды",
    ],
  "wA": [
    "Мембранотоксины",
    "Антиэлонгаторы",
    "Белковые вещества.",
    "Постоянно выделяются в окружающую среду."]
},
{
  "qID": 379,
  "qName": "Периоды инфекционного заболевания:",
  "rA": [
    "Реконвалесценция",
    ],
  "wA": [
    "Инвазия",
    "Манифестная",
    "Рекомбинация",
    "Септикопиемия"]
},
{
  "qID": 380,
  "qName": "Гонококки вызывают:",
  "rA": [
    "Гонорею",
    ],
  "wA": [
    "Ревматизм",
    "Гепатит",
    "Скарлатину",
    "Столбняк"]
},
{
  "qID": 381,
  "qName": "Для микроскопического метода диагностики гонореи берут:",
  "rA": [
    "Отделяемое из уретры",
    ],
  "wA": [
    "СМЖ",
    "Пунктат из бубона",
    "Кровь больного",
    "Испражнения"]
},
{
  "qID": 382,
  "qName": "Микробиологические методы исследования при гонококковых заболеваниях:",
  "rA": [
    "Микроскопия мазков из патологического материала",
    ],
  "wA": [
    "Реакция преципитации",
    "Заражение лабораторных животных",
    "Реакция нейтрализации",
    "Посев на щелочной агар"]
},
{
  "qID": 383,
  "qName": "Ускоренная диагностика газовой анаэробной инфекции:",
  "rA": [
    "Газово-жидкостная хроматография",
    ],
  "wA": [
    "Метод Ермольевой",
    "Выявляет наличие клостридий",
    "Реакция нейтрализации",
    "Биологический метод"]
},
{
  "qID": 384,
  "qName": "Входные ворота инфекции при гонорее:",
  "rA": [
    "Цилиндрический эпителий слизистой оболочки мочеполового тракта",
    ],
  "wA": [
    "Кровь",
    "Кожные покровы",
    "Слизистая оболочка кишечного тракта",
    "Слизистая оболочка трахеи и бронхов"]
},
{
  "qID": 385,
  "qName": "Диагностика острой гонореи:",
  "rA": [
    "Бактериоскопический метод",
    ],
  "wA": [
    "РСК",
    "Биологический метод",
    "Реакция агглютинации",
    "Аллергическая проба"]
},
{
  "qID": 386,
  "qName": "Заболевания, вызванные условно-патогенными микроорганизмами характеризуются:",
  "rA": [
    "Полиэтиологичностью",
    ],
  "wA": [
    "Строго выраженной органной локализацией.",
    "Отсутствием продромального периода",
    "Подавлением одной популяции другой.",
    "Одинаковым инкубационным периодом."]
},
{
  "qID": 387,
  "qName": "Инфекция",
  "rA": [
    "Заражение",
    ],
  "wA": [
    "Микробиоценоз",
    "Подавление жизнедеятельности одной популяции другой.",
    "Форма существования двух патогенных микробов",
    "Симбиоз нормальной микрофлоры с макроорганизмом"]
},
{
  "qID": 388,
  "qName": "Инфекционные заболевания характеризуются:",
  "rA": [
    "Цикличностью течения",
    ],
  "wA": [
    "Отсутствием контагиозности.",
    "Одинаковым инкубационным периодом",
    "Отсутствием продромального периода.",
    "Вызываются только бактериями."]
},
{
  "qID": 389,
  "qName": "Формы инфекции в зависимости от распространения микробов:",
  "rA": [
    "Очаговая",
    ],
  "wA": [
    "Острая",
    "Хроническая",
    "Эндогенная",
    "Рецидив"]
},
{
  "qID": 390,
  "qName": "Реинфекция",
  "rA": [
    "Повторное заражение тем же возбудителем после выздоровления",
    ],
  "wA": [
    "Повторное заражение бактериями другого вида",
    "возникает при заболеваниях со стойким иммунитетом",
    "Возникает за счет нормальной микрофлоры",
    "Повторное заражение тем же возбудителем до ликвидации первичного заболевания"]
},
{
  "qID": 391,
  "qName": "Формы инфекции по источнику возбудителя:",
  "rA": [
    "Зоонозная",
    ],
  "wA": [
    "Пандемия",
    "Латентная",
    "Бактериемия",
    "Экзогенная"]
},
{
  "qID": 392,
  "qName": "Рецидив",
  "rA": [
    "Возникновение болезни через некоторое время после ее прекращения за счет оставшихся в организме возбудителей.",
    ],
  "wA": [
    "Повторное заболевание после полного выздоровления за счет вторичного заражения извне.",
    "В организме вегетирует патогенный микроб, но заболевания не возникает",
    "Форма инфекции при которой к основному заболеванию присоединяется другое.",
    "Повторное заболевание той же инфекцией, наступившее до ликвидации первичного заболевания."]
},
{
  "qID": 393,
  "qName": "Укажите форму инфекции",
  "rA": [
    "Рецидив",
    ],
  "wA": [
    "Реконвалесценция",
    "Продром",
    "Сенсибилизация",
    "Мутуализм"]
},
{
  "qID": 394,
  "qName": "Выберите состояние, когда микроб попадает в кровь и размножается в ней:",
  "rA": [
    "Сепсис",
    ],
  "wA": [
    "Токсинемия",
    "Бактериемия",
    "Септикопиемия",
    "Лейкемия"]
},
{
  "qID": 395,
  "qName": "Сколько периодов при инфекционном заболевании:",
  "rA": [
    "Четыре",
    ],
  "wA": [
    "Три",
    "Пять",
    "Шесть",
    "Два"]
},
{
  "qID": 396,
  "qName": "Выберите и дополните определение: Суперинфекция - это…:",
  "rA": [
    "Если заболевание возобновилось до выздоровления в результате инфицирования тем же возбудителем.",
    ],
  "wA": [
    "Когда инфекция вызвана разными видами микробов.",
    "Когда заболевание возникает после клинического выздоровления без повторного заражения, за счет оставшихся в организме возбудителей",
    "Состояние, когда организм перенес какую-либо инфекцию и вторично заболевает в результате нового заражения тем же возбудителем.",
    "Когда к первоначальной, основной, уже развившейся болезни присоединяется другая, вызываемая новым возбудителем"]
},
{
  "qID": 397,
  "qName": "Выберите бактерии, которые секретируют энтеротоксины:",
  "rA": [
    "Холерный вибрион.",
    ],
  "wA": [
    "Бруцеллы",
    "Возбудитель чумы.",
    "Пневмококки",
    "Гонококк"]
},
{
  "qID": 398,
  "qName": "Для патогенных микробов характерны:",
  "rA": [
    "Нозологическая специфичность и органотропность.",
    ],
  "wA": [
    "Полиэтиологичность",
    "Отсутствие характерной клинической картины.",
    "Вызывают заболевания только на фоне первичного инфекционного заболевания",
    "Не имеют строго выраженной органной локализации"]
},
{
  "qID": 399,
  "qName": "Особенность вирусной инфекции",
  "rA": [
    "Облигатный внутриклеточный паразитизм",
    ],
  "wA": [
    "Короткий инкубационный период",
    "Развитие бактериемии",
    "Отсутствие взаимодействия между геномом вируса и геномом клетки макроорганизма.",
    "Отсутствием специфичности действия"]
},
{
  "qID": 400,
  "qName": "Самозаражение путем переноса возбудителя из одного биотопа в другой называется",
  "rA": [
    "аутоинфекция",
    ],
  "wA": [
    "реинфекция",
    "рецидив",
    "моноинфекция",
    "бактерионосительство"]
},
]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Вот и тесты";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' ); // пример вывода: 404: Not Found
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html"});
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
