var tests = {
  "tests": [
      {
          "qID": 201,
          "qName": "Причинами смерти больных острыми лейкозами могут стать …",
          "rA": [
              "бластный криз",
              "инфекционно-некротические осложнения",
              "геморрагический синдром"
          ],
          "wA": [
              "тромбоэмболический синдром",
              "кишечная непроходимость"
          ]
      },
      {
          "qID": 202,
          "qName": "К основным проявлениям хронических лейкозов относятся …",
          "rA": [
              "лейкозная инфильтрация костного мозга",
              "лейкемические инфильтраты в почках",
              "спленомегалия",
              "гепатомегалия"
          ],
          "wA": [
              "инфаркты головного мозга"
          ]
      },
      {
          "qID": 203,
          "qName": "К хроническим миелоцитарным лейкозам относится …",
          "rA": [
              "хронический гранулоцитарный лейкоз"
          ],
          "wA": [
              "хронический лимфолейкоз",
              "миеломная болезнь",
              "болезнь Ходжкина"
          ]
      },
      {
          "qID": 204,
          "qName": "Хронический миелолейкоз сопровождается …",
          "rA": [
              "вторичным иммунодефицитом",
              "геморрагическим синдромом",
              "вытеснением нормальных гемопоэтических элементов",
              "первичным поражением костного мозга"
          ],
          "wA": [
              "первичным поражением лимфатических узлов"
          ]
      },
      {
          "qID": 205,
          "qName": "Для хронического лимфолейкоза в период ремиссии характерно …",
          "rA": [
              "инфильтраты во внутренних органах из лимфоцитов",
              "увеличение лимфоузлов",
              "увеличение количества лимфоцитов в периферической крови",
              "увеличение селезенки, печени"
          ],
          "wA": [
              "пиоидный костный мозг"
          ]
      },
      {
          "qID": 206,
          "qName": "К хроническим лимфоцитарным лейкозам относятся …",
          "rA": [
              "хронический лимфолейкоз",
              "миеломная болезнь"
          ],
          "wA": [
              "хронический миелолейкоз",
              "болезнь Ходжкина"
          ]
      },
      {
          "qID": 207,
          "qName": "К осложнениям лейкозов относятся …",
          "rA": [
              "сепсис",
              "пневмония",
              "некротическая ангина",
              "кровоизлияние в головной мозг"
          ],
          "wA": [
              "гломерулонефрит"
          ]
      },
      {
          "qID": 208,
          "qName": "К лимфомам относится …",
          "rA": [
              "лимфогранулематоз",
              "грибовидный микоз"
          ],
          "wA": [
              "миелобластный лейкоз",
              "миеломная болезнь"
          ]
      },
      {
          "qID": 209,
          "qName": "Клинико-морфологическими формами болезни Ходжкина являются …",
          "rA": [
              "лимфоидное преобладание",
              "лимфоидное истощение",
              "смешанно-клеточный вариант",
              "нодулярный склероз"
          ],
          "wA": [
              "нодулярная гиперплазия"
          ]
      },
      {
          "qID": 210,
          "qName": "При болезни Ходжкина в лимфатических узлах появляются клетки …",
          "rA": [
              "Рид-Березовского-Штернберга",
              "Ходжкина"
          ],
          "wA": [
              "Гумпрехта",
              "Пирогова-Лангханса"
          ]
      },
      {
          "qID": 211,
          "qName": "При болезни Ходжкина происходит …",
          "rA": [
              "стирание структуры лимфоузла",
              "пролиферация опухолевых В-лимфоцитов",
              "пролиферация лимфоцитов и соединительной ткани"
          ],
          "wA": [
              "пролиферация опухолевых Т-лимфоцитов",
              "увеличение числа лимфоидных фолликулов"
          ]
      },
      {
          "qID": 212,
          "qName": "К факторам риска развития атеросклероза относятся …",
          "rA": [
              "артериальная гипертензия",
              "сахарный диабет",
              "курение",
              "увеличение содержания ЛПНП в крови"
          ],
          "wA": [
              "увеличение содержания ЛПВП в крови"
          ]
      },
      {
          "qID": 213,
          "qName": "Атеросклероз преимущественно поражает …",
          "rA": [
              "артерии эластического типа",
              "артерии мышечно-эластического типа"
          ],
          "wA": [
              "артерии мышечного типа",
              "артериолы",
              "венулы"
          ]
      },
      {
          "qID": 214,
          "qName": "Наиболее выраженные изменения при атеросклерозе аорты отмечаются в ее …",
          "rA": [
              "брюшном отделе"
          ],
          "wA": [
              "дуге",
              "восходящей части",
              "грудном отделе"
          ]
      },
      {
          "qID": 215,
          "qName": "К макроскопическим стадиям атеросклероза относятся …",
          "rA": [
              "жировые пятна и полоски",
              "фиброзные бляшки",
              "осложнённые поражения (изъязвления, тромбоз, кровоизлияния)"
          ],
          "wA": [
              "мезаортит",
              "доклинические изменения"
          ]
      },
      {
          "qID": 216,
          "qName": "К микроскопическим стадиям атеросклероза относятся …",
          "rA": [
              "липоидоз",
              "липосклероз",
              "атероматоз"
          ],
          "wA": [
              "гиалиноз",
              "липоматоз"
          ]
      },
      {
          "qID": 217,
          "qName": "Стадии атеросклероза, сопровождающиеся сужением просвета артерии …",
          "rA": [
              "липосклероз",
              "атероматоз",
              "кальциноз"
          ],
          "wA": [
              "долипидная",
              "липоидоз"
          ]
      },
      {
          "qID": 218,
          "qName": "К клинико-морфологическим формам атеросклероза относятся …",
          "rA": [
              "атеросклероз аорты",
              "атеросклероз почечных артерий",
              "атеросклероз артерий нижних конечностей",
              "атеросклероз коронарных артерий"
          ],
          "wA": [
              "атеросклероз печеночной артерии"
          ]
      },
      {
          "qID": 219,
          "qName": "При артериальной гипертензии уровень артериального давления …",
          "rA": [
              "140/90 мм рт.ст. и более"
          ],
          "wA": [
              "120/80 мм рт.ст. и более",
              "130/90 мм рт.ст. и более",
              "150/100 мм рт.ст. и более",
              "160/100 мм рт.ст. и более"
          ]
      },
      {
          "qID": 220,
          "qName": "Видами гипертонической болезни, в зависимости от характера течения являются …",
          "rA": [
              "доброкачественная",
              "злокачественная"
          ],
          "wA": [
              "мозговая",
              "сердечная"
          ]
      },
      {
          "qID": 221,
          "qName": "Клинико-морфологическими формами гипертонической болезни являются …",
          "rA": [
              "почечная",
              "мозговая",
              "сердечная"
          ],
          "wA": [
              "брыжеечная",
              "печеночная"
          ]
      },
      {
          "qID": 222,
          "qName": "О гипертрофии сердца взрослого человека говорят, когда его масса превышает …",
          "rA": [
              "350 г"
          ],
          "wA": [
              "100 г",
              "200 г",
              "600 г",
              "750 г"
          ]
      },
      {
          "qID": 223,
          "qName": "О гипертрофии левого желудочка сердца взрослого человека говорят, когда толщина его стенки превышает ...",
          "rA": [
              "1,2 см"
          ],
          "wA": [
              "0,3 см",
              "0,5 см",
              "2,0 см",
              "1,8 см"
          ]
      },
      {
          "qID": 224,
          "qName": "Основные изменения при гипертонической болезни возникают в …",
          "rA": [
              "артериолах"
          ],
          "wA": [
              "аорте",
              "крупных магистральных артериях",
              "венулах",
              "крупных венах"
          ]
      },
      {
          "qID": 225,
          "qName": "В стенках артериол при гипертонической болезни возникает …",
          "rA": [
              "гиалиноз",
              "плазматическое пропитывание",
              "фибриноидный некроз"
          ],
          "wA": [
              "амилоидоз"
          ]
      },
      {
          "qID": 226,
          "qName": "При гипертонической болезни в почках развивается …",
          "rA": [
              "первичное сморщивание"
          ],
          "wA": [
              "вторичное сморщивание",
              "гидронефроз",
              "амилоидоз",
              "некротический нефроз"
          ]
      },
      {
          "qID": 227,
          "qName": "Формами острой ишемической болезни сердца являются …",
          "rA": [
              "инфаркт миокарда",
              "внезапная коронарная смерть"
          ],
          "wA": [
              "кардиосклероз",
              "жировая дистрофия миокарда",
              "ожирение миокарда"
          ]
      },
      {
          "qID": 228,
          "qName": "Непосредственные причины инфаркта миокарда …",
          "rA": [
              "тромбоз коронарных артерий",
              "тромбоэмболия коронарных артерий",
              "длительный спазм коронарных артерий",
              "функциональное перенапряжение миокарда"
          ],
          "wA": [
              "избыточное развитие коллатералей"
          ]
      },
      {
          "qID": 229,
          "qName": "Макроскопически в миокарде обычно формируется …",
          "rA": [
              "белый инфаркт с геморрагическим венчиком"
          ],
          "wA": [
              "белый инфаркт",
              "красный инфаркт",
              "гангрена",
              "секвестр"
          ]
      },
      {
          "qID": 230,
          "qName": "Микроскопическими признаками инфаркта миокарда являются …",
          "rA": [
              "плазмокоагуляция",
              "кариопикноз, кариорексис"
          ],
          "wA": [
              "жировая дистрофия",
              "мукоидное набухание",
              "вакуолизация цитоплазмы"
          ]
      },
      {
          "qID": 231,
          "qName": "Морфологические признаки некроза появляются в миокарде спустя … от начала острой ишемии",
          "rA": [
              "18 часов"
          ],
          "wA": [
              "1 час",
              "6 часов",
              "12 часов",
              "48 часов"
          ]
      },
      {
          "qID": 232,
          "qName": "К осложнениям инфаркта миокарда относятся …",
          "rA": [
              "нарушения ритма",
              "разрыв сердца",
              "тромбоэмболический синдром"
          ],
          "wA": [
              "пневмосклероз",
              "гидронефроз"
          ]
      },
      {
          "qID": 233,
          "qName": "Повторным называется инфаркт миокарда, формирующийся … после предыдущего",
          "rA": [
              "спустя 28 дней и более"
          ],
          "wA": [
              "спустя 7 дней и более",
              "спустя 14 дней и более",
              "спустя 6 месяцев и более",
              "спустя 1 год и более"
          ]
      },
      {
          "qID": 234,
          "qName": "К хроническим формам ишемической болезни сердца относятся …",
          "rA": [
              "мелкоочаговый кардиосклероз",
              "крупноочаговый кардиосклероз"
          ],
          "wA": [
              "инфаркт миокарда",
              "гипертрофия миокарда",
              "пороки сердца"
          ]
      },
      {
          "qID": 235,
          "qName": "К цереброваскулярным заболеваниям относятся …",
          "rA": [
              "инфаркт головного мозга",
              "внутримозговые кровоизлияния",
              "субарахноидальные кровоизлияния"
          ],
          "wA": [
              "гидроцефалия",
              "энцефаломиелит"
          ]
      },
      {
          "qID": 236,
          "qName": "Причиной развития инфаркта головного мозга может быть стенозирующий атеросклероз … артерий",
          "rA": [
              "внутрицеребральных",
              "позвоночных",
              "внутренних сонных"
          ],
          "wA": [
              "наружных сонных"
          ]
      },
      {
          "qID": 237,
          "qName": "Осложнениями инфаркта головного мозга являются …",
          "rA": [
              "гипостатическая пневмония",
              "отёк мозга",
              "дислокация мозговых структур"
          ],
          "wA": [
              "тромбоэмболия лёгочной артерии",
              "инфаркт миокарда"
          ]
      },
      {
          "qID": 238,
          "qName": "Возможными причинами смерти больных с инфарктом головного мозга могут быть …",
          "rA": [
              "отек мозга",
              "дислокация мозговых структур"
          ],
          "wA": [
              "прорыв крови в желудочки мозга",
              "гнойный менингоэнцефалит"
          ]
      },
      {
          "qID": 239,
          "qName": "Возможным исходом крупного инфаркта головного мозга может быть …",
          "rA": [
              "киста"
          ],
          "wA": [
              "рубцевание",
              "полное рассасывание",
              "обызвествление"
          ]
      },
      {
          "qID": 240,
          "qName": "Осложнениями гематомы головного мозга могут быть …",
          "rA": [
              "прорыв крови в желудочки мозга",
              "гипостатическая пневмония",
              "отёк и дислокация мозга"
          ],
          "wA": [
              "геморрагический шок",
              "ДВС-синдром"
          ]
      },
      {
          "qID": 241,
          "qName": "Общие признаки для всех ревматических болезней …",
          "rA": [
              "системная прогрессирующая дезорганизация соединительной ткани",
              "иммунопатологические процессы",
              "хроническое волнообразное течение"
          ],
          "wA": [
              "обязательное поражение сердца",
              "обязательное поражение суставов"
          ]
      },
      {
          "qID": 242,
          "qName": "Этапы дезорганизации соединительной ткани при ревматизме …",
          "rA": [
              "гиалиноз",
              "мукоидное набухание",
              "фибриноидное набухание"
          ],
          "wA": [
              "амилоидоз",
              "гнойная инфильтрация"
          ]
      },
      {
          "qID": 243,
          "qName": "Мукоидное набухание характеризуется …",
          "rA": [
              "накоплением гликозаминогликанов в основном веществе соединительной ткани",
              "повышением сосудистой проницаемости",
              "набуханием волокон соединительной ткани"
          ],
          "wA": [
              "набуханием клеток соединительной ткани",
              "пропитыванием соединительной ткани фибрином"
          ]
      },
      {
          "qID": 244,
          "qName": "Для фибриноидного набухания характерно …",
          "rA": [
              "деструкция коллагеновых волокон и протеогликанов основного вещества",
              "значительное повышение сосудистой проницаемости",
              "исходом является гиалиноз"
          ],
          "wA": [
              "поверхностная, обратимая стадия дезорганизации соединительной ткани",
              "обязательно сопровождается некрозом"
          ]
      },
      {
          "qID": 245,
          "qName": "Для гиалиноза характерно …",
          "rA": [
              "накопление в ткани полупрозрачных плотных масс, напоминающих гиалиновый хрящ",
              "может возникать в стенках сосудов"
          ],
          "wA": [
              "поверхностная, обратимая стадия дезорганизации соединительной ткани",
              "обширный некроз соединительной ткани",
              "исходом является амилоидоз"
          ]
      },
      {
          "qID": 246,
          "qName": "К клинико-морфологическим формам ревматизма относятся …",
          "rA": [
              "церебральная",
              "полиартритическая",
              "нодозная",
              "кардиоваскулярная"
          ],
          "wA": [
              "почечная"
          ]
      },
      {
          "qID": 247,
          "qName": "Эндокардит при ревматизме может встречаться в форме …",
          "rA": [
              "диффузного вальвулита",
              "возвратно-бородавчатого"
          ],
          "wA": [
              "полипозно-язвенного",
              "острого язвенного",
              "кальцифицирующего"
          ]
      },
      {
          "qID": 248,
          "qName": "При первой атаке ревматизма эндокардит может носить характер …",
          "rA": [
              "острого диффузного",
              "острого бородавчатого"
          ],
          "wA": [
              "фибропластического",
              "возвратно-бородавчатого"
          ]
      },
      {
          "qID": 249,
          "qName": "При ремиссии ревматизма эндокардит может носить характер …",
          "rA": [
              "фибропластического"
          ],
          "wA": [
              "острого диффузного",
              "острого бородавчатого",
              "возвратно-бородавчатого"
          ]
      },
      {
          "qID": 250,
          "qName": "При повторных атаках ревматизма эндокардит может носить характер …",
          "rA": [
              "возвратно-бородавчатого"
          ],
          "wA": [
              "острого диффузного",
              "острого бородавчатого",
              "фибропластического"
          ]
      },
      {
          "qID": 251,
          "qName": "Тромбоэмболический синдром может осложнять течение … при ревматизме",
          "rA": [
              "острого бородавчатого эндокардита",
              "возвратно-бородавчатого эндокардита"
          ],
          "wA": [
              "острого диффузного эндокардита",
              "фибропластического эндокардита"
          ]
      },
      {
          "qID": 252,
          "qName": "Исходом ревматического эндокардита может быть …",
          "rA": [
              "недостаточность клапана",
              "стеноз клапанного отверстия"
          ],
          "wA": [
              "фибриноидный некроз",
              "мукоидное набухание",
              "кардиосклероз"
          ]
      },
      {
          "qID": 253,
          "qName": "Миокардит при ревматизме может встречаться в форме …",
          "rA": [
              "узелкового продуктивного (гранулематозного)",
              "диффузного межуточного экссудативного",
              "очагового межуточного экссудативного"
          ],
          "wA": [
              "возвратно-бородавчатого",
              "фибропластического"
          ]
      },
      {
          "qID": 254,
          "qName": "В состав ревматической гранулемы входят …",
          "rA": [
              "клетки Аничкова",
              "фибробласты",
              "лимфоциты"
          ],
          "wA": [
              "нейтрофильные лейкоциты",
              "клетки Пирогова-Лангханса"
          ]
      },
      {
          "qID": 255,
          "qName": "Исходом ревматического миокардита является…",
          "rA": [
              "мелкоочаговый кардиосклероз"
          ],
          "wA": [
              "порок сердца",
              "бурая атрофия сердца",
              "ожирение сердца",
              "крупноочаговый кардиосклероз"
          ]
      },
      {
          "qID": 256,
          "qName": "Перикардит при ревматизме может встречаться в форме …",
          "rA": [
              "серозного",
              "серозно-фибринозного",
              "фибринозного"
          ],
          "wA": [
              "фибринозно-гнойного",
              "геморрагического"
          ]
      },
      {
          "qID": 257,
          "qName": "«Волосатое сердце» формируется при …",
          "rA": [
              "фибринозном перикардите"
          ],
          "wA": [
              "возвратно-бородавчатом эндокардите",
              "гранулематозном миокардите",
              "диффузном вальвулите"
          ]
      },
      {
          "qID": 258,
          "qName": "Исходом ревматического перикардита может быть …",
          "rA": [
              "облитерация полости перикарда",
              "«панцирное сердце»"
          ],
          "wA": [
              "недостаточность митрального клапана",
              "диффузный кардиосклероз",
              "ожирение сердца"
          ]
      },
      {
          "qID": 259,
          "qName": "Сочетанное ревматическое поражение эндокарда и миокарда носит название …",
          "rA": [
              "ревмокардит"
          ],
          "wA": [
              "перикардит",
              "миокардит",
              "панкардит",
              "эндокардит"
          ]
      },
      {
          "qID": 260,
          "qName": "Сочетанное ревматическое поражение всех оболочек сердца носит название …",
          "rA": [
              "панкардит"
          ],
          "wA": [
              "перикардит",
              "ревмокардит",
              "миокардит",
              "эндокардит"
          ]
      },
      {
          "qID": 261,
          "qName": "К приобретенным порокам сердца относятся …",
          "rA": [
              "митральный стеноз",
              "аортальная недостаточность",
              "стеноз трехстворчатого клапана"
          ],
          "wA": [
              "тетрада Фалло",
              "дефект межжелудочковой перегородки"
          ]
      },
      {
          "qID": 262,
          "qName": "При одновременном развитии стеноза и недостаточности клапана порок называют …",
          "rA": [
              "комбинированным"
          ],
          "wA": [
              "сочетанным",
              "сложным",
              "комплексным",
              "изолированным"
          ]
      },
      {
          "qID": 263,
          "qName": "При одновременном поражении двух и более клапанов порок называют …",
          "rA": [
              "сочетанным"
          ],
          "wA": [
              "комбинированным",
              "сложным",
              "комплексным",
              "изолированным"
          ]
      },
      {
          "qID": 264,
          "qName": "При компенсированном пороке сердца наблюдается …",
          "rA": [
              "концентрическая гипертрофия миокарда"
          ],
          "wA": [
              "ожирение сердца",
              "жировая дистрофия миокарда",
              "диффузный кардиосклероз",
              "дилатация полостей сердца"
          ]
      },
      {
          "qID": 265,
          "qName": "При декомпенсированном пороке сердца наблюдается …",
          "rA": [
              "жировая дистрофия миокарда",
              "диффузный кардиосклероз",
              "дилатация полостей сердца"
          ],
          "wA": [
              "концентрическая гипертрофия миокарда",
              "ожирение сердца"
          ]
      },
      {
          "qID": 266,
          "qName": "Характерные изменения почек при системной красной волчанке (СКВ) …",
          "rA": [
              "гломерулонефрит",
              "феномен «проволочных петель» в капиллярах клубочка"
          ],
          "wA": [
              "межуточный экссудативный нефрит",
              "некротический нефроз",
              "гидронефроз"
          ]
      },
      {
          "qID": 267,
          "qName": "Важные особенности крупозной пневмонии …",
          "rA": [
              "долевой характер поражения",
              "экссудат носит фибринозный характер",
              "обязательно сопровождается плевритом"
          ],
          "wA": [
              "очаговый характер поражения",
              "обязательно сопровождается бронхитом (бронхиолитом)"
          ]
      },
      {
          "qID": 268,
          "qName": "Стадиями крупозной пневмонии являются ...",
          "rA": [
              "стадия прилива",
              "стадия красного опеченения",
              "стадия разрешения"
          ],
          "wA": [
              "стадия абсцедирования",
              "стадия карнификации"
          ]
      },
      {
          "qID": 269,
          "qName": "Основными возбудителями крупозной пневмонии являются …",
          "rA": [
              "пневмококки"
          ],
          "wA": [
              "протеи",
              "аденовирусы",
              "микобактерии",
              "стафилококки"
          ]
      },
      {
          "qID": 270,
          "qName": "Резкая гиперемия и «микробный отек» пораженной доли легкого при крупозной пневмонии характерен для стадии …",
          "rA": [
              "прилива"
          ],
          "wA": [
              "красного опеченения",
              "серого опеченения",
              "разрешения"
          ]
      },
      {
          "qID": 271,
          "qName": "Заполнение альвеол фибринозным экссудатом и большим количеством эритроцитов при крупозной пневмонии характерно для стадии …",
          "rA": [
              "красного опеченения"
          ],
          "wA": [
              "прилива",
              "серого опеченения",
              "разрешения"
          ]
      },
      {
          "qID": 272,
          "qName": "Накопление в альвеолах фибрина и лейкоцитов при крупозной пневмонии характерно для стадии …",
          "rA": [
              "серого опеченения"
          ],
          "wA": [
              "прилива",
              "красного опеченения",
              "разрешения"
          ]
      },
      {
          "qID": 273,
          "qName": "Резорбция экссудата в просвете альвеол при крупозной пневмонии характерна для стадии …",
          "rA": [
              "разрешения"
          ],
          "wA": [
              "прилива",
              "красного опеченения",
              "серого опеченения"
          ]
      },
      {
          "qID": 274,
          "qName": "Фибринозный экссудат в альвеолах при крупозной пневмонии может подвергаться …",
          "rA": [
              "рассасыванию",
              "организации",
              "абсцедированию"
          ],
          "wA": [
              "секвестрации"
          ]
      },
      {
          "qID": 275,
          "qName": "К лёгочным осложнениям крупозной пневмонии относятся …",
          "rA": [
              "абсцесс лёгкого",
              "эмпиема плевры",
              "карнификация"
          ],
          "wA": [
              "рак лёгкого",
              "бронхит"
          ]
      },
      {
          "qID": 276,
          "qName": "Карнификация легкого – это …",
          "rA": [
              "организация экссудата в просвете альвеол"
          ],
          "wA": [
              "нагноение экссудата в просвете альвеол",
              "распространение воспаления на бронхи",
              "некроз легочной ткани"
          ]
      },
      {
          "qID": 277,
          "qName": "Полиэтиологическое воспаление легких очагового характера, развивающееся в связи с бронхитом (бронхиолитом) носит название …",
          "rA": [
              "бронхопневмония"
          ],
          "wA": [
              "хронический бронхит",
              "бронхоэктатическая болезнь",
              "эмфизема легких",
              "пневмосклероз"
          ]
      },
      {
          "qID": 278,
          "qName": "Важные особенности бронхопневмонии …",
          "rA": [
              "очаговый характер поражения",
              "широкий спектр возбудителей",
              "обязательно сопровождается бронхитом (бронхиолитом)"
          ],
          "wA": [
              "долевой характер поражения",
              "обязательно сопровождается плевритом"
          ]
      },
      {
          "qID": 279,
          "qName": "В группу хронических обструктивных болезней легких входят …",
          "rA": [
              "хронический бронхит",
              "бронхиальная астма",
              "эмфизема легких"
          ],
          "wA": [
              "хроническая пневмония",
              "фиброзирующий альвеолит"
          ]
      },
      {
          "qID": 280,
          "qName": "В группу хронических рестриктивных болезней легких входят …",
          "rA": [
              "хроническая пневмония",
              "фиброзирующий альвеолит"
          ],
          "wA": [
              "хронический бронхит",
              "бронхиальная астма",
              "эмфизема легких"
          ]
      },
      {
          "qID": 281,
          "qName": "Основными морфологическими признаками хронического бронхита являются …",
          "rA": [
              "гиперплазия слизистых желез",
              "диффузная лимфогистиоцитарная инфильтрация стенки бронхов",
              "склероз стенки бронхов"
          ],
          "wA": [
              "накопление экссудата в просвете альвеол"
          ]
      },
      {
          "qID": 282,
          "qName": "Бронхоэктаз – это …",
          "rA": [
              "очаговое расширение просвета бронха"
          ],
          "wA": [
              "очаговое сужение просвета бронха",
              "закупорка просвета бронха",
              "склероз стенки бронха"
          ]
      },
      {
          "qID": 283,
          "qName": "В зависимости от формы различают бронхоэктазы …",
          "rA": [
              "мешотчатые",
              "цилиндрические"
          ],
          "wA": [
              "деструктивные",
              "веретеновидные"
          ]
      },
      {
          "qID": 284,
          "qName": "Основными разновидностями бронхиальной астмы являются …",
          "rA": [
              "экзогенная",
              "эндогенная"
          ],
          "wA": [
              "гетерогенная",
              "бронхитогенная"
          ]
      },
      {
          "qID": 285,
          "qName": "Для острого периода бронхиальной астмы характерно …",
          "rA": [
              "диффузный спазм мелких бронхов",
              "острая обструктивная эмфизема"
          ],
          "wA": [
              "заполнение альвеол фибринозным экссудатом",
              "очаговые некрозы легочной ткани"
          ]
      },
      {
          "qID": 286,
          "qName": "При повторяющихся приступах бронхиальной астмы в легких формируются …",
          "rA": [
              "склероз и гиалиноз стенки бронхов",
              "хроническая обструктивная эмфизема",
              "легочная гипертензия"
          ],
          "wA": [
              "абсцессы",
              "крупозная пневмония"
          ]
      },
      {
          "qID": 287,
          "qName": "Стойкое расширение воздухоносных пространств дистальнее терминальных бронхиол это …",
          "rA": [
              "эмфизема"
          ],
          "wA": [
              "бронхоэктаз",
              "пневмоторакс",
              "ателектаз",
              "пневмоторакс"
          ]
      },
      {
          "qID": 288,
          "qName": "Основными причинами смерти больных хроническими обструктивными заболеваниями легких являются …",
          "rA": [
              "легочно-сердечная недостаточность",
              "почечная недостаточность (амилоидоз)",
              "дыхательная недостаточность"
          ],
          "wA": [
              "анемия",
              "крупозная пневмония"
          ]
      },
      {
          "qID": 289,
          "qName": "При развитии лёгочного сердца наблюдается гипертрофия …",
          "rA": [
              "правого желудочка"
          ],
          "wA": [
              "левого желудочка",
              "левого предсердия",
              "правого предсердия"
          ]
      },
      {
          "qID": 290,
          "qName": "В зависимости от локализации выделяют рак легкого …",
          "rA": [
              "центральный",
              "периферический",
              "массивный"
          ],
          "wA": [
              "экзофитный",
              "эндофитный"
          ]
      },
      {
          "qID": 291,
          "qName": "Гистологические варианты рака легкого …",
          "rA": [
              "плоскоклеточный рак",
              "железистый рак (аденокарцинома)",
              "мелкоклеточный рак"
          ],
          "wA": [
              "папиллярный рак",
              "светлоклеточный рак"
          ]
      },
      {
          "qID": 292,
          "qName": "Первые метастазы при раке легкого обнаруживаются в …",
          "rA": [
              "регионарных лимфоузлах"
          ],
          "wA": [
              "печени",
              "контрлатеральном легком",
              "телах грудных позвонков"
          ]
      },
      {
          "qID": 293,
          "qName": "Осложнения рака легкого …",
          "rA": [
              "легочное кровотечение",
              "деструктивно-нагноительные процессы в легком",
              "ателектазы"
          ],
          "wA": [
              "крупозная пневмония",
              "бронхиальная астма"
          ]
      },
      {
          "qID": 294,
          "qName": "Группа болезней почек с первичным и преимущественным поражением клубочков – это …",
          "rA": [
              "гломерулопатии"
          ],
          "wA": [
              "тубулопатии",
              "интерстициальные болезни почек",
              "нефросклероз",
              "амилоидоз почек"
          ]
      },
      {
          "qID": 295,
          "qName": "Группа болезней почек с первичным и преимущественным поражением канальцев – это …",
          "rA": [
              "тубулопатии"
          ],
          "wA": [
              "гломерулопатии",
              "интерстициальные болезни почек",
              "нефросклероз",
              "амилоидоз почек"
          ]
      },
      {
          "qID": 296,
          "qName": "В зависимости от топографии процесса гломерулонефриты бывают …",
          "rA": [
              "интракапиллярные",
              "экстракапиллярные"
          ],
          "wA": [
              "экссудативные",
              "пролиферативные",
              "смешанные"
          ]
      },
      {
          "qID": 297,
          "qName": "В зависимости от характера воспаления гломерулонефриты бывают …",
          "rA": [
              "экссудативные",
              "пролиферативные",
              "смешанные"
          ],
          "wA": [
              "интракапиллярные",
              "экстракапиллярные"
          ]
      },
      {
          "qID": 298,
          "qName": "Характерные морфологические признаки острого гломерулонефрита …",
          "rA": [
              "пролиферация клеток клубочка",
              "фибриноидный некроз гломерулярных капилляров"
          ],
          "wA": [
              "фокальный склероз клубочка",
              "выраженное утолщение базальных мембран капилляров",
              "облитерация капсул клубочков с формированием «полулуний»"
          ]
      },
      {
          "qID": 299,
          "qName": "Подострый гломерулонефрит является …",
          "rA": [
              "экстракапилларным",
              "пролиферативным"
          ],
          "wA": [
              "интракапиллярным",
              "экссудативным",
              "мезангиальным"
          ]
      },
      {
          "qID": 300,
          "qName": "Образно название почек при подостром гломерулонефрите …",
          "rA": [
              "большие красные почки",
              "большие пестрые почки"
          ],
          "wA": [
              "большие серые почки",
              "большие сальные почки",
              "амилоидно-сморщенные почки"
          ]
      }
  ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' ); // пример вывода: 404: Not Found
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
