var tests = {
  "tests": [
      {
          "qID": 101,
          "qName": "Исходами фибринозного перикардита могут быть …",
          "rA": [
              "облитерация полости перикарда",
              "«панцирное» сердце",
              "рассасывание экссудата"
          ],
          "wA": [
              "разрыв стенки сердца",
              "инфаркт миокарда"
          ]
      },
      {
          "qID": 102,
          "qName": "В состав гнойного экссудата входят",
          "rA": [
              "нейтрофилы",
              "белки",
              "продукты распада тканей",
              "плазма и электролиты"
          ],
          "wA": [
              "эритроциты"
          ]
      },
      {
          "qID": 103,
          "qName": "Виды гнойного воспаления …",
          "rA": [
              "абсцесс",
              "флегмона",
              "эмпиема"
          ],
          "wA": [
              "гранулема",
              "гангрена"
          ]
      },
      {
          "qID": 104,
          "qName": "Очаговая форма гнойного воспаления с образованием полости – это …",
          "rA": [
              "абсцесс"
          ],
          "wA": [
              "флегмона",
              "гранулема",
              "эмпиема",
              "гангрена"
          ]
      },
      {
          "qID": 105,
          "qName": "Разлитое гнойное воспаление с диффузным пропитыванием тканей – это …",
          "rA": [
              "флегмона"
          ],
          "wA": [
              "абсцесс",
              "гранулема",
              "эмпиема",
              "гангрена"
          ]
      },
      {
          "qID": 106,
          "qName": "Образование свищей чаще осложняет … воспаление",
          "rA": [
              "гнойное"
          ],
          "wA": [
              "катаральное",
              "фибринозное",
              "интерстициальное"
          ]
      },
      {
          "qID": 107,
          "qName": "Гнойное воспаление характеризуется …",
          "rA": [
              "преобладанием нейтрофилов в экссудате",
              "участками гистолиза"
          ],
          "wA": [
              "образованием кожистоподобной пленки",
              "наличием слизи в экссудате",
              "преобладанием эритроцитов в экссудате"
          ]
      },
      {
          "qID": 108,
          "qName": "Хроническое (продуктивное) воспаление характеризуется …",
          "rA": [
              "прогрессирующим склерозом",
              "атрофией тканевых элементов",
              "размножением клеток гистиогенного и гематогенного происхождения"
          ],
          "wA": [
              "образованием фибринозного экссудата",
              "распадом тканей"
          ]
      },
      {
          "qID": 109,
          "qName": "Виды хронического (продуктивного) воспаления …",
          "rA": [
              "интерстициальное",
              "гранулематозное"
          ],
          "wA": [
              "дифтеритическое",
              "крупозное",
              "серозное"
          ]
      },
      {
          "qID": 110,
          "qName": "К хроническому (продуктивному) воспалению приводят …",
          "rA": [
              "аутоиммунные болезни",
              "персистирующие инфекции",
              "длительное воздействие токсичных веществ"
          ],
          "wA": [
              "артериальная гипертензия",
              "хроническое венозное полнокровие"
          ]
      },
      {
          "qID": 111,
          "qName": "В очаге продуктивного воспаления макрофаги трансформируются в …",
          "rA": [
              "гигантские клетки",
              "эпителиоидные клетки"
          ],
          "wA": [
              "лимфоциты",
              "фибробласты",
              "плазматические клетки"
          ]
      },
      {
          "qID": 112,
          "qName": "Характерные особенности гигантской клетки Пирогова-Лангханса …",
          "rA": [
              "большое количество ядер",
              "ядра располагаются по периферии клетки в виде подковы или кольца",
              "отсутствие первичных лизосом"
          ],
          "wA": [
              "ядра располагаются в центре клетки",
              "активный фагоцитоз"
          ]
      },
      {
          "qID": 113,
          "qName": "Гранулёма – это …",
          "rA": [
              "стойкое скопление способных к фагоцитозу клеток"
          ],
          "wA": [
              "скопление нейтрофильных лейкоцитов",
              "скопление крови",
              "наличие фибринозной плёнки"
          ]
      },
      {
          "qID": 114,
          "qName": "При гранулематозном воспалении преобладающей является … тканевая реакция",
          "rA": [
              "продуктивная"
          ],
          "wA": [
              "экссудативная",
              "альтеративная",
              "катаральная"
          ]
      },
      {
          "qID": 115,
          "qName": "Туберкулезную гранулему характеризуют …",
          "rA": [
              "преобладание эпителиоидных клеток",
              "наличие казеозного некроза",
              "наличие гигантских клеток Пирогова-Лангханса"
          ],
          "wA": [
              "наличие нейтрофильных лейкоцитов",
              "обилие сосудов с явлениями эндоваскулита"
          ]
      },
      {
          "qID": 116,
          "qName": "Туберкулёзную гранулёму формируют …",
          "rA": [
              "эпителиоидные клетки",
              "лимфоциты",
              "гигантские клетки Пирогова-Лангханса"
          ],
          "wA": [
              "лейкоциты",
              "эритроциты"
          ]
      },
      {
          "qID": 117,
          "qName": "Для сифилитической гуммы характерны …",
          "rA": [
              "наличие сосудов",
              "преобладание плазматических клеток",
              "наличие некроза в центре",
              "эндоваскулиты"
          ],
          "wA": [
              "большое количество гигантских клеток Пирогова Лангханса"
          ]
      },
      {
          "qID": 118,
          "qName": "Особенностями гранулем вокруг инородных тел являются …",
          "rA": [
              "продуктивная тканевая реакция",
              "преобладание гигантских клеток инородных тел"
          ],
          "wA": [
              "формирование абсцессов",
              "экссудативная тканевая реакция",
              "преобладание гигантских клеток Пирогова-Лангханса"
          ]
      },
      {
          "qID": 119,
          "qName": "Благоприятными исходами воспаления являются …",
          "rA": [
              "полная регенерация",
              "склероз"
          ],
          "wA": [
              "некроз",
              "генерализация"
          ]
      },
      {
          "qID": 120,
          "qName": "Неблагоприятными исходами воспаления являются …",
          "rA": [
              "хронизация",
              "генерализация"
          ],
          "wA": [
              "полная регенерация",
              "склероз"
          ]
      },
      {
          "qID": 121,
          "qName": "Приспособительные процессы …",
          "rA": [
              "охватывают как здоровье, так и болезнь",
              "направлены на сохранение вида"
          ],
          "wA": [
              "встречаются только при патологии",
              "направлены на «сохранение себя»"
          ]
      },
      {
          "qID": 122,
          "qName": "Приспособление (адаптация) может проявляться …",
          "rA": [
              "атрофией",
              "гипертрофией",
              "организацией"
          ],
          "wA": [
              "дистрофией",
              "некрозом"
          ]
      },
      {
          "qID": 123,
          "qName": "Компенсаторные процессы …",
          "rA": [
              "встречаются только при патологии",
              "направлены на «сохранение себя»"
          ],
          "wA": [
              "охватывают как здоровье, так и болезнь",
              "направлены на сохранение вида"
          ]
      },
      {
          "qID": 124,
          "qName": "Компенсация может проявляться …",
          "rA": [
              "гипертрофией"
          ],
          "wA": [
              "атрофией",
              "дистрофией",
              "некрозом",
              "организацией"
          ]
      },
      {
          "qID": 125,
          "qName": "Фазами развития компенсаторного процесса являются …",
          "rA": [
              "фазы становления",
              "фазы закрепления",
              "фазы истощения"
          ],
          "wA": [
              "фазы репарации"
          ]
      },
      {
          "qID": 126,
          "qName": "Атрофия – это …",
          "rA": [
              "прижизненное уменьшение объема клеток, тканей, органов"
          ],
          "wA": [
              "увеличение объема клеток, тканей, органов",
              "замещение соединительной тканью",
              "переход одного вида ткани в другой, родственный ей вид"
          ]
      },
      {
          "qID": 127,
          "qName": "Проявлениями местной атрофии являются …",
          "rA": [
              "атрофия от давления",
              "нейротическая атрофия",
              "дисфункциональная атрофия"
          ],
          "wA": [
              "алиментарное истощение"
          ]
      },
      {
          "qID": 128,
          "qName": "Внешний вид органа при атрофии …",
          "rA": [
              "размеры обычно уменьшены",
              "цвет бурый",
              "возможно сморщивание"
          ],
          "wA": [
              "размеры резко увеличены"
          ]
      },
      {
          "qID": 129,
          "qName": "Гипертрофия – это …",
          "rA": [
              "увеличение объема клеток, тканей, органов"
          ],
          "wA": [
              "прижизненное уменьшение объема клеток, тканей, органов",
              "замещение соединительной тканью",
              "переход одного вида ткани в другой, родственный ей вид"
          ]
      },
      {
          "qID": 130,
          "qName": "Видами приспособительной (адаптивной) гипертрофии являются …",
          "rA": [
              "гипертрофические разрастания",
              "нейрогуморальная"
          ],
          "wA": [
              "викарная",
              "алиментарная",
              "рабочая"
          ]
      },
      {
          "qID": 131,
          "qName": "Видами компенсаторной гипертрофии являются …",
          "rA": [
              "викарная",
              "рабочая"
          ],
          "wA": [
              "гипертрофические разрастания",
              "нейрогуморальная",
              "алиментарная"
          ]
      },
      {
          "qID": 132,
          "qName": "Примерами компенсаторной гипертрофии являются …",
          "rA": [
              "гипертрофия сердца при пороках клапанов",
              "гипертрофия стенки мочевого пузыря при нодулярной гиперплазии простаты"
          ],
          "wA": [
              "гипертрофия беременной матки",
              "гипертрофия молочных желёз при лактации",
              "гинекомастия"
          ]
      },
      {
          "qID": 133,
          "qName": "Организация – это …",
          "rA": [
              "замещение соединительной тканью"
          ],
          "wA": [
              "прижизненное уменьшение объема клеток, тканей, органов",
              "увеличение объема клеток, тканей, органов",
              "переход одного вида ткани в другой, родственный ей вид"
          ]
      },
      {
          "qID": 134,
          "qName": "Организация является благоприятным исходом …",
          "rA": [
              "тромбоза",
              "некроза"
          ],
          "wA": [
              "патологических накоплений (дистрофий)",
              "амилоидоза"
          ]
      },
      {
          "qID": 135,
          "qName": "Метаплазия – это …",
          "rA": [
              "переход одного вида ткани в другой, родственный ей вид"
          ],
          "wA": [
              "прижизненное уменьшение объема клеток, тканей, органов",
              "увеличение объема клеток, тканей, органов",
              "замещение соединительной тканью"
          ]
      },
      {
          "qID": 136,
          "qName": "Видами регенерации являются …",
          "rA": [
              "репаративная",
              "патологическая",
              "физиологическая"
          ],
          "wA": [
              "старческая",
              "воспалительная"
          ]
      },
      {
          "qID": 137,
          "qName": "Формами регенерации являются …",
          "rA": [
              "клеточная",
              "внутриклеточная"
          ],
          "wA": [
              "органная",
              "викарная",
              "заместительная"
          ]
      },
      {
          "qID": 138,
          "qName": "Проявлениями репаративной регенерации являются …",
          "rA": [
              "возникновение рубца на месте кожной раны",
              "регенерационная гипертрофия миокарда"
          ],
          "wA": [
              "обновление клеточных элементов крови",
              "образование узлов - регенератов при циррозе печени"
          ]
      },
      {
          "qID": 139,
          "qName": "Регенерационная гипертрофия миокарда осуществляется путем …",
          "rA": [
              "гиперплазии внутриклеточных ультраструктур",
              "гиперплазии волокнистых структур стромы",
              "гиперплазии интрамуральных сосудов"
          ],
          "wA": [
              "гиперплазии кардиомиоцитов"
          ]
      },
      {
          "qID": 140,
          "qName": "Основную массу созревающей грануляционной ткани составляют …",
          "rA": [
              "фибробласты",
              "коллагеновые волокна"
          ],
          "wA": [
              "лейкоциты",
              "эритроциты"
          ]
      },
      {
          "qID": 141,
          "qName": "Атипизм опухоли бывает …",
          "rA": [
              "морфологическим",
              "биохимическим",
              "антигенным",
              "функциональным"
          ],
          "wA": [
              "физическим"
          ]
      },
      {
          "qID": 142,
          "qName": "Морфологический атипизм опухоли может быть …",
          "rA": [
              "тканевым",
              "клеточным"
          ],
          "wA": [
              "биохимическим",
              "антигенным",
              "функциональным"
          ]
      },
      {
          "qID": 143,
          "qName": "Тканевой атипизм выражается в …",
          "rA": [
              "нарушении соотношения паренхимы и стромы"
          ],
          "wA": [
              "изменении формы и размеров клеток",
              "гиперхромии ядер",
              "появлении патологических митозов",
              "гипохромии ядер"
          ]
      },
      {
          "qID": 144,
          "qName": "Клеточный атипизм выражается в …",
          "rA": [
              "изменении формы и размеров клеток",
              "гиперхромии ядер",
              "появлении патологических митозов"
          ],
          "wA": [
              "нарушении соотношения паренхимы и стромы",
              "гипохромии ядер"
          ]
      },
      {
          "qID": 145,
          "qName": "Видами роста опухоли по отношению к окружающим тканям являются …",
          "rA": [
              "экспансивный",
              "инвазивный"
          ],
          "wA": [
              "прогрессивный",
              "эндофитный",
              "экзофитный"
          ]
      },
      {
          "qID": 146,
          "qName": "Видами роста опухоли по отношению к просвету полого органа являются …",
          "rA": [
              "эндофитный",
              "экзофитный"
          ],
          "wA": [
              "экспансивный",
              "прогрессивный",
              "инвазивный"
          ]
      },
      {
          "qID": 147,
          "qName": "К признакам экспансивного роста опухоли относятся …",
          "rA": [
              "рост с оттеснением соседних тканей",
              "образование капсулы вокруг узла"
          ],
          "wA": [
              "инфильтрирующий рост",
              "прорастание базальной мембраны",
              "отсутствие четкой границы от неопухолевой ткани"
          ]
      },
      {
          "qID": 148,
          "qName": "Признаками инфильтрирующего роста опухолей являются …",
          "rA": [
              "прорастание опухолью капсулы органов и стенки сосудов",
              "проникновение опухолевых клеток в соседние органы"
          ],
          "wA": [
              "наличие капсулы",
              "четкие границы опухолевой ткани"
          ]
      },
      {
          "qID": 149,
          "qName": "Возможными путями метастазирования злокачественных  опухолей из эпителия являются …",
          "rA": [
              "гематогенный",
              "лимфогенный",
              "имплантационный"
          ],
          "wA": [
              "ликворогенный"
          ]
      },
      {
          "qID": 150,
          "qName": "Доброкачественную опухоль характеризуют …",
          "rA": [
              "высокая дифференцировка опухолевых клеток",
              "экспансивный рост"
          ],
          "wA": [
              "низкая дифференцировка опухолевых клеток",
              "способность к метастазированию",
              "инфильтративный рост"
          ]
      },
      {
          "qID": 151,
          "qName": "Злокачественную опухоль характеризует …",
          "rA": [
              "низкая дифференцировка опухолевых клеток",
              "способность к метастазированию",
              "инфильтративный рост"
          ],
          "wA": [
              "высокая дифференцировка опухолевых клеток",
              "экспансивный рост"
          ]
      },
      {
          "qID": 152,
          "qName": "К вторичным изменениям в опухолях относятся …",
          "rA": [
              "некроз и кровоизлияния",
              "ослизнение",
              "гиалиноз стромы",
              "кальциноз"
          ],
          "wA": [
              "метастазирование"
          ]
      },
      {
          "qID": 153,
          "qName": "Местное влияние опухоли на организм выражается в …",
          "rA": [
              "сдавлении и разрушении окружающих тканей",
              "обтурации полого органа"
          ],
          "wA": [
              "кахексии",
              "паранеопластических синдромах"
          ]
      },
      {
          "qID": 154,
          "qName": "Общее влияние опухоли на организм выражается в …",
          "rA": [
              "кахексии",
              "паранеопластических синдромах"
          ],
          "wA": [
              "сдавлении и разрушении окружающих тканей",
              "обтурации полого органа"
          ]
      },
      {
          "qID": 155,
          "qName": "Для сарком характерно:",
          "rA": [
              "чаще встречаются у детей",
              "метастазируют преимущественно гематогенно"
          ],
          "wA": [
              "чаще встречаются у взрослых",
              "метастазируют преимущественно лимфогенно"
          ]
      },
      {
          "qID": 156,
          "qName": "Для карцином (рака) характерно …",
          "rA": [
              "чаще встречаются у взрослых",
              "метастазируют преимущественно лимфогенно"
          ],
          "wA": [
              "чаще встречаются у детей",
              "метастазируют преимущественно гематогенно"
          ]
      },
      {
          "qID": 157,
          "qName": "К доброкачественным (зрелым) опухолям мезенхимального происхождения относятся …",
          "rA": [
              "остеома",
              "ангиома"
          ],
          "wA": [
              "меланома",
              "карцинома",
              "флегмона"
          ]
      },
      {
          "qID": 158,
          "qName": "К злокачественным (незрелым) опухолям мезенхимального происхождения относятся …",
          "rA": [
              "липосаркома"
          ],
          "wA": [
              "меланома",
              "атерома",
              "аденокарцинома",
              "рабдомиома"
          ]
      },
      {
          "qID": 159,
          "qName": "Злокачественная опухоль костной ткани …",
          "rA": [
              "остеосаркома"
          ],
          "wA": [
              "остеома",
              "хондросаркома",
              "ангиосаркома"
          ]
      },
      {
          "qID": 160,
          "qName": "К злокачественным опухолям соединительнотканного происхождения относятся …",
          "rA": [
              "злокачественная гистиоцитома",
              "фибросаркома"
          ],
          "wA": [
              "фиброма",
              "липосаркома"
          ]
      },
      {
          "qID": 161,
          "qName": "Источником сарком могут быть … ткани",
          "rA": [
              "костная",
              "мышечная",
              "жировая"
          ],
          "wA": [
              "нервная",
              "эпителиальная"
          ]
      },
      {
          "qID": 162,
          "qName": "Саркому характеризует …",
          "rA": [
              "преимущественно гематогенное метастазирование",
              "развитие из ткани мезенхимального происхождения"
          ],
          "wA": [
              "опухолевые клетки формируют железы",
              "возникновение, большей частью, в пожилом и старческом возрасте",
              "развитие из эпителиальной ткани"
          ]
      },
      {
          "qID": 163,
          "qName": "К доброкачественным эпителиальным опухолям относятся …",
          "rA": [
              "аденома",
              "папиллома"
          ],
          "wA": [
              "ангиома",
              "саркома",
              "меланома"
          ]
      },
      {
          "qID": 164,
          "qName": "Папиллома может развиваться из …",
          "rA": [
              "многослойного ороговевающего эпителия",
              "многослойного неороговевающего эпителия",
              "переходного эпителия"
          ],
          "wA": [
              "однослойного эпителия слизистых оболочек",
              "железистой паренхимы органов"
          ]
      },
      {
          "qID": 165,
          "qName": "Папиллома может возникать …",
          "rA": [
              "на коже",
              "в полости рта",
              "в мочевом пузыре"
          ],
          "wA": [
              "в желудке",
              "в печени"
          ]
      },
      {
          "qID": 166,
          "qName": "Микроскопическая характеристика папилломы …",
          "rA": [
              "толщина пласта опухолевой паренхимы неравномерная",
              "сохраняется полярность и комплексность",
              "базальная мембрана целостная",
              "часто наблюдается гиперкератоз"
          ],
          "wA": [
              "базальная мембрана разрушена"
          ]
      },
      {
          "qID": 167,
          "qName": "Аденома может развиваться из …",
          "rA": [
              "однослойного эпителия слизистых оболочек",
              "железистой паренхимы органов"
          ],
          "wA": [
              "многослойного ороговевающего эпителия",
              "многослойного неороговевающего эпителия",
              "переходного эпителия"
          ]
      },
      {
          "qID": 168,
          "qName": "Характерные признаки аденомы …",
          "rA": [
              "развивается из железистого эпителия",
              "тканевой атипизм"
          ],
          "wA": [
              "часто развивается на коже",
              "клеточный атипизм",
              "инвазивный рост"
          ]
      },
      {
          "qID": 169,
          "qName": "Микроскопическая характеристика аденомы …",
          "rA": [
              "построена из многочисленных желез",
              "железы могут иметь различную величину и форму",
              "каждая железа имеет непрерывную базальную мембрану"
          ],
          "wA": [
              "часто встречаются «раковые жемчужины»",
              "выстилка желез образована атипичными полиморфными клетками"
          ]
      },
      {
          "qID": 170,
          "qName": "Термином «рак» (карцинома) обозначают …",
          "rA": [
              "злокачественные эпителиальные опухоли"
          ],
          "wA": [
              "все злокачественные опухоли",
              "все эпителиальные опухоли",
              "доброкачественные эпителиальные опухоли"
          ]
      },
      {
          "qID": 171,
          "qName": "К злокачественным эпителиальным опухолям относятся …",
          "rA": [
              "плоскоклеточный рак",
              "аденокарцинома",
              "слизистый рак"
          ],
          "wA": [
              "остеосаркома",
              "меланома"
          ]
      },
      {
          "qID": 172,
          "qName": "Характерные признаки рака (карциномы) …",
          "rA": [
              "имеет эпителиальное происхождение",
              "первые метастазы лимфогенные",
              "чаще встречается у взрослых"
          ],
          "wA": [
              "имеет мезенхимальное происхождение",
              "первые метастазы гематогенные"
          ]
      },
      {
          "qID": 173,
          "qName": "«Рак на месте» (carcinoma in situ) – это …",
          "rA": [
              "неинвазивный рак"
          ],
          "wA": [
              "инвазивный рак без метастазирования",
              "инвазивный рак с метастазированием в лимфоузлы",
              "инвазивный рак с гематогенными метастазами"
          ]
      },
      {
          "qID": 174,
          "qName": "Плоскоклеточный рак первично может локализоваться в …",
          "rA": [
              "шейке матки",
              "нижней губе",
              "пищеводе",
              "легком"
          ],
          "wA": [
              "печени"
          ]
      },
      {
          "qID": 175,
          "qName": "«Раковые жемчужины» характерны для …",
          "rA": [
              "плоскоклеточного рака"
          ],
          "wA": [
              "аденокарциномы",
              "меланомы",
              "остеосаркомы",
              "переходноклеточного рака"
          ]
      },
      {
          "qID": 176,
          "qName": "Аденокарцинома первично может локализоваться в …",
          "rA": [
              "желудке",
              "легком",
              "толстой кишке",
              "эндометрии"
          ],
          "wA": [
              "миокарде"
          ]
      },
      {
          "qID": 177,
          "qName": "Характерные признаки аденокарциномы …",
          "rA": [
              "развивается из железистого эпителия",
              "инвазивный рост",
              "выраженный тканевой атипизм",
              "выраженный клеточный атипизм"
          ],
          "wA": [
              "экспансивный рост"
          ]
      },
      {
          "qID": 178,
          "qName": "Первые метастазы рака локализуются в …",
          "rA": [
              "регионарных лимфоузлах"
          ],
          "wA": [
              "легких",
              "костях",
              "головном мозге",
              "печени"
          ]
      },
      {
          "qID": 179,
          "qName": "Гистогенез недифференцированных опухолей помогает установить …",
          "rA": [
              "иммуногистохимическое исследование"
          ],
          "wA": [
              "электронная микроскопия",
              "морфометрия",
              "цитологическое исследование",
              "биохимическое исследование"
          ]
      },
      {
          "qID": 180,
          "qName": "Зрелыми (доброкачественными) опухолями головного мозга являются …",
          "rA": [
              "астроцитома",
              "эпендимома"
          ],
          "wA": [
              "глиобластома",
              "невринома",
              "медуллобластома"
          ]
      },
      {
          "qID": 181,
          "qName": "Особенности опухолей ЦНС …",
          "rA": [
              "метастазируют обычно в пределах ЦНС по току ликвора",
              "головной мозг поражается чаще, чем спинной",
              "клинически всегда протекают злокачественно"
          ],
          "wA": [
              "встречаются исключительно у детей",
              "всегда имеют зрелое (дифференцированное) строение"
          ]
      },
      {
          "qID": 182,
          "qName": "Характерные признаки глиобластомы …",
          "rA": [
              "выраженный полиморфизм клеток и ядер",
              "пестрый вид на разрезе",
              "имеет глиальное происхождение"
          ],
          "wA": [
              "всегда связана с мозговыми оболочками",
              "не метастазирует"
          ]
      },
      {
          "qID": 183,
          "qName": "Характерные признаки менингиомы …",
          "rA": [
              "всегда имеет связь с мозговой оболочкой",
              "не метастазирует",
              "экспансивный рост"
          ],
          "wA": [
              "локализуется в белом веществе головного мозга",
              "выраженный тканевой и клеточный атипизм"
          ]
      },
      {
          "qID": 184,
          "qName": "Характерные признаки невриномы (шванномы) …",
          "rA": [
              "растет из оболочек нервов",
              "тканевой атипизм"
          ],
          "wA": [
              "растет непосредственно из нервного волокна",
              "инвазивный рост",
              "клеточный атипизм"
          ]
      },
      {
          "qID": 185,
          "qName": "К разновидностям невусов относятся …",
          "rA": [
              "пограничный",
              "внутридермальный",
              "сложный"
          ],
          "wA": [
              "простой",
              "составной"
          ]
      },
      {
          "qID": 186,
          "qName": "Меланома первично может локализоваться в …",
          "rA": [
              "коже",
              "глазном яблоке",
              "надпочечнике"
          ],
          "wA": [
              "щитовидной железе",
              "гипофизе"
          ]
      },
      {
          "qID": 187,
          "qName": "Характерные признаки меланомы …",
          "rA": [
              "инвазивный (инфильтрирующий) рост",
              "может возникать в результате малигнизации невуса",
              "выраженный клеточный полиморфизм"
          ],
          "wA": [
              "экспансивный рост",
              "может возникать в результате малигнизации папилломы"
          ]
      },
      {
          "qID": 188,
          "qName": "Анемия может проявляться … в крови",
          "rA": [
              "снижением концентрации гемоглобина",
              "снижением количества эритроцитов",
              "повышением цветового показателя",
              "снижением цветового показателя"
          ],
          "wA": [
              "появлением бластных клеток"
          ]
      },
      {
          "qID": 189,
          "qName": "Этиологическими факторами анемии могут быть …",
          "rA": [
              "кровопотеря",
              "эритропоэтическая гипофункция костного мозга",
              "повышенное кроверазрушение (гемолиз)"
          ],
          "wA": [
              "эритропоэтическая гиперфункция костного мозга"
          ]
      },
      {
          "qID": 190,
          "qName": "Для железодефицитной анемии характерны … эритроцитов",
          "rA": [
              "гипохромия",
              "микроцитоз"
          ],
          "wA": [
              "гиперхромия",
              "макроцитоз"
          ]
      },
      {
          "qID": 191,
          "qName": "Для В12-дефицитной (пернициозной) анемии характерно развитие …",
          "rA": [
              "атрофического гастрита",
              "гунтеровского глоссита",
              "фуникулярного миелоза"
          ],
          "wA": [
              "пневмосклероза",
              "гидронефроза"
          ]
      },
      {
          "qID": 192,
          "qName": "Общим проявлением хронических анемий могут являться …",
          "rA": [
              "гиперплазия костного мозга",
              "ретикулоцитоз периферической крови",
              "патологические включения в эритроцитах",
              "дистрофические изменения внутренних органов"
          ],
          "wA": [
              "появление бластных клеток в периферической крови"
          ]
      },
      {
          "qID": 193,
          "qName": "Причинами наследственных гемолитических анемий могут быть …",
          "rA": [
              "мембранопатии",
              "ферментопатии",
              "гемоглобинопатии"
          ],
          "wA": [
              "бластопатии"
          ]
      },
      {
          "qID": 194,
          "qName": "К опухолевым заболеваниям гемопоэтической ткани относятся …",
          "rA": [
              "лейкозы",
              "лимфомы"
          ],
          "wA": [
              "апластические синдромы",
              "гемангиомы",
              "лейкемоидные реакции"
          ]
      },
      {
          "qID": 195,
          "qName": "Для лейкозов характерно …",
          "rA": [
              "первичное поражение костного мозга",
              "первично системный характер поражения"
          ],
          "wA": [
              "первичное поражение внекостномозговой ткани",
              "первично очаговый характер поражения"
          ]
      },
      {
          "qID": 196,
          "qName": "Для лимфом характерно …",
          "rA": [
              "первичное поражение внекостномозговой ткани",
              "первично очаговый характер поражения"
          ],
          "wA": [
              "первичное поражение костного мозга",
              "первично системный характер поражения"
          ]
      },
      {
          "qID": 197,
          "qName": "Лейкозы по степени зрелости лейкозных клеток делятся на …",
          "rA": [
              "острые",
              "хронические"
          ],
          "wA": [
              "подострые",
              "моноклоновые",
              "поликлоновые"
          ]
      },
      {
          "qID": 198,
          "qName": "Общими проявлениями острых лейкозов являются …",
          "rA": [
              "бластоз периферической крови и костного мозга",
              "гипопластическая анемия",
              "лейкопения"
          ],
          "wA": [
              "тромбоцитоз",
              "ретикулоцитоз"
          ]
      },
      {
          "qID": 199,
          "qName": "Признаками недифференцированного лейкоза являются …",
          "rA": [
              "клетки в пунктатах костного мозга не поддаются морфологической идентификации",
              "некротический гингивит и тонзиллит",
              "геморрагический диатез",
              "сепсис"
          ],
          "wA": [
              "лейкемические инфильтраты состоят из клеток миелоцитов"
          ]
      },
      {
          "qID": 200,
          "qName": "При остром миелобластном лейкозе в органах кроветворения разрастаются …",
          "rA": [
              "миелобласты"
          ],
          "wA": [
              "миеломные клетки",
              "миелоциты",
              "плазмобласты",
              "эритробласты"
          ]
      }
  ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' ); // пример вывода: 404: Not Found
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
