var tests = {
    "tests": [
        {
            "qID": 101,
            "qName": "ЭНТАЛЬПИЯ ОБРАЗОВАНИЯ РАВНА О:",
            "rA": [
                "О2"
            ],
            "wA": [
                "Н2О",
                "NaCl",
                "СН4",
                "НСl"
            ]
        },
        {
            "qID": 102,
            "qName": "ЭНТРОПИЯ УВЕЛИЧИВАЕТСЯ В РЕАКЦИИ",
            "rA": [
                "NH4N02=N2+2H20"
            ],
            "wA": [
                "2Н2+02=2Н20",
                "4HCl+02=2C12+2H20",
                "Cа0+С02=СаСО3",
                "BaO+S03=BaS04"
            ]
        },
        {
            "qID": 103,
            "qName": "ТЕПЛОВОЙ ЭФФЕКТ ПРОЦЕССА НЕ ЗАВИСИТ ОТ ПУТИ ПРОЦЕССА, А ОПРЕДЕЛЯЕТСЯ НАЧАЛЬНЫМ И КОНЕЧНЫМ СОСТОЯНИЕМ СИСТЕМЫ - ЭТО ЗАКОН",
            "rA": [
                "Гесса"
            ],
            "wA": [
                "Клапейрона",
                "Фика",
                "Дальтона"
            ]
        },
        {
            "qID": 104,
            "qName": "ЭКЗЕРГОНИЧЕСКИИ ПРОЦЕСС, ЕСЛИ",
            "rA": [
                "ΔG>0"
            ],
            "wA": [
                "ΔG>0",
                "ΔG=0",
                "ΔH<0",
                "ΔH>0"
            ]
        },
        {
            "qID": 105,
            "qName": "ЗАКОН, ЛЕЖАЩИЙ В ОСНОВЕ РАСЧЕТОВ КАЛОРИЙНОСТИ ПРОДУКТОВ ПИТАНИЯ",
            "rA": [
                "Гесса"
            ],
            "wA": [
                "Вант-Гоффа",
                "Сеченова",
                "Рауля",
                "Клапейрона"
            ]
        },
        {
            "qID": 106,
            "qName": "ДЛЯ ОБРАТИМЫХ ПРОЦЕССОВ",
            "rA": [
                "ΔG=0"
            ],
            "wA": [
                "ΔG<0",
                "ΔG>0"
            ]
        },
        {
            "qID": 107,
            "qName": "ЭНДЭРГОНИЧЕСКИЕ РЕАКЦИИ В ОРГАНИЗМЕ ТРЕБУЮТ ПОДВОДА ЭНЕРГИИ, ТАК КАК",
            "rA": [
                "ΔG>0"
            ],
            "wA": [
                "ΔG<0",
                "ΔG=0",
                "ΔG≤0"
            ]
        },
        {
            "qID": 108,
            "qName": "ПРИ ГИДРОЛИЗЕ ЛЮБОГО ПЕПТИДА ΔH<0, ΔS>0 ПРОТЕКАЕТ ЛИ ПРОЦЕСС САМОПРОИЗВОЛЬНО?",
            "rA": [
                "да, т.к. ΔG<0"
            ],
            "wA": [
                "да, т.к. ΔG>0",
                "нет, т.к. ΔG>0",
                "нет, т.к. ΔG<0"
            ]
        },
        {
            "qID": 109,
            "qName": "ДЛЯ ПРОЦЕССА ФОТОСИНТЕЗА ΔН>0, ΔS<0, ПРОТЕКАЕТ ЛИ ПРОЦЕСС САМОПРОИЗВОЛЬНО?",
            "rA": [
                "процесс неосуществим при любых температурах"
            ],
            "wA": [
                "процесс осуществим при любых температурах",
                "процесс осуществим при высоких температурах",
                "процесс осуществим при низких температурах"
            ]
        },
        {
            "qID": 110,
            "qName": "ИЗМЕНЕНИЕ КОНЦЕНТРАЦИИ ВЕЩЕСТВА ЗА ЕДИНИЦУ ВРЕМЕНИ ЭТО",
            "rA": [
                "скорость реакции"
            ],
            "wA": [
                "константа скорости",
                "энергия активации",
                "константа равновесия"
            ]
        },
        {
            "qID": 111,
            "qName": "РАЗМЕРНОСТЬ СКОРОСТИ ХИМИЧЕСКИХ РЕАКЦИИ",
            "rA": [
                "моль/л*с"
            ],
            "wA": [
                "км/час",
                "кДж/моль",
                "с^-1"
            ]
        },
        {
            "qID": 112,
            "qName": "ЧИСЛО МОЛЕКУЛ, УЧАСТВУЮЩИХ В ЭЛЕМЕНТАРНОМ АКТЕ ХИМИЧЕСКОГО ВЗАИМОДЕЙСТВИЯ",
            "rA": [
                "молекулярность реакции"
            ],
            "wA": [
                "порядок реакции",
                "скорость реакции",
                "стехиометрия"
            ]
        },
        {
            "qID": 113,
            "qName": "ВРЕМЯ, ЗА КОТОРОЕ ПРОРЕАГИРУЕТ ПОЛОВИНА ВЕЩЕСТВА ЭТО",
            "rA": [
                "ПЕРИОД ПОЛУПРЕВРАЩЕНИЯ"
            ],
            "wA": [
                "ПОРЯДОК РЕАКЦИИ",
                "КОНСТАНТА СКОРОСТИ",
                "КОНСТАНТА РАВНОВЕСИЯ"
            ]
        },
        {
            "qID": 114,
            "qName": "МОЛЕКУЛЯРНОСТЬ ЭЛЕМЕНТАРНОЙ РЕАКЦИИ 2N0 + 02 = 2NO2",
            "rA": [
                "2"
            ],
            "wA": [
                "0",
                "1",
                "3"
            ]
        },
        {
            "qID": 115,
            "qName": "ЗАКОН ДЕЙСТВУЮЩИХ МАСС УСТАНАВЛИВАЕТ ЗАВИСИМОСТЬ МЕЖДУ СКОРОСТЬЮ ХИМИЧЕСКОЙ РЕАКЦИИ И",
            "rA": [
                "концентрацией реагирующих веществ"
            ],
            "wA": [
                "температурой",
                "массой реагирующих веществ",
                "количеством реагирующих веществ",
                "количеством продуктов реакции"
            ]
        },
        {
            "qID": 116,
            "qName": "СУММА ПОКАЗАТЕЛЕЙ СТЕПЕНЕЙ ПРИ КОНЦЕНТРАЦИЯХ, ВХОДЯЩИХ В КИНЕТИЧЕСКОЕ УРАВНЕНИЕ НАЗЫВАЕТСЯ",
            "rA": [
                "общим кинетическим порядком реакции"
            ],
            "wA": [
                "молекулятностью реакции",
                "порядком реакции по веществу",
                "стехиометрическими коэффициентами",
                "константой скорости реакции"
            ]
        },
        {
            "qID": 117,
            "qName": "БИОХИМИЧЕСКИЕ РЕАКЦИИ, ПРОТЕКАЮЩИЕ В ОРГАНИЗМЕ, ЯВЛЯЮТСЯ РЕАКЦИЯМИ",
            "rA": [
                "1 порядка, переходящие в реакции 0 порядка"
            ],
            "wA": [
                "1 порядка",
                "0 порядка",
                "2 порядка, переходящие в реакции 1 порядка",
                "обратимыми"
            ]
        },
        {
            "qID": 118,
            "qName": "ЛИМИТИРУЮЩАЯ СТАДИЯ СЛОЖНОИ ХИМИЧЕСКОИ РЕАКЦИИ ЯВЛЯЕТСЯ",
            "rA": [
                "самой медленной"
            ],
            "wA": [
                "самой быстрой",
                "самой сложной",
                "стадией, имеющей высокую энергию активации",
                "стадией, имеющей первый порядок"
            ]
        },
        {
            "qID": 119,
            "qName": "ВЫХОД МОЧЕВИНЫ ПРИ УВЕЛИЧЕНИИ ДАВЛЕНИЯ C02 + 2NH3 ↔ H2O + СО(NH2)2",
            "rA": [
                "увеличится"
            ],
            "wA": [
                "уменьшится",
                "не изменится"
            ]
        },
        {
            "qID": 120,
            "qName": "ΔG = - RTlnk это уравнение",
            "rA": [
                "изохоры химической реакции"
            ],
            "wA": [
                "изотермы",
                "изобары"
            ]
        },
        {
            "qID": 121,
            "qName": "КОНСТАНТА РАВНОВЕСИЯ ПРИ 298 К РАВНА 1, ТОГДА ΔG",
            "rA": [
                "ΔG=O"
            ],
            "wA": [
                "ΔG<О",
                "ΔG>O"
            ]
        },
        {
            "qID": 122,
            "qName": "СООТНОШЕНИЕ, ПРИ КОТОРОМ СИСТЕМА НАХОДИТСЯ В СОСТОЯНИИ РАВНОВЕСИЯ",
            "rA": [
                "ΔH=TΔS"
            ],
            "wA": [
                "Δн=-тΔS",
                "ΔH>-TΔS",
                "ΔH<-TΔS",
                "ΔH=ΔS"
            ]
        },
        {
            "qID": 123,
            "qName": "ВЫХОД ПРОДУКТА РЕАКЦИИ 2S02+02↔S03 УМЕНЬШИТ",
            "rA": [
                "увеличение давления"
            ],
            "wA": [
                "увеличение концентрации 02",
                "увеличение концентрации S02",
                "уменьшение температуры"
            ]
        },
        {
            "qID": 124,
            "qName": "КОНСТАНТА СКОРОСТИ РЕАКЦИИ ЗАВИСИТ ОТ",
            "rA": [
                "природы веществ, температуры, катализатора"
            ],
            "wA": [
                "времени реакции, температуры, катализатора",
                "природы веществ, температуры; концентрации",
                "природы веществ, температуры"
            ]
        },
        {
            "qID": 125,
            "qName": "КОНСТАНТА РАВНОВЕСИЯ ИЗМЕНИТСЯ ПРИ",
            "rA": [
                "изменении температуры"
            ],
            "wA": [
                "введении катализатора",
                "изменении концентраций"
            ]
        },
        {
            "qID": 126,
            "qName": "ПРИ ИЗМЕНЕНИИ КОЛИЧЕСТВА ВЕЩЕСТВА А СКОРОСТЬ НЕ ИЗМЕНИТСЯ ДЛЯ РЕАКЦИИ",
            "rA": [
                "2А(тв)+2В(г)="
            ],
            "wA": [
                "А(г)+В(г)=",
                "2А(тв)+В2(г)=",
                "ЗА(г) +В2(г)="
            ]
        },
        {
            "qID": 127,
            "qName": "СООТНОШЕНИЕ\tМЕЖДУ\tРАВНОВЕСНЫМИ КОНЦЕНТРАЦИЯМИ ОПРЕДЕЛЯЕТ ЗАКОН",
            "rA": [
                "действующих масс"
            ],
            "wA": [
                "Вант-Гоффа",
                "Рауля",
                "Гесса"
            ]
        },
        {
            "qID": 128,
            "qName": "СОЕДИНЕНИЕ ПОСТОЯННОГО СОСТАВА, ОБРАЗОВАННЫЕ С УЧАСТИЕМ ДОНОРНО - АКЦЕПТОРНЫХ СВЯЗЕЙ",
            "rA": [
                "комплексные"
            ],
            "wA": [
                "двойные",
                "смешанные",
                "бинарные",
                "кластерные"
            ]
        },
        {
            "qID": 129,
            "qName": "ЧИСЛО ИОНОВ ИЛИ МОЛЕКУЛ, РАСПОЛОЖЕННЫХ ВОКРУГ ЦЕНТРАЛЬНОГО АТОМА",
            "rA": [
                "координационное ЧИСЛО"
            ],
            "wA": [
                "дентантность",
                "заряд ядра",
                "заряд катиона",
                "заряд аниона"
            ]
        },
        {
            "qID": 130,
            "qName": "КОМПЛЕКСООБРАЗОВАТЕЛЬ В ГЕМОГЛОБИНЕ",
            "rA": [
                "Fe(2+)"
            ],
            "wA": [
                "Cu(0)",
                "Fe(3+)",
                "Fe(0)",
                "Mg(2+)"
            ]
        },
        {
            "qID": 131,
            "qName": "СВЯЗЬ МЕЖДУ КОМПЛЕКСООБРАЗОВАТЕЛЕМ И ЛИГАНДАМИ",
            "rA": [
                "ковалентная по донорно — акцепторному механизму"
            ],
            "wA": [
                "ковалентная по обменному механизму",
                "ионная",
                "водородная",
                "атомная"
            ]
        },
        {
            "qID": 132,
            "qName": "ДЕНТАНТНОСТЬ - это",
            "rA": [
                "число электронодонорных атомов в лиганде"
            ],
            "wA": [
                "число связей между комплексообразователем и лигандами",
                "заряд коплексообразователя",
                "заряд комплексного иона",
                "число лигандов"
            ]
        },
        {
            "qID": 133,
            "qName": "В ХЕЛАТНЫЕ СОЕДИНЕНИЯ ВХОДЯТ ЛИГАНДЫ",
            "rA": [
                "полидентантные"
            ],
            "wA": [
                "монодентантные",
                "нейтральные",
                "положительно заряженные"
            ]
        },
        {
            "qID": 134,
            "qName": "НАЗВАНИЕ Na[Co(NH3)2(NO2)4]",
            "rA": [
                "диамминтетранитрокобальтат (Ш) натрия"
            ],
            "wA": [
                "диамминкобальтат натрия",
                "тетранетрокобальтат натрия",
                "диамминтетранитрокобальтат (П) натрия",
                "диамминтетранитрокобальтат натрия"
            ]
        },
        {
            "qID": 135,
            "qName": "ЧИСЛО МОЛЬ ИОНОВ, ОБРАЗУЮЩИХСЯ ПРИ ПЕРВИЧНОИ ДИССОЦИАЦИИ ОДНОГО МОЛЯ ГЕКСАЦИАНОФЕРРАТА (П) КАЛИЯ",
            "rA": [
                "5"
            ],
            "wA": [
                "1",
                "2",
                "3",
                "4"
            ]
        },
        {
            "qID": 136,
            "qName": "СТЕПЕНЬ ОКИСЛЕНИЯ КОМПЛЕКСООБРАЗОВАТЕЛЯ В СОЕДИНЕНИИ [Pt(NH3)5Br](NO3)3",
            "rA": [
                "+4"
            ],
            "wA": [
                "+1",
                "+2",
                "+3",
                "+6"
            ]
        },
        {
            "qID": 137,
            "qName": "КООРДИНАЦИОННОЕ ЧИСЛО КОМПЛЕКСООБРАЗОВАТЕЛЯ В КОМПЛЕКСЕ Na3[Co(CN)6] равно",
            "rA": [
                "6"
            ],
            "wA": [
                "3",
                "2",
                "9",
                "4"
            ]
        },
        {
            "qID": 138,
            "qName": "КОМПЛЕКСООБРАЗОВАТЕЛЬ В ХЛОРОФИЛЛЕ:",
            "rA": [
                "Mg(2+)"
            ],
            "wA": [
                "Cu(0)",
                "Fe(3+)",
                "Fe(2+)"
            ]
        },
        {
            "qID": 139,
            "qName": "ЛИГАНДЫ-ЭТО",
            "rA": [
                "молекулы и ионы-доноры электронных пар"
            ],
            "wA": [
                "молекулы, доноры электронных пар",
                "ионы, акцепторы электронных пар",
                "молекулы и ионы-акцепторы электронных пар"
            ]
        },
        {
            "qID": 140,
            "qName": "КООРДИНАЦИОННОЕ ЧИСЛО ЦЕНТРАЛЬНОГО АТОМА И ЕГО ЗАРЯД В СОЕДИНЕНИИ [Pt(NH3)4Cl2]Cl2",
            "rA": [
                "6,+4"
            ],
            "wA": [
                "6,+2",
                "4,+4",
                "4,+2",
                "6,+2"
            ]
        },
        {
            "qID": 141,
            "qName": "ЧЕМ МЕНЬШЕ Кн , ТЕМ КОМПЛЕКС БОЛЕЕ",
            "rA": [
                "устойчивый"
            ],
            "wA": [
                "устойчивость не определяется Кн",
                "неустойчивый",
                "растворимый"
            ]
        },
        {
            "qID": 142,
            "qName": "ЗАРЯД ВНУТРЕННЕИ СФЕРЫ В СОЕДИНЕНИИ K4[Fe(CN)6]",
            "rA": [
                "+4"
            ],
            "wA": [
                "-4",
                "-3",
                "-2",
                "+3"
            ]
        },
        {
            "qID": 143,
            "qName": "КООРДИНАЦИОННОЕ ЧИСЛО ЦЕНТРАЛЬНОГО АТОМА И ЕГО ЗАРЯД В СОЕДИНЕНИИ [Co(NH3)3Cl3]",
            "rA": [
                "6,+3"
            ],
            "wA": [
                "4,+3",
                "6,+2"
            ]
        },
        {
            "qID": 144,
            "qName": "УСТОИЧИВОСТЬ КОМПЛЕКСА С УВЕЛИЧЕНИЕМ ЧИСЛА ДОНОРНЫХ АТОМОВ В ПОЛИДЕНТАНТНОМ ЛИГАНДЕ",
            "rA": [
                "увеличивается"
            ],
            "wA": [
                "уменьшается",
                "не изменяется"
            ]
        },
        {
            "qID": 145,
            "qName": "СОЕДИНЕНИЕ КОТОРОЕ НЕ ПОДВЕРГАЕТСЯ ПЕРВИЧНОИ ДИССОЦИАЦИИ",
            "rA": [
                "[Pt(NH3)2Cl2]"
            ],
            "wA": [
                "K2[PtCl6]",
                "[Co(NH3)6]Cl3",
                "[Ag(NH3)2]OH",
                "K3[Fe(CN)6]"
            ]
        },
        {
            "qID": 146,
            "qName": "ЛУЧШИИ КОМПЛЕКСООБРАЗОВАТЕЛЬ ИЗ: Na, Mg, Co, Al",
            "rA": [
                "Co"
            ],
            "wA": [
                "Na",
                "Mg",
                "Al"
            ]
        },
        {
            "qID": 147,
            "qName": "СВЯЗЬ МЕЖДУ КОМПЛЕКСООБРАЗОВАТЕЛЕМ И ЛИГАНДАМИ.",
            "rA": [
                "ковалентная по донорно-акцепторному механизму"
            ],
            "wA": [
                "ковалентная по обменному механизму",
                "ионная",
                "водородная"
            ]
        },
        {
            "qID": 148,
            "qName": "КООРДИНАЦИОННОЕ ЧИСЛО ЦЕНТРАЛЬНОГО АТОМА И ЕГО ЗАРЯД В СОЕДИНЕНИИ [Cr(NH3)2Cl2]",
            "rA": [
                "4,+2"
            ],
            "wA": [
                "6,+3",
                "2,+2",
                "6,+2",
                "6,+4"
            ]
        },
        {
            "qID": 149,
            "qName": "СТЕПЕНЬ ОКИСЛЕНИЯ И ТИП ГИБРИДИЗАЦИИ ЦЕНТРАЛЬНОГО АТОМА В СОЕДИНЕНИИ [Ag(NH3)2]Cl",
            "rA": [
                "+l,sp"
            ],
            "wA": [
                "+l,sp2",
                "+2,sp",
                "0,sp",
                "0,sp2"
            ]
        },
        {
            "qID": 150,
            "qName": "НАИМЕНЬШАЯ КОМПЛЕКСООБРАЗУЮЩАЯ СПОСОБНОСТЬ У",
            "rA": [
                "s-элементов"
            ],
            "wA": [
                "р-элементов",
                "d-элементов",
                "f-элементов"
            ]
        },
        {
            "qID": 151,
            "qName": "НАИБОЛЕЕ ПРОЧНЫИ ИОН.",
            "rA": [
                "Кн[Zn(CN)4]2-=2,4 * 10^-20"
            ],
            "wA": [
                "Кн[Zn(OH)4]2-=1,99 * 10^-18",
                "Кн[Zn(NH3)4]2+=8,3 * 10^-12",
                "Кн[Zn(H2O2)]2+=2,1 * 10^-10"
            ]
        },
        {
            "qID": 152,
            "qName": "КОМПЛЕКСООБРАЗОВАТЕЛЬ В МОЛЕКУЛЕ ВИТАМИНА В 12",
            "rA": [
                "Co(+3)"
            ],
            "wA": [
                "Fe(+2)",
                "Ni(+2)",
                "Mg(+2)"
            ]
        },
        {
            "qID": 153,
            "qName": "РЯД, В КОТОРОМ СПОСОБНОСТЬ КОМПЛЕКСООБРАЗОВАНИЮ УВЕЛИЧИВАЕТСЯ",
            "rA": [
                "s>p>d>f"
            ],
            "wA": [
                "f>d>p>s",
                "d>f>p>s",
                "p>s>d>f"
            ]
        },
        {
            "qID": 154,
            "qName": "ПОВЕРХНОСТНО - АКТИВНЫЕ ВЕЩЕСТВА ПО ОТНОШЕНИЮ К ВОДЕ",
            "rA": [
                "этанол"
            ],
            "wA": [
                "хлорид натрия",
                "фруктоза",
                "сахароза",
                "глюкоза"
            ]
        },
        {
            "qID": 155,
            "qName": "ВЕЩЕСТВА, ПОНИЖАЮЩИЕ ПОВЕРХНОСТНОЕ НАТЯЖЕНИЕ РАСТВОРИТЕЛЯ",
            "rA": [
                "Поверхностно — активные"
            ],
            "wA": [
                "Активаторы",
                "Поверхностно — неактивные"
            ]
        },
        {
            "qID": 156,
            "qName": "ПОВЕРХНОСТНАЯ АКТИВНОСТЬ ПАВ С УВЕЛИЧЕНИЕМ УГЛЕВОДОРОДНОГО РАДИКАЛА",
            "rA": [
                "увеличивается"
            ],
            "wA": [
                "уменьшается",
                "не изменяется"
            ]
        },
        {
            "qID": 157,
            "qName": "САМОПРОИЗВОЛЬНОЕ УВЕЛИЧЕНИЕ КОНЦЕНТРАЦИИ РАСТВОРЕННОГО ВЕЩЕСТВА НА ГРАНИЦЕ РАЗДЕЛА ФАЗ ПО СРАВНЕНИЮ С ОБЪЕМНОЙ КОНЦЕНТРАЦИЕЙ",
            "rA": [
                "адсорбция"
            ],
            "wA": [
                "абсорбция",
                "адгезия",
                "возгонка"
            ]
        },
        {
            "qID": 158,
            "qName": "ПОВЕРХНОСТНОЕ НАТЯЖЕНИЕ ВОДЫ ПРИ ДОБАВЛЕНИИ СПИРТА С2Н5ОН",
            "rA": [
                "уменьшится"
            ],
            "wA": [
                "увеличится",
                "не изменится"
            ]
        },
        {
            "qID": 159,
            "qName": "АДСОРБЕНТ, ПОГЛОЩАЮЩИИ ИЗ РАСТВОРА КАТИОНЫ ВЫДЕЛЯЯ ОДНОВРЕМЕННО В РАСТВОР ЭКВИВАЛЕНТНОЕ КОЛИЧЕСТВО КАТИОНОВ ДРУГОГО РОДА",
            "rA": [
                "катионит"
            ],
            "wA": [
                "анионит",
                "мембрана"
            ]
        },
        {
            "qID": 160,
            "qName": "ВЕЩЕСТВО, НА ПОВЕРХНОСТИ КОТОРОГО ПРОИСХОДИТ АДСОРБЦИЯ, НАЗЫВАЕТСЯ",
            "rA": [
                "адсорбентом"
            ],
            "wA": [
                "адсорбатом",
                "десорбцией"
            ]
        },
        {
            "qID": 161,
            "qName": "СИСТЕМЫ, СОСТОЯЩИЕ ИЗ ТВЕРДОИ ДИСПЕРСНОИ ФАЗЫ И ЖИДКОЙ ДИСПЕРСИОННОЙ СРЕДЫ",
            "rA": [
                "суспензия"
            ],
            "wA": [
                "аэрозоли",
                "лиозоли",
                "криозоли",
                "пены"
            ]
        },
        {
            "qID": 162,
            "qName": "ДВИЖЕНИЯ ДИСПЕРСИОННОИ СРЕДЫ В ПОСТОЯННОМ ЭЛЕКТРИЧЕСКОМ ПОЛЕ К ПРОТИВОПОЛОЖНО ЗАРЯЖЕННОМУ ЭЛЕКТРОДУ - ЭТО",
            "rA": [
                "электроосмос"
            ],
            "wA": [
                "электрофорез",
                "потенциал течения"
            ]
        },
        {
            "qID": 163,
            "qName": "В КРОВИ ДИСПЕРСИОННОИ СРЕДОЙ ЯВЛЯЕТСЯ",
            "rA": [
                "вода"
            ],
            "wA": [
                "эритроциты",
                "кислород",
                "СО2"
            ]
        },
        {
            "qID": 164,
            "qName": "ПОГЛОЩЕНИЕ ВЕЩЕСТВА ВСЕЙ МАССОЙ АДСОРБЕНТА",
            "rA": [
                "абсорбция"
            ],
            "wA": [
                "адсорбция",
                "сорбция",
                "десорбция"
            ]
        },
        {
            "qID": 165,
            "qName": "ПЕРМУТИТ (Na2O•Al2O3•SiO2•H2O), ИСПОЛЬЗУЕМЫЙ ДЛЯ УМЯГЧЕНИЯ ВОДЫ ОБМЕНИВАЕТ НА ИОНЫ Ca(2+)",
            "rA": [
                "Na(+)"
            ],
            "wA": [
                "Al(3+)",
                "Si(4+)",
                "различные ионы"
            ]
        },
        {
            "qID": 166,
            "qName": "ЕДИНИЦЫ ИЗМЕРЕНИЯ ПОВЕРХНОСТНОГО НАТЯЖЕНИЯ",
            "rA": [
                "н/м; дж/м2"
            ],
            "wA": [
                "н/м2 ; Дж/м",
                "Дж/моль•К;",
                "Дж/м•, дж/м2"
            ]
        },
        {
            "qID": 167,
            "qName": "ИЗ ИОНОВ . К , Ca , Al МИНИМАЛЬНОЙ АДСОРБЦИОННОЙ СПОСОБНОСТЬЮ ОБЛАДАЕТ",
            "rA": [
                "K+"
            ],
            "wA": [
                "Ca(2+)",
                "Al(3+)",
                "адсорбционная способность одинакова"
            ]
        },
        {
            "qID": 168,
            "qName": "ИЗОТЕРМА АДСОРБЦИИ ФРЕИНДЛИХА",
            "rA": [
                "х/m=к*С^1/n"
            ],
            "wA": [
                "Г=Г∞С/I+αС",
                "Г=к*С",
                "Г=ΔC*V/m"
            ]
        },
        {
            "qID": 169,
            "qName": "ИЗ ИОНОВ ОДИНАКОВОГО ЗАРЯДА МИНИМАЛЬНУЮ АДСОРБЦИОННУЮ СПОСОБНОСТЬ ПРОЯВЛЯЮТ ИОНЫ",
            "rA": [
                "наибольшего радиуса"
            ],
            "wA": [
                "величина радиуса не имеет значения",
                "наименьшего радиуса"
            ]
        },
        {
            "qID": 170,
            "qName": "ПОВЕРХНОСТОЕ НАТЯЖЕНИЕ ЖИДКОСТЕИ С ПОВЫШЕНИЕМ ТЕМПЕРАТУРЫ",
            "rA": [
                "уменьшается"
            ],
            "wA": [
                "увеличивается",
                "не изменяется",
                "изменяется неоднозначно"
            ]
        },
        {
            "qID": 171,
            "qName": "ИЗОТЕРМА АДСОРБЦИИ ЛЭНГМЮРА",
            "rA": [
                "Г=Г∞С/I+αС"
            ],
            "wA": [
                "Г=к*С",
                "х/m=к*С^1/n",
                "Г=ΔC*V/m"
            ]
        },
        {
            "qID": 172,
            "qName": "АКТИВИРОВАННЫИ УГОЛЬ- ГИДРОФОБНЫИ СОРБЕНТ И ЛУЧШЕ АДСОРБИРУЕТ",
            "rA": [
                "неполярные вещества из полярных растворителей"
            ],
            "wA": [
                "полярные вещества из неполярных растворителей",
                "полярные вещества из полярных растворителей",
                "неполярные вещества из неполярных растворителей"
            ]
        },
        {
            "qID": 173,
            "qName": "К ПНВ относятся",
            "rA": [
                "сахароза"
            ],
            "wA": [
                "фосфолипиды",
                "желчные кислоты",
                "белки"
            ]
        },
        {
            "qID": 174,
            "qName": "ПОВЕРХНОСТНАЯ АКТИВНОСТЬ БУТАНОЛА БОЛЬШЕ ПОВЕРХНОСТНОЙ АКТИВНОСТИ ЭТАНОЛА В",
            "rA": [
                "9 раз"
            ],
            "wA": [
                "4 раза",
                "6 раз",
                "12 раз",
                "15 раз"
            ]
        },
        {
            "qID": 175,
            "qName": "МЕТОД ОЧИСТКИ КОЛЛОИДНЫХ РАСТВОРОВ И РАСТВОРОВ ВМС С ПОМОЩЬЮ МЕМБРАН, ПО ПРИНЦИПУ КОТОРОГО РАБОТАЕТ «ИСКУССТВЕННАЯ ПОЧКА»",
            "rA": [
                "диализ"
            ],
            "wA": [
                "хроматография",
                "фильтрация"
            ]
        },
        {
            "qID": 176,
            "qName": "ОПТИЧЕСКОЕ СВОЙСТВО ВСЕХ КОЛЛОИДНЫХ РАСТВОРОВ",
            "rA": [
                "рассеяние света"
            ],
            "wA": [
                "отражение света",
                "поглощение света"
            ]
        },
        {
            "qID": 177,
            "qName": "ДВИЖЕНИЯ ЧАСТЩ ДИСПЕРСНОИ ФАЗЫ В ПОСТОЯННОМ ЭЛЕКТРИЧЕСКОМ ПОЛЕ К ПРОТИВОПОЛОЖНО ЗАРЯЖЕННОМУ ЭЛЕКТРОДУ",
            "rA": [
                "электрофорез"
            ],
            "wA": [
                "диализ",
                "электроосмос"
            ]
        },
        {
            "qID": 178,
            "qName": "УСТОИЧИВОСТЬ, ХАРАКТЕРИЗУЮЩАЯ СПОСОБНОСТЬ СИСТЕМЫ СОХРАНЯТЬ ПОСТОЯННЫМ РАЗМЕР ЧАСТИЦ",
            "rA": [
                "агрегативная"
            ],
            "wA": [
                "кинетическая",
                "оптическая"
            ]
        },
        {
            "qID": 179,
            "qName": "УКРУПНЕНИЕ КОЛЛОИДНЫХ ЧАСТИЦ ЗА СЧЕТ ИХ СЛИПАНИЯ СЕДИМЕНТАЦИЕЙ",
            "rA": [
                "коагуляция"
            ],
            "wA": [
                "опалесценция",
                "солюбилизация"
            ]
        },
        {
            "qID": 180,
            "qName": "ЗНАЧЕНИЯ рн РАСТВОРА БЕЛКА, ПРИ КОТОРОМ МОЛЕКУЛА СТАНОВИТСЯ ЭЛЕКТРОНЕЙТРАЛЬНОЙ",
            "rA": [
                "изоэлектическая точка"
            ],
            "wA": [
                "золотое число",
                "критическое"
            ]
        },
        {
            "qID": 181,
            "qName": "ПРОНИКНОВЕНИЕ РАСТВОРИТЕЛЯ В ПОЛИМЕРНОЕ ВЕЩЕСТВО, ПРИВОДЯЩЕЕ К УВЕЛИЧЕНИЮ МАССЫ И ОБЪЕМА ОБРАЗЦА",
            "rA": [
                "набухание"
            ],
            "wA": [
                "седиментация",
                "высаливание"
            ]
        },
        {
            "qID": 182,
            "qName": "МАКСИМАЛЬНАЯ КОАГУЛИРУЮЩАЯ СПОСОБНОСТЬ У ИОНА",
            "rA": [
                "[Fe(CN)6](4-)"
            ],
            "wA": [
                "Сl-",
                "SO4(2+)",
                "PO4(3-)"
            ]
        },
        {
            "qID": 183,
            "qName": "КОЛЛАРГОЛ - ЭТО 70% ЗОЛЬ СЕРЕБРА, СТАБИЛИЗИРОВАННЫЙ",
            "rA": [
                "белками"
            ],
            "wA": [
                "порошком угля",
                "силикагелем"
            ]
        },
        {
            "qID": 184,
            "qName": "МЫЛА, СИНТЕТИЧЕСКИЕ МОЮЩИЕ СРЕДСТВА, ФОСФОЛИПИДЫ",
            "rA": [
                "коллоидные ПАВ"
            ],
            "wA": [
                "пептизаторы",
                "электролиты"
            ]
        },
        {
            "qID": 185,
            "qName": "КОАГУЛЯЦИЯ, НЕВИДИМАЯ НЕВООРУЖЕННЫМ ВЗГЛЯДОМ",
            "rA": [
                "скрытая"
            ],
            "wA": [
                "явная",
                "медленная",
                "быстрая"
            ]
        },
        {
            "qID": 186,
            "qName": "РАЗМЕР КОЛЛОИДНЫХ ЧАСТИЦ",
            "rA": [
                "10^-9 –10^-7 м"
            ],
            "wA": [
                "менее 10^-9 м",
                "более 10^-7 м",
                "10^-5 – 10^-7 м"
            ]
        },
        {
            "qID": 187,
            "qName": "ДИСПЕРСНАЯ СИСТЕМА, СОСТОЯЩАЯ ИЗ ТВЕРДОИ ДИСПЕРСНОЙ ФАЗЫ И ЖИДКОЙ ДИСПЕРСНОЙ СРЕДЫ",
            "rA": [
                "суспензия"
            ],
            "wA": [
                "эмульсия",
                "пена",
                "аэрозоль"
            ]
        },
        {
            "qID": 188,
            "qName": "РАССЕИВАНИЕ СВЕТА В КОЛЛОИДНЫХ СИСТЕМАХ и НАБЛЮДАЮЩЕЕСЯ ПРИ ЭТОМ ИЗМЕНЕНИЕ ОКРАСКИ",
            "rA": [
                "опалесценция"
            ],
            "wA": [
                "эффект Тиндаля",
                "диффузия",
                "седиментация"
            ]
        },
        {
            "qID": 189,
            "qName": "ДИСПЕРСНАЯ СИСТЕМА, СОСТОЯЩАЯ ИЗ жидкои ДИСПЕРСНОЙ ФАЗЫ И ЖИДКОЙ ДИСПЕРСИОННОЙ СРЕДЫ",
            "rA": [
                "эмульсия"
            ],
            "wA": [
                "пена",
                "аэрозоль",
                "суспензия"
            ]
        },
        {
            "qID": 190,
            "qName": "КОАГУЛИРУЮЩИЕ\tДЕИСТВИЕ ЭЛЕКТРОЛИТА ОПРЕДЕЛЯЕТСЯ ПРАВИЛОМ",
            "rA": [
                "Шульце — Гарди"
            ],
            "wA": [
                "Панета — Фаянса",
                "Ребиндера",
                "Шилова"
            ]
        },
        {
            "qID": 191,
            "qName": "ДИСПЕРСНАЯ СИСТЕМА СОСТОЯЩАЯ ИЗ ГАЗООБРАЗНОИ ДИСПЕРСНОЙ ФАЗЫ И ЖИДКОЙ ДИСПЕРСИОННОЙ СРЕДЫ",
            "rA": [
                "пена"
            ],
            "wA": [
                "эмульсия",
                "аэрозоль",
                "суспензия"
            ]
        },
        {
            "qID": 192,
            "qName": "ИОНЫ, ПЕРВЫМИ АДСОРБИРУЮЩИЕСЯ НА ПОВЕРХНОСТИ АГРЕГАТА",
            "rA": [
                "потенциалопределяющие"
            ],
            "wA": [
                "диффузный слой",
                "противоионы",
                "катионы"
            ]
        },
        {
            "qID": 193,
            "qName": "СЕДИМЕНТАЦИЯ - ЭТО",
            "rA": [
                "оседание частиц"
            ],
            "wA": [
                "укрупнение частиц",
                "отталкивание частиц",
                "диссоциация частиц"
            ]
        },
        {
            "qID": 194,
            "qName": "ДИСПЕРСНАЯ СИСТЕМА, СОСТОЯЩАЯ ИЗ ЖИДКОЙ ДИСПЕРСНОЙ ФАЗЫ И ГАЗООБРАЗНОЙ ДИСПЕРСНОЙ СРЕДЫ",
            "rA": [
                "аэрозоль"
            ],
            "wA": [
                "эмульсия",
                "пена",
                "суспензия"
            ]
        },
        {
            "qID": 195,
            "qName": "СИНТЕТИЧЕСКИЙ ПОЛИМЕР",
            "rA": [
                "полиметилак илат"
            ],
            "wA": [
                "целлюлоза",
                "крахмал",
                "днк"
            ]
        },
        {
            "qID": 196,
            "qName": "ЗНАЧЕНИЕ РН РАСТВОРА БЕЛКА, ПРИ КОТОРОМ МОЛЕКУЛА СТАНОВИТСЯ ЭЛЕКТРОНЕЙТРАЛНОЙ",
            "rA": [
                "изоэлектрическая точка"
            ],
            "wA": [
                "золотое число",
                "порог коагуляции",
                "ККМ"
            ]
        },
        {
            "qID": 197,
            "qName": "УРАВНЕНИЕ ГАЛЛЕРА",
            "rA": [
                "Росм= (C/M)•RT+KC2"
            ],
            "wA": [
                "Росм=СRТ",
                "[n]= KM^2",
                "α= m-m0/m0• 100%"
            ]
        },
        {
            "qID": 198,
            "qName": "ПРИ СИНЕРЕЗИСЕ ОБЪЕМ СТУДНЯ",
            "rA": [
                "уменьшается"
            ],
            "wA": [
                "увеличивается",
                "не изменяется"
            ]
        },
        {
            "qID": 199,
            "qName": "ПРИ ДЕНАТУРАЦИИ БЕЛКОВ РАЗРЫВАЮТСЯ СВЯЗИ",
            "rA": [
                "водородные"
            ],
            "wA": [
                "ковалентные",
                "ионные",
                "пептидные"
            ]
        },
        {
            "qID": 200,
            "qName": "[n]= KM^2",
            "rA": [
                "уравнение Штаудингера"
            ],
            "wA": [
                "степень набухания",
                "уравнение Галлера",
                "Уравнение Клайперона"
            ]
        },
        {
            "qID": 201,
            "qName": "СЛИЯНИЕ ВОДНЫХ ОБОЛОЧЕК НЕСКОЛЬКИХ ЧАСТИЦ ВМС БЕЗ ОБЪЕДИНЕНИЯ САМИХ ЧАСТИЦ",
            "rA": [
                "коацервация"
            ],
            "wA": [
                "желатинирование",
                "синерезис",
                "тиксотропия"
            ]
        },
        {
            "qID": 202,
            "qName": "ОСАЖДЕНИЕ ВМС ИЗ РАСТВОРА ПОД ДЕЙСТВИЕМ ЭЛЕКТРОЛИТОВ.",
            "rA": [
                "высаливание"
            ],
            "wA": [
                "тиксотропия",
                "коацервация",
                "синерезис"
            ]
        },
        {
            "qID": 203,
            "qName": "ПРИ НАБУХАНИИ МАССА ПОЛИМЕРА:",
            "rA": [
                "увеличивается"
            ],
            "wA": [
                "не изменяется",
                "уменьшается",
                "зависит от полимера"
            ]
        },
        {
            "qID": 204,
            "qName": "АНИОН, СПОСОБСТВУЮЩИЙ НАИБОЛЬШЕЙ СТЕПЕНИ НАБУХАНИЯ БЕЛКОВ",
            "rA": [
                "цианид"
            ],
            "wA": [
                "NОз-",
                "So3-",
                "сульфат"
            ]
        },
        {
            "qID": 205,
            "qName": "ПОТЕРЯ РАСТВОРОМ ВМС ТЕКУЧЕСТИ И ПЕРЕХОД В СТУДЕНЬ - это",
            "rA": [
                "желатинирование"
            ],
            "wA": [
                "тиксотропия",
                "синерезис",
                "коацервация"
            ]
        },
        {
            "qID": 206,
            "qName": "НАИБОЛЕЕ ВЕРОЯТНАЯ ФОРМА МОЛЕКУЛЫ ВМС ВСЛЕДСТВИЕ ТЕПЛОВОГО ДВИЖЕНИЯ ЗВЕНЬЕВ",
            "rA": [
                "глобула"
            ],
            "wA": [
                "спираль",
                "палочка",
                "нить"
            ]
        },
        {
            "qID": 207,
            "qName": "ПРОЦЕСС ОТДЕЛЕНИЯ НИЗКОМОЛЕКУЛЯРНОГО РАСТВОРИТЕЛЯ ИЗ СТУДНЯ",
            "rA": [
                "синерезис"
            ],
            "wA": [
                "застудневание",
                "тиксотропия",
                "денатурация"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
