var tests = {
    "tests": [
        {
            "qID": 201,
            "qName": "При дифференциальной диагностике красного плоского лишая и сифилиса учитываются следующие данные",
            "rA": [
                "результаты КСР"
            ],
            "wA": [
                "результаты люминесцентной диагностики",
                "нахождение бледных трепонем в серуме с розеол",
                "псориатическая триада",
                "феномен \"яблочного желе\""
            ]
        },
        {
            "qID": 202,
            "qName": "Розовый лишай  - это",
            "rA": [
                "заболевание предположительно вирусной этиологии"
            ],
            "wA": [
                "высококонтагиозное заболевание",
                "возникает летом",
                "заболевание с генетической предрасположенностью",
                "заболевание, передающееся половым путем"
            ]
        },
        {
            "qID": 203,
            "qName": "Розовый лишай характеризуется наличием:",
            "rA": [
                "«материнской бляшки»"
            ],
            "wA": [
                "регионарного лимфаденита",
                "нестерпимого зуда",
                "кораллово-красного свечения очагов под люминесцентной лампой",
                "высыпаний на слизистых полости рта"
            ]
        },
        {
            "qID": 204,
            "qName": "Розовый лишай следует дифференцировать с:",
            "rA": [
                "отрубевидным лишаем"
            ],
            "wA": [
                "красным плоским лишаем",
                "папулезным  сифилидом",
                "лейшманиозом",
                "почесухой"
            ]
        },
        {
            "qID": 205,
            "qName": "Различают следующие клинические формы красной волчанки",
            "rA": [
                "дискоидную"
            ],
            "wA": [
                "веррукозную",
                "ограниченную",
                "бляшечную",
                "атрофическую"
            ]
        },
        {
            "qID": 206,
            "qName": "На красной кайме губ выделяют следующие клинические формы красной волчанки:",
            "rA": [
                "все перечисленное верно."
            ],
            "wA": [
                "типичная",
                "без клинически выраженной атрофии",
                "эрозивно-язвенная",
                "глубокая форма Капоши-Ирганга"
            ]
        },
        {
            "qID": 207,
            "qName": "Для типичной формы красной волчанки красной каймы губ характерно все, кроме:",
            "rA": [
                "наличие пузырей"
            ],
            "wA": [
                "гиперкератоза",
                "атрофии",
                "снежно-голубого свечение очагов под лампой Вуда.",
                "инфильтрация"
            ]
        },
        {
            "qID": 208,
            "qName": "Для эрозивно-язвенной разновидности красной волчанки красной каймы губ характерно все, кроме:",
            "rA": [
                "cужение ротового отверстия"
            ],
            "wA": [
                "выраженное воспаление",
                "наличие эрозий",
                "наличие язв",
                "наличие трещин."
            ]
        },
        {
            "qID": 209,
            "qName": "При лечении красной волчанки применяется",
            "rA": [
                "делагил"
            ],
            "wA": [
                "гризеофульвин",
                "ацетилсалициловая кислота",
                "тетрациклин",
                "чистый ихтиол"
            ]
        },
        {
            "qID": 210,
            "qName": "Клинические симптомы дискоидной красной волчанки",
            "rA": [
                "эритема"
            ],
            "wA": [
                "сгруппированные пузырьки",
                "лихенификация",
                "фолликулярные папулы",
                "изоморфная реакция Кебнера"
            ]
        },
        {
            "qID": 211,
            "qName": "При лечении хронической красной волчанкой применяются",
            "rA": [
                "антималярийные препараты (делагил, хлорохин)"
            ],
            "wA": [
                "антибиотики широкого спектра действия",
                "цитостатики",
                "серно-дегтярная мазь",
                "седативные препараты"
            ]
        },
        {
            "qID": 212,
            "qName": "Клиническая картина склеродермии может быть представлена",
            "rA": [
                "уплотнением"
            ],
            "wA": [
                "шелушением серебристо-белыми чешуйками",
                "фолликулярным гиперкератозом",
                "лихенификацией",
                "наличием бордюра из фолликулярных папул по периферии очага"
            ]
        },
        {
            "qID": 213,
            "qName": "Клинической формой склеродермии является",
            "rA": [
                "линейная"
            ],
            "wA": [
                "дискоидная",
                "вегетирующая",
                "зостериформная",
                "листовидная"
            ]
        },
        {
            "qID": 214,
            "qName": "Очаговая склеродермия имеет стадию",
            "rA": [
                "атрофии"
            ],
            "wA": [
                "распада",
                "фолликулярного гиперкератоза",
                "нагноения",
                "изъязвления"
            ]
        },
        {
            "qID": 215,
            "qName": "При лечении склеродермии применяется",
            "rA": [
                "лидаза"
            ],
            "wA": [
                "гризеофульвин",
                "лидокаин",
                "изотретиноин",
                "антигистаминные"
            ]
        },
        {
            "qID": 216,
            "qName": "Симтом Никольского наблюдается при:",
            "rA": [
                "истинной пузырчатке"
            ],
            "wA": [
                "очаговом нейродермите",
                "строфулюсе",
                "почесухе взрослых",
                "герпетиформном дерматите Дюринга."
            ]
        },
        {
            "qID": 217,
            "qName": "Для герпетиформного дерматита Дюринга характерно все, кроме:",
            "rA": [
                "положительный симптом Никольского"
            ],
            "wA": [
                "наличие полиморфизма",
                "наклонность высыпаний к группировке",
                "повышенная чувствительность к йоду",
                "зуд"
            ]
        },
        {
            "qID": 218,
            "qName": "Различают следующие клинические формы пузырчатки, кроме:",
            "rA": [
                "буллезная"
            ],
            "wA": [
                "вульгарная (обыкновенная)",
                "вегетирующая",
                "листовидная",
                "себорейная."
            ]
        },
        {
            "qID": 219,
            "qName": "Обыкновенная пузырчатка чаще начинается с высыпаний на:",
            "rA": [
                "слизистой рта"
            ],
            "wA": [
                "гениталиях",
                "разгибательных поверхностях верхних  конечностей",
                "ладонях и подошвах.",
                "разгибательных поверхностях нижних конечностей"
            ]
        },
        {
            "qID": 220,
            "qName": "Пузырчатку следует дифференцировать со всем перечисленным, кроме:",
            "rA": [
                "псориазом"
            ],
            "wA": [
                "буллезным пемфигоидом",
                "герпетиформным дерматитом Дюринга",
                "многоформной экссудативной эритемой",
                "герпес простой"
            ]
        },
        {
            "qID": 221,
            "qName": "При лечении пузырчатки применяются препараты:",
            "rA": [
                "кортикостероиды"
            ],
            "wA": [
                "антималярийные препараты",
                "фотосенсибилизаторы",
                "ангопротекторы",
                "гемокинаторы"
            ]
        },
        {
            "qID": 222,
            "qName": "При диагностике пузырчатки имеет значение наличие симптомов:",
            "rA": [
                "Никольского"
            ],
            "wA": [
                "Кебнера",
                "Бенье-Мещерского",
                "\"дамского каблука\"",
                "Горчакова-Арди."
            ]
        },
        {
            "qID": 223,
            "qName": "Акантолиз – это:",
            "rA": [
                "расплавление межклеточных мостиков в шиповатом слое эпидермиса"
            ],
            "wA": [
                "утолщение всех слоев кожи",
                "межклеточный отек",
                "усиление размножения клеток шиповатого слоя в виде тяжей",
                "разрастание сосочков дермы."
            ]
        },
        {
            "qID": 224,
            "qName": "При лечении пузырчатки используются все, кроме:",
            "rA": [
                "системные антимикотики"
            ],
            "wA": [
                "кортикостероиды и цитостатики",
                "кортикостероиды и диаминодифенилсульфон (ДДС)",
                "ДДС (диаминодифенилсульфон).",
                "анилиновые красители"
            ]
        },
        {
            "qID": 225,
            "qName": "Клинической формой пузырчатки является",
            "rA": [
                "вегетирующая"
            ],
            "wA": [
                "скутулярная",
                "серпигинирующая",
                "буллезной",
                "инфильтративная"
            ]
        },
        {
            "qID": 226,
            "qName": "Основным гистопатологическим процессом при пузырчатке является",
            "rA": [
                "акантолиз"
            ],
            "wA": [
                "паракератоз",
                "акантоз",
                "спонгиоз",
                "гранулез"
            ]
        },
        {
            "qID": 227,
            "qName": "Осложнениями стероидной терапии являются",
            "rA": [
                "стероидный сахарный диабет"
            ],
            "wA": [
                "алопеция",
                "склеродактилия",
                "остеохондроз",
                "остеохондрит"
            ]
        },
        {
            "qID": 228,
            "qName": "Для пузырчатки характерно",
            "rA": [
                "появление пузырей на невоспаленной коже"
            ],
            "wA": [
                "чувство зуда",
                "истинный полиморфизм высыпаний",
                "наличие \"серозных колодцев\"",
                "наличие зозинофилов в содержимом пузырей"
            ]
        },
        {
            "qID": 229,
            "qName": "Принципы назначения кортикостероидов при пузырчатке",
            "rA": [
                "начинают с ударных доз"
            ],
            "wA": [
                "начинают с малых доз",
                "после эпителизации эрозий сразу переходят на поддерживающую дозу",
                "резко отменяют препарат после эпителизации эрозий",
                "чередуют прием препарата per os и парентерально"
            ]
        },
        {
            "qID": 230,
            "qName": "Для герпетиформного дерматоза Дюринга характерно",
            "rA": [
                "наличие полиморфизма высыпаний"
            ],
            "wA": [
                "положительный симптом Никольского",
                "положительный симптом Асбо-Хансена",
                "мономорфизм высыпаний",
                "начало заболевания со слизистой полости рта"
            ]
        },
        {
            "qID": 231,
            "qName": "При дерматозе Дюринга наблюдается",
            "rA": [
                "эозинофилия в крови и в пузырях"
            ],
            "wA": [
                "отсутствие эффекта от лечения диаминодифенилсульфоном",
                "положительный симптом  Никольского",
                "наличие РН-клеток в мазках-отпечатках",
                "положительный симптом Горчакова-Арди"
            ]
        },
        {
            "qID": 232,
            "qName": "Различают формы хейлитов, кроме:",
            "rA": [
                "дисгидротический"
            ],
            "wA": [
                "экссудативный",
                "гландулярный",
                "метеорологический.",
                "актинический"
            ]
        },
        {
            "qID": 233,
            "qName": "Облигатными предраками красной каймы губ являются:",
            "rA": [
                "бородавчатый предрак и абразивный преканкрозный хейлит Манганотти"
            ],
            "wA": [
                "лейкоплакия и кератоакантома",
                "фиброма",
                "атопический хейлит и постлучевой хейлит",
                "липома"
            ]
        },
        {
            "qID": 234,
            "qName": "Для лечения актинического хейлита применяются препараты, кроме:",
            "rA": [
                "витамины группы В"
            ],
            "wA": [
                "делагил",
                "никотиновая кислота",
                "преднизолон",
                "кортикостероидные крема"
            ]
        },
        {
            "qID": 235,
            "qName": "Для синдрома Мелькерссона-Розенталя характерно все, кроме:",
            "rA": [
                "наличие бляшек «скошенного луга» на языке"
            ],
            "wA": [
                "складчатый язык",
                "утолщение губ",
                "паралич лицевого нерва",
                "отек щеки"
            ]
        },
        {
            "qID": 236,
            "qName": "Подозрительным в отношении ВИЧ-инфекции является",
            "rA": [
                "рецидивирующие гнойные инфекции"
            ],
            "wA": [
                "атопический дерматит",
                "эритематоз",
                "пузырчатка",
                "многоформная экссудативная эритема"
            ]
        },
        {
            "qID": 237,
            "qName": "Какие лекарственные препараты нельзя назначить ВИЧ – инфицированному?",
            "rA": [
                "сульфаниламиды"
            ],
            "wA": [
                "антибиотики",
                "иммуностимуляторы",
                "витамины.",
                "ангиопротекторы"
            ]
        },
        {
            "qID": 238,
            "qName": "Какое из перечисленных заболеваний подозрительно в отношении ВИЧ-инфекции?",
            "rA": [
                "рецидивирующие гнойные инфекции"
            ],
            "wA": [
                "атопический дерматит",
                "эритематоз",
                "пузырчатка",
                "многоформная экссудативная эритема"
            ]
        },
        {
            "qID": 239,
            "qName": "ВИЧ относится к семейству:",
            "rA": [
                "ретровирусов"
            ],
            "wA": [
                "энтеровирусов",
                "аденовирусов",
                "афтовирусов",
                "папилломавирусов."
            ]
        },
        {
            "qID": 240,
            "qName": "Опасная концентрация ВИЧ содержится в",
            "rA": [
                "семенной жидкости"
            ],
            "wA": [
                "слюне",
                "моче, кале",
                "слезах",
                "поте"
            ]
        },
        {
            "qID": 241,
            "qName": "Инкубационный период при ВИЧ-инфекции составляет",
            "rA": [
                "от 3 – 6 недель до 3 – 6 месяцев"
            ],
            "wA": [
                "3 – 4 недели",
                "7 дней",
                "1 год",
                "1 месяц"
            ]
        },
        {
            "qID": 242,
            "qName": "Диспансерное наблюдение за ВИЧ-инфицированными осуществляется в",
            "rA": [
                "территориальных центрах по профилактике СПИДа"
            ],
            "wA": [
                "кожвендиспансерах",
                "инфекционных больницах",
                "территориальных центрах Госсанэпиднадзора",
                "станциях скорой помощи"
            ]
        },
        {
            "qID": 243,
            "qName": "Саркома Капоши, связанная со СПИДом, отличается",
            "rA": [
                "развитием заболевания в молодом возрасте"
            ],
            "wA": [
                "медленно-прогрессирующим течением",
                "поражением только кожи",
                "хорошим терапевтическим эффектом от проводимого  лечения",
                "низкой летальностью в первые 1–2 года заболевания"
            ]
        },
        {
            "qID": 244,
            "qName": "ВИЧ-маркерными заболеваниями являются",
            "rA": [
                "кандидоз"
            ],
            "wA": [
                "микроспория",
                "зоофильная трихофития",
                "псориаз",
                "атопический дерматит"
            ]
        },
        {
            "qID": 245,
            "qName": "Число завитков бледной трепонемы",
            "rA": [
                "8 -12"
            ],
            "wA": [
                "6-8",
                "3-5",
                "12-14",
                "5-7"
            ]
        },
        {
            "qID": 246,
            "qName": "Возбудителя сифилиса можно обнаружить в материале, полученном с",
            "rA": [
                "мокнущих папул"
            ],
            "wA": [
                "розеол",
                "остроконечных кондилом",
                "очагов облысения",
                "корок"
            ]
        },
        {
            "qID": 247,
            "qName": "Различают следующие периоды сифилиса",
            "rA": [
                "первичный серопозитивный"
            ],
            "wA": [
                "первичный активный",
                "третичный серопозитивный",
                "вторичный серопозитивный",
                "первичный рецидивный"
            ]
        },
        {
            "qID": 248,
            "qName": "Твердый шанкр характеризуется",
            "rA": [
                "наличием плотно-эластического инфильтрата в основании"
            ],
            "wA": [
                "наличием некротического стержня",
                "болезненностью",
                "наличием полициклических очертаний",
                "отсутствием уплотнения в основании"
            ]
        },
        {
            "qID": 249,
            "qName": "К атипичным формам первичных сифилом относится",
            "rA": [
                "шанкр - амигдалит"
            ],
            "wA": [
                "парафимоз",
                "гангренозный шанкр",
                "фимоз",
                "шанкороид"
            ]
        },
        {
            "qID": 250,
            "qName": "Атипичной формой первичной сифиломы является",
            "rA": [
                "индуративный отек"
            ],
            "wA": [
                "фимоз",
                "парафимоз",
                "гангрена",
                "фагеденизм"
            ]
        },
        {
            "qID": 251,
            "qName": "Твердый шанкр дифференцируют  с",
            "rA": [
                "мягким шанкром"
            ],
            "wA": [
                "фурункулом",
                "склеродермией",
                "красным плоским лишаем",
                "псориазом"
            ]
        },
        {
            "qID": 252,
            "qName": "Первичная сифилома может осложняться",
            "rA": [
                "фимозом"
            ],
            "wA": [
                "индуративным отеком",
                "экзематизацией",
                "абсцедированием",
                "язвенной вегетирующей пиодермией"
            ]
        },
        {
            "qID": 253,
            "qName": "К атипичным твердым шанкрам относятся",
            "rA": [
                "шанкр-панариций"
            ],
            "wA": [
                "фурункулоподобный",
                "шанкриформный",
                "фагеденический",
                "гангренозный"
            ]
        },
        {
            "qID": 254,
            "qName": "Высыпания при вторичном свежем сифилисе",
            "rA": [
                "яркой окраски, обильные"
            ],
            "wA": [
                "обильные, неяркой окраски",
                "сгруппированные",
                "необильные, бледные",
                "широкие кондиломы"
            ]
        },
        {
            "qID": 255,
            "qName": "Для вторичного рецидивного сифилиса характерны  высыпания в виде",
            "rA": [
                "широких кондилом"
            ],
            "wA": [
                "остроконечных кондилом",
                "твердого шанкра",
                "бугорков",
                "обильной розеолезной сыпи"
            ]
        },
        {
            "qID": 256,
            "qName": "Сифилитическая розеола",
            "rA": [
                "не сопровождается субъективными ощущениями"
            ],
            "wA": [
                "цвета «кофе с молоком»",
                "не исчезает при надавливании",
                "разрешается с образованием рубца",
                "располагается на лице"
            ]
        },
        {
            "qID": 257,
            "qName": "Розеолезные высыпания при сифилисе дифференцируют с",
            "rA": [
                "токсикодермией"
            ],
            "wA": [
                "чесоткой",
                "псориазом",
                "трихофитией",
                "красным плоским лишаем"
            ]
        },
        {
            "qID": 258,
            "qName": "Вторичные сифилиды слизистых оболочек",
            "rA": [
                "могут развиваться на языке"
            ],
            "wA": [
                "встречаются редко",
                "наблюдаются в виде папулезных и пятнистых высыпаний",
                "имеются нечеткие границы",
                "сопровождаются значительной болезненностью"
            ]
        },
        {
            "qID": 259,
            "qName": "Папулезные высыпания вторичного сифилиса на коже следует дифференцировать с",
            "rA": [
                "псориазом"
            ],
            "wA": [
                "токсидермией",
                "отрубевидным лишаем",
                "розовым лишаем",
                "пузырчаткой"
            ]
        },
        {
            "qID": 260,
            "qName": "Выделяют следующие разновидности пустулезного сифилида",
            "rA": [
                "оспенновидный"
            ],
            "wA": [
                "шанкриформный",
                "серпигинирующий",
                "листовидный",
                "фагеденический"
            ]
        },
        {
            "qID": 261,
            "qName": "Сифилитическая лейкодерма возникает во время",
            "rA": [
                "вторичного рецидивного сифилиса"
            ],
            "wA": [
                "первичного серонегативного сифилиса",
                "первичного серопозитивного сифилиса",
                "инкубационного периода",
                "через 1 неделю после появления твердого шанкра"
            ]
        },
        {
            "qID": 262,
            "qName": "Сифилитическая мелкоочаговая алопеция возникает через",
            "rA": [
                "6 месяцев после заражения"
            ],
            "wA": [
                "1 неделю после заражения",
                "1 месяц после заражения",
                "2 месяца после заражения",
                "1 неделю после появления твердого шанкра"
            ]
        },
        {
            "qID": 263,
            "qName": "Широкие кондиломы – это",
            "rA": [
                "гипертрофированные папулы перианальной области"
            ],
            "wA": [
                "вирусное заболевание",
                "проявление первичного сифилиса",
                "атипичное проявление остроконечных кондилом",
                "проявление вегетирующей пузырчатки"
            ]
        },
        {
            "qID": 264,
            "qName": "При третичном сифилисе встречаются следующие виды высыпаний",
            "rA": [
                "гуммы"
            ],
            "wA": [
                "сгруппированный угревидный сифилид",
                "фиброаденомы",
                "серпигинирующий папулезный сифилид",
                "гуммозный сифилид площадкой"
            ]
        },
        {
            "qID": 265,
            "qName": "Бугорковый сифилид следует дифференцировать со следующими заболеваниями",
            "rA": [
                "туберкулезной волчанкой"
            ],
            "wA": [
                "псориазом",
                "красным плоским лишаем",
                "атопическим дерматитом",
                "почесухой"
            ]
        },
        {
            "qID": 266,
            "qName": "Для третичного сифилиса характерно наличие",
            "rA": [
                "сгруппированных бугорков"
            ],
            "wA": [
                "папул ладоней и подошв",
                "мелкоочагового облысения",
                "широких кондилом промежности",
                "обильной розеолезной сыпи на туловище"
            ]
        },
        {
            "qID": 267,
            "qName": "Гумма возникает через",
            "rA": [
                "3-50 лет после заражения"
            ],
            "wA": [
                "1 неделю после заражения",
                "1 месяц после заражения",
                "2 месяца после заражения",
                "1 неделю после появления твердого шанкра"
            ]
        },
        {
            "qID": 268,
            "qName": "Инфицирование плода у больной сифилисом беременной происходит, как правило",
            "rA": [
                "на 4-5-м месяце"
            ],
            "wA": [
                "на 1 -2-м месяце",
                "на 3-м месяце",
                "на 6-7-м месяце",
                "на 8-9-м месяце"
            ]
        },
        {
            "qID": 269,
            "qName": "Сифилитическое поражение плаценты проявляется",
            "rA": [
                "эндо-, мезо-, периваскулитом"
            ],
            "wA": [
                "не имеет проявлений",
                "увеличением массы и размеров плода",
                "неизменной зародышевой частью",
                "уменьшением массы и размеров плаценты"
            ]
        },
        {
            "qID": 270,
            "qName": "Достоверными признаками позднего врожденного сифилиса яв¬ляются",
            "rA": [
                "зубы Гетчинсона"
            ],
            "wA": [
                "саблевидные голени",
                "высокое \"готическое небо\"",
                "сифилитическая пузырчатка",
                "остеохондрит"
            ]
        },
        {
            "qID": 271,
            "qName": "К вероятным признакам позднего врожденного сифилиса относятся",
            "rA": [
                "рубцы Робинсона-Фурнье"
            ],
            "wA": [
                "яйцеобразный череп",
                "сифилитическая пузырчатка",
                "аксифоидия",
                "диффузная папулезная инфильтрация Гохзингера"
            ]
        },
        {
            "qID": 272,
            "qName": "Какой из признаков зубов Гетчинсона является строго обязательным?",
            "rA": [
                "сужение режущего края не менее, чем на 2 мм относительно шейки зуба"
            ],
            "wA": [
                "уменьшенные размеры",
                "полулунная выемка на режущем крае",
                "бочкообразная форма",
                "наличие диастемы"
            ]
        },
        {
            "qID": 273,
            "qName": "К специфическим реакциям на сифилис относится",
            "rA": [
                "РИФ"
            ],
            "wA": [
                "реакция Вассермана",
                "микрореакция преципитации с кардиолипиновым   антигеном",
                "реакция Максимова",
                "КСР"
            ]
        },
        {
            "qID": 274,
            "qName": "К  неспецифическим реакциям на сифилис относится",
            "rA": [
                "микрореакция преципитации с кардиолипиновым  антигеном"
            ],
            "wA": [
                "РИФ",
                "РИБТ",
                "ИФА",
                "РПГА"
            ]
        },
        {
            "qID": 275,
            "qName": "К специфическим противосифилитическим средствам относятся",
            "rA": [
                "пенициллин"
            ],
            "wA": [
                "пирогенал",
                "гоновакцина",
                "полиоксидоний",
                "тербинафин"
            ]
        },
        {
            "qID": 276,
            "qName": "Одним из видов лечения при сифилисе является",
            "rA": [
                "специфическое"
            ],
            "wA": [
                "патогенетическое",
                "симптоматическое",
                "противорецидивное",
                "предупредительное"
            ]
        },
        {
            "qID": 277,
            "qName": "К препаратам средней дюрантности относится",
            "rA": [
                "прокаин-бензилпенициллин"
            ],
            "wA": [
                "экстенциллин",
                "ретарпен",
                "эритромицин",
                "натриевая соль бензилпенициллина"
            ]
        },
        {
            "qID": 278,
            "qName": "К препаратам резерва для лечения сифилиса относятся",
            "rA": [
                "цефтриаксон"
            ],
            "wA": [
                "рифампицин",
                "экстенциллин",
                "ретарпен",
                "клиндамицин"
            ]
        },
        {
            "qID": 279,
            "qName": "Больные ранними формами сифилиса, имевшие до лечения положительные результаты КСР,  находятся на клинико-серологическом контроле:",
            "rA": [
                "до полной негативации КСР и еще 6 месяцев"
            ],
            "wA": [
                "3 месяца",
                "6 месяцев",
                "3 года",
                "5 лет"
            ]
        },
        {
            "qID": 280,
            "qName": "По окончании клинико-серологического контроля больные сифили¬сом должны быть осмотрены",
            "rA": [
                "терапевтом"
            ],
            "wA": [
                "урологом",
                "гинекологом",
                "психиатром",
                "вертебрологом"
            ]
        },
        {
            "qID": 281,
            "qName": "Перед снятием с учета обязательным является  серологическое обследование пациента при помощи",
            "rA": [
                "КСР"
            ],
            "wA": [
                "реакции Максимова",
                "МР",
                "исследования на бледную трепонему в темном поле",
                "IgМ  FTA-абс"
            ]
        },
        {
            "qID": 282,
            "qName": "Гонорейный уретрит может осложняться",
            "rA": [
                "простатитом"
            ],
            "wA": [
                "экзематизацией",
                "пиодермией",
                "гангренизацией",
                "фагеденизмом"
            ]
        },
        {
            "qID": 283,
            "qName": "Диссеминации гонококков способствуют",
            "rA": [
                "длительно не диагностируемый процесс"
            ],
            "wA": [
                "соблюдение режима труда и отдыха",
                "полноценное питание",
                "своевременное лечение",
                "высокий уровень иммунной резистентности"
            ]
        },
        {
            "qID": 284,
            "qName": "К осложнениям гонореи относится",
            "rA": [
                "простатит"
            ],
            "wA": [
                "индуративный отек",
                "гангренизация",
                "фагеденизм",
                "фарингит"
            ]
        },
        {
            "qID": 285,
            "qName": "При диагностике гонореи у мужчин используются следующие методы провокации",
            "rA": [
                "метод провокации не используется"
            ],
            "wA": [
                "медикаментозная",
                "биологическая",
                "физиологическая",
                "алиментарная"
            ]
        },
        {
            "qID": 286,
            "qName": "Возбудителем урогенитального хламидиоза является",
            "rA": [
                "Chlamydia trachomatis  серотипы от D до K"
            ],
            "wA": [
                "Spirochaeta pallidum",
                "Ureplasma urelyticum",
                "Gardnerella vaginalis",
                "Chlamydia trachomatis  серотипы L-1, L-2, L-3"
            ]
        },
        {
            "qID": 287,
            "qName": "Пути передачи хламидийной инфекции",
            "rA": [
                "половой"
            ],
            "wA": [
                "фекально-оральный",
                "трансмиссивный",
                "трансфузионый",
                "воздушно-капельный"
            ]
        },
        {
            "qID": 288,
            "qName": "Методы лабораторной диагностики хламидиоза",
            "rA": [
                "выделение в культуре клеток"
            ],
            "wA": [
                "с помощью люминесцентной лампы",
                "КСР",
                "исследование нативных препаратов в темном поле",
                "культивирование на плотных питательных средах"
            ]
        },
        {
            "qID": 289,
            "qName": "Клинические проявления хламидиоза",
            "rA": [
                "уретрит"
            ],
            "wA": [
                "остроконечные кондиломы",
                "широкие кондиломы",
                "облысение",
                "розеолезная сыпь на коже"
            ]
        },
        {
            "qID": 290,
            "qName": "К мерам профилактики урогенитального хламидиоза относится",
            "rA": [
                "пропаганда использования презервативов"
            ],
            "wA": [
                "профилактическое лечение беременных пенициллином",
                "профилактическое лечение половых партнеров",
                "профилактическое лечения новорожденных",
                "профилактическое лечение девочек-подростков"
            ]
        },
        {
            "qID": 291,
            "qName": "Возбудителями урогенитального микоплазмоза является",
            "rA": [
                "Mycoplasma genitalium"
            ],
            "wA": [
                "Mycoplasma urealyticum",
                "Ureaplasma hominis",
                "Сhlamydia trachomatis",
                "Treponema pallidum"
            ]
        },
        {
            "qID": 292,
            "qName": "Пути передачи микоплазменной урогенитальной инфекции",
            "rA": [
                "половой"
            ],
            "wA": [
                "орально-фекальный",
                "бытовой",
                "трансфузионый",
                "воздушно-капельный"
            ]
        },
        {
            "qID": 293,
            "qName": "К мерам профилактики  урогенитального микоплазмоза относится",
            "rA": [
                "обследования женщин, страдающих хроническими  заболеваниями  урогенитального тракта невыясненной  этиологии"
            ],
            "wA": [
                "профилактическое лечение беременных пенициллином",
                "обследование новорожденных",
                "вакцинация беременных",
                "дезинфекции нижнего белья"
            ]
        },
        {
            "qID": 294,
            "qName": "Возбудитель трихомониаза:",
            "rA": [
                "урогенитальная трихомонада"
            ],
            "wA": [
                "хламидии",
                "вирусы",
                "бактерии",
                "гриб ы"
            ]
        },
        {
            "qID": 295,
            "qName": "Лабораторный диагноз трихомониаза основывается:",
            "rA": [
                "на культуральном методе"
            ],
            "wA": [
                "на результатах люминесцентной диагностики",
                "на результатах РИФ",
                "на реакции Вассермана",
                "на результатах микрореакции"
            ]
        },
        {
            "qID": 296,
            "qName": "Возникновению урогентального кандидоза способствует все, кроме:",
            "rA": [
                "наличие высокого уровня иммунологической реактивности."
            ],
            "wA": [
                "эндокринопатия",
                "авитаминоз",
                "антибиотикотерапия",
                "онкопатология"
            ]
        },
        {
            "qID": 297,
            "qName": "При диагностике урогентального кандидоза применяются методы все, кроме:",
            "rA": [
                "исследования крови на КСР"
            ],
            "wA": [
                "микроскопические",
                "культуральные",
                "клинические.",
                "ПЦР"
            ]
        },
        {
            "qID": 298,
            "qName": "Остроконечные кондиломы вызываются:",
            "rA": [
                "ВПЧ – вирусом папилломы человека"
            ],
            "wA": [
                "ВПГ – 1",
                "ВПГ – 2",
                "ВИЧ",
                "вирусом Herpes Varicella-Zoster."
            ]
        },
        {
            "qID": 299,
            "qName": "Эпидемиологическими мероприятиями по контролю за распространением ИППП являются",
            "rA": [
                "выявление и лечение больных ИППП"
            ],
            "wA": [
                "проведение профилактических прививок",
                "профилактическое лечение подростков антибиотиками",
                "обследование новорожденных",
                "применение иммуномодуляторов"
            ]
        },
        {
            "qID": 300,
            "qName": "Учетно-статистическая форма №089/у – 83 составляется при установлении",
            "rA": [
                "сифилиса"
            ],
            "wA": [
                "псориаза",
                "красного плоского лишая",
                "розового лишая Жибера",
                "пузырчатки"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
