var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 К СОЦИАЛЬНЫМ ФАКТОРАМ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА ОТНОСИТСЯ",
            "rA": [
                "миграция населения"
            ],
            "wA": [
                "факторы риска",
                "климатические факторы",
                "источник возбудителя инфекции"
            ]
        },
        {
            "qID": 2,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРИРОДНЫЕ ФАКТОРЫ, ВЛИЯЮЩИЕ НА ЗВЕНЬЯ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА",
            "rA": [
                "среднегодовая температура"
            ],
            "wA": [
                "источник инфекции",
                "восприимчивость населения",
                "пути и факторы передачи возбудителя"
            ]
        },
        {
            "qID": 3,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ ПРОЦЕСС ДЕТЕРМИНИРОВАН",
            "rA": [
                "природными факторами"
            ],
            "wA": [
                "политическими  факторами",
                "экономическими факторами",
                "антропологическими"
            ]
        },
        {
            "qID": 4,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ ПРОЦЕСС – ЭТО ЯВЛЕНИЕ",
            "rA": [
                "социально-биологическое"
            ],
            "wA": [
                "социальное",
                "биологическое",
                "социально-политическое"
            ]
        },
        {
            "qID": 5,
            "qName": "ОК-1, ОПК-1, ПК-3 НАБЛЮДЕНИЕ В ЭПИДЕМИЧЕСКОМ ОЧАГЕ ПРЕКРАЩАЕТСЯ",
            "rA": [
                "по истечении срока максимальной инкубации у контактировавших с больным"
            ],
            "wA": [
                "немедленно после госпитализации больного",
                "немедленно после заключительной дезинфекции;",
                "после введения контактным иммуноглобулина, или вакцины, или бактериофага"
            ]
        },
        {
            "qID": 6,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОТИВОЭПИДЕМИЧЕСКУЮ РАБОТУ В ОЧАГЕ ОРГАНИЗУЕТ И ПРОВОДИТ",
            "rA": [
                "участковый  врач и эпидемиолог;"
            ],
            "wA": [
                "эндокринолог;",
                "врач-бактериолог;",
                "врач-офтальмолог;"
            ]
        },
        {
            "qID": 7,
            "qName": "ОК-1, ОПК-1, ПК-3 ПЕРВОЕ  ДЕЙСТВИЕ ПРИ ОРГАНИЗАЦИИ РАБОТЫ  В ЭПИДЕМИЧЕСКОМ ОЧАГЕ",
            "rA": [
                "заполнить и отправить  «Экстренное извещение…»;"
            ],
            "wA": [
                "сбор эпидемиологического анамнеза;",
                "ввести вакцины, или иммуноглобулина;",
                "определить контактных;"
            ]
        },
        {
            "qID": 8,
            "qName": "ОК-1, ОПК-1, ПК-3 «ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ» ЗАПОЛНЯЕТ ВРАЧ",
            "rA": [
                "заподозривший инфекционную болезнь"
            ],
            "wA": [
                "подтвердивший диагноз инфекционной болезни",
                "установивший границы эпидемического очага",
                "хирург"
            ]
        },
        {
            "qID": 9,
            "qName": "ОК-1, ОПК-1, ПК-3 ЗАПОЛНЯТЬ «ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ» ОБ ИНФЕКЦИОННОМ БОЛЬНОМ",
            "rA": [
                "немедленно при подозрении на инфекционную болезнь"
            ],
            "wA": [
                "после консультации с врачом-инфекционистом",
                "после лабораторного подтверждения диагноза",
                "после госпитализации пациента"
            ]
        },
        {
            "qID": 10,
            "qName": "ОК-1, ОПК-1, ПК-3 «ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ» ОБ ИНФЕКЦИОННОМ БОЛЬНОМ ОТПРАВЛЯЮТ",
            "rA": [
                "в территориальный ФБУЗ «Цг и Э»"
            ],
            "wA": [
                "в управление здравоохранения",
                "в районную бактериологическую лабораторию",
                "в дезинфекционную станцию"
            ]
        },
        {
            "qID": 11,
            "qName": "ОК-1, ОПК-1, ПК-3 УЧАСТКОВЫЙ ВРАЧ ПРИ ВЫЯВЛЕНИИ ИНФЕКЦИОННОГО БОЛЬНОГО",
            "rA": [
                "Заполняет  «Экстренное извещение»"
            ],
            "wA": [
                "Выясняет анамнез болезни",
                "проводит текущую дезинфекцию",
                "сообщить по месту работы заболевшего"
            ]
        },
        {
            "qID": 12,
            "qName": "ОК-1, ОПК-1, ПК-3 ДОКУМЕНТЫ, ЗАПОЛНЯЕМЫЕ ПОЛИКЛИНИКОЙ ПРИ ВЫЯВЛЕНИИ ИНФЕКЦИОННОГО БОЛЬНОГО",
            "rA": [
                "«Экстренное извещение…» статистический талон, карта диспансерного наблюдения за переболевшим;"
            ],
            "wA": [
                "справка в бассейн;",
                "карта эпидемиологического обследования очага;",
                "лист уточненных диагнозов."
            ]
        },
        {
            "qID": 13,
            "qName": "ОК-1, ОПК-1, ПК-3  ГОСПИТАЛИЗАЦИЯ БОЛЬНОГО ИНФЕКЦИОННОЙ БОЛЕЗНЬЮ",
            "rA": [
                "не обязательна"
            ],
            "wA": [
                "обязательна",
                "желательна",
                "обоснована"
            ]
        },
        {
            "qID": 14,
            "qName": "ОК-1, ОПК-1, ПК-3 К КЛИНИЧЕСКИМ ПОКАЗАНИЯМ ДЛЯ ГОСПИТАЛИЗАЦИИ БОЛЬНОГО ОТНОСЯТСЯ",
            "rA": [
                "возраст, тяжесть течения болезни"
            ],
            "wA": [
                "сухой кашель",
                "профессия больного",
                "профессия контактных лиц"
            ]
        },
        {
            "qID": 15,
            "qName": "ОК-1, ОПК-1, ПК-3 К ПРОТИВОЭПИДЕМИЧЕСКИМ МЕРОПРИЯТИЯМ В ОТНОШЕНИИ ИСТОЧНИКА ИНФЕКЦИИ ОТНОСЯТСЯ",
            "rA": [
                "госпитализация больного в стационар"
            ],
            "wA": [
                "текущая дезинфекция",
                "заключительная дезинфекция",
                "отправка в места заключения"
            ]
        },
        {
            "qID": 16,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ПЕРЕЧИСЛЕННЫХ ЭПИДЕМИЧЕСКИМ ОЧАГОМ  ЯВЛЯЕТСЯ",
            "rA": [
                "квартира где проживает больной с  вирусным гепатитом В"
            ],
            "wA": [
                "ротоглотка больного дифтерией",
                "кишечник больного брюшным тифом",
                "верхние дыхательные пути больного гриппом"
            ]
        },
        {
            "qID": 17,
            "qName": "ОК-1, ОПК-1, ПК-3 СУЩНОСТЬЮ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА ЯВЛЯЕТСЯ",
            "rA": [
                "распространение инфекционных болезней среди людей"
            ],
            "wA": [
                "распространение инфекционных болезней среди животных",
                "состояние зараженности организма человека",
                "зараженность возбудителями переносчиков инфекции"
            ]
        },
        {
            "qID": 18,
            "qName": "ОК-1, ОПК-1, ПК-3 СПОРАДИЧЕСКАЯ ЗАБОЛЕВАЕМОСТЬ – ЭТО",
            "rA": [
                "единичные заболевания"
            ],
            "wA": [
                "групповые заболевания",
                "легкие формы болезни",
                "типичные формы болезни"
            ]
        },
        {
            "qID": 19,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИЗНАКИ ЗАБОЛЕВАЕМОСТИ, ХАРАКТЕРИЗУЮЩИЕ ВСПЫШКУ, ЭПИДЕМИЮ, ПАНДЕМИЮ",
            "rA": [
                "по количеству зарегистрированных случаев болезни"
            ],
            "wA": [
                "по скорости распространения инфекции",
                "по механизму передачи возбудителя",
                "по числу выявленных носителей"
            ]
        },
        {
            "qID": 20,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ ПРОЦЕСС СООТВЕТСТВУЕТ  ОСНОВНЫМ ПРОЯВЛЕНИЯМ В ВИДЕ",
            "rA": [
                "эндемии"
            ],
            "wA": [
                "множественных переломов костей",
                "энзоотии",
                "лакунарной ангины"
            ]
        },
        {
            "qID": 21,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОФИЛАКТИЧЕСКИЕ МЕРОПРИЯТИЯ ПРОВОДЯТ",
            "rA": [
                "вне зависимости от наличия случаев инфекционных болезней"
            ],
            "wA": [
                "при единичных случаях инфекционных заболеваний",
                "при множественных случаях инфекционных заболеваний",
                "в зависимости от эпидемической ситуации в регионе"
            ]
        },
        {
            "qID": 22,
            "qName": "ОК-1, ОПК-1, ПК-3 ПЛАНОВЫЕ ПРИВИВКИ ПРОВОДЯТ",
            "rA": [
                "в соответствии с календарем прививок"
            ],
            "wA": [
                "контактным в очагах",
                "при угрозе брюшнотифозной инфекции",
                "населению города при угрозе распространения холеры"
            ]
        },
        {
            "qID": 23,
            "qName": "ОК-1, ОПК-1, ПК-3 ХЛОРСОДЕРЖАЩИЙ  ПРЕПАРАТ,  РЕКОМЕНДОВАННЫЙ  ДЛЯ ОБРАБОТКИ ПОВЕРХНОСТЕЙ В  ЖИЛЫХ ПОМЕЩЕНИЯХ",
            "rA": [
                "\"Гипохлорит кальция\";"
            ],
            "wA": [
                "хлорная известь;",
                "\"Дезеф\";",
                "\"Кама\";"
            ]
        },
        {
            "qID": 24,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ СТИРКИ, ДЕЗИНФЕКЦИИ БЕЛЬЯ И МЫТЬЯ ПОСУДЫ  РЕКОМЕН¬ДОВАНЫ",
            "rA": [
                "дихлор-;"
            ],
            "wA": [
                "хлорная известь",
                "Сальваниос рН -10",
                "санита"
            ]
        },
        {
            "qID": 25,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕДРАБОТНИКАМ НЕОБХОДИМА ЭКСТРЕННАЯ ПРОФИЛАКТИКА ВИРУСНОГО ГЕПАТИТА В  ПРИ",
            "rA": [
                "повреждении кожных покровов в процессе проведения различных манипуляций больному вирусным гепатитом В или носителю НВs антигена, если медработник был ранее не вакцинирован или был вакцинирован, но титр антител к HBs-антигену не превышает 10 МЕ/мл"
            ],
            "wA": [
                "любых манипуляциях с повреждением кожи",
                "повреждении кожных покровов при проведении различных манипуляций больному вирусным гепатитом В или носителю НВs антигена, если медработник был ранее вакцинирован и титр антител к HBs-антигену  превышает 20 МЕ/мл",
                "уходе за любым больными вирусным гепатитом В, даже в отсутствие повреждения кожных покровов"
            ]
        },
        {
            "qID": 26,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРИ ОБРАБОТКЕ ЗАГРЯЗНЕННОЕ ИСПРАЖНЕНИЯМИ ПОСТЕЛЬНОЕ БЕЛЬЕ БОЛЬНЫХ ДИЗЕНТЕРИЕЙ НЕОБХОДИМО",
            "rA": [
                "кипятить"
            ],
            "wA": [
                "отправить в камеру для де¬зинфекции",
                "замочить в сухой хлорной извести",
                "прополоскать в содовом растворе"
            ]
        },
        {
            "qID": 27,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕТОД СТЕРИЛИЗАЦИИ МЕДИЦИНСКОГО ИНСТРУМЕНТАРИЯ ИЗ КОРРОЗИОННО НЕУСТОЙЧИВЫХ МАТЕРИАЛОВ",
            "rA": [
                "воздушный"
            ],
            "wA": [
                "паровой",
                "газовый",
                "биологический"
            ]
        },
        {
            "qID": 28,
            "qName": "ОК-1, ОПК-1, ПК-3 ХИМИЧЕСКОЕ СРЕДСТВО, ИСПОЛЬЗУЕМОЕ ДЛЯ ОБРАБОТКИ ХИРУРГИЧЕСКОГО ИНСТРУМЕНТАРИЯ",
            "rA": [
                "хлорамин"
            ],
            "wA": [
                "перекись водорода",
                "пар",
                "горячий воз¬дух"
            ]
        },
        {
            "qID": 29,
            "qName": "ОК-1, ОПК-1, ПК-3 СТЕРИЛИЗАЦИЯ МЕДИЦИНСКАЯ — ЭТО",
            "rA": [
                "полное освобо¬ждение объекта от всех микроорганизмов"
            ],
            "wA": [
                "уничтожение только вегетативных патогенных микроорганизмов;",
                "уничтоже¬ние только споровых патогенных форм;",
                "действие медицинской сестры"
            ]
        },
        {
            "qID": 30,
            "qName": "ОК-1, ОПК-1, ПК-3 ЦЕЛЬ ПРЕДСТЕРИЛИЗАЦИОННОЙ ОБРАБОТКИ    МЕДИЦИНСКОГО ИНСТРУ¬МЕНТАРИЯ",
            "rA": [
                "удалить белковые, жировые загрязнения"
            ],
            "wA": [
                "удалить информацию",
                "удалить  лак",
                "стерилизовать  загрязнения"
            ]
        },
        {
            "qID": 31,
            "qName": "ОК-1, ОПК-1, ПК-3 О КАЖДОМ СЛУЧАЕ ИНФЕКЦИОННОЙ (ПАРАЗИТАРНОЙ) БОЛЕЗНИ МЕДИЦИНСКИЕ РАБОТНИКИ МЕДИЦИНСКИХ, ОБРАЗОВАТЕЛЬНЫХ, ОЗДОРОВИТЕЛЬНЫХ И ДРУГИХ ОРГАНИЗАЦИЙ, ИНДИВИДУАЛЬНЫЕ ПРЕДПРИНИМАТЕЛИ, ОСУЩЕСТВЛЯЮЩИЕ МЕДИЦИНСКУЮ ДЕЯТЕЛЬНОСТЬ, ОБЯЗАНЫ СООБЩИТЬ ПО ТЕЛЕФОНУ  ВТЕЧЕНИЕ \tЧАСОВ",
            "rA": [
                "2"
            ],
            "wA": [
                "6",
                "12",
                "15"
            ]
        },
        {
            "qID": 32,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРИ ИСПОЛЬЗОВАНИИ РЕПЕЛЛЕНТОВ НЕОБХОДИМО",
            "rA": [
                "обработать  одежду и открытые части тела"
            ],
            "wA": [
                "обработать инструктора дезинфектора",
                "обработать помещение",
                "обработать местность"
            ]
        },
        {
            "qID": 33,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПОД ЭПИДЕМИЧЕСКИМ ОЧАГОМ ПОНИМАЮТ",
            "rA": [
                "место нахождения источника с окружающей его территорией, где может передаваться заразное начало"
            ],
            "wA": [
                "квартиру, в которой находится больной туляремией",
                "столовую в детском дошкольном учреждении, в которой кушал больной туляремией",
                "пруд, в котором купались дети"
            ]
        },
        {
            "qID": 34,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОБНАРУЖИВ ПРИ  ОСМОТРЕ ПАЦИЕНТА  В ПРИЕМНОМ ОТДЕЛЕНИИ  ГОЛОВНЫЕ ВШИ И ГНИДЫ, НЕОБХОДИМО",
            "rA": [
                "обработать волосы противопедикулезными препаратами;"
            ],
            "wA": [
                "обработать тело  мазевыми противовоспалительными препаратами;",
                "обработать голову Микроцидом ликвидом;",
                "вымыть голову горячей водой с хозяйствен¬ным мылом;"
            ]
        },
        {
            "qID": 35,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ПРОФИЛАКТИКИ И БОРЬБЫ С МУХАМИ НЕОБХОДИМО",
            "rA": [
                "соблюдать санитарное состояние помещений;"
            ],
            "wA": [
                "пользоваться репеллентами;",
                "осушать мелкие водо¬емы;",
                "использовать перитроиды;"
            ]
        },
        {
            "qID": 36,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ ОБРАБОТКЕ  МНОГОЭТАЖНОГО КОРПУСА БОЛЬНИЦЫ ДЛЯ УНИЧТОЖЕНИЯ ТАРАКАНОВ НЕОБХОДИМО",
            "rA": [
                "одновременно обрабо¬тать весь корпус"
            ],
            "wA": [
                "обрабатывать только пищеблок",
                "поочередно в течение нескольких дней обра¬ботать все помещения больницы",
                "не проводить повторную обработку."
            ]
        },
        {
            "qID": 37,
            "qName": "ОК-1, ОПК-1, ПК-3 «ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ» ЗАПОЛНЯЕТ ВРАЧ",
            "rA": [
                "заподозривший инфекционное заболевание"
            ],
            "wA": [
                "подтвердивший диагноз инфекционного заболевания",
                "эпидемиолог",
                "дезинфектор"
            ]
        },
        {
            "qID": 38,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ВЕРТИКАЛЬНЫЙ МЕХАНИЗМ ПЕРЕДАЧИ ВОЗМОЖЕН ПРИ",
            "rA": [
                "ВИЧ-инфекции"
            ],
            "wA": [
                "шигеллезе",
                "вирусном гепатите А",
                "коклюше"
            ]
        },
        {
            "qID": 39,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕДИЦИНСКИЙ ПЕРСОНАЛ МОЖЕТ ВЫПОЛНЯТЬ ДЕЗИНФЕКЦИОННЫЕ РАБОТЫ В ВОЗРАСТЕ",
            "rA": [
                "лица старше 18 лет;"
            ],
            "wA": [
                "независимо от возраста;",
                "по¬сле инструктажа.",
                "при наличии образования"
            ]
        },
        {
            "qID": 40,
            "qName": "ОК-1, ОПК-1 ПРОБЫ ДЛЯ ОБНАРУЖЕНИЯ СЛЕДОВ КРОВИ НА МЕДИЦИНСКОМ ИНСТРУ¬МЕНТАРИИ",
            "rA": [
                "Азопирамовая, амидопириновая"
            ],
            "wA": [
                "фенол¬фталеиновую",
                "с Суданом III",
                "Цуверкалова"
            ]
        },
        {
            "qID": 41,
            "qName": "ОК-1, ОПК-1, ПК-3 УНИЧТОЖЕНИЕ ПАТОГЕННЫХ И УСЛОВНО - ПАТОГЕННЫХ МИКРООРГАНИЗМОВ С ОБЪЕКТОВ ВНЕШНЕЙ СРЕДЫ ИЛИ КОЖНОГО ПОКРОВА ДО УРОВНЯ НЕ ПРЕДСТАВЛЯЮЩЕГО ОПАСНОСТИ ДЛЯ ЗДОРОВЬЯ НАЗЫВАЕТСЯ",
            "rA": [
                "дезинфекция"
            ],
            "wA": [
                "дезинсекция",
                "стерилизация",
                "дератизация"
            ]
        },
        {
            "qID": 42,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 МЕТОД ИСТРЕБЛЕНИЯ  ГРЫЗУНОВ, ЯВЛЯЮЩИХСЯ ИСТОЧНИКАМИ ИЛИ ПЕРЕНОСЧИКАМИ ИНФЕКЦИОННЫХ ЗАБОЛЕВАНИЙ (ЧУМА, ТУЛЯРЕМИЯ, ЛЕЙШМАНИОЗЫ И ДР.) И НАНОСЯЩИХ ЭКОНОМИЧЕСКИЙ УЩЕРБ ХОЗЯЙСТВУ НАЗЫВАЕТСЯ",
            "rA": [
                "дератизация"
            ],
            "wA": [
                "дезинфекция",
                "дезинсекция",
                "стерилизация"
            ]
        },
        {
            "qID": 43,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОФИЛАКТИЧЕСКАЯ ДЕЗИНФЕКЦИЯ ОСУЩЕСТВЛЯЕТСЯ В",
            "rA": [
                "организации осуществляющей медицинскую деятельность"
            ],
            "wA": [
                "мышиной норе",
                "в поле, где растет пшеница",
                "в морской воде"
            ]
        },
        {
            "qID": 44,
            "qName": "ОК-1, ОПК-1, ПК-3  МЕТОД, ОБЕСПЕЧИВАЮЩИЙ ГИБЕЛЬ ВЕГЕТАТИВНЫХ И СПОРОВЫХ ФОРМ, ПАТОГЕННЫХ И НЕПАТОГЕННЫХ МИКРООРГАНИЗМОВ НАЗЫВАЕТСЯ",
            "rA": [
                "стерилизация"
            ],
            "wA": [
                "дезинфекция",
                "дезинсекция",
                "дератизация"
            ]
        },
        {
            "qID": 45,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕТОДЫ И СРЕДСТВА БОРЬБЫ С ЧЛЕНИСТОНОГИМИ (НАСЕКОМЫМИ И КЛЕЩАМИ), ПЕРЕНОСЯЩИМИ ИНФЕКЦИОННЫЕ ЗАБОЛЕВАНИЯ И НАНОСЯЩИМИ ВРЕД ПИЩЕВЫМ И СЕЛЬСКОХОЗЯЙСТВЕННЫМ ПРОДУКТАМ И ЖИЛИЩУ ЧЕЛОВЕКА НАЗЫВАЮТСЯ",
            "rA": [
                "дезинсекция"
            ],
            "wA": [
                "дезинфекция",
                "стерилизация",
                "дератизация"
            ]
        },
        {
            "qID": 46,
            "qName": "ОК-1, ОПК-1, ПК-3  ВСЕ ВЕГЕТАТИВНЫЕ ФОРМЫ ПОГИБАЮТ, НО СОХРАНЯЮТСЯ СПОРЫ ПРИ ТЕМПЕРАТУРЕ",
            "rA": [
                "60° - 70°С."
            ],
            "wA": [
                "100°С;",
                "85°С;",
                "80°С;"
            ]
        },
        {
            "qID": 47,
            "qName": "ОК-1, ОПК-1, ПК-3 АНТИСЕПТИКА –  ЭТО СОВОКУПНОСТЬ МЕР, НАПРАВЛЕННЫХ НА",
            "rA": [
                "уничтожение микробов в ране, патологическом очаге и в организме в целом"
            ],
            "wA": [
                "предупреждение попадания возбудителя в рану, органы больного при операциях, лечебных и диагностических мероприятиях",
                "обработку загрязненного микробами предмета с целью их уничтожения до такой степени, чтобы они не смогли вызвать инфекцию при использовании данного предмета",
                "уничтожение возбудителя инфекционных болезней на путях передачи от источника инфекции к восприимчивым людям",
                "уничтожение возбудителя инфекционных болезней на неживых объектах окружающей среды"
            ]
        },
        {
            "qID": 48,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ЗАРАЖЕНИЯ ВИРУСНЫМИ ГЕПАТИТАМИ В И С НАИБОЛЕЕ ЗНАЧИМЫМ СУБСТРАТОМ ЯВЛЯЕТСЯ",
            "rA": [
                "кровь"
            ],
            "wA": [
                "моча",
                "пот",
                "слюна"
            ]
        },
        {
            "qID": 49,
            "qName": "ОК-1, ОПК-1, ПК-3 АСЕПТИКА - ЭТО",
            "rA": [
                "предупреждение попадания возбудителя инфекции в рану или организм человека"
            ],
            "wA": [
                "комплекс мероприятий направленных на борьбу с инфекцией",
                "комплекс мероприятий направленных на лечение заболеваний",
                "мероприятия на ликвидацию инфекционного воспалительного процесса",
                "контроль  наличия инфекции на медицинском инструментарии"
            ]
        },
        {
            "qID": 50,
            "qName": "ОК-1, ОПК-1, ПК-3 К ФИЗИЧЕСКОМУ МЕТОДУ ДЕЗИНФЕКЦИИ ОТНОСИТСЯ",
            "rA": [
                "кипячение"
            ],
            "wA": [
                "хлорсодержащие  средства",
                "Биолот-1",
                "горячая вода"
            ]
        },
        {
            "qID": 51,
            "qName": "ОК-1, ОПК-1, ПК-3 НЕ ЯВЛЯЕТСЯ ТРЕБОВАНИЕМ  К ДЕЗИНФЕКТАНТАМ",
            "rA": [
                "высокая агрессивность относительно конструктивных материалов;"
            ],
            "wA": [
                "экологическая безопасность;",
                "активность  воздействия  на разнообразных  микроорганизмов;",
                "возможность растворимости в воде;"
            ]
        },
        {
            "qID": 52,
            "qName": "ОК-1, ОПК-1, ПК-3 МИКРООРГАНИЗМЫ, ЭВОЛЮЦИОННО ПРИСПОСОБЛЕННЫЕ К ПАРАЗИТИРОВАНИЮ В ЖИВОМ ОРГАНИЗМЕ И СПОСОБНЫЕ ВЫЗЫВАТЬ ИНФЕКЦИОННУЮ БОЛЕЗНЬ НАЗЫВАЮТСЯ",
            "rA": [
                "патогенные"
            ],
            "wA": [
                "условно-патогенные",
                "вирулентные",
                "особо опасные"
            ]
        },
        {
            "qID": 53,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ВИЧ-ИНФИЦИРОВАННЫЙ БОЛЬНОЙ ЯВЛЯЕТСЯ ИСТОЧНИКОМ ИНФЕКЦИИ",
            "rA": [
                "весь период болезни"
            ],
            "wA": [
                "в инкубационном периоде",
                "в острой стадии",
                "на стадии вторичных заболеваний"
            ]
        },
        {
            "qID": 54,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИРУСНЫЕ ГЕПАТИТЫ (А, В, С, D, Е) — ЭТО",
            "rA": [
                "антропонозы"
            ],
            "wA": [
                "зоонозы",
                "антропозоонозы",
                "сапронозы."
            ]
        },
        {
            "qID": 55,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ ПРОЦЕСС ГЕПАТИТА В  В СОВРЕМЕННЫХ УСЛОВИЯХ ХАРАКТЕРИЗУЕТСЯ",
            "rA": [
                "низким уровнем заболеваемости острыми формами"
            ],
            "wA": [
                "нарастанием числа заболевших в зимне-весеннее время года",
                "взрывообразным началом сезонных подъемов забо¬леваемости",
                "равномерным распределениеем заболеваемости во всех возрастных  группах"
            ]
        },
        {
            "qID": 56,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ   ПРОЦЕСС   ГЕПАТИТА   С    В СОВРЕМЕННЫХ УСЛОВИЯХ ХАРАКТЕРИЗУЕТСЯ",
            "rA": [
                "широким распространением хронических форм"
            ],
            "wA": [
                "нарастанием числа заболевших среди  детей",
                "эпидемическими очагами с множественными   случаями   заболеваний",
                "увеличением числа заболевших в летне-осенние месяцы года"
            ]
        },
        {
            "qID": 57,
            "qName": "ОК-1, ОПК-1, ПК-3 БОЛЬНОЙ  ВИРУСНЫМ ГЕПАТИТОМ А  НАИБОЛЕЕ ЗАРАЗЕН",
            "rA": [
                "последние 7—10 дней инкубации, в преджелтушный период"
            ],
            "wA": [
                "последние 3 нед инкубации, в последний день преджелтушного периода",
                "последний день инкубационного периода",
                "желтушный пе¬риод"
            ]
        },
        {
            "qID": 58,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ДЛЯ ЗАРАЖЕНИЯ ГЕПАТИТОМ В НАИБОЛЕЕ  ЭПИДЕМИОЛОГИЧЕСКИ ЗНАЧИМЫЕ БИОЛОГИ-ЧЕСКИЕ СУБСТРАТЫ",
            "rA": [
                "кровь, спермальная жидкость"
            ],
            "wA": [
                "моча, фекалии",
                "спер¬ма, пот",
                "спинномозговая жидкость, слезы"
            ]
        },
        {
            "qID": 59,
            "qName": "ОК-1, ОПК-1, ПК-3 ФАКТОРАМИ ПЕРЕДАЧИ ВИРУСА ГЕПАТИТА В МОГУТ БЫТЬ  ПРЕДМЕТЫ",
            "rA": [
                "бритвен¬ный прибор, зубная щетка"
            ],
            "wA": [
                "Шарф, носовой платок",
                "маникюрные принадлежности, столовая посуда",
                "ложка"
            ]
        },
        {
            "qID": 60,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСТОЧНИК ИНФЕКЦИИ ГЕПАТИТА С ИМЕЮЩИЙ НАИБОЛЬШЕЕ ЭПИДЕМИОЛОГИЧЕСКОЕ ЗНАЧЕНИЕ",
            "rA": [
                "больной хронической формой гепатита С"
            ],
            "wA": [
                "больной острой формой гепатита С",
                "сыворотка крови чело¬века, инфицированного вирусом гепатита С",
                "плазма крови"
            ]
        },
        {
            "qID": 61,
            "qName": "ОК-1, ОПК-1, ПК-3 К ИСТОЧНИКАМ ИНФЕКЦИИ ПРИ ГРИППЕ ОТНОСЯТ",
            "rA": [
                "больного человека в первые пять дней болезни"
            ],
            "wA": [
                "вирусоносителя",
                "домашних животных",
                "птиц"
            ]
        },
        {
            "qID": 62,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРИ УГРОЗЕ МАССОВОГО РАПРОСТРАНЕНИЯ ЗАБОЛЕВАНИЯ ПРОВОДЯТ",
            "rA": [
                "вакцинацию"
            ],
            "wA": [
                "бактериофагирование",
                "вводят иммуноглобулин",
                "вводят сыворотку"
            ]
        },
        {
            "qID": 63,
            "qName": "ОК-1, ОПК-1, ПК-3 БОЛЬНОЙ ОСТРОЙ ФОРМОЙ ГЕПАТИТА В  НЕ ОПАСЕН КАК ИСТОЧНИК ИНФЕКЦИИ",
            "rA": [
                "в начале  инкубационного период;"
            ],
            "wA": [
                "в последние 2—8 недель инкубационного периода",
                "в про¬дромальном периоде",
                "в  желтушном периоде (разгар болез¬ни);",
                "в  период реконвалесценции."
            ]
        },
        {
            "qID": 64,
            "qName": "ОК-1, ОПК-1, ПК-3 ОБСЛЕДОВАНИЕ МЕДИЦИНСКИХ РАБОТНИКОВ НА  HBSAG ПРОВОДИТСЯ",
            "rA": [
                "1 раз в год"
            ],
            "wA": [
                "1 раз в полгода",
                "1 раз в 2 года",
                "ежеквар¬тально"
            ]
        },
        {
            "qID": 65,
            "qName": "ОК-1, ОПК-1, ПК-3 ] К ПРИЧИНАМ ЭКЗОГЕННОГО ЗАНОСА ИНФЕКЦИИ В ОРГАНИЗМ ЧЕЛОВЕКА ОТНОСЯТ",
            "rA": [
                "снижение резистентности организма"
            ],
            "wA": [
                "различные медицинские манипуляции",
                "продолжительную бактериемию",
                "смену возбудителя в процессе течения болезни"
            ]
        },
        {
            "qID": 66,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ПЕРЕЧИСЛЕННЫХ ГРУПП МЕДИЦИНСКИХ РАБОТНИКОВ НАИМЕНЬШИЙ РИСК ЗАРАЖЕНИЯ ВИРУСНЫМ ГЕПАТИТОМ С ИМЕЕТ",
            "rA": [
                "участковый педиатр"
            ],
            "wA": [
                "оперирующий хирург",
                "персо¬нал станции скорой помощи",
                "персонал станции перели¬вания крови"
            ]
        },
        {
            "qID": 67,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ИЗ ПЕРЕЧИСЛЕННЫХ  МЕР ПРОФИЛАКТИКИ ВИРУСНОГО ГЕПАТИТА В НЕ ПОВЛИЯЕТ НА РАЗВИТИЕ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА ЭТОЙ ИНФЕКЦИИ",
            "rA": [
                "санитарный контроль за водоснабжением  населения"
            ],
            "wA": [
                "использование одноразовых шприцев",
                "контроль соблюдения противоэпидемического режима  в МО",
                "вакцинация лиц  групп риска"
            ]
        },
        {
            "qID": 68,
            "qName": "ОК-1, ОПК-1, ПК-3 ЗАРАЖЕНИЕ ЧЕЛОВЕКА ТУБЕРКУЛЕЗОМ ЧАЩЕ ПРОИСХОДИТ_____ПУТЕМ",
            "rA": [
                "аэрогенным"
            ],
            "wA": [
                "алиментарным",
                "контактным",
                "внутриутробным"
            ]
        },
        {
            "qID": 69,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИЧ-ИНФИЦИРОВАННЫЕ ЛИЦА  НЕ ИМЕЮТ ПРАВО",
            "rA": [
                "быть до¬нором"
            ],
            "wA": [
                "на доступное медицинское освидетельствование",
                "на получение квалифи¬цированной медицинской помощи всех видов",
                "на добровольное обследование"
            ]
        },
        {
            "qID": 70,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИЧ-ИНФЕКЦИЯ — ЭТО",
            "rA": [
                "антропоноз;"
            ],
            "wA": [
                "сапроноз;",
                "зооноз;",
                "зооантропоноз."
            ]
        },
        {
            "qID": 71,
            "qName": "ОК-1, ОПК-1, ПК-3 НАИБОЛЬШАЯ КОНЦЕНТРАЦИЯ ВИРУСА ВИЧ В БИОЛОГИЧЕСКИХ ЖИДКОСТЯХ ЧЕЛОВЕКА В",
            "rA": [
                "крови"
            ],
            "wA": [
                "моче",
                "грудном молоке",
                "сперме"
            ]
        },
        {
            "qID": 72,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОСНОВНЫМ МЕТОДОМ РАННЕГО ВЫЯВЛЕНИЯ ТУБЕРКУЛЕЗА ЛЕГКИХ СРЕДИ ВЗРОСЛОГО НАСЕЛЕНИЯ ЯВЛЯЕТСЯ",
            "rA": [
                "лучевой (флюорография)"
            ],
            "wA": [
                "микроскопия мокроты на микобактерии туберкулеза",
                "посев мокроты на микобактерии туберкулеза",
                "клинический анализ крови"
            ]
        },
        {
            "qID": 73,
            "qName": "ОК-1, ОПК-1, ПК-3 НАИБОЛЕЕ ВЫСОК РИСК ЗАРАЖЕНИЯ ВИЧ ИНФЕКЦИЕЙ  ПРИ",
            "rA": [
                "переливании инфицированной кро¬ви"
            ],
            "wA": [
                "сек¬суальном контакте",
                "грудном вскармливании",
                "пользовании общим туа¬летом"
            ]
        },
        {
            "qID": 74,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРЕПЯТСТВУЕТ ЗАРАЖЕНИЮ    ВИЧ",
            "rA": [
                "сексуальный контакт с использованием презерватива"
            ],
            "wA": [
                "беспорядочные гомо- и гетеросексуальные связи",
                "наличие венерических заболеваний   у   сексуальных   партнеров",
                "сексуальный контакт во время менструации"
            ]
        },
        {
            "qID": 75,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ПЕРЕЧИСЛЕННЫХ ГРУПП НАСЕЛЕНИЯ НАИМЕНЬШИЙ РИСК ЗАРАЖЕНИЯ ВИЧ ИНФЕКЦИЕЙ У",
            "rA": [
                "медицинские работника строго соблюдающего технику безопасности"
            ],
            "wA": [
                "донора крови",
                "инъкционного наркомана",
                "работника коммерческого секса (РКС)"
            ]
        },
        {
            "qID": 76,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСПОЛЬЗУЮТ  ПРИ  СКРИНИНГОВОМ ОБСЛЕДОВАНИИ ГРУПП РИСКА  С ЦЕЛЬЮ ВЫ¬ЯВЛЕНИЯ   ВИЧ-ИНФИЦИРОВАННЫХ",
            "rA": [
                "ИФА;"
            ],
            "wA": [
                "РСК;",
                "иммунный блоттинг;",
                "иммуноэлек¬трофорез."
            ]
        },
        {
            "qID": 77,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ИНФИЦИРОВАНИЕ  ВИЧ МЕДИЦИНСКОГО ПЕРСОНАЛА  МАЛО ВЕРОЯТНО  ПРИ",
            "rA": [
                "проведении физиотерапевти¬ских процедур;"
            ],
            "wA": [
                "проведении парентеральных процедур;",
                "оперативных вмешательствах;",
                "удалении зубного камня;"
            ]
        },
        {
            "qID": 78,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ОБРАБОТКИ РУК МЕДИЦИНСКОГО ПЕРСОНАЛА, ЗАГРЯЗНЕННОГО КРОВЬЮ БОЛЬНОГО ВИЧ-ИНФЕКЦИЕЙ, ИСПОЛЬЗУЮТ ЭТИЛОВЫЙ СПИРТ В_______КОНЦЕНТРАЦИИ",
            "rA": [
                "70 %;"
            ],
            "wA": [
                "40 %;",
                "60 %;",
                "80 %;"
            ]
        },
        {
            "qID": 79,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ПОДТВЕРЖДЕНИЯ ДИАГНОЗА ВИЧ-ИНФЕКЦИИ ПРОВОДЯТ ПОСТАНОВКУ РЕАКЦИИ",
            "rA": [
                "иммунного блота;"
            ],
            "wA": [
                "иммуноферментного анализа,",
                "генетической;",
                "микроскопической."
            ]
        },
        {
            "qID": 80,
            "qName": "ОК-1, ОПК-1, ПК-3 ДО ИСПОЛЬЗОВАНИЯ РАЗЛИЧНЫХ РАСТВОРОВ  ПРИ ПОПАДАНИИ КРОВИ ПАЦИЕНТА НА КОНЪЮНКТИВУ ГЛАЗ СТОМАТОЛОГА НЕОБХОДИМО",
            "rA": [
                "обильно промыть водой"
            ],
            "wA": [
                "Промыть 0,05 % раствором  перманганата калия;",
                "раствор сульфацил-натрия",
                "2 % раствор бикарбоната натрия (сода дву¬углекислая)"
            ]
        },
        {
            "qID": 81,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ ВСКРЫТИИ АБСЦЕССА В РОТОВОЙ ПОЛОСТИ У БОЛЬНОГО ВИЧ-ИН¬ФЕКЦИЕЙ  ВРАЧ ПРОКОЛОЛ РЕЗИНОВУЮ ПЕРЧАТКУ И ПО¬РАНИЛ  ПАЛЕЦ   С   ВЫДЕЛЕНИЕМ   КРОВИ,  ПЕРВОЕ ДЕЙСТВИЕ",
            "rA": [
                "обработать  перчатки   дезинфицирующим    раствором, снять их"
            ],
            "wA": [
                "снять  перчатки",
                "вымыть руки в перчатках с мылом и снять перчатки",
                "обработать  руки 70 % спиртом и смазать ранку 5 % раствором йода"
            ]
        },
        {
            "qID": 82,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИЧ-ИНФИЦИРОВАННЫЙ ЧЕЛОВЕК ЯВЛЯЕТСЯ ИСТОЧНИКОМ ИН¬ФЕКЦИИ",
            "rA": [
                "пожизненно"
            ],
            "wA": [
                "в терминальной стадии",
                "в стадии бессимптомной ин¬фекции (II 2.;",
                "в стадии острой инфекции (II 1.;"
            ]
        },
        {
            "qID": 83,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕХАНИЗМЫ ПЕРЕДАЧИ ВИЧ-ИНФЕКЦИИ",
            "rA": [
                "контактный"
            ],
            "wA": [
                "аспирационный",
                "фекально-оральный",
                "трансмиссив¬ный"
            ]
        },
        {
            "qID": 84,
            "qName": "ОК-1, ОПК-1, ПК-3 НЕОБХОДИМО ОБРАБАТЫВАТЬ ЗАГРЯЗНЕННУЮ КРОВЬЮ ИЛИ ВЫДЕЛЕНИЯМИ БОЛЬНЫХ ЗАЩИТНУЮ ОДЕЖДУ МЕДИЦИНСКОГО ПЕРСОНАЛА",
            "rA": [
                "раствором хлорамина"
            ],
            "wA": [
                "в паровой камере",
                "в пароформалиновой камере",
                "протирать 6 % перекисью во¬дорода"
            ]
        },
        {
            "qID": 85,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ СНИЖЕНИЯ РИСКА ЗАНОСА ИНФЕКЦИИ В  ТЕРА¬ПЕВТИЧЕСКИЙ СТАЦИОНАР  НЕОБХОДИМО",
            "rA": [
                "тщательно осматривать больного в приемном отделении и собирать эпиданамнез"
            ],
            "wA": [
                "контролировать соблю¬дение дезинфекционного режима",
                "сокращать время пребывания больных в стациона¬ре",
                "повышать квалификацию  врачей"
            ]
        },
        {
            "qID": 86,
            "qName": "ОК-1, ОПК-1, ПК-3 НА 15-Й ДЕНЬ ПРЕБЫВАНИЯ В ТЕРА¬ПЕВТИЧЕСКОМ ОТДЕЛЕНИИ У БОЛЬНОГО   ЖИДКИЙ СТУЛ,   ВЫСЕЯНЫ   ШИГЕЛЛЫ ЗОННЕ. АНАЛОГИЧНЫХ ЗАБОЛЕВАНИЙ В СТАЦИОНАРЕ НЕТ. ДАННЫЙ СЛУЧАЙ – ЭТО",
            "rA": [
                "внутриболь¬ничное заражение"
            ],
            "wA": [
                "больной поступил в состоянии ин¬кубации дизентерии",
                "занос инфекции в стационар",
                "не ИСМП"
            ]
        },
        {
            "qID": 87,
            "qName": "ОК-1, ОПК-1, ПК-3 ЯВЛЯЮТСЯ ИСТОЧНИКАМИ   ВОЗБУДИТЕЛЕЙ   ВНУТРИБОЛЬНИЧНОЙ   ИНФЕКЦИИ",
            "rA": [
                "Пациенты и медицинский персонал"
            ],
            "wA": [
                "медицинский персонал и персонал  АХЧ",
                "ме¬дицинский инструментарий",
                "администрация ООМД"
            ]
        },
        {
            "qID": 88,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕДИЦИНСКИЙ РАБОТНИК ПРИ ВЫЯВЛЕНИИ В МЕДИЦИНСКОЙ ОРГАНИЗАЦИИ БОЛЬНОГО, ПОДОЗРИТЕЛЬНОГО НА ОСОБО ОПАСНУЮ ИНФЕКЦИЮ",
            "rA": [
                "изолирует его и, не выходя из помещения, извещает руководителя своего учреждения о выявленном больном"
            ],
            "wA": [
                "извещает органы Роспотребнадзора или вышестоящие инстанции",
                "изолирует его, а сам выходит из кабинета и срочно оповещает руководителя своего учреждения",
                "заполняет экстренное извещение и оповещает всех медицинских работников данного учреждения"
            ]
        },
        {
            "qID": 89,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИЧИНОЙ ГИБЕЛИ БОЛЬШИНСТВА ПОСТРАДАВШИХ ПРИ ЧРЕЗВЫЧАЙНЫХ СИТУАЦИЯХ ЯВЛЯЕТСЯ",
            "rA": [
                "несвоевременность оказания медицинской помощи"
            ],
            "wA": [
                "воздействие механического поражающего фактора",
                "недостаточное обеспечение средствами защиты",
                "неорганизованные эвакуационные мероприятия"
            ]
        },
        {
            "qID": 90,
            "qName": "ОК-1, ОПК-1, ПК-3 ПЕРЕДАЮТСЯ ВОЗДУШНО-ПЫ¬ЛЕВЫМ ПУТЕМ ПРИ ВНУТРИБОЛЬНИЧНОМ ЗАРАЖЕНИИ ВОЗБУДИТЕЛИ",
            "rA": [
                "Легионеллы, сальмонеллы, стафилококки;"
            ],
            "wA": [
                "ВИЧ;",
                "Сальмонеллы, кишечные палочки ;",
                "стафилококки;"
            ]
        },
        {
            "qID": 91,
            "qName": "ОК-1, ОПК-1, ПК- ДЛЯ ЛАБОРАТОРНОГО ПОДТВЕРЖДЕНИЯ ДИАГНОЗА МАЛЯРИИ ИССЛЕДУЕТСЯ",
            "rA": [
                "кровь"
            ],
            "wA": [
                "кал",
                "моча",
                "желчь"
            ]
        },
        {
            "qID": 92,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 К МЕТОДАМ СПЕЦИФИЧЕСКОЙ ПРОФИЛАКТИКИ ГРИППА ОТНОСИТСЯ",
            "rA": [
                "вакцинация"
            ],
            "wA": [
                "закаливание организма",
                "применение амантадина",
                "применение лейкоцитарногоинтеферона"
            ]
        },
        {
            "qID": 93,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 К МЕРОПРИЯТИЯМ ПЕРВИЧНОЙ ПРОФИЛАКТИКИ ОТНОСИТСЯ",
            "rA": [
                "устранение причин развития заболевания"
            ],
            "wA": [
                "раннее выявление заболевания",
                "своевременное начало лечения заболевания",
                "паллиативная медицинская помощь"
            ]
        },
        {
            "qID": 94,
            "qName": "ОК-1, ОПК-1, ПК-3 ФАКТОРЫ РИСКА   РОСТА  ЗАБОЛЕВАЕМОСТИ ВНУТРИБОЛЬНИЧНЫМИ ИНФЕКЦИЯМИ",
            "rA": [
                "соз¬дание крупных  многопрофильных больничных комплек¬сов;"
            ],
            "wA": [
                "уменьшение числа госпитализированных;",
                "развитие стационарзамещающих технологий;",
                "улучшение противоэпидемического режима;"
            ]
        },
        {
            "qID": 95,
            "qName": "ОК-1, ОПК-1, ПК-3 ФАКТОР РИСКА ВОЗНИКНОВЕНИЯ ИСМП",
            "rA": [
                "дли¬тельность госпитализации;"
            ],
            "wA": [
                "пол госпитализированных больных;",
                "анамнез жизни  больных;",
                "внедрение малоинвазивной хирургии;"
            ]
        },
        {
            "qID": 96,
            "qName": "ОК-1, ОПК-1, ПК-3 МАНИПУЛЯЦИИ  И ПРОЦЕДУРЫ, ПОТЕНЦИАЛЬНО ОПАСНЫЕ ДЛЯ ВНУТРИБОЛЬНИЧНОГО ЗАРАЖЕНИЯ",
            "rA": [
                "оперативное вмешатель¬ство, катетеризация сосудов;"
            ],
            "wA": [
                "инъекции, визуальный осмотр;",
                "пальпация;",
                "аускультация;"
            ]
        },
        {
            "qID": 97,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 НЕОБХОДИМО ОБРАБАТЫВАТЬ ЗАГРЯЗНЕННУЮ КРОВЬЮ ИЛИ ВЫДЕЛЕНИЯМИ БОЛЬНЫХ СМЕННУЮ ОБУВЬ",
            "rA": [
                "в пароформалиновой камере;"
            ],
            "wA": [
                "в паровой камере;",
                "раствором хлорамина;",
                "протирать 6 % перекисью во¬дорода;"
            ]
        },
        {
            "qID": 98,
            "qName": "ОК-1, ОПК-1, ПК-3 НЕОБХОДИМО ОБРАБАТЫВАТЬ ЗАГРЯЗНЕННЫЕ КРОВЬЮ ИЛИ ВЫДЕЛЕНИЯМИ БОЛЬНЫХ РЕЗИНОВЫЕ ПЕРЧАТКИ",
            "rA": [
                "раствором хлорамина;"
            ],
            "wA": [
                "в паровой камере;",
                "в пароформалиновой камере;",
                "кипятить в содовом растворе;"
            ]
        },
        {
            "qID": 99,
            "qName": "ОК-1, ОПК-1, ПК-3 ЗАГРЯЗНЕННЫЙ КРОВЬЮ ИЛИ ВЫДЕЛЕНИЯМИ БОЛЬНЫХ ФОНЕНДОСКОП НЕОБХОДИМО ОБРАБОТАТЬ",
            "rA": [
                "протереть 6 % перекисью во¬дорода;"
            ],
            "wA": [
                "в крафт пакете;",
                "в гласперленовом стерилизаторе;",
                "раствором хлорамина;"
            ]
        },
        {
            "qID": 100,
            "qName": "ОК-1, ОПК-1, ПК-17 РАННЕЕ ВЫЯВЛЕНИЕ ЗАБОЛЕВАНИЯ В ДОКЛИНИЧЕСКОЙ СТАДИИ ПОСРЕДСТВОМ МАССОВОГО ОБСЛЕДОВАНИЯ ПРАКТИЧЕСКИ ЗДОРОВЫХ ПАЦИЕНТОВ НАЗЫВАЕТСЯ",
            "rA": [
                "скрининг"
            ],
            "wA": [
                "мониторинг",
                "первичная профилактика",
                "диспансеризация"
            ]
        },
        {
            "qID": 101,
            "qName": "ОК-1, ОПК-1 ПОКАЗАНИЕМ К ГОСПИТАЛИЗАЦИИ ПРИ ОРВИ ЯВЛЯЕТСЯ",
            "rA": [
                "наличие осложнений"
            ],
            "wA": [
                "цефалгия",
                "анемия легкой степени",
                "фарингит"
            ]
        },
        {
            "qID": 102,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОБЪЕКТОМ ИЗУЧЕНИЯ КЛАССИЧЕСКОЙ ЭПИДЕМИОЛОГИИ ЯВЛЯЕТСЯ",
            "rA": [
                "эпидемический процесс;"
            ],
            "wA": [
                "заболеваемость неинфекционными болезнями;",
                "любые массовые явления в населении;",
                "состояние здоровья населения."
            ]
        },
        {
            "qID": 103,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕХАНИЗМ ПЕРЕДАЧИ ИНФЕКЦИИ СООТВЕТСТВУЕТ",
            "rA": [
                "основной локализации возбудителя в организме хозяина;"
            ],
            "wA": [
                "характеристикам источника инфекции;",
                "путям распространения инфекции;",
                "устойчивости возбудителя."
            ]
        },
        {
            "qID": 104,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ПЕРЕЧИСЛЕННЫХ К МЕДЛЕННЫМ ИНФЕКЦИЯМ ОТНОСЯТСЯ",
            "rA": [
                "ВИЧ-инфекция;"
            ],
            "wA": [
                "туберкулез;",
                "столбняк;",
                "клещевой возвратный тиф;"
            ]
        },
        {
            "qID": 105,
            "qName": "ОК-1, ОПК-1, ПК-3 ВЕРТИКАЛЬНЫЙ ПУТЬ ПЕРЕДАЧИ ИМЕЕТ МЕСТО ПРИ",
            "rA": [
                "токсоплазмозе;"
            ],
            "wA": [
                "геморрагической лихорадке с почечным синдромом;",
                "брюшном тифе;",
                "стафилококкозах;"
            ]
        },
        {
            "qID": 106,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСТОЧНИКОМ ВОЗБУДИТЕЛЯ ИНФЕКЦИИ ЯВЛЯЮТСЯ",
            "rA": [
                "птицы, зараженные арбовирусами;"
            ],
            "wA": [
                "блохи, зараженные чумными бактериями;",
                "вода, зараженная холерными вибрионами;",
                "малярийные комары;"
            ]
        },
        {
            "qID": 107,
            "qName": "ОК-1, ОПК-1, ПК-3 ВЕРТИКАЛЬНЫЙ ПУТЬ ПЕРЕДАЧИ ВОЗМОЖЕН ПРИ",
            "rA": [
                "вирусном гепатите В;"
            ],
            "wA": [
                "скарлатине;",
                "дизентерии;",
                "вирусном гепатите А;"
            ]
        },
        {
            "qID": 108,
            "qName": "ОК-1, ОПК-1, ПК-3 ТЕРМИНОМ  «ДЕКРЕТИРОВАННАЯ» ГРУППА НАСЕЛЕНИЯ ОБОЗНАЧАЕТСЯ",
            "rA": [
                "группа лиц, в отношении которых противоэпидемические мероприятия проводят особым образом;"
            ],
            "wA": [
                "группа населения, имеющая наибольший интенсивный показатель заболеваемости;",
                "группа населения, среди которой отмечается наибольшее число заболеваний;",
                "коллектив, в котором зарегистрирован хотя бы один случай «особо опасной» инфекции."
            ]
        },
        {
            "qID": 109,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 К КАТЕГОРИИ ОТДЕЛЬНЫХ «СОЦИАЛЬНО ЗНАЧИМЫХ БОЛЕЗНЕЙ», ПОДЛЕЖАЩИХ СПЕЦИАЛЬНОМУ УЧЕТУ, ОТНОСИТСЯ",
            "rA": [
                "наркомания"
            ],
            "wA": [
                "гипотиреоз",
                "описторхоз",
                "муковисцидоз"
            ]
        },
        {
            "qID": 110,
            "qName": "ОК-1, ОПК-1, ПК-3 ВОЗМОЖНОСТЬ РЕАЛИЗАЦИИ ВОЗДУШНО-ПЫЛЕВОГО ПУТИ ПЕРЕДАЧИ ЗАВИСИТ",
            "rA": [
                "от устойчивости возбудителя во внешней среде;"
            ],
            "wA": [
                "устойчивость не имеет значения;",
                "от скорости снижения вирулентности возбудителя;",
                "от дисперсности аэрозоля."
            ]
        },
        {
            "qID": 111,
            "qName": "ОК-1, ОПК-1, ПК-3 ИНФЕКЦИЯ, КОТОРАЯ ПЕРЕДАЕТСЯ ВОДНЫМ, ПИЩЕВЫМ И КОНТАКТНО-БЫТОВЫМ ПУТЯМИ",
            "rA": [
                "гепатит А;"
            ],
            "wA": [
                "скарлатина;",
                "чесотка;",
                "ВИЧ-инфекция."
            ]
        },
        {
            "qID": 112,
            "qName": "ОК-1, ОПК-1, ПК-3 ИНФЕКЦИЯ, ПРИ КОТОРОЙ ВОЗМОЖЕН  ПЕРЕХОД ЭПИЗООТИЧЕСКОГО ПРОЦЕССА В ЭПИДЕМИЧЕСКИЙ",
            "rA": [
                "чума;"
            ],
            "wA": [
                "туляремия;",
                "лептоспироз;",
                "бруцеллез."
            ]
        },
        {
            "qID": 113,
            "qName": "ОК-1, ОПК-1, ПК-3 СПЕЦИФИКУ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА ОПРЕДЕЛЯЕТ ФАКТОР",
            "rA": [
                "биологический;"
            ],
            "wA": [
                "социальный;",
                "природный."
            ]
        },
        {
            "qID": 114,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНЫЕ ИСТОЧНИКИ ИНФЕКЦИИ ПРИ ДИФТЕРИИ  В СОВРЕМЕННЫЙ ПЕРИОД",
            "rA": [
                "носители токсигенных штаммов;"
            ],
            "wA": [
                "больные клинически выраженными формами;",
                "носители нетоксигенных штаммов;",
                "больные стертыми формами инфекции."
            ]
        },
        {
            "qID": 115,
            "qName": "ОК-1, ОПК-1, ПК-3 ФАКТОРАМИ ПЕРЕДАЧИ ПРИ ВОЗНИКНОВЕНИИ ПИЩЕВЫХ ВСПЫШЕК ДИЗЕНТЕРИИ ЗОННЕ ЧАЩЕ ВСЕГО СЛУЖАТ",
            "rA": [
                "молочные продукты;"
            ],
            "wA": [
                "мясные продукты;",
                "овощи;",
                "фрукты."
            ]
        },
        {
            "qID": 116,
            "qName": "ОК-1, ОПК-1,  ПК-17 ОПТИМАЛЬНЫЙ РАЗМЕР ГРУППЫ СРАВНЕНИЯ В ИССЛЕДОВАНИИ СЛУЧАЙ – КОНТРОЛЬ",
            "rA": [
                "2-4 контроля на 1 случай;"
            ],
            "wA": [
                "чем больше контролей на один случай, тем надежнее результаты;",
                "1-2 контроля на 1 случай;",
                "1 контроль на 2-А случая;"
            ]
        },
        {
            "qID": 117,
            "qName": "ОК-1, ОПК-1  ВОЗБУДИТЕЛЕМ ВНЕБОЛЬНИЧНОЙ ПНЕВМОНИИ ЧАЩЕ ВСЕГО ЯВЛЯЕТСЯ",
            "rA": [
                "пневмококк"
            ],
            "wA": [
                "клебсиелла",
                "кишечная палочка",
                "легионелла"
            ]
        },
        {
            "qID": 118,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПОСЛЕ ПРИМЕНЕНИЯ ВАКЦИНЫ ФОРМИРУЕТСЯ ПРИОБРЕТЁННЫЙ\tВИД ИММУНИТЕТА",
            "rA": [
                "искусственный активный"
            ],
            "wA": [
                "естественный активный",
                "естественный пассивный",
                "искусственный пассивный"
            ]
        },
        {
            "qID": 119,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ ПОДОЗРЕНИИ У ПАЦИЕНТА ИНФЕКЦИОННОГО ЗАБОЛЕВАНИЯ НЕОБХОДИМО ЗАПОЛНИТЬ",
            "rA": [
                "экстренное извещение об инфекционном заболевании"
            ],
            "wA": [
                "статистический талон для регистрации заключительных диагнозов",
                "журнал учета инфекционных заболеваний",
                "листок ежедневного учета работы врача"
            ]
        },
        {
            "qID": 120,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНЫМИ ИСТОЧНИКАМИ ПРИ МЕНИНГОКОККОВОЙ ИНФЕКЦИИ ЯВЛЯЮТСЯ",
            "rA": [
                "резидентные носители."
            ],
            "wA": [
                "больные клинически выраженными формами;",
                "больные назофарингитом;",
                "транзиторные носители;"
            ]
        },
        {
            "qID": 121,
            "qName": "ОК-1, ОПК-1 ДЛЯ ПРОФИЛАКТИКИ БЕШЕНСТВА ПРИ УКУСЕ СОБАКОЙ ОПАСНОЙ ЛОКАЛИЗАЦИИ В ПЕРВУЮ ОЧЕРЕДЬ НЕОБХОДИМО ПРИМЕНИТЬ",
            "rA": [
                "антирабический иммуноглобулин"
            ],
            "wA": [
                "антибиотик широкого спектра действия",
                "когацел",
                "противостолбнячную сыворотку"
            ]
        },
        {
            "qID": 122,
            "qName": "ОК-1, ОПК-1, ПК-3 С ПРОФИЛАКТИЧЕСКОЙ ЦЕЛЬЮ БАКТЕРИОЛОГИЧЕСКИ ОБСЛЕДУЮТ НА НАЛИЧИЕ ДИФТЕРИИ",
            "rA": [
                "поступающих в детские дома, дома ребенка и специальные учреждения для детей и взрослых;"
            ],
            "wA": [
                "детей, обучающихся в школах и школах-интернатах;",
                "взрослых 30-40 лет;",
                "медицинских работников."
            ]
        },
        {
            "qID": 123,
            "qName": "ОК-1, ОПК-1, ПК-3  ПОД ТЕРМИНОМ «АТИПИЧНАЯ ПНЕВМОНИЯ» ПОНИМАЮТ",
            "rA": [
                "пневмонию, вызванную легионеллами, хламидиями или микоплазмами"
            ],
            "wA": [
                "пневмококковую пневмонию верхнедолевой локализации",
                "вирусную бронхопневмонию",
                "эозинофильный инфильтрат"
            ]
        },
        {
            "qID": 124,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 НОЗОКОМИАЛЬНОЙ ПРИНЯТО НАЗЫВАТЬ ПНЕВМОНИЮ, ВОЗНИКШУЮ",
            "rA": [
                "позднее 48 часов после госпитализации человека"
            ],
            "wA": [
                "у ранее не леченного человека",
                "у больного, лечившегося в домашних условиях от другого заболевания",
                "у беременной женщины после 20 недель беременности"
            ]
        },
        {
            "qID": 125,
            "qName": "ОК-1, ОПК-1, ПК-3 ПОД ЭПИДЕМИЧЕСКИМ ОЧАГОМ ТУБЕРКУЛЕЗНОЙ ИНФЕКЦИИ СЛЕДУЕТ ПОНИМАТЬ",
            "rA": [
                "больного, выделяющего ВК, его жилье и окружение."
            ],
            "wA": [
                "больного, выделяющего ВК;",
                "больного, выделяющего ВК и его жилье;",
                "место работы родителей"
            ]
        },
        {
            "qID": 126,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17  НАИБОЛЕЕ ЧАСТО ВИРУСНАЯ ИНФЕКЦИЯ ПОПАДАЕТ К ПЛОДУ______ПУТЕМ",
            "rA": [
                "трансплацентарным"
            ],
            "wA": [
                "восходящим",
                "аспирационным",
                "лимфогенным"
            ]
        },
        {
            "qID": 127,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНЫМ ИСТОЧНИКОМ ВОЗБУДИТЕЛЯ ТУБЕРКУЛЕЗА ДЛЯ ЧЕЛОВЕКА ЯВЛЯЕТСЯ",
            "rA": [
                "больные люди;"
            ],
            "wA": [
                "предметы окружающей среды;",
                "продукты питания;",
                "здоровье."
            ]
        },
        {
            "qID": 128,
            "qName": "ОК-1, ОПК-1, ПК-3 ЧАЩЕ ДРУГИХ ПОРАЖАЮТСЯ ТУБЕРКУЛЕЗОМ И МОГУТ СЛУЖИТЬ ИСТОЧНИКОМ ИНФЕКЦИИ ТУБЕРКУЛЕЗА СЛЕДУЮЩИЕ ВИДЫ ЖИВОТНЫХ",
            "rA": [
                "крупный рогатый скот;"
            ],
            "wA": [
                "кошки и собаки;",
                "птицы и лошади.",
                "аквариумные рыбки"
            ]
        },
        {
            "qID": 129,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17  ОБЪЕКТОМ ПЕРВИЧНОЙ ПРОФИЛАКТИКИ ЯВЛЯЮТСЯ",
            "rA": [
                "все жители территории"
            ],
            "wA": [
                "реконвалесценты острых заболеваний",
                "больные хроническими заболеваниями",
                "жители в трудоспособном возрасте"
            ]
        },
        {
            "qID": 130,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ЧАЩЕ ЗАБОЛЕВАЮТ ТУБЕРКУЛЕЗОМ И УМИРАЮТ ОТ НЕГО",
            "rA": [
                "мужчины;"
            ],
            "wA": [
                "женщины;",
                "одинаково часто и мужчины и женщины;",
                "животные."
            ]
        },
        {
            "qID": 131,
            "qName": "ОК-1, ОПК-1, ПК-3 ВЫСОКАЯ ЗАБОЛЕВАЕМОСТЬ ТУБЕРКУЛЕЗОМ ОБНАРУЖИВАЕТСЯ В НАСТОЯЩЕЕ ВРЕМЯ У",
            "rA": [
                "этнической группы населения (малые народы Север1. и мигрирующего населения;"
            ],
            "wA": [
                "постоянно живущего населения и аборигенной группы;",
                "мигрирующего населения",
                "медицинские работники"
            ]
        },
        {
            "qID": 132,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ КОНТАКТЕ С БАКТЕРИОВЫДЕЛИТЕЛЕМ ТУБЕРКУЛЕЗА ЧАЩЕ ЗАБОЛЕВАЮТ",
            "rA": [
                "не вакцинированные и не инфицированные"
            ],
            "wA": [
                "вакцинированные БЦЖ;",
                "инфицированные туберкулезом;",
                "медицинские работники"
            ]
        },
        {
            "qID": 133,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРАВОМОЧНОСТЬ ДЕЛЕНИЯ БОЛЬНЫХ АКТИВНЫМ ТУБЕРКУЛЕЗОМ НА 2 ФОРМЫ (ОТКРЫТУЮ И ЗАКРЫТУЮ) БАЗИРУЕТСЯ НА ПРЕДСТАВЛЕНИИ О",
            "rA": [
                "большой заражающей дозе"
            ],
            "wA": [
                "гетерогенности возбудителя;",
                "устойчивости его во внешней среде;",
                "способности к формированию L-форм;"
            ]
        },
        {
            "qID": 134,
            "qName": "ОК-1, ОПК-1, ПК-3 БОЛЬНОЙ ТУБЕРКУЛЕЗОМ НАИБОЛЕЕ ОПАСЕН ДЛЯ ПАЦИЕНТОВ СТАЦИОНАРА",
            "rA": [
                "акушерского;"
            ],
            "wA": [
                "терапевтического;",
                "инфекционного;",
                "хирургического."
            ]
        },
        {
            "qID": 135,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17  СОГЛАСНО КРИТЕРИЯМ ВОЗ, ПОДРОСТКАМИ СЧИТАЮТСЯ ЛИЦА В ВОЗРАСТЕ   ____ЛЕТ",
            "rA": [
                "15-17"
            ],
            "wA": [
                "10-18",
                "12-16",
                "15-20"
            ]
        },
        {
            "qID": 136,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРОДОЛЖИТЕЛЬНОСТЬ ИЗОЛЯЦИИ ЛИЦ, КОНТАКТИРОВАВШИХ С БОЛЬНЫМ ЧУМОЙ (ТРУПОМ), СОСТАВЛЯЕТ ______СУТОК",
            "rA": [
                "6"
            ],
            "wA": [
                "3",
                "10",
                "15"
            ]
        },
        {
            "qID": 137,
            "qName": "ОК-1, ОПК-1, ПК-3, ОСНОВНЫМ СПОСОБОМ ПРОФИЛАКТИКИ И БОРЬБЫ С КИШЕЧНЫМИ ИНФЕКЦИЯМИ ЯВЛЯЕТСЯ",
            "rA": [
                "комплекс санитарно-гигиенических мер, направленных на прерывание путей передачи"
            ],
            "wA": [
                "иммунизация восприимчивых контингентов",
                "раннее выявление и изоляция больных",
                "выявление и лечение бактерионосителей"
            ]
        },
        {
            "qID": 138,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНЫМ МЕТОДОМ ВЫЯВЛЕНИЯ ТУБЕРКУЛЕЗА У ДЕТЕЙ ЯВЛЯЕТСЯ",
            "rA": [
                "массовая туберкулодиагностика;"
            ],
            "wA": [
                "флюрография;",
                "обследование групп риска;",
                "обследование лиц, обратившихся к фтизиатру."
            ]
        },
        {
            "qID": 139,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОВЕДЕНИЕ МАССОВОЙ ТУБЕРКУЛОДИАГНОСТИКИ ОСУЩЕСТВЛЯЕТСЯ СПЕЦИАЛИСТАМИ",
            "rA": [
                "общей практики;"
            ],
            "wA": [
                "противотуберкулезных  диспансеров;",
                "противотуберкулезных стационаров;",
                "противоэпидемической службы."
            ]
        },
        {
            "qID": 140,
            "qName": "ОК-1, ОПК-1, ПК-3 ВАКЦИНАЦИЯ И РЕВАКЦИНАЦИЯ БЦЖ – ЭТО ПРОФИЛАКТИКА",
            "rA": [
                "генерализованных форм туберкулезной инфекции;"
            ],
            "wA": [
                "всех форм туберкулезной инфекции;",
                "инфицирования туберкулезом;",
                "заражения."
            ]
        },
        {
            "qID": 141,
            "qName": "ОК-1, ОПК-1 ДЛЯ ЭКСТРЕННОЙ ПРОФИЛАКТИКИ КЛЕЩЕВОГО ЭНЦЕФАЛИТА В ПЕРВЫЕ ТРИ ДНЯ ПОСЛЕ ПРИСАСЫВАНИЯ КЛЕЩА ИСПОЛЬЗУЮТ",
            "rA": [
                "гомологичный специфический иммуноглобулин"
            ],
            "wA": [
                "антибиотики",
                "циклоферон",
                "вакцину против клещевого энцефалита"
            ]
        },
        {
            "qID": 142,
            "qName": "ОК-1, ОПК-1 МЕДИЦИНСКИХ РАБОТНИКОВ, ИМЕЮЩИХ КОНТАКТ С КРОВЬЮ И ЕЕ КОМПОНЕНТАМИ, НА HBSAG ОБСЛЕДУЮТ",
            "rA": [
                "1 раз в год"
            ],
            "wA": [
                "1 раз в 2года",
                "ежеквартально",
                "при поступлении на работу"
            ]
        },
        {
            "qID": 143,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСТОЧНИКОМ ВИЧ-ИНФЕКЦИИ ОПРЕДЕЛЕННО МОЖНО СЧИТАТЬ",
            "rA": [
                "ВИЧ-инфицированного;"
            ],
            "wA": [
                "больного туберкулезом;",
                "человека, у которого антитела к ВИЧ обнаружены однократно методом ИФА;",
                "человека с признаками иммунодефицитного состояния;"
            ]
        },
        {
            "qID": 144,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИЧ-ИНФЕКЦИЯ ОТНОСИТЧСЯ К ГРУППЕ ИНФЕКЦИЙ С МЕХАНИЗМОМ ПЕРЕДАЧИ",
            "rA": [
                "контактным;"
            ],
            "wA": [
                "фекально-оральным;",
                "трансмиссивным;",
                "аэрозольным."
            ]
        },
        {
            "qID": 145,
            "qName": "ОК-1, ОПК-1, ПК-3 К ЧИСЛУ СТИХИЙНЫХ БЕДСТВИЙ, КОТОРЫЕ МОГУТ СЕРЬЕЗНО ОСЛОЖНИТЬ ОБСТАНОВКУ ПО ЗАБОЛЕВАЕМОСТИ КИШЕЧНЫМИ ИНФЕКЦИЯМИ, ОТНОСЯТ",
            "rA": [
                "нашествие саранчи"
            ],
            "wA": [
                "наводнения",
                "лесные пожары",
                "торнадо"
            ]
        },
        {
            "qID": 146,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОБСЛЕДОВАНИЕ БЕРЕМЕННЫХ ЖЕНЩИН НА HBSAG",
            "rA": [
                "проводится при постановке на учет и при уходе в декретный отпуск"
            ],
            "wA": [
                "не проводится;",
                "проводится при постановке на учет;",
                "по желанию беременной"
            ]
        },
        {
            "qID": 147,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ ВЫЯВЛЕНИИ БОЛЬНОГО ИНФЕКЦИОННОЙ БОЛЕЗНЬЮ ЛЕЧАЩИЙ ВРАЧ ОБЯЗАН",
            "rA": [
                "направить извещение о больном в ФГБУЗ «Центр гигиены и эпидемиологии»"
            ],
            "wA": [
                "выявить всех контактных",
                "определить границы эпидемического очага",
                "сообщить о контактных лицах по месту работы"
            ]
        },
        {
            "qID": 148,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ОБРАБОТКИ РУК МЕДИЦИНСКОГО ПЕРСОНАЛА, ЗАГРЯЗНЕННЫХ КРОВЬЮ БОЛЬНОГО ВИЧ-ИНФЕКЦИЕЙ, ИСПОЛЬЗУЮТ ЭТИЛОВЫЙ\t%СПИРТ",
            "rA": [
                "40"
            ],
            "wA": [
                "70",
                "80",
                "60"
            ]
        },
        {
            "qID": 149,
            "qName": "ОК-1, ОПК-1, ПК-3 НАЛИЧИЕ В КРОВИ ОБСЛЕДУЕМОГО ЛИЦА АНТИТЕЛ К ВИЧ СВИДЕТЕЛЬСТВУЕТ О/ОБ",
            "rA": [
                "вероятной инфицированности"
            ],
            "wA": [
                "приобретенном иммунитете;",
                "перенесенной в прошлом инфекции;",
                "невосприимчивости к инфекции;"
            ]
        },
        {
            "qID": 150,
            "qName": "ОК-1, ОПК-1 ОСНОВНЫМ ИНСТРУМЕНТАЛЬНЫМ МЕТОДОМ ОБСЛЕДОВАНИЯ БОЛЬНОГО ПРИ РАННЕЙ ДИАГНОСТИКЕ ТУБЕРКУЛЕЗА ЛЕГКИХ ЯВЛЯЕТСЯ",
            "rA": [
                "флюорография"
            ],
            "wA": [
                "бронхоскопия",
                "спирография",
                "сцинтиграфия"
            ]
        },
        {
            "qID": 151,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ИЗВЕСТНЫХ ПУТЕЙ ПЕРЕДАЧИ  ВИЧ ПРАКТИЧЕСКИ К 100% ЗАРАЖЕНИЮ ПРИВОДИТ",
            "rA": [
                "переливание крови;"
            ],
            "wA": [
                "перинатальное инфицирование;",
                "половой контакт;",
                "внутривенное введение наркотика нестерильным инструментом."
            ]
        },
        {
            "qID": 152,
            "qName": "ОК-1, ОПК-1, ПК-3 ] НАЛЕТ НА МИНДАЛИНАХ РАСПРОСТРАНЯЕТСЯ ЗА ЕЕ ПРЕДЕЛЫ ПРИ",
            "rA": [
                "дифтерии глотки"
            ],
            "wA": [
                "лакунарной ангине",
                "язвенно-некротической ангине",
                "катаральной ангине"
            ]
        },
        {
            "qID": 153,
            "qName": "ОК-1, ОПК-1 ВИЧ-ИНФЕКЦИЯ ПЕРЕДАЕТСЯ\tПУТЕМ",
            "rA": [
                "половым"
            ],
            "wA": [
                "природно-очаговым",
                "воздушно-капельным",
                "трансмиссивным"
            ]
        },
        {
            "qID": 154,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСТОЧНИКОМ ВИЧ-ИНФЕКЦИИ ЯВЛЯЕТСЯ ЧЕЛОВЕК",
            "rA": [
                "в любой стадии болезни, включая терминальную."
            ],
            "wA": [
                "инкубационном периоде;",
                "стадии первичных проявлений болезни;",
                "стадии вторичных проявлений болезни;"
            ]
        },
        {
            "qID": 155,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОДОЛЖИТЕЛЬНОСТЬ ЖИЗНИ  ВИЧ В ИСПОЛЬЗОВАННОМ ШПРИЦЕ ИЛИ ПОЛОЙ ИГЛЕ (БЕЗ СТЕРИЛИЗАЦИИ) СОСТАВЛЯЕТ НЕСКОЛЬКО",
            "rA": [
                "дней"
            ],
            "wA": [
                "минут",
                "часов"
            ]
        },
        {
            "qID": 156,
            "qName": "ОК-1, ОПК-1, ПК-3 ЗАБОЛЕВАЕМОСТЬ  ВИЧ-ИНФЕКЦИЕЙ МОЖНО ХАРАКТЕРИЗОВАТЬ   КАК",
            "rA": [
                "пандемическую"
            ],
            "wA": [
                "спорадической",
                "эпидемической",
                "вспышечной"
            ]
        },
        {
            "qID": 157,
            "qName": "ОК-1, ОПК-1, ПК-3 ВЕДУЩИМ СПОСОБОМ ПЕРЕДАЧИ  ВИЧ В НАСТОЯЩЕЕ ВРЕМЯ В РОССИИ ЯВЛЯЕТСЯ",
            "rA": [
                "половой;"
            ],
            "wA": [
                "вертикальный;",
                "инъекционный среди наркоманов;",
                "шприцевой в МО"
            ]
        },
        {
            "qID": 158,
            "qName": "ОК-1, ОПК-1, ПК-3 САНИТАРНО-ГИГИЕНИЧЕСКИЕ И ПРОТИВОЭПИДЕМИЧЕСКИЕ МЕРОПРИЯТИЯ ПРОВОДЯТСЯ С ЦЕЛЬЮ",
            "rA": [
                "сохранения и укрепления здоровья населения, а также профилактики инфекционных болезней и ликвидации эпидемических очагов"
            ],
            "wA": [
                "недопущения распространения инфекционных болезней",
                "своевременного оказания населению медицинской помощи",
                "предупреждения возникновения и распространения инфекционных заболеваний среди населения"
            ]
        },
        {
            "qID": 159,
            "qName": "ОК-1, ОПК-1, ПК-3 ГРУППОЙ РИСКА ЗАРАЖЕНИЯ ВИЧ-ИНФЕКЦИЕЙ ЯВЛЯЮТСЯ ЛИЦА В ВОЗРАСТЕ",
            "rA": [
                "20-30 лет;"
            ],
            "wA": [
                "до года;",
                "31-40 лет;",
                "50 лет и старше;",
                "дети до 14 лет."
            ]
        },
        {
            "qID": 160,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПОНЯТИЕ «КАРАНТИН» ВКЛЮЧАЕТ",
            "rA": [
                "изоляционные и противоэпидемические мероприятия, направленные на локализацию и ликвидацию эпидемического очага"
            ],
            "wA": [
                "уничтожение насекомых-переносчиков инфекционных болезней",
                "уничтожение в окружающей среде возбудителей инфекционных болезней",
                "ограничительные мероприятия и усиленное медицинское наблюдение, направленные на предупреждение распространения инфекционных болезней"
            ]
        },
        {
            "qID": 161,
            "qName": "ОК-1, ОПК-1, ПК-3 ОБСЕРВАЦИЯ ПРОВОДИТСЯ В РАЙОНАХ ЧРЕЗВЫЧАЙНОЙ СИТУАЦИИ С",
            "rA": [
                "неблагополучным или чрезвычайным санитарно-эпидемическим состоянием"
            ],
            "wA": [
                "неустойчивым санитарно-эпидемическим состоянием",
                "чрезвычайным санитарно-эпидемическим состоянием",
                "появлением групповых неконтагиозных заболеваний"
            ]
        },
        {
            "qID": 162,
            "qName": "ОК-1, ОПК-1, ПК-3 РАСПОРЯЖЕНИЕ О ПРОВЕДЕНИИ ЭКСТРЕННОЙ ПРОФИЛАКТИКИ ВЫДАЕТ",
            "rA": [
                "санитарно-противоэпидемическая комиссия"
            ],
            "wA": [
                "главный врач санэпидемстанции",
                "главный врач инфекционной больницы",
                "эпидемиолог"
            ]
        },
        {
            "qID": 163,
            "qName": "ОК-1, ОПК-1  ПРОДОЛЖИТЕЛЬНОСТЬ ФЕНОМЕНА «ОКНА» ПРИ ВИЧ-ИНФЕКЦИИ СОСТАВЛЯЕТ",
            "rA": [
                "1-1,5 месяца;"
            ],
            "wA": [
                "1 неделю;",
                "2 месяца;",
                "3 месяца."
            ]
        },
        {
            "qID": 164,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 РЕЖИМ КАРАНТИНА ВВОДИТСЯ",
            "rA": [
                "на срок максимального инкубационного периода соответствующего инфекционного заболевания с момента изоляции последнего больного"
            ],
            "wA": [
                "с момента изоляции последнего больного и окончания дезинфекции в очаге заражения",
                "на два инкубационных периода соответствующего инфекционного заболевания",
                "на срок одного инкубационного периода инфекционного заболевания"
            ]
        },
        {
            "qID": 165,
            "qName": "ОК-1, ОПК-1, ПК-3 МАРКЕРАМИ ИЗЛЕЧЕННОСТИ ОТ ГЕПАТИТА В И ЭФФЕКТИВНОСТИ  ВВЕДЕНИЯ ВАКЦИНЫ ПРОТИВ ГЕПАТИТА В ЯВЛЯЮТСЯ",
            "rA": [
                "анти-HBs;"
            ],
            "wA": [
                "HbsAg;",
                "анти-HBcgrM;",
                "HbeAg."
            ]
        },
        {
            "qID": 166,
            "qName": "ОК-1, ОПК-1, ПК-3 ОБСЕРВАЦИЯ ВКЛЮЧАЕТ",
            "rA": [
                "ограничительные мероприятия и усиленное медицинское наблюдение, направленные на предупреждение распространения инфекционных болезней"
            ],
            "wA": [
                "изоляционные и противоэпидемические мероприятия, направленные на локализацию и ликвидацию эпидемического очага",
                "уничтожение в окружающей среде возбудителей инфекционных болезней",
                "изоляцию инфекционных больных"
            ]
        },
        {
            "qID": 167,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПОПУЛЯЦИОННАЯ СТРАТЕГИЯ ПРЕДПОЛАГАЕТ",
            "rA": [
                "формирование здорового образа жизни на уровне всего населения и обеспечение для этого соответствующих условий"
            ],
            "wA": [
                "своевременное выявление лиц с повышенным уровнем факторов риска и проведение мероприятий по их коррекции",
                "предупреждение прогрессирования хронических неинфекционных заболеваний как за счет коррекции факторов риска, так и за счет своевременного проведения лечения и мер реабилитации",
                "разделение населения на группы в зависимости от возраста"
            ]
        },
        {
            "qID": 168,
            "qName": "ОК-1, ОПК-1, ПК-3 СРЕДИ ПРЕДЛОЖЕННЫХ В НАСТОЯЩЕЕ ВРЕМЯ МЕТОДОВ СПЕЦИФИЧЕСКОЙ ЛАБОРАТОРНОЙ ДИАГНОСТИКИ ВИРУСНЫХ ГЕПАТИТОВ НАИБОЛЕЕ ЧУВСТВИТЕЛЬНЫМ И ДОСТУПНЫМ ЯВЛЯЕТСЯ",
            "rA": [
                "иммуноферментный анализ;"
            ],
            "wA": [
                "реакция преципитации в геле;",
                "встречный иммуноэлектрофорез;",
                "реакция обратной пассивной гемагглютинации;"
            ]
        },
        {
            "qID": 169,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ЧИСЛА ДИАГНОСТИРУЕМЫХ В НАСТОЯЩЕЕ ВРЕМЯ ВИРУСНЫХ ГЕПАТИТОВ ХРОНИЧЕСКОЕ ТЕЧЕНИЕ НАИБОЛЕЕ ЧАСТО ПРИОБРЕТАЕТ  ГЕПАТИТ",
            "rA": [
                "С;"
            ],
            "wA": [
                "Е;",
                "А;",
                "В."
            ]
        },
        {
            "qID": 170,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 СТРАТЕГИЯ ВЫСОКОГО РИСКА ЗАКЛЮЧАЕТСЯ В",
            "rA": [
                "своевременном выявлении лиц с повышенным уровнем факторов риска и проведение мероприятий по их коррекции"
            ],
            "wA": [
                "формировании здорового образа жизни на уровне всего населения и обеспечение для этого соответствующих условий",
                "предупреждении прогрессирования хронических неинфекционных заболеваний как за счет коррекции факторов риска, так и за счет своевременного проведения лечения и мер реабилитации",
                "разделение населения на группы в зависимости от возраста"
            ]
        },
        {
            "qID": 171,
            "qName": "ОК-1, ОПК-1, ПК-3  ПРИ УСТАНОВЛЕНИИ ДИАГНОЗА \"ТОНЗИЛЛОФАРИНГИТ\" С НАЛЕТОМ НА МИНДАЛИНАХ ОБЯЗАН НАЗНАЧИТЬ",
            "rA": [
                "мазок из миндалин на дифтерию"
            ],
            "wA": [
                "анализ крови на вирус иммунодефицита человека",
                "анализ крови на реакцию вассермана",
                "анализ крови на реакцию видаля"
            ]
        },
        {
            "qID": 172,
            "qName": "ОК-1, ОПК-1 МОЖНО РЕКОМЕНДОВАТЬ ГРУДНОЕ ВСКАРМЛИВАНИЕ  НОВОРОЖДЕННЫХ ОТ ВИЧ-ИНФИЦИРОВАННЫХ МАТЕРЕЙ",
            "rA": [
                "нет;"
            ],
            "wA": [
                "да;",
                "да, если слизистая полости рта новорожденного без повреждений;",
                "да, если не прорезались зубы;",
                "нет, если соски имеют трещины."
            ]
        },
        {
            "qID": 173,
            "qName": "ОК-1, ОПК-1 ПРИ НАЛИЧИИ ОСТРОЙ ЛАКУНАРНОЙ АНГИНЫ СЛЕДУЕТ ИСКЛЮЧИТЬ",
            "rA": [
                "дифтерию"
            ],
            "wA": [
                "грипп",
                "парагрипп",
                "паратонзиллярный абсцесс"
            ]
        },
        {
            "qID": 174,
            "qName": "ОК-1, ОПК-1 ДИСПАНСЕРНОЕ НАБЛЮДЕНИЕ ЗА ВИЧ-ИНФИЦИРОВАННЫМИ И БОЛЬНЫМИ СПИД ОСУЩЕСТВЛЯЮТ",
            "rA": [
                "врачи КИЗ (кабинетов инфекционных заболеваний) поликлиник"
            ],
            "wA": [
                "инфекционные больницы",
                "кожно-венерические диспансеры",
                "поликлиники ближайшего регионального центра СПИД"
            ]
        },
        {
            "qID": 175,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ЧАСТОТА ПРОФИЛАКТИЧЕСКОЙ ВАКЦИНАЦИИ ОТ ГРИППА БОЛЬНЫХ ХРОНИЧЕСКОЙ ОБСТРУКТИВНОЙ БОЛЕЗНЬЮ ЛЁГКИХ ЛЕГКОЙ И СРЕДНЕЙ СТЕПЕНИ ТЯЖЕСТИ СОСТАВЛЯЕТ 1 РАЗ В",
            "rA": [
                "год"
            ],
            "wA": [
                "полгода",
                "2 года",
                "3 года"
            ]
        },
        {
            "qID": 176,
            "qName": "ОК-1, ОПК-1, ПК-3 ВТОРИЧНАЯ ПРОФИЛАКТИКА ВКЛЮЧАЕТ",
            "rA": [
                "мероприятия, предупреждающие развитие осложнений и рецидивов заболеваний"
            ],
            "wA": [
                "проведение прививок",
                "мероприятия, предупреждающие развитие заболеваний",
                "выявление заболеваний"
            ]
        },
        {
            "qID": 177,
            "qName": "ОК-1, ОПК-1 ПРАВИЛА ОБЕЗЗАРАЖИВАНИЯ РУК МЕДИЦИНСКОГО ПЕРСОНАЛА (ДЛЯ ПРОФИЛАКТИКИ ВИЧ) ПРИ ЗАГРЯЗНЕНИИ ИХ КРОВЬЮ ИЛИ СЫВОРОТКОЙ",
            "rA": [
                "обработать 70% спиртом, вымыть водой с мылом, повторно обработать 70% спиртом;"
            ],
            "wA": [
                "обработать тампоном, смоченным 96% спиртом;",
                "вымыть с водой и мылом, затем обработать тампоном, смоченным 0,5% раствором хлорамина, повторно вымыть с водой и мылом;",
                "тщательно вымыть руки с мылом;",
                "снять «щипком» капли крови или сыворотки сухим тампоном, обработать руки 1% раствором хлорамина;"
            ]
        },
        {
            "qID": 178,
            "qName": "ОК-1, ОПК-1 ПК-17 НАИБОЛЕЕ ЭФФЕКТИВНЫМИ  МЕРАМИ  ПРОФИЛАКТИКИ ВИЧ СРЕДИ НАСЕЛЕНИЯ ЯВЛЯЮТСЯ",
            "rA": [
                "санитарно-просветительная работа среди населения;"
            ],
            "wA": [
                "применение медикаментов и вакцин по специфической профилактике, угрожаемых контингентов;",
                "массовое обследование для выявления всех инфицированных;",
                "изоляция инфицированных и больных СПИД;"
            ]
        },
        {
            "qID": 179,
            "qName": "ОК-1, ОПК-1,ПК-17 К ФАКТОРАМ РИСКА У ПОЖИЛЫХ, НЕПОСРЕДСТВЕННО ВЛИЯЮЩИМ НА СМЕРТНОСТЬ, ОТНОСИТСЯ",
            "rA": [
                "высокое систолическое ад на плечевой артерии"
            ],
            "wA": [
                "высокое диастолическое ад на плечевой артерии",
                "высокое систолическое ад на голени",
                "низкое систолическое АД на голени"
            ]
        },
        {
            "qID": 180,
            "qName": "ОК-1, ОПК-1, ПК-17 К ОСНОВНЫМ ПРОФИЛАКТИЧЕСКИМ МЕРОПРИЯТИЯМ САХАРНОГО ДИАБЕТА 2 ТИПА ОТНОСЯТСЯ",
            "rA": [
                "рациональное питание, физическая активность, предупреждение ожирения и его лечение"
            ],
            "wA": [
                "рациональное питание, физическая активность",
                "предупреждение ожирения и его лечение",
                "рациональное питание, профилактика атеросклероза"
            ]
        },
        {
            "qID": 181,
            "qName": "ОК-1, ОПК-1 ОДЕВАТЬ РЕЗИНОВЫЕ ПЕРЧАТКИ ДЛЯ ПРОФИЛАКТИКИ ВИЧ НЕОБХОДИМО ПРИ ИНЪЕКЦИЯХ",
            "rA": [
                "любых;"
            ],
            "wA": [
                "внутривенных;",
                "подкожных;",
                "внутримышечных;",
                "накожных."
            ]
        },
        {
            "qID": 182,
            "qName": "ОК-1, ОПК-1 ВЕДУЩИМИ ВОЗБУДИТЕЛЯМИ ИНФЕКЦИЙ КРОВОТОКА, СВЯЗАННЫХ С КАТЕТЕРИЗАЦИЕЙ, ЯВЛЯЮТСЯ",
            "rA": [
                "Коагулазо отрицательные стафилококки;"
            ],
            "wA": [
                "Staphylococcus aureus;",
                "Pseudomonas aeruginosa;",
                "Acinetobacter calcoaceticus;"
            ]
        },
        {
            "qID": 183,
            "qName": "ОК-1, ОПК-1  ПРИ ПОДОЗРЕНИИ НА ТУБЕРКУЛЕЗ ОБСЛЕДОВАНИЮ ПОДЛЕЖАТ БОЛЬНЫЕ С ЖАЛОБАМИ НА",
            "rA": [
                "кашель с мокротой, потливость, потерю массы тела"
            ],
            "wA": [
                "слабость, одышку, тяжесть за грудиной, потливость",
                "потливость, одышку, головную боль, потерю массы тела",
                "учащенное сердцебиение, потливость, малый субфебрилитет"
            ]
        },
        {
            "qID": 184,
            "qName": "ОК-1, ОПК-1 У БОЛЬНОГО В ХИРУРГИЧЕСКОМ ОТДЕЛЕНИИ ПОСЛЕ ОПЕРАЦИИ ВЫЯВЛЕН УРОГЕНИТАЛЬНЫЙ ХЛАМИДИОЗ. НЕОБХОДИМЫЕ МЕРЫ",
            "rA": [
                "продолжить лечение в данном отделении"
            ],
            "wA": [
                "срочный перевод в инфекционную больницу;",
                "изоляция больного в боксе;",
                "перевести в урологическое отделение"
            ]
        },
        {
            "qID": 185,
            "qName": "ОК-1, ОПК-1 САМЫЙ ВЫСОКИЙ РИСК ВОЗНИКНОВЕНИЯ ГСИ ПРЕДСТАВЛЯЮТ ОПЕРАТИВНЫЕ ВМЕШАТЕЛЬСТВА ИЗ КЛАССА",
            "rA": [
                "грязные;"
            ],
            "wA": [
                "условно-чистые;",
                "загрязненные, контаминированные;",
                "чистые."
            ]
        },
        {
            "qID": 186,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОСОБЕННОСТИ РАЗВИТИЯ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА  ИСМП ОБУСЛОВЛЕНЫ ПРЕИМУЩЕСТВЕННО",
            "rA": [
                "особенностями лечебно-диагностического процесса;"
            ],
            "wA": [
                "биологическими свойствами возбудителей;",
                "наличием носителей среди медицинского персонала",
                "особенностями резистентности пациента"
            ]
        },
        {
            "qID": 187,
            "qName": "ОК-1, ОПК-1, ПК-3 УЧЕТНАЯ ФОРМА 058/У – ЭТО",
            "rA": [
                "экстренное извещение об инфекционном заболевании, пищевом, остром профессиональном отравлении, необычной реакции на прививку"
            ],
            "wA": [
                "извещение о больном с впервые в жизни установленным диагнозом рака или другого злокачественного новообразования",
                "извещение о больном с впервые в жизни установленным диагнозом активного туберкулеза, венерической болезни, трихофитии, микроспории, фавуса, чесотки, трахомы, психического заболевания",
                "статистический талон для регистрации заключительных (уточненных) диагнозов"
            ]
        },
        {
            "qID": 188,
            "qName": "ОК-1, ОПК-1 ЧАСТОТА ЗАБОЛЕВАНИЙ, ВЫЯВЛЕННЫХ ПРИ ПРОФИЛАКТИЧЕСКИХ ОСМОТРАХ, НАЗЫВАЕТСЯ",
            "rA": [
                "патологической пораженностью"
            ],
            "wA": [
                "распространенностью",
                "первичной заболеваемостью",
                "болезненностью"
            ]
        },
        {
            "qID": 189,
            "qName": "ОК-1, ОПК-1, ПК-17 ЭКСТЕНСИВНЫЙ ПОКАЗАТЕЛЬ ХАРАКТЕРИЗУЕТ",
            "rA": [
                "структуру явления"
            ],
            "wA": [
                "репрезентативность",
                "достоверность",
                "взаимосвязь признаков"
            ]
        },
        {
            "qID": 190,
            "qName": "ОК-1, ОПК-1 БАКТЕРИЕМИИ  В ОТДЕЛЕНИИ РЕАНИМАЦИИ ЧАЩЕ ВЫЗЫВАЮТСЯ",
            "rA": [
                "коагулазонегативным стафилококком;"
            ],
            "wA": [
                "золотистым стафилококком;",
                "стрептококком",
                "кишечной палочкой"
            ]
        },
        {
            "qID": 191,
            "qName": "ОК-1, ОПК-1 РИСК ВОЗНИКНОВЕНИЯ  ИСМП  ПРИ ПРОВЕДЕНИИ ОПЕРАТИВНЫХ ВМЕШАТЕЛЬСТВ С ВЫСОКИМ РИСКОМ РАЗВИТИЯ ЭНДОГЕННОЙ ИНФЕКЦИИ МОЖЕТ БЫТЬ СНИЖЕН ЗА СЧЕТ",
            "rA": [
                "адекватной антибиотикопрофилактики;"
            ],
            "wA": [
                "санации носителей стафилококка;",
                "увеличение кратности воздухообмена в операционной",
                "показателей здоровья персонала"
            ]
        },
        {
            "qID": 192,
            "qName": "ОК-1, ОПК-1 ИСМП   ВЫЗЫВАЮТСЯ МИКРООРГАНИЗМАМИ",
            "rA": [
                "патогенными и условно-патогенными"
            ],
            "wA": [
                "патогенными;",
                "условно-патогенными;",
                "грибами"
            ]
        },
        {
            "qID": 193,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ В УЧРЕЖДЕНИЕ ПРОТИВОЭПИДЕМИЧЕСКОЙ СЛУЖБЫ МЕДИЦИНСКИЙ РАБОТНИК  ОТПРАВЛЯЕТ",
            "rA": [
                "при подозрении на инфекционное заболевание"
            ],
            "wA": [
                "только после бактериологического подтверждение заболевания",
                "только после консультации с врачом-инфекционистом",
                "после госпитализации больного"
            ]
        },
        {
            "qID": 194,
            "qName": "ОК-1, ОПК-1 БОЛЬНОЙ ПРЕДСТАВЛЯЕТ ЭПИДЕМИОЛОГИЧЕСКУЮ ОПАСНОСТЬ ДЛЯ ОКРУЖАЮЩИХ В КОНЦЕ ИНКУБАЦИОННОГО ПЕРИОДА ПРИ",
            "rA": [
                "вирусном гепатите А"
            ],
            "wA": [
                "брюшном тифе",
                "сальмонеллезе",
                "иерсиниозе"
            ]
        },
        {
            "qID": 195,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОТИВОЭПИДЕМИЧЕСКИЕ МЕРОПРИЯТИЯ – ЭТО МЕРОПРИЯТИЯ, НАПРАВЛЕННЫЕ НА ПРОФИЛАКТИКУ",
            "rA": [
                "инфекционных заболеваний"
            ],
            "wA": [
                "неинфекционных заболеваний",
                "инфекционных и неинфекционных заболеваний",
                "заболеваний отдельных групп населения"
            ]
        },
        {
            "qID": 196,
            "qName": "ОК-1, ОПК-1 ОБЯЗАТЕЛЬНЫМ УСЛОВИЕМ ДЛЯ ПРОВЕДЕНИЯ МЕРОПРИЯТИЙ ПО ИНАКТИВАЦИИ ВИЧ ЯВЛЯЕТСЯ",
            "rA": [
                "предстерилизационная очистка инструментов"
            ],
            "wA": [
                "кипячение инструментов",
                "применение дезинфицирующих средств в повышенных концентрациях",
                "заключительная дезинфекция"
            ]
        },
        {
            "qID": 197,
            "qName": "ОК-1, ОПК-1 ВЕДУЩИМИ СПОСОБАМИ ЗАЩИТЫ ОТ ДИФТЕРИИ ЯВЛЯЮТСЯ",
            "rA": [
                "вакцинопрофилактика"
            ],
            "wA": [
                "антибиотикопрофилактика",
                "меры разобщения",
                "дезинфекционные мероприятия"
            ]
        },
        {
            "qID": 198,
            "qName": "ОК-1, ОПК-1 СРЕДСТВО УПРАВЛЕНИЯ ЭПИДЕМИЧЕСКИМ ПРОЦЕССОМ АЭРОЗОЛЬНЫХ ИНФЕКЦИЙ",
            "rA": [
                "иммунопрофилактика"
            ],
            "wA": [
                "изоляционные мероприятия",
                "дезинфекционные мероприятия",
                "санитарно-гигиенические мероприятия"
            ]
        },
        {
            "qID": 199,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ЭФФЕКТИВНОСТЬ ПРОТИВОЭПИДЕМИЧЕСКИХ МЕРОПРИЯТИЙ – ЭТО",
            "rA": [
                "достижение необходимого результата за счет эффективного  мероприятия"
            ],
            "wA": [
                "соответствие  мероприятий нормативным требованиям",
                "соответствие используемых средств национальным (международным) стандартам",
                "предотвращение морального ущерба"
            ]
        },
        {
            "qID": 200,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНОЙ МЕТОД ДЕЗИНФЕКЦИИ ОБЪЕКТОВ ВНЕШНЕЙ СРЕДЫ",
            "rA": [
                "химический"
            ],
            "wA": [
                "механический",
                "физический",
                "очистка"
            ]
        },
        {
            "qID": 201,
            "qName": "ОК-1, ОПК-1 ПРОФИЛАКТИЧЕСКОЙ ДЕЗИНФЕКЦИЕЙ ЯВЛЯЕТСЯ",
            "rA": [
                "дезинфекция воды на водопроводной станции"
            ],
            "wA": [
                "дезинфекция в квартире, где находится больной дизентерией",
                "систематическая дезинфекция мокроты больного туберкулезом",
                "дезинфекция помещений и оборудования в инфекционном стационаре"
            ]
        },
        {
            "qID": 202,
            "qName": "ОК-1, ОПК-1, ПК-3 СТЕРИЛИЗАЦИЯ ИНСТРУМЕНТОВ В СУХОЖАРОВОМ ШКАФУ ПРОВОДИТСЯ ПРИ ТЕМПЕРАТУРЕ _____ °С _____ МИНУТ",
            "rA": [
                "180; 45"
            ],
            "wA": [
                "125; 45",
                "160; 40",
                "80; 60"
            ]
        },
        {
            "qID": 203,
            "qName": "ОК-1, ОПК-1 ИЗ МЕТОДОВ ДЕЗИНФЕКЦИИ НАИБОЛЕЕ ВЫРАЖЕННОЙ СПЕЦИФИЧНОСТЬЮ ДЕЙСТВИЯ ОБЛАДАЕТ",
            "rA": [
                "биологический"
            ],
            "wA": [
                "физический",
                "химический",
                "механический"
            ]
        },
        {
            "qID": 204,
            "qName": "ОК-1, ОПК-1, ПК-3 БОРЬБУ С ПЕРЕНОСЧИКАМИ ИНФЕКЦИОННЫХ БОЛЕЗНЕЙ ОСУЩЕСТВЛЯЮТ ПУТЕМ ПРОВЕДЕНИЯ",
            "rA": [
                "дезинсекции"
            ],
            "wA": [
                "дезинфекции",
                "санитарно-гигиенических мероприятий",
                "дератизации"
            ]
        },
        {
            "qID": 205,
            "qName": "ОК-1, ОПК-1 ИЗ ИСТРЕБИТЕЛЬНЫХ ДЕЗИНСЕКЦИОННЫХ МЕРОПРИЯТИЙ В БОРЬБЕ С ОКРЫЛЕННЫМИ СТАДИЯМИ РАЗВИТИЯ МУХ НАИБОЛЕЕ ЧАСТО ПРИМЕНЯЕТСЯ",
            "rA": [
                "механический"
            ],
            "wA": [
                "физический",
                "химический",
                "биологический"
            ]
        },
        {
            "qID": 206,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕТОДОМ ХИМИЧЕСКОЙ (ХОЛОДНОЙ) СТЕРИЛИЗАЦИИ СТЕРИЛИЗУЮТ",
            "rA": [
                "зеркала, изделия из стекла"
            ],
            "wA": [
                "наконечники",
                "боры",
                "одноразовые шприцы"
            ]
        },
        {
            "qID": 207,
            "qName": "ОК-1, ОПК-1 К МЕРАМ ЛИЧНОЙ ЗАЩИТЫ ОТ КЛЕЩЕЙ ОТНОСИТСЯ ИСПОЛЬЗОВАНИЕ",
            "rA": [
                "репеллентов, защитной одежды"
            ],
            "wA": [
                "репеллентов",
                "репеллентов, защитной одежды, сетки Павловского",
                "вакцинации"
            ]
        },
        {
            "qID": 208,
            "qName": "ОК-1, ОПК-1, ПК-3 В СИСТЕМЕ ПРОТИВОЭПИДЕМИЧЕСКИХ МЕРОПРИЯТИЙ КАМЕРНАЯ ДЕЗИНФЕКЦИЯ И ДЕЗИНСЕКЦИЯ НАПРАВЛЕНЫ НА",
            "rA": [
                "пути передачи возбудителя"
            ],
            "wA": [
                "источник инфекции",
                "восприимчивый организм",
                "исполнение нормативных документов"
            ]
        },
        {
            "qID": 209,
            "qName": "ОК-1, ОПК-1, ПК-3 АВТОКЛАВИРОВАНИЕМ СТЕРИЛИЗУЮТСЯ",
            "rA": [
                "марлевые тампоны, наконечники"
            ],
            "wA": [
                "одноразовые шприцы",
                "пластмассовые шпатели",
                "слюноотсосы, зеркала"
            ]
        },
        {
            "qID": 210,
            "qName": "ОК-1, ОПК-1, ПК-3 В СИСТЕМЕ ПРОТИВОЭПИДЕМИЧЕСКИХ МЕРОПРИЯТИЙ ДЕЗИНСЕКЦИЯ НАПРАВЛЕНА НА",
            "rA": [
                "пути передачи возбудителя"
            ],
            "wA": [
                "источник инфекции",
                "восприимчивый организм",
                "обеспечение безопасности"
            ]
        },
        {
            "qID": 211,
            "qName": "ОК-1, ОПК-1, ПК-3 В СИСТЕМЕ ПРОТИВОЭПИДЕМИЧЕСКИХ МЕРОПРИЯТИЙ ДЕРАТИЗАЦИЯ НАПРАВЛЕНА НА",
            "rA": [
                "источник инфекции"
            ],
            "wA": [
                "пути передачи возбудителя",
                "восприимчивый организм",
                "обеспечение безопасности"
            ]
        },
        {
            "qID": 212,
            "qName": "ОК-1, ОПК-1 ЦЕЛЬЮ ИСПОЛЬЗОВАНИЯ АППАРАТА «АССИСТИНА» ЯВЛЯЕТСЯ",
            "rA": [
                "предстерилизационная очистка и смазывание наконечников"
            ],
            "wA": [
                "стерилизация наконечников",
                "дезинфекция боров",
                "дезинфекция эндодонтического инструментария"
            ]
        },
        {
            "qID": 213,
            "qName": "ОК-1, ОПК-1, ПК-3 СРЕДСТВОМ, ИСПОЛЬЗУЕМЫМ ДЛЯ ХОЛОДНОЙ СТЕРИЛИЗАЦИИ СТОМАТОЛОГИЧЕСКИХ ЗЕРКАЛ, ЯВЛЯЕТСЯ",
            "rA": [
                "6% раствор перекиси водорода"
            ],
            "wA": [
                "1% раствор перекиси водорода",
                "0,5% раствор хлорамина",
                "75% метиловый спирт"
            ]
        },
        {
            "qID": 214,
            "qName": "ОК-1, ОПК-1, ПК-3 БОРЬБУ С КРОВОСОСУЩИМИ ЧЛЕНИСТОНОГИМИ ОСУЩЕСТВЛЯЮТ ПУТЕМ ПРОВЕДЕНИЯ",
            "rA": [
                "дезинсекции"
            ],
            "wA": [
                "дезинфекции",
                "санитарно-гигиенических мероприятий",
                "дератизации"
            ]
        },
        {
            "qID": 215,
            "qName": "ОК-1, ОПК-1 С ПОМОЩЬЮ АМИДОПИРИНОВОЙ ПРОБЫ ОПРЕДЕЛЯЮТ",
            "rA": [
                "остатки крови на инструментах"
            ],
            "wA": [
                "остатки моющих средств",
                "стерильность инструментов",
                "наличие жира"
            ]
        },
        {
            "qID": 216,
            "qName": "ОК-1, ОПК-1, ПК-3 СТОМАТОЛОГИЧЕСКИЕ ЗЕРКАЛА СТЕРИЛИЗУЮТСЯ МЕТОДОМ ХИМИЧЕСКОЙ СТЕРИЛИЗАЦИИ ПО ВРЕМЕНИ (ЧАС)",
            "rA": [
                "1-2"
            ],
            "wA": [
                "2-3",
                "3",
                "4-5"
            ]
        },
        {
            "qID": 217,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОЦЕСС УНИЧТОЖЕНИЯ БОЛЬШИНСТВА ПАТОГЕННЫХ МИКРООРГАНИЗМОВ  ЗА ИСКЛЮЧЕНИЕМ БАКТЕРИАЛЬНЫХ СПОР – ЭТО",
            "rA": [
                "дезинфекция"
            ],
            "wA": [
                "стерилизация",
                "предстерилизационная очистка",
                "дезинсекция"
            ]
        },
        {
            "qID": 218,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗДЕЛИЯ, НЕ ИМЕЮЩИЕ КОНТАКТА С РАНЕВОЙ ПОВЕРХНОСТЬЮ, КРОВЬЮ ИЛИ ИНЪЕКЦИОННЫМИ ПРЕПАРАТАМИ ПОДВЕРГАЮТСЯ",
            "rA": [
                "дезинфекции"
            ],
            "wA": [
                "стерилизации",
                "дезинфекции и стерилизации",
                "камерной дезинфекции"
            ]
        },
        {
            "qID": 219,
            "qName": "ОК-1, ОПК-1, ПК-3 СПИРТЫ НЕ РЕКОМЕНДУЕТСЯ ПРИМЕНЯТЬ ДЛЯ СТЕРИЛИЗАЦИИ МЕДИЦИНСКИХ И ХИРУРГИЧЕСКИХ МАТЕРИАЛОВ, ПОТОМУ ЧТО ОНИ НЕ ОБЛАДАЮТ ДЕЙСТВИЕМ",
            "rA": [
                "спороцидным"
            ],
            "wA": [
                "бактерицидным",
                "вирулицидным",
                "овоцидным"
            ]
        },
        {
            "qID": 220,
            "qName": "ОК-1, ОПК-1, ПК-3 СТЕРИЛЬНОСТЬ ОТКРЫТОГО БИКСА БЕЗ ФИЛЬТРА СОХРАНЯЕТСЯ (В ЧАСАХ)",
            "rA": [
                "6"
            ],
            "wA": [
                "24",
                "72",
                "12"
            ]
        },
        {
            "qID": 221,
            "qName": "ОК-1, ОПК-1 СТЕРИЛЬНОСТЬ ЗАКРЫТОГО БИКСА БЕЗ ФИЛЬТРА СОХРАНЯЕТСЯ (В ЧАСАХ)",
            "rA": [
                "72"
            ],
            "wA": [
                "6",
                "24",
                "12"
            ]
        },
        {
            "qID": 222,
            "qName": "ОК-1, ОПК-1 СТЕРИЛЬНОСТЬ ОТКРЫТОГО БИКСА С ФИЛЬТРОМ СОХРАНЯЕТСЯ",
            "rA": [
                "6 часов;"
            ],
            "wA": [
                "1 сутки;",
                "3 суток",
                "12 часов"
            ]
        },
        {
            "qID": 223,
            "qName": "ОК-1, ОПК-1 СТЕРИЛЬНОСТЬ ЗАКРЫТОГО БИКСА С ФИЛЬТРОМ СОХРАНЯЕТСЯ (В СУТКАХ)",
            "rA": [
                "20"
            ],
            "wA": [
                "1",
                "3",
                "12"
            ]
        },
        {
            "qID": 224,
            "qName": "ОК-1, ОПК-1 НАИБОЛЕЕ ЧАСО ПРИМЕНЯЕМЫЙ  МЕТОД СТЕРИЛИЗАЦИИ",
            "rA": [
                "физический"
            ],
            "wA": [
                "механический",
                "химический",
                "биологический"
            ]
        },
        {
            "qID": 225,
            "qName": "ОК-1, ОПК-1, ПК-3 ГЛАВНОЕ ОТЛИЧИЕ ДЕЗИНФЕКЦИИ И СТЕРИЛИЗАЦИИ",
            "rA": [
                "степень деконтаминации"
            ],
            "wA": [
                "область применения",
                "методы проведения",
                "стоимость"
            ]
        },
        {
            "qID": 226,
            "qName": "ОК-1, ОПК-1 ГЛАВНОЕ ОТЛИЧИЕ ДЕЗИНФЕКЦИИ И АНТИСЕПТИКИ",
            "rA": [
                "область применения"
            ],
            "wA": [
                "методы проведения",
                "степень деконтаминации",
                "стоимость"
            ]
        },
        {
            "qID": 227,
            "qName": "ОК-1, ОПК-1 ПРОЦЕСС УНИЧТОЖЕНИЯ ВСЕХ ФОРМ МИКРОБНОЙ ЖИЗНИ, ВКЛЮЧАЯ БАКТЕРИИ, ВИРУСЫ, СПОРЫ И ГРИБЫ – ЭТО",
            "rA": [
                "стерилизация"
            ],
            "wA": [
                "дезинфекция",
                "предстерилизационная очистка",
                "дератизация"
            ]
        },
        {
            "qID": 228,
            "qName": "ОК-1, ОПК-1 ПРОВЕРКА КАЧЕСТВА ПРЕДСТЕРИЛИЗАЦИОННОЙ ОЧИСТКИ ИНСТРУМЕНТОВ ПРОВОДИТСЯ ПУТЕМ ПОСТАНОВКИ ПРОБ  НА",
            "rA": [
                "кровь и полноту отмыва изделий от щелочных компонентов моющих средств"
            ],
            "wA": [
                "наличие остатков крови",
                "полноту отмыва изделий от щелочных компонентов моющих средств",
                "остатки лекарственных веществ"
            ]
        },
        {
            "qID": 229,
            "qName": "ОК-1, ОПК-1 ПРОВЕРКА КАЧЕСТВА ПРЕДСТЕРИЛИЗАЦИОННОЙ ОЧИСТКИ ИНСТРУМЕНТОВ НА НАЛИЧИЕ ОСТАТКОВ КРОВИ ПРОВОДИТСЯ ПУТЕМ ПОСТАНОВКИ ПРОБЫ",
            "rA": [
                "азопирамовой"
            ],
            "wA": [
                "амидопириновой",
                "фенолфталеиновой",
                "йод-крахмальной"
            ]
        },
        {
            "qID": 230,
            "qName": "ОК-1, ОПК-1 ДЛЯ ОБРАБОТКИ  ЗУБНЫХ, ГОРТАННЫХ, НОСОГЛОТОЧНЫХ  ЗЕРКАЛ  ИСПОЛЬЗУЕТСЯ",
            "rA": [
                "погружение в раствор перекиси водорода (3% с последующим промыванием водой)"
            ],
            "wA": [
                "автоклавирование",
                "кипячение",
                "протирание"
            ]
        },
        {
            "qID": 231,
            "qName": "ОК-1, ОПК-1 СТЕРИЛИЗАЦИЯ ПЕРЕВЯЗОЧНОГО МАТЕРИАЛА ПРОИЗВОДИТСЯ МЕТОДОМ",
            "rA": [
                "паровым"
            ],
            "wA": [
                "химическим",
                "паровоздушным",
                "пароформалиновым"
            ]
        },
        {
            "qID": 232,
            "qName": "ОК-1, ОПК-1 ПРОВЕРКА КАЧЕСТВА ПРЕДСТЕРИЛИЗАЦИОННОЙ ОЧИСТКИ  ИНСТРУМЕНТОВ  НА ПОЛНОТУ ОТМЫВА ИЗДЕЛИЙ ОТ ЩЕЛОЧНЫХ КОМПОНЕНТОВ МОЮЩИХ СРЕДСТВ ПРОВОДИТСЯ ПУТЕМ  ПОСТАНОВКИ  ПРОБЫ",
            "rA": [
                "фенолфталеиновой"
            ],
            "wA": [
                "азопирамовой",
                "амидопириновой",
                "йод-крахмальной."
            ]
        },
        {
            "qID": 233,
            "qName": "ОК-1, ОПК-1 ПРИ ПОЛОЖИТЕЛЬНОЙ АЗОПИРАМОВОЙ ПРОБЕ ПАРТИЯ ИЗДЕЛИЙ ПОДЛЕЖИТ",
            "rA": [
                "повторной предстерилизационной обработке"
            ],
            "wA": [
                "повторной дезинфекции",
                "повторной дезинфекции и предстерилизационной обработке",
                "стерилизации"
            ]
        },
        {
            "qID": 234,
            "qName": "ОК-1, ОПК-1 ТЕСТЫ ДЛЯ КОНТРОЛЯ  РЕЖИМА СТЕРИЛИЗАЦИИ БЫВАЮТ",
            "rA": [
                "физические, химические"
            ],
            "wA": [
                "механические",
                "химические, электронные",
                "электронные."
            ]
        },
        {
            "qID": 235,
            "qName": "ОК-1, ОПК-1 СТЕРИЛИЗАЦИЯ ПРОВОДИТСЯ, В ЗАВИСИМОСТИ ОТ ОСОБЕННОСТЕЙ СТЕРИЛИЗУЕМОГО ИЗДЕЛИЯ, МЕТОДАМИ",
            "rA": [
                "воздушным, паровым, химическим"
            ],
            "wA": [
                "воздушным, химическим",
                "паровым, химическим",
                "механическим, химическим"
            ]
        },
        {
            "qID": 236,
            "qName": "ОК-1, ОПК-1 УНИВЕРСАЛЬНЫМ АНТИМИКРОБНЫМ ДЕЙСТВИЕМ ОБЛАДАЮТ",
            "rA": [
                "альдегидсодержащие препараты"
            ],
            "wA": [
                "четвертичные аммониевые соединения",
                "амфотензиды",
                "спирты"
            ]
        },
        {
            "qID": 237,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ДЛЯ ДЕЗИНФЕКЦИИ И СТЕРИЛИЗАЦИИ ПРЕДМЕТОВ МЕДИЦИНСКОГО НАЗНАЧЕНИЯ МОЖНО ИСПОЛЬЗОВАТЬ",
            "rA": [
                "глутаровый альдегид"
            ],
            "wA": [
                "амфолан",
                "гипохлорит лития",
                "хлорамин"
            ]
        },
        {
            "qID": 238,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ОБРАБОТКИ  ПАЛАТ В ПРИСУТСТВИИ БОЛЬНЫХ В  МО СЛЕДУЕТ ИСПОЛЬЗОВАТЬ ПРЕПАРАТЫ, СОДЕРЖАЩИЕ",
            "rA": [
                "ЧАС"
            ],
            "wA": [
                "хлор",
                "альдегиды",
                "спирты"
            ]
        },
        {
            "qID": 239,
            "qName": "ОК-1, ОПК-1 РЕЗУЛЬТАТ АЗОПИРАМОВОЙ ПРОБЫ УЧИТЫВАЕТСЯ ЧЕРЕЗ",
            "rA": [
                "1 минуту"
            ],
            "wA": [
                "5 минут",
                "1 час",
                "6 часов"
            ]
        },
        {
            "qID": 240,
            "qName": "ОК-1, ОПК-1 ОЦЕНКА АЗОПИРАМОВОЙ ПРОБЫ: ФИОЛЕТОВОЕ, СИНЕЕ ИЛИ РОЗОВО-СИРЕНЕВОЕ  ОКРАШИВАНИЕ  ОЗНАЧАЕТ НАЛИЧИЕ НА ИНСТРУМЕНТАХ",
            "rA": [
                "ржавчины или следов крови"
            ],
            "wA": [
                "остатков щелочи от моющего раствора или следов крови",
                "остатков хлорсодержащих или следов крови",
                "остатков хлорсодержащих средств или ржавчины"
            ]
        },
        {
            "qID": 241,
            "qName": "ОК-1, ОПК-1 ФЕНОЛФТАЛЕИНОВАЯ ПРОБА ИСПОЛЬЗУЕТСЯ ДЛЯ ОПРЕДЕЛЕНИЯ НА ИНСТРУМЕНТАРИИ НАЛИЧИЯ",
            "rA": [
                "не отмытых компонентов моющих средств"
            ],
            "wA": [
                "следов крови",
                "ржавчины",
                "остатков хлорсодержащих дезинфицирующих средств"
            ]
        },
        {
            "qID": 242,
            "qName": "ОК-1, ОПК-1 ОЦЕНКА РЕЗУЛЬТАТОВ ФЕНОЛФТАЛЕИНОВОЙ ПРОБЫ: РЕЗУЛЬТАТ СЧИТАЕТСЯ ПОЛОЖИТЕЛЬНЫМ, ЕСЛИ ПОЯВЛЯЕТСЯ ОКРАШИВАНИЕ",
            "rA": [
                "розовое"
            ],
            "wA": [
                "сиреневое",
                "бурое",
                "сине-зеленое",
                "желтое"
            ]
        },
        {
            "qID": 243,
            "qName": "ОК-1, ОПК-1 ПРИ ПОЛОЖИТЕЛЬНОЙ ФЕНОЛФТАЛЕИНОВОЙ ПРОБЕ ПАРТИЯ ИЗДЕЛИЙ МЕДИЦИНСКОГО НАЗНАЧЕНИЯ ПОДЛЕЖИТ",
            "rA": [
                "повторной  отмывке дистилированной водой или водопроводной"
            ],
            "wA": [
                "повторной дезинфекции и предстерилизационной обработке",
                "повторной предстерилизационной обработке",
                "стерилизации"
            ]
        },
        {
            "qID": 244,
            "qName": "ОК-1, ОПК-1 ВОЗДУШНЫМ МЕТОДОМ СТЕРИЛИЗАЦИИ ОБРАБАТЫВАЮТ ИЗДЕЛИЯ",
            "rA": [
                "изделия из металла, стекла и силиконовой резины"
            ],
            "wA": [
                "изделия из металла, стекла, текстильных материалов",
                "резиновые перчатки, изделия из резины и полимерных материалов",
                "каучука"
            ]
        },
        {
            "qID": 245,
            "qName": "ОК-1, ОПК-1 ВЫГРУЗКУ СТЕРИЛЬНОГО ИНСТРУМЕНТАРИЯ  ИЗ СУХОЖАРОВОГО ШКАФА ПРОИЗВОДИТСЯ  ПРИ ТЕМПЕРАТУРЕ",
            "rA": [
                "40-500 С"
            ],
            "wA": [
                "80-1000 С",
                "160-1800 С",
                "140-1600  C"
            ]
        },
        {
            "qID": 246,
            "qName": "ОК-1, ОПК-1 ПРИ ВСКРЫТИИ УПАКОВКИ С ИНСТРУМЕНТАМИ  ЛЮБОГО ВИДА – ИСПОЛЬЗОВАТЬ ЕЕ СОДЕРЖИМОЕ В ТЕЧЕНИЕ",
            "rA": [
                "6 суток;"
            ],
            "wA": [
                "24 часов;",
                "12 часов",
                "1 месяца"
            ]
        },
        {
            "qID": 247,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРОФИЛАКТИЧЕСКИЕ  ПРИВИВКИ  ВОЗДЕЙСТВУЮТ  НА______  ЗВЕНО ЭПИДЕМИЧЕСКОГО ПРОЦЕССА",
            "rA": [
                "третье"
            ],
            "wA": [
                "первое",
                "второе",
                "оперативное"
            ]
        },
        {
            "qID": 248,
            "qName": "ОК-1, ОПК-1 ПРИ ПЕРВИЧНОМ ИММУННОМ  ОТВЕТЕ   ВЫРАБАТЫВАЮТСЯ В ОРГАНИЗМЕ",
            "rA": [
                "Ig M, затем Ig G;"
            ],
            "wA": [
                "только Ig M;",
                "только Ig G;",
                "Ig G, затем Ig M."
            ]
        },
        {
            "qID": 249,
            "qName": "ОК-1, ОПК-1 ПРОВЕСТИ ПРИВИВКУ РЕБЕНКУ ВАКЦИНОЙ, ПРИВЕЗЕННОЙ ИЗ-ЗА РУБЕЖА, ЕСЛИ НАСТАВЛЕНИЕ К ВАКЦИНЕ ОТСУТСТВУЕТ",
            "rA": [
                "нельзя"
            ],
            "wA": [
                "можно, предварительно изучив характеристику вакцину по этикетке",
                "можно, если вакцина  зарегистрирована  в РФ",
                "можно по согласованию с противоэпидемической службой"
            ]
        },
        {
            "qID": 250,
            "qName": "ОК-1, ОПК-1 В СЛУЧАЕ ЭКСТРЕННОЙ НЕОБХОДИМОСТИ ОДНОВРЕМЕННО С АНТИРАБИЧЕСКОЙ ВАКЦИНОЙ МОЖЕТ БЫТЬ ПРОВЕДЕНА ПРОФИЛАКТИКА",
            "rA": [
                "столбняка"
            ],
            "wA": [
                "кори",
                "дифтерии",
                "гепатита В"
            ]
        },
        {
            "qID": 251,
            "qName": "ОК-1, ОПК-1 ЕСТЕСТВЕННЫЙ ПРОТИВОТУБЕРКУЛЕЗНЫЙ ИММУНИТЕТ ВЫРАБАТЫВАЕТСЯ В РЕЗУЛЬТАТЕ",
            "rA": [
                "инфицирования микобактериями туберкулеза"
            ],
            "wA": [
                "вакцинации  БЦЖ",
                "ревакцинации БЦЖ",
                "введения туберкулина"
            ]
        },
        {
            "qID": 252,
            "qName": "ОК-1, ОПК-1 ПОВЕРХНОСТЬ СТОМАТОЛОГИЧЕСКОЙ УСТАНОВКИ ОБРАБАТЫВАЕТСЯ ДЕЗИНФИЦИРУЮЩИМ РАСТВОРОМ",
            "rA": [
                "после приёма каждого пациента"
            ],
            "wA": [
                "1 раз в день",
                "2 раза в день",
                "3 раза в день"
            ]
        },
        {
            "qID": 253,
            "qName": "ОК-1, ОПК-1, ПК-3 КВАРЦЕВАНИЕ СТОМАТОЛОГИЧЕСКОГО КАБИНЕТА СЛЕДУЕТ ПРОВОДИТЬ В ДЕНЬ (КОЛИЧЕСТВО РАЗ)",
            "rA": [
                "3"
            ],
            "wA": [
                "1",
                "2",
                "4"
            ]
        },
        {
            "qID": 254,
            "qName": "ОК-1, ОПК-1 ХРОНИЧЕСКИЕ ЗАБОЛЕВАНИЯ СЕРДЦА, ЛЕГКИХ, ПОЧЕК, ПЕЧЕНИ В СТАДИИ ОБОСТРЕНИЯ, ЛЕЧЕНИЕ СТЕРОИДАМИ ЯВЛЯЮТСЯ ПРОТИВОПОКАЗАНИЯМИ К ВАКЦИНАЦИИ",
            "rA": [
                "временными"
            ],
            "wA": [
                "постоянными",
                "ложными",
                "необходимыми"
            ]
        },
        {
            "qID": 255,
            "qName": "ОК-1, ОПК-1 АНАМНЕСТИЧЕСКИЕ УКАЗАНИЯ НА НАЛИЧИЕ У РОДСТВЕННИКОВ АЛЛЕРГИИ, ЭПИЛЕПСИИ, ОСЛОЖНЕНИЙ ВАКЦИНАЦИИ ЯВЛЯЮТСЯ ПРОТИВОПОКАЗАНИЯМИ К ВАКЦИНАЦИИ",
            "rA": [
                "ложными"
            ],
            "wA": [
                "временными",
                "постоянными",
                "необходимыми"
            ]
        },
        {
            "qID": 256,
            "qName": "ОК-1, ОПК-1 ВВЕДЕНИЕ В ОРГАНИЗМ ЧЕЛОВЕКА МЕДИЦИНСКИХ ИММУНОБИОЛОГИЧЕСКИХ   ПРЕПАРАТОВ ДЛЯ СОЗДАНИЯ СПЕЦИФИЧЕСКОЙ НЕВОСПРИИМЧИВОСТИ К ИНФЕКЦИОННЫМ БОЛЕЗНЯМ – ЭТО",
            "rA": [
                "профилактические прививки"
            ],
            "wA": [
                "иммунопрофилактика инфекционных болезней",
                "национальный календарь прививок",
                "медицинские иммунобиологические препараты"
            ]
        },
        {
            "qID": 257,
            "qName": "ОК-1, ОПК-1 НАЦИОНАЛЬНЫЙ КАЛЕНДАРЬ ПРОФИЛАКТИЧЕСКИХ ПРИВИВОК НЕ ВКЛЮЧАЕТ В ОБЯЗАТЕЛЬНЫЙ ПЕРЕЧЕНЬ  ПРОФИЛАКТИЧЕСКИЕ ПРИВИВКИ ПРОТИВ",
            "rA": [
                "менингококковой инфекции"
            ],
            "wA": [
                "гепатита В;",
                "кори;",
                "коклюша;"
            ]
        },
        {
            "qID": 258,
            "qName": "ОК-1, ОПК-1 НОРМАТИВНЫЙ ПРАВОВОЙ АКТ, УСТАНАВЛИВАЮЩИЙ ПОРЯДОК ПРОВЕДЕНИЯ ГРАЖДАНАМ ПРОФИЛАКТИЧЕСКИХ ПРИВИВОК – ЭТО",
            "rA": [
                "закон об иммунопрофилактике инфекционных заболеваний"
            ],
            "wA": [
                "профилактические прививки",
                "прививки по эпидемическим показаниям",
                "перечень препаратов"
            ]
        },
        {
            "qID": 259,
            "qName": "ОК-1, ОПК-1 АЗОПИРАМОВАЯ ПРОБА ПРОВОДИТСЯ ПОСЛЕ",
            "rA": [
                "предстерилизационной очистки"
            ],
            "wA": [
                "дезинфекции",
                "стерилизации",
                "каждого этапа дезинфекции"
            ]
        },
        {
            "qID": 260,
            "qName": "ОК-1, ОПК-1 ПК-3  ДОКУМЕНТ ИНДИВИДУАЛЬНОГО УЧЕТА, В КОТОРОМ РЕГИСТРИРУЮТСЯ  ВСЕ  ПОЛУЧЕННЫЕ ПРОФИЛАКТИЧЕСКИЕ  ПРИВИВКИ – ЭТО",
            "rA": [
                "сертификат профилактических прививок"
            ],
            "wA": [
                "карта профилактических прививок",
                "история болезни",
                "страховой полис"
            ]
        },
        {
            "qID": 261,
            "qName": "ОК-1, ОПК-1 ДЛЯ ОЦЕНКИ КАЧЕСТВА ПРЕДСТЕРИЛИЗАЦИОННОЙ ОБРАБОТКИ ИНСТРУМЕНТОВ НА НАЛИЧИЕ КРОВИ И БЕЛКОВЫХ ЗАГРЯЗНЕНИЙ ИСПОЛЬЗУЕТСЯ ПРОБА",
            "rA": [
                "амидопириновая"
            ],
            "wA": [
                "йодиноловая",
                "бензидиновая",
                "фенолфталеиновая"
            ]
        },
        {
            "qID": 262,
            "qName": "ОК-1, ОПК-1 ПОСЛЕ ИСПОЛЬЗОВАНИЯ СЛЮНООТСОСЫ",
            "rA": [
                "утилизируют"
            ],
            "wA": [
                "дезинфицируют",
                "стерилизуют",
                "промывают"
            ]
        },
        {
            "qID": 263,
            "qName": "ОК-1, ОПК-1 В ПРИРОДНЫХ ОЧАГАХ КЛЕЩЕВОГО ЭНЦЕФАЛИТА, ПОСЛЕ УДАЛЕНИЯ ПРИСОСАВШИХСЯ ИКСОДОВЫХ КЛЕЩЕЙ ПОСТРАДАВШИМ С ЦЕЛЬЮ ЭКСТРЕННОЙ ПРОФИЛАКТИКИ СЛЕДУЕТ ВВЕСТИ",
            "rA": [
                "специфический иммуноглобулин"
            ],
            "wA": [
                "вакцину",
                "сыворотку",
                "антибиотики"
            ]
        },
        {
            "qID": 264,
            "qName": "ОК-1, ОПК-1 РЕКОМЕНДУЕМЫЙ  МАКСИМАЛЬНЫЙ  СРОК  ХРАНЕНИЯ ВАКЦИН В ПОЛИКЛИНИКЕ",
            "rA": [
                "1 мес."
            ],
            "wA": [
                "до следующей поставки",
                "3 мес.",
                "6 мес."
            ]
        },
        {
            "qID": 265,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ЗАБОЛЕВАЕМОСТЬЮ КАРИЕСОМ НАЗЫВАЮТ",
            "rA": [
                "число впервые выявленных случаев заболевания за определённый промежуток времени"
            ],
            "wA": [
                "число людей, имеющих заболевание на момент обследования",
                "число кариозных, запломбированных и удалённых зубов у одного обследуемого",
                "среднее количество кариозных, удалённых и запломбированных зубов в группе населения"
            ]
        },
        {
            "qID": 266,
            "qName": "ОК-1, ОПК-1 ПРИЧИНОЙ ВОЗНИКНОВЕНИЯ ПОСТИНЪЕКЦИОННОГО АБСЦЕССА ЯВЛЯЕТСЯ",
            "rA": [
                "несоблюдение правил асептики и антисептики во время анестезии"
            ],
            "wA": [
                "высокая доза сосудосуживающего препарата в карпуле",
                "наличие метилпарабена в карпуле местного анестетика",
                "непереносимость местного анестетика"
            ]
        },
        {
            "qID": 267,
            "qName": "ОК-1, ОПК-1,  ПК-17 ПОКАЗАТЕЛЬ ОБЩЕЙ ЗАБОЛЕВАЕМОСТИ ХАРАКТЕРИЗУЕТ",
            "rA": [
                "распространённость заболеваний среди населения"
            ],
            "wA": [
                "изменения распространённости заболеваний во времени",
                "удельный вес конкретного заболевания",
                "распространённость социально-значимых заболеваний"
            ]
        },
        {
            "qID": 268,
            "qName": "ОК-1, ОПК-1, ПК-3  НАИБОЛЕЕ ЭФФЕКТИВНОЕ СРЕДСТВО ПРОФИЛАКТИКИ ГРИППА В ПРЕДЭПИДЕМИЧЕСКИЙ  ПЕРИОД",
            "rA": [
                "гриппозная вакцина"
            ],
            "wA": [
                "человеческий лейкоцитарный интерферон",
                "ремантадин",
                "иммуноглобулин"
            ]
        },
        {
            "qID": 269,
            "qName": "ОК-1, ОПК-1, ПК-17 ЦЕЛЬЮ ЭПИДЕМИОЛОГИЧЕСКИХ ИССЛЕДОВАНИЙ ЯВЛЯЕТСЯ",
            "rA": [
                "разработка мер профилактики и оценка их эффективности"
            ],
            "wA": [
                "изучение распространения заболеваний по группам населения",
                "реформирование системы здравоохранения",
                "анализ демографических показателей"
            ]
        },
        {
            "qID": 270,
            "qName": "ОК-1, ОПК-1, ПК-3 ЛИЦАМ, КОТОРЫЕ  КОНТАКТИРУЮТ С БОЛЬШИМ ЧИСЛОМ ЛЮДЕЙ (ВРАЧИ, ПРОДАВЦЫ, ПЕДАГОГИ И Т. П.), А ТАК ЖЕ ЛЮДЯМ СТАРШЕ 65 ЛЕТ И ЛИЦАМ, СТРАДАЮЩИМ ХРОНИЧЕСКИМИ ЗАБОЛЕВАНИЯМИ СЕРДЕЧНО-СОСУДИСТОЙ СИСТЕМЫ И ЛЕГКИХ, ПОКАЗАНЫ, ПРЕЖДЕ ВСЕГО, ПРИВИВКИ ПРОТИВ",
            "rA": [
                "гриппа"
            ],
            "wA": [
                "дифтерии",
                "туберкулеза",
                "кори"
            ]
        },
        {
            "qID": 271,
            "qName": "ОК-1, ОПК-1,  ПК-17 УСТРАНЕНИЕ ФАКТОРОВ РИСКА И ПРИЧИН ЯВЛЯЕТСЯ ОСНОВНЫМ МЕРОПРИЯТИЕМ",
            "rA": [
                "первичной профилактики стоматологических заболеваний"
            ],
            "wA": [
                "вторичной профилактики стоматологических заболеваний",
                "третичной профилактики стоматологических заболеваний",
                "эпидемиологического обследования населения"
            ]
        },
        {
            "qID": 272,
            "qName": "ОК-1, ОПК-1,  ПК-17 ЭПИДЕМИОЛОГИЧЕСКОЕ СТОМАТОЛОГИЧЕСКОЕ ОБСЛЕДОВАНИЕ НАСЕЛЕНИЯ ПРОВОДЯТ",
            "rA": [
                "врачи-стоматологи"
            ],
            "wA": [
                "гигиенисты",
                "стоматологические медицинские сестры",
                "санитарные врачи"
            ]
        },
        {
            "qID": 273,
            "qName": "ОК-1, ОПК-1, ПК-3 ОБЯЗАТЕЛЬНОСТЬ ПЛАНОВЫХ ПРИВИВОК ПРОТИВ ИНФЕКЦИОННЫХ ЗАБОЛЕВАНИЙ ОПРЕДЕЛЯЕТСЯ",
            "rA": [
                "Законом РФ об иммунопрофилактике инфекционных заболеваний"
            ],
            "wA": [
                "календарем прививок",
                "Приказом Минздрава РФ",
                "Указанием противоэпидемической службы"
            ]
        },
        {
            "qID": 274,
            "qName": "ОК-1, ОПК-1 КРИТЕРИЕМ ОБЪЕКТИВНОЙ ОЦЕНКИ КАЧЕСТВА ИММУНОПРОФИЛАКТИКИ ЯВЛЯЕТСЯ",
            "rA": [
                "результаты серологического мониторинга"
            ],
            "wA": [
                "полнота охвата прививками",
                "снижение заболеваемости",
                "результаты аллергических проб"
            ]
        },
        {
            "qID": 275,
            "qName": "ОК-1, ОПК-1, ПК-3 ГРАЖДАНИН РФ, СОГЛАСНО 157-ФЗ «ОБ ИММУНОПРОФИЛАКТИКЕ ИНФЕКЦИОННЫХ БОЛЕЗНЕЙ» ИМЕЕТ ПРАВО…",
            "rA": [
                "отказаться от прививок за исключением прививок против инфекционных заболеваний, проводимых по эпидемическим показаниям"
            ],
            "wA": [
                "отказаться от прививок, не подписывая отказа от прививок",
                "отказаться от прививок, подписав отказ",
                "не имеет права отказаться от прививок"
            ]
        },
        {
            "qID": 276,
            "qName": "ОК-1, ОПК-1,  ПК-17 КРИТЕРИЕМ ОЦЕНКИ САНИТАРНОГО СОСТОЯНИЯ СТЕРИЛИЗАЦИОННОЙ В ПОЛИКЛИНИКЕ ЯВЛЯЕТСЯ",
            "rA": [
                "бактериологический контроль"
            ],
            "wA": [
                "данные учёта журнала стерилизации",
                "данные визуального контроля стерилизационной",
                "определение концентрации дезинфицирующих растворов"
            ]
        },
        {
            "qID": 277,
            "qName": "ОК-1, ОПК-1,  ПК-17 КРИТЕРИЕМ ОЦЕНКИ САНИТАРНОГО СОСТОЯНИЯ ХИРУРГИЧЕСКОГО КАБИНЕТА ЯВЛЯЕТСЯ",
            "rA": [
                "бактериологический контроль"
            ],
            "wA": [
                "регулярность генеральных уборок",
                "контроль за санитарным состоянием старшей медицинской сестрой",
                "регулярность влажных уборок"
            ]
        },
        {
            "qID": 278,
            "qName": "ОК-1, ОПК-1 НЕОБХОДИМОСТЬ ПЛАНОВЫХ ПРИВИВОК ПРОТИВ СТОЛБНЯКА ВЫЗВАНА, ПРЕЖДЕ ВСЕГО",
            "rA": [
                "высокой летальностью"
            ],
            "wA": [
                "высокой заболеваемостью",
                "высокой смертностью",
                "большими экономическими потерями"
            ]
        },
        {
            "qID": 279,
            "qName": "ОК-1, ОПК-1 КАЖДЫЙ СЛУЧАЙ ПОСТВАКЦИНАЛЬНОГО ОСЛОЖНЕНИЯ",
            "rA": [
                "подлежит расследованию в обязательном порядке комиссионно"
            ],
            "wA": [
                "подлежит расследованию в обязательном порядке главным врачом поликлиники",
                "подлежит расследованию в обязательном порядке врачом эпидемиологом",
                "расследованию не подлежит"
            ]
        },
        {
            "qID": 280,
            "qName": "ОК-1, ОПК-1,  ПК-17 ДЛЯ ОБРАБОТКИ РУК МЕДИЦИНСКОГО ПЕРСОНАЛА ПРИМЕНЯЕТСЯ РАСТВОР",
            "rA": [
                "0,5% Хлоргексидина биглюконата в 70% этиловом спирте"
            ],
            "wA": [
                "3% Перекиси водорода",
                "Перманганата калия в разведении 1:10 000",
                "Фурацилина в разведении 1:5 000"
            ]
        },
        {
            "qID": 281,
            "qName": "ОК-1, ОПК-1, ПК-17 СПЕЦИФИЧНОСТЬ ДИАГНОСТИЧЕСКОГО ТЕСТА – ЭТО",
            "rA": [
                "вероятность отрицательного результата  теста при отсутствии болезни"
            ],
            "wA": [
                "вероятность положительного результата  теста при наличии болезни",
                "прогностичность положительного результата",
                "прогностичность отрицательного результата"
            ]
        },
        {
            "qID": 282,
            "qName": "ОК-1, ОПК-1  ПОСЛЕ ИСПОЛЬЗОВАНИЯ БОРЫ ПОМЕЩАЮТ В",
            "rA": [
                "дезинфицирующий раствор"
            ],
            "wA": [
                "сухожаровой шкаф",
                "гласперленовый стерилизатор",
                "«Терминатор»"
            ]
        },
        {
            "qID": 283,
            "qName": "ОК-1, ОПК-1,  ПК-17 РАНДОМИЗИРОВАННЫЕ  КОНТРОЛИРУЕМЫЕ ИСПЫТАНИЯ – ЭТО ЭКСПЕРИМЕНТАЛЬНЫЕ ИССЛЕДОВАНИЯ,  В КОТОРЫХ",
            "rA": [
                "участники распределены на опытную и контрольную группы случайным образом"
            ],
            "wA": [
                "распределяют пациентов по подгруппам с одинаковым прогнозом",
                "выделяют опытную и контрольную группы в зависимости от  факторов риска",
                "проводят эксперемент"
            ]
        },
        {
            "qID": 284,
            "qName": "ОК-1, ОПК-1,  ПК-17 ВАЛИДНОСТЬ ПОЛУЧЕННОЙ ИНФОРМАЦИИ О РЕЗУЛЬТАТАХ ИССЛЕДОВАНИЙ – ЭТО",
            "rA": [
                "достоверность результатов"
            ],
            "wA": [
                "обоснованность результатов",
                "проверка результатов",
                "сопоставимость результатов"
            ]
        },
        {
            "qID": 285,
            "qName": "ОК-1, ОПК-1,  ПК-17 МЕТА-АНАЛИЗ – ЭТО",
            "rA": [
                "количественный анализ объединенных результатов нескольких РКИ"
            ],
            "wA": [
                "совокупность статистических методов",
                "совокупность статистических методов рассматривающих одну переменную",
                "РКИ проведенные в ВОЗ"
            ]
        },
        {
            "qID": 286,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ФАКТОР РИСКА – ЭТО",
            "rA": [
                "воздействие, приводящее к увеличению риска возникновения заболевания или иному неблагоприятному исходу"
            ],
            "wA": [
                "отношение вероятности того, что событие произойдет, к вероятности того, что событие не произойдет",
                "неслучайное, однонаправленное отклонение результатов от истинных значений",
                "случайное воздействие"
            ]
        },
        {
            "qID": 287,
            "qName": "ОК-1, ОПК-1 ПОСЛЕ РАБОЧЕГО ДНЯ, В ТЕЧЕНИЕ КОТОРОГО ИМЕЛ МЕСТО КОНТАКТ РУК С ХЛОРНЫМИ ПРЕПАРАТАМИ, КОЖУ ОБРАБАТЫВАЮТ ВАТНЫМ ТАМПОНОМ, СМОЧЕННЫМ РАСТВОРОМ",
            "rA": [
                "1%  гипосульфита натрия"
            ],
            "wA": [
                "2%  перекиси водорода",
                "0,05%  хлоргексидина",
                "70%  медицинского спирта"
            ]
        },
        {
            "qID": 288,
            "qName": "ОК-1, ОПК-1,  ПК-17 ОТНОШЕНИЕ ШАНСОВ – ЭТО",
            "rA": [
                "отношение вероятности того, что событие произойдет, к вероятности того, что событие не произойдет;"
            ],
            "wA": [
                "внешнее воздействие, приводящее к увеличению риска возникновения заболевания",
                "неслучайное, однонаправленное отклонение результатов от истинных значений",
                "разность рисков"
                
            ]
        },
		{
            "qID": 289,
            "qName": "[ОК-1, ОПК-1, ПК-17] ДЛЯ ОЦЕНКИ ЭФФЕКТИВНОСТИ ЛЕЧЕНИЯ (ПРОФИЛАКТИЧЕСКОГО ВМЕШАТЕЛЬСТВА) ОСУЩЕСТВЛЯЕТСЯ ПОИСК В ЛИТЕРАТУРНЫХ ИСТОЧНИКАХ ОПИСАНИЯ ИССЛЕДОВАНИЙ, ПРОВОДИМЫХ ПО ТИПУ",
            "rA": [
                "рандомизированных контролируемых испытаний"
            ],
            "wA": [
                "случай-контроль",
                "когортных исследований",
                "случай-контроль и когортных исследований",

            ]
        },
        {
            "qID": 290,
            "qName": "ДЛЯ ОЦЕНКИ ПОТЕНЦИАЛЬНЫХ ФАКТОРОВ РИСКА, ОСУЩЕСТВЛЯЕТСЯ ПОИСК В ЛИТЕРАТУРНЫХ ИСТОЧНИКАХ ОПИСАНИЯ ИССЛЕДОВАНИЙ, ПРОВОДИМЫХ ПО ТИПУ",
            "rA": [
                "случай-контроль и когортных исследований"
            ],
            "wA": [
                "случай-контроль",
                "когортных исследований",
              	"рандомизированных контролируемых испытаний"
            ]
        },
        {
            "qID": 291,
            "qName": "ОК-1, ОПК-1, ПК-17 ДЛЯ ОТВЕТА НА ВОПРОС, КАСАЮЩИЙСЯ ТОЧНОСТИ ДИАГНОСТИЧЕСКОГО МЕТОДА, ОСУЩЕСТВЛЯЕТСЯ ПОИСК В ЛИТЕРАТУРНЫХ ИСТОЧНИКАХ ОПИСАНИЯ ИССЛЕДОВАНИЙ, ПРОВОДИМЫХ ПО ТИПУ",
            "rA": [
                "поперечных (срезовых) исследований"
            ],
            "wA": [
                "случай-контроль и когортных исследований",
                "когортных исследований",
                "рандомизированных контролируемых испытаний"
                
            ]
        },
		{
            "qID": 292,
            "qName": "К-1, ОПК-1,  ПК-17 ДЛЯ ОЦЕНКИ ДАЛЬНЕЙШЕГО РАЗВИТИЯ ЗАБОЛЕВАНИЯ (ПРОГНОЗ1. ОСУЩЕСТВЛЯЕТСЯ ПОИСК В ЛИТЕРАТУРНЫХ ИСТОЧНИКАХ ОПИСАНИЯ ИССЛЕДОВАНИЙ, ПРОВОДИМЫХ ПО ТИПУ",
            "rA": [
                "когортных исследований"
            ],
            "wA": [
                "случай-контроль",
                "случай-контроль и когортных исследований",
                "рандомизированных контролируемых испытаний"
            ]
        },
        {
            "qID": 293,
            "qName": "ОК-1, ОПК-1 БОЛЬНОЙ МОЖЕТ ПРЕДСТАВЛЯТЬ ЭПИДЕМИОЛОГИЧЕСКУЮ ОПАСНОСТЬ ДЛЯ ОКРУЖАЮЩИХ В ПЕРИОД РЕКОНВАЛЕСЦЕНЦИИ  ПРИ",
            "rA": [
                "вирусном гепатите В"
            ],
            "wA": [
                "вирусном гепатите А",
                "гриппе",
                "иерсиниозе;"
            ]
        },
        {
            "qID": 294,
            "qName": "ОК-1, ОПК-1 ЭПИДЕМИОЛОГИЧЕСКАЯ ОПАСНОСТЬ БОЛЬНОГО  ДЛЯ ОКРУЖАЮЩИХ В ПЕРИОД РАЗГАРА ЗАБОЛЕВАНИЯ СНИЖАЕТСЯ   ПРИ…",
            "rA": [
                "вирусном гепатите А"
            ],
            "wA": [
                "гриппе",
                "вирусном гепатите В",
                "иерсиниозе"
            ]
        },
        {
            "qID": 295,
            "qName": "ОК-1, ОПК-1 ТИП ВОЗРАСТНОЙ СТРУКТУРЫ НАСЕЛЕНИЯ РОССИЙСКОЙ ФЕДЕРАЦИИ",
            "rA": [
                "регрессивный"
            ],
            "wA": [
                "стационарный",
                "статичный",
				"прогрессивный"
            ]
        },
        {
            "qID": 296,
            "qName": "ОК-1, ОПК-1, ПК-17 ПОКАЗАТЕЛЬ ОБЩЕЙ ЗАБОЛЕВАЕМОСТИ ХАРАКТЕРИЗУЕТ",
            "rA": [
                "распространённость заболеваний среди населения"
            ],
            "wA": [
                "изменения распространённости заболеваний во времени",
                "удельный вес конкретного заболевания",
                "распространённость социально-значимых заболеваний"
            ]
        },
        {
            "qID": 297,
            "qName": "ОК-1, ОПК-1, ПК-17 ДЛЯ РАСЧЁТА КОНКРЕТНОГО ВИДА ЗАБОЛЕВАЕМОСТИ НЕОБХОДИМЫ ДАННЫЕ О ЧИСЛЕ СЛУЧАЕВ КОНКРЕТНОГО ЗАБОЛЕВАНИЯ И",
            "rA": [
                "среднегодовой численности населения"
            ],
            "wA": [
                "числе случаев заболеваний в предыдущие годы",
                "численности трудоспособного населения",
                "числе лиц, прошедших медосмотр"
            ]
        },
        {
            "qID": 298,
            "qName": "ОК-1, ОПК-1, ПК-17 ИЗ УСЛОВИЙ, ВЛИЯЮЩИХ НА ЗДОРОВЬЕ, НАИБОЛЕЕ ЗНАЧИМЫМ, СОГЛАСНО ДАННЫМ ВОЗ, ЯВЛЯЕТСЯ",
            "rA": [
                "образ жизни"
            ],
            "wA": [
                "здравоохранение",
                "наследственность",
                "внешняя среда"
            ]
        },
        {
            "qID": 299,
            "qName": "ОК-1, ОПК-1 О КАЧЕСТВЕ ЛЕЧЕНИЯ В СТАЦИОНАРНЫХ УСЛОВИЯХ СВИДЕТЕЛЬСТВУЕТ ПОКАЗАТЕЛЬ",
            "rA": [
                "летальности"
            ],
            "wA": [
                "количества пролеченных пациентов",
                "среднегодовой занятости койки",
                "оборота койки"
            ]
        },
        {
            "qID": 300,
            "qName": "ОК-1, ОПК-1 О КАЧЕСТВЕ ЛЕЧЕНИЯ В СТАЦИОНАРНЫХ УСЛОВИЯХ СВИДЕТЕЛЬСТВУЕТ ПОКАЗАТЕЛЬ",
            "rA": [
                "послеоперационных осложнений"
            ],
            "wA": [
                "средней продолжительности пребывания на койке",
                "среднегодовой занятости койки",
                "оборота койки"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
