var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 К СОЦИАЛЬНЫМ ФАКТОРАМ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА ОТНОСИТСЯ",
            "rA": [
                "миграция населения"
            ],
            "wA": [
                "факторы риска",
                "климатические факторы",
                "источник возбудителя инфекции"
            ]
        },
        {
            "qID": 2,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРИРОДНЫЕ ФАКТОРЫ, ВЛИЯЮЩИЕ НА ЗВЕНЬЯ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА",
            "rA": [
                "среднегодовая температура"
            ],
            "wA": [
                "источник инфекции",
                "восприимчивость населения",
                "пути и факторы передачи возбудителя"
            ]
        },
        {
            "qID": 3,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ ПРОЦЕСС ДЕТЕРМИНИРОВАН",
            "rA": [
                "природными факторами"
            ],
            "wA": [
                "политическими  факторами",
                "экономическими факторами",
                "антропологическими"
            ]
        },
        {
            "qID": 4,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ ПРОЦЕСС – ЭТО ЯВЛЕНИЕ",
            "rA": [
                "социально-биологическое"
            ],
            "wA": [
                "социальное",
                "биологическое",
                "социально-политическое"
            ]
        },
        {
            "qID": 5,
            "qName": "ОК-1, ОПК-1, ПК-3 НАБЛЮДЕНИЕ В ЭПИДЕМИЧЕСКОМ ОЧАГЕ ПРЕКРАЩАЕТСЯ",
            "rA": [
                "по истечении срока максимальной инкубации у контактировавших с больным"
            ],
            "wA": [
                "немедленно после госпитализации больного",
                "немедленно после заключительной дезинфекции;",
                "после введения контактным иммуноглобулина, или вакцины, или бактериофага"
            ]
        },
        {
            "qID": 6,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОТИВОЭПИДЕМИЧЕСКУЮ РАБОТУ В ОЧАГЕ ОРГАНИЗУЕТ И ПРОВОДИТ",
            "rA": [
                "участковый  врач и эпидемиолог;"
            ],
            "wA": [
                "эндокринолог;",
                "врач-бактериолог;",
                "врач-офтальмолог;"
            ]
        },
        {
            "qID": 7,
            "qName": "ОК-1, ОПК-1, ПК-3 ПЕРВОЕ  ДЕЙСТВИЕ ПРИ ОРГАНИЗАЦИИ РАБОТЫ  В ЭПИДЕМИЧЕСКОМ ОЧАГЕ",
            "rA": [
                "заполнить и отправить  «Экстренное извещение…»;"
            ],
            "wA": [
                "сбор эпидемиологического анамнеза;",
                "ввести вакцины, или иммуноглобулина;",
                "определить контактных;"
            ]
        },
        {
            "qID": 8,
            "qName": "ОК-1, ОПК-1, ПК-3 «ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ» ЗАПОЛНЯЕТ ВРАЧ",
            "rA": [
                "заподозривший инфекционную болезнь"
            ],
            "wA": [
                "подтвердивший диагноз инфекционной болезни",
                "установивший границы эпидемического очага",
                "хирург"
            ]
        },
        {
            "qID": 9,
            "qName": "ОК-1, ОПК-1, ПК-3 ЗАПОЛНЯТЬ «ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ» ОБ ИНФЕКЦИОННОМ БОЛЬНОМ",
            "rA": [
                "немедленно при подозрении на инфекционную болезнь"
            ],
            "wA": [
                "после консультации с врачом-инфекционистом",
                "после лабораторного подтверждения диагноза",
                "после госпитализации пациента"
            ]
        },
        {
            "qID": 10,
            "qName": "ОК-1, ОПК-1, ПК-3 «ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ» ОБ ИНФЕКЦИОННОМ БОЛЬНОМ ОТПРАВЛЯЮТ",
            "rA": [
                "в территориальный ФБУЗ «Цг и Э»"
            ],
            "wA": [
                "в управление здравоохранения",
                "в районную бактериологическую лабораторию",
                "в дезинфекционную станцию"
            ]
        },
        /*{
            "qID": 11,
            "qName": "ОК-1, ОПК-1, ПК-3 УЧАСТКОВЫЙ ВРАЧ ПРИ ВЫЯВЛЕНИИ ИНФЕКЦИОННОГО БОЛЬНОГО",
            "rA": [
                "Заполняет  «Экстренное извещение»"
            ],
            "wA": [
                "Выясняет анамнез болезни",
                "проводит текущую дезинфекцию",
                "сообщить по месту работы заболевшего"
            ]
        },
        {
            "qID": 12,
            "qName": "ОК-1, ОПК-1, ПК-3 ДОКУМЕНТЫ, ЗАПОЛНЯЕМЫЕ ПОЛИКЛИНИКОЙ ПРИ ВЫЯВЛЕНИИ ИНФЕКЦИОННОГО БОЛЬНОГО",
            "rA": [
                "«Экстренное извещение…» статистический талон, карта диспансерного наблюдения за переболевшим;"
            ],
            "wA": [
                "справка в бассейн;",
                "карта эпидемиологического обследования очага;",
                "лист уточненных диагнозов."
            ]
        },
        {
            "qID": 13,
            "qName": "ОК-1, ОПК-1, ПК-3  ГОСПИТАЛИЗАЦИЯ БОЛЬНОГО ИНФЕКЦИОННОЙ БОЛЕЗНЬЮ",
            "rA": [
                "не обязательна"
            ],
            "wA": [
                "обязательна",
                "желательна",
                "обоснована"
            ]
        },
        {
            "qID": 14,
            "qName": "ОК-1, ОПК-1, ПК-3 К КЛИНИЧЕСКИМ ПОКАЗАНИЯМ ДЛЯ ГОСПИТАЛИЗАЦИИ БОЛЬНОГО ОТНОСЯТСЯ",
            "rA": [
                "возраст, тяжесть течения болезни"
            ],
            "wA": [
                "сухой кашель",
                "профессия больного",
                "профессия контактных лиц"
            ]
        },
        {
            "qID": 15,
            "qName": "ОК-1, ОПК-1, ПК-3 К ПРОТИВОЭПИДЕМИЧЕСКИМ МЕРОПРИЯТИЯМ В ОТНОШЕНИИ ИСТОЧНИКА ИНФЕКЦИИ ОТНОСЯТСЯ",
            "rA": [
                "госпитализация больного в стационар"
            ],
            "wA": [
                "текущая дезинфекция",
                "заключительная дезинфекция",
                "отправка в места заключения"
            ]
        },
        {
            "qID": 16,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ПЕРЕЧИСЛЕННЫХ ЭПИДЕМИЧЕСКИМ ОЧАГОМ  ЯВЛЯЕТСЯ",
            "rA": [
                "квартира где проживает больной с  вирусным гепатитом В"
            ],
            "wA": [
                "ротоглотка больного дифтерией",
                "кишечник больного брюшным тифом",
                "верхние дыхательные пути больного гриппом"
            ]
        },
        {
            "qID": 17,
            "qName": "ОК-1, ОПК-1, ПК-3 СУЩНОСТЬЮ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА ЯВЛЯЕТСЯ",
            "rA": [
                "распространение инфекционных болезней среди людей"
            ],
            "wA": [
                "распространение инфекционных болезней среди животных",
                "состояние зараженности организма человека",
                "зараженность возбудителями переносчиков инфекции"
            ]
        },
        {
            "qID": 18,
            "qName": "ОК-1, ОПК-1, ПК-3 СПОРАДИЧЕСКАЯ ЗАБОЛЕВАЕМОСТЬ – ЭТО",
            "rA": [
                "единичные заболевания"
            ],
            "wA": [
                "групповые заболевания",
                "легкие формы болезни",
                "типичные формы болезни"
            ]
        },
        {
            "qID": 19,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИЗНАКИ ЗАБОЛЕВАЕМОСТИ, ХАРАКТЕРИЗУЮЩИЕ ВСПЫШКУ, ЭПИДЕМИЮ, ПАНДЕМИЮ",
            "rA": [
                "по количеству зарегистрированных случаев болезни"
            ],
            "wA": [
                "по скорости распространения инфекции",
                "по механизму передачи возбудителя",
                "по числу выявленных носителей"
            ]
        },
        {
            "qID": 20,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ ПРОЦЕСС СООТВЕТСТВУЕТ  ОСНОВНЫМ ПРОЯВЛЕНИЯМ В ВИДЕ",
            "rA": [
                "эндемии"
            ],
            "wA": [
                "множественных переломов костей",
                "энзоотии",
                "лакунарной ангины"
            ]
        },
        {
            "qID": 21,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОФИЛАКТИЧЕСКИЕ МЕРОПРИЯТИЯ ПРОВОДЯТ",
            "rA": [
                "вне зависимости от наличия случаев инфекционных болезней"
            ],
            "wA": [
                "при единичных случаях инфекционных заболеваний",
                "при множественных случаях инфекционных заболеваний",
                "в зависимости от эпидемической ситуации в регионе"
            ]
        },
        {
            "qID": 22,
            "qName": "ОК-1, ОПК-1, ПК-3 ПЛАНОВЫЕ ПРИВИВКИ ПРОВОДЯТ",
            "rA": [
                "в соответствии с календарем прививок"
            ],
            "wA": [
                "контактным в очагах",
                "при угрозе брюшнотифозной инфекции",
                "населению города при угрозе распространения холеры"
            ]
        },
        {
            "qID": 23,
            "qName": "ОК-1, ОПК-1, ПК-3 ХЛОРСОДЕРЖАЩИЙ  ПРЕПАРАТ,  РЕКОМЕНДОВАННЫЙ  ДЛЯ ОБРАБОТКИ ПОВЕРХНОСТЕЙ В  ЖИЛЫХ ПОМЕЩЕНИЯХ",
            "rA": [
                "\"Гипохлорит кальция\";"
            ],
            "wA": [
                "хлорная известь;",
                "\"Дезеф\";",
                "\"Кама\";"
            ]
        },
        {
            "qID": 24,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ СТИРКИ, ДЕЗИНФЕКЦИИ БЕЛЬЯ И МЫТЬЯ ПОСУДЫ  РЕКОМЕН¬ДОВАНЫ",
            "rA": [
                "дихлор-;"
            ],
            "wA": [
                "хлорная известь",
                "Сальваниос рН -10",
                "санита"
            ]
        },
        {
            "qID": 25,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕДРАБОТНИКАМ НЕОБХОДИМА ЭКСТРЕННАЯ ПРОФИЛАКТИКА ВИРУСНОГО ГЕПАТИТА В  ПРИ",
            "rA": [
                "повреждении кожных покровов в процессе проведения различных манипуляций больному вирусным гепатитом В или носителю НВs антигена, если медработник был ранее не вакцинирован или был вакцинирован, но титр антител к HBs-антигену не превышает 10 МЕ/мл"
            ],
            "wA": [
                "любых манипуляциях с повреждением кожи",
                "повреждении кожных покровов при проведении различных манипуляций больному вирусным гепатитом В или носителю НВs антигена, если медработник был ранее вакцинирован и титр антител к HBs-антигену  превышает 20 МЕ/мл",
                "уходе за любым больными вирусным гепатитом В, даже в отсутствие повреждения кожных покровов"
            ]
        },
        {
            "qID": 26,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРИ ОБРАБОТКЕ ЗАГРЯЗНЕННОЕ ИСПРАЖНЕНИЯМИ ПОСТЕЛЬНОЕ БЕЛЬЕ БОЛЬНЫХ ДИЗЕНТЕРИЕЙ НЕОБХОДИМО",
            "rA": [
                "кипятить"
            ],
            "wA": [
                "отправить в камеру для де¬зинфекции",
                "замочить в сухой хлорной извести",
                "прополоскать в содовом растворе"
            ]
        },
        {
            "qID": 27,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕТОД СТЕРИЛИЗАЦИИ МЕДИЦИНСКОГО ИНСТРУМЕНТАРИЯ ИЗ КОРРОЗИОННО НЕУСТОЙЧИВЫХ МАТЕРИАЛОВ",
            "rA": [
                "воздушный"
            ],
            "wA": [
                "паровой",
                "газовый",
                "биологический"
            ]
        },
        {
            "qID": 28,
            "qName": "ОК-1, ОПК-1, ПК-3 ХИМИЧЕСКОЕ СРЕДСТВО, ИСПОЛЬЗУЕМОЕ ДЛЯ ОБРАБОТКИ ХИРУРГИЧЕСКОГО ИНСТРУМЕНТАРИЯ",
            "rA": [
                "хлорамин"
            ],
            "wA": [
                "перекись водорода",
                "пар",
                "горячий воз¬дух"
            ]
        },
        {
            "qID": 29,
            "qName": "ОК-1, ОПК-1, ПК-3 СТЕРИЛИЗАЦИЯ МЕДИЦИНСКАЯ — ЭТО",
            "rA": [
                "полное освобо¬ждение объекта от всех микроорганизмов"
            ],
            "wA": [
                "уничтожение только вегетативных патогенных микроорганизмов;",
                "уничтоже¬ние только споровых патогенных форм;",
                "действие медицинской сестры"
            ]
        },
        {
            "qID": 30,
            "qName": "ОК-1, ОПК-1, ПК-3 ЦЕЛЬ ПРЕДСТЕРИЛИЗАЦИОННОЙ ОБРАБОТКИ    МЕДИЦИНСКОГО ИНСТРУ¬МЕНТАРИЯ",
            "rA": [
                "удалить белковые, жировые загрязнения"
            ],
            "wA": [
                "удалить информацию",
                "удалить  лак",
                "стерилизовать  загрязнения"
            ]
        },
        {
            "qID": 31,
            "qName": "ОК-1, ОПК-1, ПК-3 О КАЖДОМ СЛУЧАЕ ИНФЕКЦИОННОЙ (ПАРАЗИТАРНОЙ) БОЛЕЗНИ МЕДИЦИНСКИЕ РАБОТНИКИ МЕДИЦИНСКИХ, ОБРАЗОВАТЕЛЬНЫХ, ОЗДОРОВИТЕЛЬНЫХ И ДРУГИХ ОРГАНИЗАЦИЙ, ИНДИВИДУАЛЬНЫЕ ПРЕДПРИНИМАТЕЛИ, ОСУЩЕСТВЛЯЮЩИЕ МЕДИЦИНСКУЮ ДЕЯТЕЛЬНОСТЬ, ОБЯЗАНЫ СООБЩИТЬ ПО ТЕЛЕФОНУ  ВТЕЧЕНИЕ \tЧАСОВ",
            "rA": [
                "2"
            ],
            "wA": [
                "6",
                "12",
                "15"
            ]
        },
        {
            "qID": 32,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРИ ИСПОЛЬЗОВАНИИ РЕПЕЛЛЕНТОВ НЕОБХОДИМО",
            "rA": [
                "обработать  одежду и открытые части тела"
            ],
            "wA": [
                "обработать инструктора дезинфектора",
                "обработать помещение",
                "обработать местность"
            ]
        },
        {
            "qID": 33,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПОД ЭПИДЕМИЧЕСКИМ ОЧАГОМ ПОНИМАЮТ",
            "rA": [
                "место нахождения источника с окружающей его территорией, где может передаваться заразное начало"
            ],
            "wA": [
                "квартиру, в которой находится больной туляремией",
                "столовую в детском дошкольном учреждении, в которой кушал больной туляремией",
                "пруд, в котором купались дети"
            ]
        },
        {
            "qID": 34,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОБНАРУЖИВ ПРИ  ОСМОТРЕ ПАЦИЕНТА  В ПРИЕМНОМ ОТДЕЛЕНИИ  ГОЛОВНЫЕ ВШИ И ГНИДЫ, НЕОБХОДИМО",
            "rA": [
                "обработать волосы противопедикулезными препаратами;"
            ],
            "wA": [
                "обработать тело  мазевыми противовоспалительными препаратами;",
                "обработать голову Микроцидом ликвидом;",
                "вымыть голову горячей водой с хозяйствен¬ным мылом;"
            ]
        },
        {
            "qID": 35,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ПРОФИЛАКТИКИ И БОРЬБЫ С МУХАМИ НЕОБХОДИМО",
            "rA": [
                "соблюдать санитарное состояние помещений;"
            ],
            "wA": [
                "пользоваться репеллентами;",
                "осушать мелкие водо¬емы;",
                "использовать перитроиды;"
            ]
        },
        {
            "qID": 36,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ ОБРАБОТКЕ  МНОГОЭТАЖНОГО КОРПУСА БОЛЬНИЦЫ ДЛЯ УНИЧТОЖЕНИЯ ТАРАКАНОВ НЕОБХОДИМО",
            "rA": [
                "одновременно обрабо¬тать весь корпус"
            ],
            "wA": [
                "обрабатывать только пищеблок",
                "поочередно в течение нескольких дней обра¬ботать все помещения больницы",
                "не проводить повторную обработку."
            ]
        },
        {
            "qID": 37,
            "qName": "ОК-1, ОПК-1, ПК-3 «ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ» ЗАПОЛНЯЕТ ВРАЧ",
            "rA": [
                "заподозривший инфекционное заболевание"
            ],
            "wA": [
                "подтвердивший диагноз инфекционного заболевания",
                "эпидемиолог",
                "дезинфектор"
            ]
        },
        {
            "qID": 38,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ВЕРТИКАЛЬНЫЙ МЕХАНИЗМ ПЕРЕДАЧИ ВОЗМОЖЕН ПРИ",
            "rA": [
                "ВИЧ-инфекции"
            ],
            "wA": [
                "шигеллезе",
                "вирусном гепатите А",
                "коклюше"
            ]
        },
        {
            "qID": 39,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕДИЦИНСКИЙ ПЕРСОНАЛ МОЖЕТ ВЫПОЛНЯТЬ ДЕЗИНФЕКЦИОННЫЕ РАБОТЫ В ВОЗРАСТЕ",
            "rA": [
                "лица старше 18 лет;"
            ],
            "wA": [
                "независимо от возраста;",
                "по¬сле инструктажа.",
                "при наличии образования"
            ]
        },
        {
            "qID": 40,
            "qName": "ОК-1, ОПК-1 ПРОБЫ ДЛЯ ОБНАРУЖЕНИЯ СЛЕДОВ КРОВИ НА МЕДИЦИНСКОМ ИНСТРУ¬МЕНТАРИИ",
            "rA": [
                "Азопирамовая, амидопириновая"
            ],
            "wA": [
                "фенол¬фталеиновую",
                "с Суданом III",
                "Цуверкалова"
            ]
        },
        {
            "qID": 41,
            "qName": "ОК-1, ОПК-1, ПК-3 УНИЧТОЖЕНИЕ ПАТОГЕННЫХ И УСЛОВНО - ПАТОГЕННЫХ МИКРООРГАНИЗМОВ С ОБЪЕКТОВ ВНЕШНЕЙ СРЕДЫ ИЛИ КОЖНОГО ПОКРОВА ДО УРОВНЯ НЕ ПРЕДСТАВЛЯЮЩЕГО ОПАСНОСТИ ДЛЯ ЗДОРОВЬЯ НАЗЫВАЕТСЯ",
            "rA": [
                "дезинфекция"
            ],
            "wA": [
                "дезинсекция",
                "стерилизация",
                "дератизация"
            ]
        },
        {
            "qID": 42,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 МЕТОД ИСТРЕБЛЕНИЯ  ГРЫЗУНОВ, ЯВЛЯЮЩИХСЯ ИСТОЧНИКАМИ ИЛИ ПЕРЕНОСЧИКАМИ ИНФЕКЦИОННЫХ ЗАБОЛЕВАНИЙ (ЧУМА, ТУЛЯРЕМИЯ, ЛЕЙШМАНИОЗЫ И ДР.) И НАНОСЯЩИХ ЭКОНОМИЧЕСКИЙ УЩЕРБ ХОЗЯЙСТВУ НАЗЫВАЕТСЯ",
            "rA": [
                "дератизация"
            ],
            "wA": [
                "дезинфекция",
                "дезинсекция",
                "стерилизация"
            ]
        },
        {
            "qID": 43,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОФИЛАКТИЧЕСКАЯ ДЕЗИНФЕКЦИЯ ОСУЩЕСТВЛЯЕТСЯ В",
            "rA": [
                "организации осуществляющей медицинскую деятельность"
            ],
            "wA": [
                "мышиной норе",
                "в поле, где растет пшеница",
                "в морской воде"
            ]
        },
        {
            "qID": 44,
            "qName": "ОК-1, ОПК-1, ПК-3  МЕТОД, ОБЕСПЕЧИВАЮЩИЙ ГИБЕЛЬ ВЕГЕТАТИВНЫХ И СПОРОВЫХ ФОРМ, ПАТОГЕННЫХ И НЕПАТОГЕННЫХ МИКРООРГАНИЗМОВ НАЗЫВАЕТСЯ",
            "rA": [
                "стерилизация"
            ],
            "wA": [
                "дезинфекция",
                "дезинсекция",
                "дератизация"
            ]
        },
        {
            "qID": 45,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕТОДЫ И СРЕДСТВА БОРЬБЫ С ЧЛЕНИСТОНОГИМИ (НАСЕКОМЫМИ И КЛЕЩАМИ), ПЕРЕНОСЯЩИМИ ИНФЕКЦИОННЫЕ ЗАБОЛЕВАНИЯ И НАНОСЯЩИМИ ВРЕД ПИЩЕВЫМ И СЕЛЬСКОХОЗЯЙСТВЕННЫМ ПРОДУКТАМ И ЖИЛИЩУ ЧЕЛОВЕКА НАЗЫВАЮТСЯ",
            "rA": [
                "дезинсекция"
            ],
            "wA": [
                "дезинфекция",
                "стерилизация",
                "дератизация"
            ]
        },
        {
            "qID": 46,
            "qName": "ОК-1, ОПК-1, ПК-3  ВСЕ ВЕГЕТАТИВНЫЕ ФОРМЫ ПОГИБАЮТ, НО СОХРАНЯЮТСЯ СПОРЫ ПРИ ТЕМПЕРАТУРЕ",
            "rA": [
                "60° - 70°С."
            ],
            "wA": [
                "100°С;",
                "85°С;",
                "80°С;"
            ]
        },
        {
            "qID": 47,
            "qName": "ОК-1, ОПК-1, ПК-3 АНТИСЕПТИКА –  ЭТО СОВОКУПНОСТЬ МЕР, НАПРАВЛЕННЫХ НА",
            "rA": [
                "уничтожение микробов в ране, патологическом очаге и в организме в целом"
            ],
            "wA": [
                "предупреждение попадания возбудителя в рану, органы больного при операциях, лечебных и диагностических мероприятиях",
                "обработку загрязненного микробами предмета с целью их уничтожения до такой степени, чтобы они не смогли вызвать инфекцию при использовании данного предмета",
                "уничтожение возбудителя инфекционных болезней на путях передачи от источника инфекции к восприимчивым людям",
                "уничтожение возбудителя инфекционных болезней на неживых объектах окружающей среды"
            ]
        },
        {
            "qID": 48,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ЗАРАЖЕНИЯ ВИРУСНЫМИ ГЕПАТИТАМИ В И С НАИБОЛЕЕ ЗНАЧИМЫМ СУБСТРАТОМ ЯВЛЯЕТСЯ",
            "rA": [
                "кровь"
            ],
            "wA": [
                "моча",
                "пот",
                "слюна"
            ]
        },
        {
            "qID": 49,
            "qName": "ОК-1, ОПК-1, ПК-3 АСЕПТИКА - ЭТО",
            "rA": [
                "предупреждение попадания возбудителя инфекции в рану или организм человека"
            ],
            "wA": [
                "комплекс мероприятий направленных на борьбу с инфекцией",
                "комплекс мероприятий направленных на лечение заболеваний",
                "мероприятия на ликвидацию инфекционного воспалительного процесса",
                "контроль  наличия инфекции на медицинском инструментарии"
            ]
        },
        {
            "qID": 50,
            "qName": "ОК-1, ОПК-1, ПК-3 К ФИЗИЧЕСКОМУ МЕТОДУ ДЕЗИНФЕКЦИИ ОТНОСИТСЯ",
            "rA": [
                "кипячение"
            ],
            "wA": [
                "хлорсодержащие  средства",
                "Биолот-1",
                "горячая вода"
            ]
        },
        {
            "qID": 51,
            "qName": "ОК-1, ОПК-1, ПК-3 НЕ ЯВЛЯЕТСЯ ТРЕБОВАНИЕМ  К ДЕЗИНФЕКТАНТАМ",
            "rA": [
                "высокая агрессивность относительно конструктивных материалов;"
            ],
            "wA": [
                "экологическая безопасность;",
                "активность  воздействия  на разнообразных  микроорганизмов;",
                "возможность растворимости в воде;"
            ]
        },
        {
            "qID": 52,
            "qName": "ОК-1, ОПК-1, ПК-3 МИКРООРГАНИЗМЫ, ЭВОЛЮЦИОННО ПРИСПОСОБЛЕННЫЕ К ПАРАЗИТИРОВАНИЮ В ЖИВОМ ОРГАНИЗМЕ И СПОСОБНЫЕ ВЫЗЫВАТЬ ИНФЕКЦИОННУЮ БОЛЕЗНЬ НАЗЫВАЮТСЯ",
            "rA": [
                "патогенные"
            ],
            "wA": [
                "условно-патогенные",
                "вирулентные",
                "особо опасные"
            ]
        },
        {
            "qID": 53,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ВИЧ-ИНФИЦИРОВАННЫЙ БОЛЬНОЙ ЯВЛЯЕТСЯ ИСТОЧНИКОМ ИНФЕКЦИИ",
            "rA": [
                "весь период болезни"
            ],
            "wA": [
                "в инкубационном периоде",
                "в острой стадии",
                "на стадии вторичных заболеваний"
            ]
        },
        {
            "qID": 54,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИРУСНЫЕ ГЕПАТИТЫ (А, В, С, D, Е) — ЭТО",
            "rA": [
                "антропонозы"
            ],
            "wA": [
                "зоонозы",
                "антропозоонозы",
                "сапронозы."
            ]
        },
        {
            "qID": 55,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ ПРОЦЕСС ГЕПАТИТА В  В СОВРЕМЕННЫХ УСЛОВИЯХ ХАРАКТЕРИЗУЕТСЯ",
            "rA": [
                "низким уровнем заболеваемости острыми формами"
            ],
            "wA": [
                "нарастанием числа заболевших в зимне-весеннее время года",
                "взрывообразным началом сезонных подъемов забо¬леваемости",
                "равномерным распределениеем заболеваемости во всех возрастных  группах"
            ]
        },
        {
            "qID": 56,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭПИДЕМИЧЕСКИЙ   ПРОЦЕСС   ГЕПАТИТА   С    В СОВРЕМЕННЫХ УСЛОВИЯХ ХАРАКТЕРИЗУЕТСЯ",
            "rA": [
                "широким распространением хронических форм"
            ],
            "wA": [
                "нарастанием числа заболевших среди  детей",
                "эпидемическими очагами с множественными   случаями   заболеваний",
                "увеличением числа заболевших в летне-осенние месяцы года"
            ]
        },
        {
            "qID": 57,
            "qName": "ОК-1, ОПК-1, ПК-3 БОЛЬНОЙ  ВИРУСНЫМ ГЕПАТИТОМ А  НАИБОЛЕЕ ЗАРАЗЕН",
            "rA": [
                "последние 7—10 дней инкубации, в преджелтушный период"
            ],
            "wA": [
                "последние 3 нед инкубации, в последний день преджелтушного периода",
                "последний день инкубационного периода",
                "желтушный пе¬риод"
            ]
        },
        {
            "qID": 58,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ДЛЯ ЗАРАЖЕНИЯ ГЕПАТИТОМ В НАИБОЛЕЕ  ЭПИДЕМИОЛОГИЧЕСКИ ЗНАЧИМЫЕ БИОЛОГИ-ЧЕСКИЕ СУБСТРАТЫ",
            "rA": [
                "кровь, спермальная жидкость"
            ],
            "wA": [
                "моча, фекалии",
                "спер¬ма, пот",
                "спинномозговая жидкость, слезы"
            ]
        },
        {
            "qID": 59,
            "qName": "ОК-1, ОПК-1, ПК-3 ФАКТОРАМИ ПЕРЕДАЧИ ВИРУСА ГЕПАТИТА В МОГУТ БЫТЬ  ПРЕДМЕТЫ",
            "rA": [
                "бритвен¬ный прибор, зубная щетка"
            ],
            "wA": [
                "Шарф, носовой платок",
                "маникюрные принадлежности, столовая посуда",
                "ложка"
            ]
        },
        {
            "qID": 60,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСТОЧНИК ИНФЕКЦИИ ГЕПАТИТА С ИМЕЮЩИЙ НАИБОЛЬШЕЕ ЭПИДЕМИОЛОГИЧЕСКОЕ ЗНАЧЕНИЕ",
            "rA": [
                "больной хронической формой гепатита С"
            ],
            "wA": [
                "больной острой формой гепатита С",
                "сыворотка крови чело¬века, инфицированного вирусом гепатита С",
                "плазма крови"
            ]
        },
        {
            "qID": 61,
            "qName": "ОК-1, ОПК-1, ПК-3 К ИСТОЧНИКАМ ИНФЕКЦИИ ПРИ ГРИППЕ ОТНОСЯТ",
            "rA": [
                "больного человека в первые пять дней болезни"
            ],
            "wA": [
                "вирусоносителя",
                "домашних животных",
                "птиц"
            ]
        },
        {
            "qID": 62,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРИ УГРОЗЕ МАССОВОГО РАПРОСТРАНЕНИЯ ЗАБОЛЕВАНИЯ ПРОВОДЯТ",
            "rA": [
                "вакцинацию"
            ],
            "wA": [
                "бактериофагирование",
                "вводят иммуноглобулин",
                "вводят сыворотку"
            ]
        },
        {
            "qID": 63,
            "qName": "ОК-1, ОПК-1, ПК-3 БОЛЬНОЙ ОСТРОЙ ФОРМОЙ ГЕПАТИТА В  НЕ ОПАСЕН КАК ИСТОЧНИК ИНФЕКЦИИ",
            "rA": [
                "в начале  инкубационного период;"
            ],
            "wA": [
                "в последние 2—8 недель инкубационного периода",
                "в про¬дромальном периоде",
                "в  желтушном периоде (разгар болез¬ни);",
                "в  период реконвалесценции."
            ]
        },
        {
            "qID": 64,
            "qName": "ОК-1, ОПК-1, ПК-3 ОБСЛЕДОВАНИЕ МЕДИЦИНСКИХ РАБОТНИКОВ НА  HBSAG ПРОВОДИТСЯ",
            "rA": [
                "1 раз в год"
            ],
            "wA": [
                "1 раз в полгода",
                "1 раз в 2 года",
                "ежеквар¬тально"
            ]
        },
        {
            "qID": 65,
            "qName": "ОК-1, ОПК-1, ПК-3 ] К ПРИЧИНАМ ЭКЗОГЕННОГО ЗАНОСА ИНФЕКЦИИ В ОРГАНИЗМ ЧЕЛОВЕКА ОТНОСЯТ",
            "rA": [
                "снижение резистентности организма"
            ],
            "wA": [
                "различные медицинские манипуляции",
                "продолжительную бактериемию",
                "смену возбудителя в процессе течения болезни"
            ]
        },
        {
            "qID": 66,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ПЕРЕЧИСЛЕННЫХ ГРУПП МЕДИЦИНСКИХ РАБОТНИКОВ НАИМЕНЬШИЙ РИСК ЗАРАЖЕНИЯ ВИРУСНЫМ ГЕПАТИТОМ С ИМЕЕТ",
            "rA": [
                "участковый педиатр"
            ],
            "wA": [
                "оперирующий хирург",
                "персо¬нал станции скорой помощи",
                "персонал станции перели¬вания крови"
            ]
        },
        {
            "qID": 67,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ИЗ ПЕРЕЧИСЛЕННЫХ  МЕР ПРОФИЛАКТИКИ ВИРУСНОГО ГЕПАТИТА В НЕ ПОВЛИЯЕТ НА РАЗВИТИЕ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА ЭТОЙ ИНФЕКЦИИ",
            "rA": [
                "санитарный контроль за водоснабжением  населения"
            ],
            "wA": [
                "использование одноразовых шприцев",
                "контроль соблюдения противоэпидемического режима  в МО",
                "вакцинация лиц  групп риска"
            ]
        },
        {
            "qID": 68,
            "qName": "ОК-1, ОПК-1, ПК-3 ЗАРАЖЕНИЕ ЧЕЛОВЕКА ТУБЕРКУЛЕЗОМ ЧАЩЕ ПРОИСХОДИТ_____ПУТЕМ",
            "rA": [
                "аэрогенным"
            ],
            "wA": [
                "алиментарным",
                "контактным",
                "внутриутробным"
            ]
        },
        {
            "qID": 69,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИЧ-ИНФИЦИРОВАННЫЕ ЛИЦА  НЕ ИМЕЮТ ПРАВО",
            "rA": [
                "быть до¬нором"
            ],
            "wA": [
                "на доступное медицинское освидетельствование",
                "на получение квалифи¬цированной медицинской помощи всех видов",
                "на добровольное обследование"
            ]
        },
        {
            "qID": 70,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИЧ-ИНФЕКЦИЯ — ЭТО",
            "rA": [
                "антропоноз;"
            ],
            "wA": [
                "сапроноз;",
                "зооноз;",
                "зооантропоноз."
            ]
        },
        {
            "qID": 71,
            "qName": "ОК-1, ОПК-1, ПК-3 НАИБОЛЬШАЯ КОНЦЕНТРАЦИЯ ВИРУСА ВИЧ В БИОЛОГИЧЕСКИХ ЖИДКОСТЯХ ЧЕЛОВЕКА В",
            "rA": [
                "крови"
            ],
            "wA": [
                "моче",
                "грудном молоке",
                "сперме"
            ]
        },
        {
            "qID": 72,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОСНОВНЫМ МЕТОДОМ РАННЕГО ВЫЯВЛЕНИЯ ТУБЕРКУЛЕЗА ЛЕГКИХ СРЕДИ ВЗРОСЛОГО НАСЕЛЕНИЯ ЯВЛЯЕТСЯ",
            "rA": [
                "лучевой (флюорография)"
            ],
            "wA": [
                "микроскопия мокроты на микобактерии туберкулеза",
                "посев мокроты на микобактерии туберкулеза",
                "клинический анализ крови"
            ]
        },
        {
            "qID": 73,
            "qName": "ОК-1, ОПК-1, ПК-3 НАИБОЛЕЕ ВЫСОК РИСК ЗАРАЖЕНИЯ ВИЧ ИНФЕКЦИЕЙ  ПРИ",
            "rA": [
                "переливании инфицированной кро¬ви"
            ],
            "wA": [
                "сек¬суальном контакте",
                "грудном вскармливании",
                "пользовании общим туа¬летом"
            ]
        },
        {
            "qID": 74,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРЕПЯТСТВУЕТ ЗАРАЖЕНИЮ    ВИЧ",
            "rA": [
                "сексуальный контакт с использованием презерватива"
            ],
            "wA": [
                "беспорядочные гомо- и гетеросексуальные связи",
                "наличие венерических заболеваний   у   сексуальных   партнеров",
                "сексуальный контакт во время менструации"
            ]
        },
        {
            "qID": 75,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ПЕРЕЧИСЛЕННЫХ ГРУПП НАСЕЛЕНИЯ НАИМЕНЬШИЙ РИСК ЗАРАЖЕНИЯ ВИЧ ИНФЕКЦИЕЙ У",
            "rA": [
                "медицинские работника строго соблюдающего технику безопасности"
            ],
            "wA": [
                "донора крови",
                "инъкционного наркомана",
                "работника коммерческого секса (РКС)"
            ]
        },
        {
            "qID": 76,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСПОЛЬЗУЮТ  ПРИ  СКРИНИНГОВОМ ОБСЛЕДОВАНИИ ГРУПП РИСКА  С ЦЕЛЬЮ ВЫ¬ЯВЛЕНИЯ   ВИЧ-ИНФИЦИРОВАННЫХ",
            "rA": [
                "ИФА;"
            ],
            "wA": [
                "РСК;",
                "иммунный блоттинг;",
                "иммуноэлек¬трофорез."
            ]
        },
        {
            "qID": 77,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ИНФИЦИРОВАНИЕ  ВИЧ МЕДИЦИНСКОГО ПЕРСОНАЛА  МАЛО ВЕРОЯТНО  ПРИ",
            "rA": [
                "проведении физиотерапевти¬ских процедур;"
            ],
            "wA": [
                "проведении парентеральных процедур;",
                "оперативных вмешательствах;",
                "удалении зубного камня;"
            ]
        },
        {
            "qID": 78,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ОБРАБОТКИ РУК МЕДИЦИНСКОГО ПЕРСОНАЛА, ЗАГРЯЗНЕННОГО КРОВЬЮ БОЛЬНОГО ВИЧ-ИНФЕКЦИЕЙ, ИСПОЛЬЗУЮТ ЭТИЛОВЫЙ СПИРТ В_______КОНЦЕНТРАЦИИ",
            "rA": [
                "70 %;"
            ],
            "wA": [
                "40 %;",
                "60 %;",
                "80 %;"
            ]
        },
        {
            "qID": 79,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ПОДТВЕРЖДЕНИЯ ДИАГНОЗА ВИЧ-ИНФЕКЦИИ ПРОВОДЯТ ПОСТАНОВКУ РЕАКЦИИ",
            "rA": [
                "иммунного блота;"
            ],
            "wA": [
                "иммуноферментного анализа,",
                "генетической;",
                "микроскопической."
            ]
        },
        {
            "qID": 80,
            "qName": "ОК-1, ОПК-1, ПК-3 ДО ИСПОЛЬЗОВАНИЯ РАЗЛИЧНЫХ РАСТВОРОВ  ПРИ ПОПАДАНИИ КРОВИ ПАЦИЕНТА НА КОНЪЮНКТИВУ ГЛАЗ СТОМАТОЛОГА НЕОБХОДИМО",
            "rA": [
                "обильно промыть водой"
            ],
            "wA": [
                "Промыть 0,05 % раствором  перманганата калия;",
                "раствор сульфацил-натрия",
                "2 % раствор бикарбоната натрия (сода дву¬углекислая)"
            ]
        },
        {
            "qID": 81,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ ВСКРЫТИИ АБСЦЕССА В РОТОВОЙ ПОЛОСТИ У БОЛЬНОГО ВИЧ-ИН¬ФЕКЦИЕЙ  ВРАЧ ПРОКОЛОЛ РЕЗИНОВУЮ ПЕРЧАТКУ И ПО¬РАНИЛ  ПАЛЕЦ   С   ВЫДЕЛЕНИЕМ   КРОВИ,  ПЕРВОЕ ДЕЙСТВИЕ",
            "rA": [
                "обработать  перчатки   дезинфицирующим    раствором, снять их"
            ],
            "wA": [
                "снять  перчатки",
                "вымыть руки в перчатках с мылом и снять перчатки",
                "обработать  руки 70 % спиртом и смазать ранку 5 % раствором йода"
            ]
        },
        {
            "qID": 82,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИЧ-ИНФИЦИРОВАННЫЙ ЧЕЛОВЕК ЯВЛЯЕТСЯ ИСТОЧНИКОМ ИН¬ФЕКЦИИ",
            "rA": [
                "пожизненно"
            ],
            "wA": [
                "в терминальной стадии",
                "в стадии бессимптомной ин¬фекции (II 2.;",
                "в стадии острой инфекции (II 1.;"
            ]
        },
        {
            "qID": 83,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕХАНИЗМЫ ПЕРЕДАЧИ ВИЧ-ИНФЕКЦИИ",
            "rA": [
                "контактный"
            ],
            "wA": [
                "аспирационный",
                "фекально-оральный",
                "трансмиссив¬ный"
            ]
        },
        {
            "qID": 84,
            "qName": "ОК-1, ОПК-1, ПК-3 НЕОБХОДИМО ОБРАБАТЫВАТЬ ЗАГРЯЗНЕННУЮ КРОВЬЮ ИЛИ ВЫДЕЛЕНИЯМИ БОЛЬНЫХ ЗАЩИТНУЮ ОДЕЖДУ МЕДИЦИНСКОГО ПЕРСОНАЛА",
            "rA": [
                "раствором хлорамина"
            ],
            "wA": [
                "в паровой камере",
                "в пароформалиновой камере",
                "протирать 6 % перекисью во¬дорода"
            ]
        },
        {
            "qID": 85,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ СНИЖЕНИЯ РИСКА ЗАНОСА ИНФЕКЦИИ В  ТЕРА¬ПЕВТИЧЕСКИЙ СТАЦИОНАР  НЕОБХОДИМО",
            "rA": [
                "тщательно осматривать больного в приемном отделении и собирать эпиданамнез"
            ],
            "wA": [
                "контролировать соблю¬дение дезинфекционного режима",
                "сокращать время пребывания больных в стациона¬ре",
                "повышать квалификацию  врачей"
            ]
        },
        {
            "qID": 86,
            "qName": "ОК-1, ОПК-1, ПК-3 НА 15-Й ДЕНЬ ПРЕБЫВАНИЯ В ТЕРА¬ПЕВТИЧЕСКОМ ОТДЕЛЕНИИ У БОЛЬНОГО   ЖИДКИЙ СТУЛ,   ВЫСЕЯНЫ   ШИГЕЛЛЫ ЗОННЕ. АНАЛОГИЧНЫХ ЗАБОЛЕВАНИЙ В СТАЦИОНАРЕ НЕТ. ДАННЫЙ СЛУЧАЙ – ЭТО",
            "rA": [
                "внутриболь¬ничное заражение"
            ],
            "wA": [
                "больной поступил в состоянии ин¬кубации дизентерии",
                "занос инфекции в стационар",
                "не ИСМП"
            ]
        },
        {
            "qID": 87,
            "qName": "ОК-1, ОПК-1, ПК-3 ЯВЛЯЮТСЯ ИСТОЧНИКАМИ   ВОЗБУДИТЕЛЕЙ   ВНУТРИБОЛЬНИЧНОЙ   ИНФЕКЦИИ",
            "rA": [
                "Пациенты и медицинский персонал"
            ],
            "wA": [
                "медицинский персонал и персонал  АХЧ",
                "ме¬дицинский инструментарий",
                "администрация ООМД"
            ]
        },
        {
            "qID": 88,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕДИЦИНСКИЙ РАБОТНИК ПРИ ВЫЯВЛЕНИИ В МЕДИЦИНСКОЙ ОРГАНИЗАЦИИ БОЛЬНОГО, ПОДОЗРИТЕЛЬНОГО НА ОСОБО ОПАСНУЮ ИНФЕКЦИЮ",
            "rA": [
                "изолирует его и, не выходя из помещения, извещает руководителя своего учреждения о выявленном больном"
            ],
            "wA": [
                "извещает органы Роспотребнадзора или вышестоящие инстанции",
                "изолирует его, а сам выходит из кабинета и срочно оповещает руководителя своего учреждения",
                "заполняет экстренное извещение и оповещает всех медицинских работников данного учреждения"
            ]
        },
        {
            "qID": 89,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИЧИНОЙ ГИБЕЛИ БОЛЬШИНСТВА ПОСТРАДАВШИХ ПРИ ЧРЕЗВЫЧАЙНЫХ СИТУАЦИЯХ ЯВЛЯЕТСЯ",
            "rA": [
                "несвоевременность оказания медицинской помощи"
            ],
            "wA": [
                "воздействие механического поражающего фактора",
                "недостаточное обеспечение средствами защиты",
                "неорганизованные эвакуационные мероприятия"
            ]
        },
        {
            "qID": 90,
            "qName": "ОК-1, ОПК-1, ПК-3 ПЕРЕДАЮТСЯ ВОЗДУШНО-ПЫ¬ЛЕВЫМ ПУТЕМ ПРИ ВНУТРИБОЛЬНИЧНОМ ЗАРАЖЕНИИ ВОЗБУДИТЕЛИ",
            "rA": [
                "Легионеллы, сальмонеллы, стафилококки;"
            ],
            "wA": [
                "ВИЧ;",
                "Сальмонеллы, кишечные палочки ;",
                "стафилококки;"
            ]
        },
        {
            "qID": 91,
            "qName": "ОК-1, ОПК-1, ПК- ДЛЯ ЛАБОРАТОРНОГО ПОДТВЕРЖДЕНИЯ ДИАГНОЗА МАЛЯРИИ ИССЛЕДУЕТСЯ",
            "rA": [
                "кровь"
            ],
            "wA": [
                "кал",
                "моча",
                "желчь"
            ]
        },
        {
            "qID": 92,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 К МЕТОДАМ СПЕЦИФИЧЕСКОЙ ПРОФИЛАКТИКИ ГРИППА ОТНОСИТСЯ",
            "rA": [
                "вакцинация"
            ],
            "wA": [
                "закаливание организма",
                "применение амантадина",
                "применение лейкоцитарногоинтеферона"
            ]
        },
        {
            "qID": 93,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 К МЕРОПРИЯТИЯМ ПЕРВИЧНОЙ ПРОФИЛАКТИКИ ОТНОСИТСЯ",
            "rA": [
                "устранение причин развития заболевания"
            ],
            "wA": [
                "раннее выявление заболевания",
                "своевременное начало лечения заболевания",
                "паллиативная медицинская помощь"
            ]
        },
        {
            "qID": 94,
            "qName": "ОК-1, ОПК-1, ПК-3 ФАКТОРЫ РИСКА   РОСТА  ЗАБОЛЕВАЕМОСТИ ВНУТРИБОЛЬНИЧНЫМИ ИНФЕКЦИЯМИ",
            "rA": [
                "соз¬дание крупных  многопрофильных больничных комплек¬сов;"
            ],
            "wA": [
                "уменьшение числа госпитализированных;",
                "развитие стационарзамещающих технологий;",
                "улучшение противоэпидемического режима;"
            ]
        },
        {
            "qID": 95,
            "qName": "ОК-1, ОПК-1, ПК-3 ФАКТОР РИСКА ВОЗНИКНОВЕНИЯ ИСМП",
            "rA": [
                "дли¬тельность госпитализации;"
            ],
            "wA": [
                "пол госпитализированных больных;",
                "анамнез жизни  больных;",
                "внедрение малоинвазивной хирургии;"
            ]
        },
        {
            "qID": 96,
            "qName": "ОК-1, ОПК-1, ПК-3 МАНИПУЛЯЦИИ  И ПРОЦЕДУРЫ, ПОТЕНЦИАЛЬНО ОПАСНЫЕ ДЛЯ ВНУТРИБОЛЬНИЧНОГО ЗАРАЖЕНИЯ",
            "rA": [
                "оперативное вмешатель¬ство, катетеризация сосудов;"
            ],
            "wA": [
                "инъекции, визуальный осмотр;",
                "пальпация;",
                "аускультация;"
            ]
        },
        {
            "qID": 97,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 НЕОБХОДИМО ОБРАБАТЫВАТЬ ЗАГРЯЗНЕННУЮ КРОВЬЮ ИЛИ ВЫДЕЛЕНИЯМИ БОЛЬНЫХ СМЕННУЮ ОБУВЬ",
            "rA": [
                "в пароформалиновой камере;"
            ],
            "wA": [
                "в паровой камере;",
                "раствором хлорамина;",
                "протирать 6 % перекисью во¬дорода;"
            ]
        },
        {
            "qID": 98,
            "qName": "ОК-1, ОПК-1, ПК-3 НЕОБХОДИМО ОБРАБАТЫВАТЬ ЗАГРЯЗНЕННЫЕ КРОВЬЮ ИЛИ ВЫДЕЛЕНИЯМИ БОЛЬНЫХ РЕЗИНОВЫЕ ПЕРЧАТКИ",
            "rA": [
                "раствором хлорамина;"
            ],
            "wA": [
                "в паровой камере;",
                "в пароформалиновой камере;",
                "кипятить в содовом растворе;"
            ]
        },
        {
            "qID": 99,
            "qName": "ОК-1, ОПК-1, ПК-3 ЗАГРЯЗНЕННЫЙ КРОВЬЮ ИЛИ ВЫДЕЛЕНИЯМИ БОЛЬНЫХ ФОНЕНДОСКОП НЕОБХОДИМО ОБРАБОТАТЬ",
            "rA": [
                "протереть 6 % перекисью во¬дорода;"
            ],
            "wA": [
                "в крафт пакете;",
                "в гласперленовом стерилизаторе;",
                "раствором хлорамина;"
            ]
        },
        {
            "qID": 100,
            "qName": "ОК-1, ОПК-1, ПК-17 РАННЕЕ ВЫЯВЛЕНИЕ ЗАБОЛЕВАНИЯ В ДОКЛИНИЧЕСКОЙ СТАДИИ ПОСРЕДСТВОМ МАССОВОГО ОБСЛЕДОВАНИЯ ПРАКТИЧЕСКИ ЗДОРОВЫХ ПАЦИЕНТОВ НАЗЫВАЕТСЯ",
            "rA": [
                "скрининг"
            ],
            "wA": [
                "мониторинг",
                "первичная профилактика",
                "диспансеризация"
            ]
        }*/
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
