var tests = {
  "tests": [
    {
        "qID": 201,
        "qName": "ОК-1, ОПК-1 ПРОФИЛАКТИЧЕСКОЙ ДЕЗИНФЕКЦИЕЙ ЯВЛЯЕТСЯ",
        "rA": [
            "дезинфекция воды на водопроводной станции"
        ],
        "wA": [
            "дезинфекция в квартире, где находится больной дизентерией",
            "систематическая дезинфекция мокроты больного туберкулезом",
            "дезинфекция помещений и оборудования в инфекционном стационаре"
        ]
    },
    {
        "qID": 202,
        "qName": "ОК-1, ОПК-1, ПК-3 СТЕРИЛИЗАЦИЯ ИНСТРУМЕНТОВ В СУХОЖАРОВОМ ШКАФУ ПРОВОДИТСЯ ПРИ ТЕМПЕРАТУРЕ _____ °С _____ МИНУТ",
        "rA": [
            "180; 45"
        ],
        "wA": [
            "125; 45",
            "160; 40",
            "80; 60"
        ]
    },
    {
        "qID": 203,
        "qName": "ОК-1, ОПК-1 ИЗ МЕТОДОВ ДЕЗИНФЕКЦИИ НАИБОЛЕЕ ВЫРАЖЕННОЙ СПЕЦИФИЧНОСТЬЮ ДЕЙСТВИЯ ОБЛАДАЕТ",
        "rA": [
            "биологический"
        ],
        "wA": [
            "физический",
            "химический",
            "механический"
        ]
    },
    {
        "qID": 204,
        "qName": "ОК-1, ОПК-1, ПК-3 БОРЬБУ С ПЕРЕНОСЧИКАМИ ИНФЕКЦИОННЫХ БОЛЕЗНЕЙ ОСУЩЕСТВЛЯЮТ ПУТЕМ ПРОВЕДЕНИЯ",
        "rA": [
            "дезинсекции"
        ],
        "wA": [
            "дезинфекции",
            "санитарно-гигиенических мероприятий",
            "дератизации"
        ]
    },
    {
        "qID": 205,
        "qName": "ОК-1, ОПК-1 ИЗ ИСТРЕБИТЕЛЬНЫХ ДЕЗИНСЕКЦИОННЫХ МЕРОПРИЯТИЙ В БОРЬБЕ С ОКРЫЛЕННЫМИ СТАДИЯМИ РАЗВИТИЯ МУХ НАИБОЛЕЕ ЧАСТО ПРИМЕНЯЕТСЯ",
        "rA": [
            "механический"
        ],
        "wA": [
            "физический",
            "химический",
            "биологический"
        ]
    },
    {
        "qID": 206,
        "qName": "ОК-1, ОПК-1, ПК-3 МЕТОДОМ ХИМИЧЕСКОЙ (ХОЛОДНОЙ) СТЕРИЛИЗАЦИИ СТЕРИЛИЗУЮТ",
        "rA": [
            "зеркала, изделия из стекла"
        ],
        "wA": [
            "наконечники",
            "боры",
            "одноразовые шприцы"
        ]
    },
    {
        "qID": 207,
        "qName": "ОК-1, ОПК-1 К МЕРАМ ЛИЧНОЙ ЗАЩИТЫ ОТ КЛЕЩЕЙ ОТНОСИТСЯ ИСПОЛЬЗОВАНИЕ",
        "rA": [
            "репеллентов, защитной одежды"
        ],
        "wA": [
            "репеллентов",
            "репеллентов, защитной одежды, сетки Павловского",
            "вакцинации"
        ]
    },
    {
        "qID": 208,
        "qName": "ОК-1, ОПК-1, ПК-3 В СИСТЕМЕ ПРОТИВОЭПИДЕМИЧЕСКИХ МЕРОПРИЯТИЙ КАМЕРНАЯ ДЕЗИНФЕКЦИЯ И ДЕЗИНСЕКЦИЯ НАПРАВЛЕНЫ НА",
        "rA": [
            "пути передачи возбудителя"
        ],
        "wA": [
            "источник инфекции",
            "восприимчивый организм",
            "исполнение нормативных документов"
        ]
    },
    {
        "qID": 209,
        "qName": "ОК-1, ОПК-1, ПК-3 АВТОКЛАВИРОВАНИЕМ СТЕРИЛИЗУЮТСЯ",
        "rA": [
            "марлевые тампоны, наконечники"
        ],
        "wA": [
            "одноразовые шприцы",
            "пластмассовые шпатели",
            "слюноотсосы, зеркала"
        ]
    },
    {
        "qID": 210,
        "qName": "ОК-1, ОПК-1, ПК-3 В СИСТЕМЕ ПРОТИВОЭПИДЕМИЧЕСКИХ МЕРОПРИЯТИЙ ДЕЗИНСЕКЦИЯ НАПРАВЛЕНА НА",
        "rA": [
            "пути передачи возбудителя"
        ],
        "wA": [
            "источник инфекции",
            "восприимчивый организм",
            "обеспечение безопасности"
        ]
    },
    {
        "qID": 211,
        "qName": "ОК-1, ОПК-1, ПК-3 В СИСТЕМЕ ПРОТИВОЭПИДЕМИЧЕСКИХ МЕРОПРИЯТИЙ ДЕРАТИЗАЦИЯ НАПРАВЛЕНА НА",
        "rA": [
            "источник инфекции"
        ],
        "wA": [
            "пути передачи возбудителя",
            "восприимчивый организм",
            "обеспечение безопасности"
        ]
    },
    {
        "qID": 212,
        "qName": "ОК-1, ОПК-1 ЦЕЛЬЮ ИСПОЛЬЗОВАНИЯ АППАРАТА «АССИСТИНА» ЯВЛЯЕТСЯ",
        "rA": [
            "предстерилизационная очистка и смазывание наконечников"
        ],
        "wA": [
            "стерилизация наконечников",
            "дезинфекция боров",
            "дезинфекция эндодонтического инструментария"
        ]
    },
    {
        "qID": 213,
        "qName": "ОК-1, ОПК-1, ПК-3 СРЕДСТВОМ, ИСПОЛЬЗУЕМЫМ ДЛЯ ХОЛОДНОЙ СТЕРИЛИЗАЦИИ СТОМАТОЛОГИЧЕСКИХ ЗЕРКАЛ, ЯВЛЯЕТСЯ",
        "rA": [
            "6% раствор перекиси водорода"
        ],
        "wA": [
            "1% раствор перекиси водорода",
            "0,5% раствор хлорамина",
            "75% метиловый спирт"
        ]
    },
    {
        "qID": 214,
        "qName": "ОК-1, ОПК-1, ПК-3 БОРЬБУ С КРОВОСОСУЩИМИ ЧЛЕНИСТОНОГИМИ ОСУЩЕСТВЛЯЮТ ПУТЕМ ПРОВЕДЕНИЯ",
        "rA": [
            "дезинсекции"
        ],
        "wA": [
            "дезинфекции",
            "санитарно-гигиенических мероприятий",
            "дератизации"
        ]
    },
    {
        "qID": 215,
        "qName": "ОК-1, ОПК-1 С ПОМОЩЬЮ АМИДОПИРИНОВОЙ ПРОБЫ ОПРЕДЕЛЯЮТ",
        "rA": [
            "остатки крови на инструментах"
        ],
        "wA": [
            "остатки моющих средств",
            "стерильность инструментов",
            "наличие жира"
        ]
    },
    {
        "qID": 216,
        "qName": "ОК-1, ОПК-1, ПК-3 СТОМАТОЛОГИЧЕСКИЕ ЗЕРКАЛА СТЕРИЛИЗУЮТСЯ МЕТОДОМ ХИМИЧЕСКОЙ СТЕРИЛИЗАЦИИ ПО ВРЕМЕНИ (ЧАС)",
        "rA": [
            "1-2"
        ],
        "wA": [
            "2-3",
            "3",
            "4-5"
        ]
    },
    {
        "qID": 217,
        "qName": "ОК-1, ОПК-1, ПК-3 ПРОЦЕСС УНИЧТОЖЕНИЯ БОЛЬШИНСТВА ПАТОГЕННЫХ МИКРООРГАНИЗМОВ  ЗА ИСКЛЮЧЕНИЕМ БАКТЕРИАЛЬНЫХ СПОР – ЭТО",
        "rA": [
            "дезинфекция"
        ],
        "wA": [
            "стерилизация",
            "предстерилизационная очистка",
            "дезинсекция"
        ]
    },
    {
        "qID": 218,
        "qName": "ОК-1, ОПК-1, ПК-3 ИЗДЕЛИЯ, НЕ ИМЕЮЩИЕ КОНТАКТА С РАНЕВОЙ ПОВЕРХНОСТЬЮ, КРОВЬЮ ИЛИ ИНЪЕКЦИОННЫМИ ПРЕПАРАТАМИ ПОДВЕРГАЮТСЯ",
        "rA": [
            "дезинфекции"
        ],
        "wA": [
            "стерилизации",
            "дезинфекции и стерилизации",
            "камерной дезинфекции"
        ]
    },
    {
        "qID": 219,
        "qName": "ОК-1, ОПК-1, ПК-3 СПИРТЫ НЕ РЕКОМЕНДУЕТСЯ ПРИМЕНЯТЬ ДЛЯ СТЕРИЛИЗАЦИИ МЕДИЦИНСКИХ И ХИРУРГИЧЕСКИХ МАТЕРИАЛОВ, ПОТОМУ ЧТО ОНИ НЕ ОБЛАДАЮТ ДЕЙСТВИЕМ",
        "rA": [
            "спороцидным"
        ],
        "wA": [
            "бактерицидным",
            "вирулицидным",
            "овоцидным"
        ]
    },
    {
        "qID": 220,
        "qName": "ОК-1, ОПК-1, ПК-3 СТЕРИЛЬНОСТЬ ОТКРЫТОГО БИКСА БЕЗ ФИЛЬТРА СОХРАНЯЕТСЯ (В ЧАСАХ)",
        "rA": [
            "6"
        ],
        "wA": [
            "24",
            "72",
            "12"
        ]
    },
    {
        "qID": 221,
        "qName": "ОК-1, ОПК-1 СТЕРИЛЬНОСТЬ ЗАКРЫТОГО БИКСА БЕЗ ФИЛЬТРА СОХРАНЯЕТСЯ (В ЧАСАХ)",
        "rA": [
            "72"
        ],
        "wA": [
            "6",
            "24",
            "12"
        ]
    },
    {
        "qID": 222,
        "qName": "ОК-1, ОПК-1 СТЕРИЛЬНОСТЬ ОТКРЫТОГО БИКСА С ФИЛЬТРОМ СОХРАНЯЕТСЯ",
        "rA": [
            "6 часов;"
        ],
        "wA": [
            "1 сутки;",
            "3 суток",
            "12 часов"
        ]
    },
    {
        "qID": 223,
        "qName": "ОК-1, ОПК-1 СТЕРИЛЬНОСТЬ ЗАКРЫТОГО БИКСА С ФИЛЬТРОМ СОХРАНЯЕТСЯ (В СУТКАХ)",
        "rA": [
            "20"
        ],
        "wA": [
            "1",
            "3",
            "12"
        ]
    },
    {
        "qID": 224,
        "qName": "ОК-1, ОПК-1 НАИБОЛЕЕ ЧАСО ПРИМЕНЯЕМЫЙ  МЕТОД СТЕРИЛИЗАЦИИ",
        "rA": [
            "физический"
        ],
        "wA": [
            "механический",
            "химический",
            "биологический"
        ]
    },
    {
        "qID": 225,
        "qName": "ОК-1, ОПК-1, ПК-3 ГЛАВНОЕ ОТЛИЧИЕ ДЕЗИНФЕКЦИИ И СТЕРИЛИЗАЦИИ",
        "rA": [
            "степень деконтаминации"
        ],
        "wA": [
            "область применения",
            "методы проведения",
            "стоимость"
        ]
    },
    {
        "qID": 226,
        "qName": "ОК-1, ОПК-1 ГЛАВНОЕ ОТЛИЧИЕ ДЕЗИНФЕКЦИИ И АНТИСЕПТИКИ",
        "rA": [
            "область применения"
        ],
        "wA": [
            "методы проведения",
            "степень деконтаминации",
            "стоимость"
        ]
    },
    {
        "qID": 227,
        "qName": "ОК-1, ОПК-1 ПРОЦЕСС УНИЧТОЖЕНИЯ ВСЕХ ФОРМ МИКРОБНОЙ ЖИЗНИ, ВКЛЮЧАЯ БАКТЕРИИ, ВИРУСЫ, СПОРЫ И ГРИБЫ – ЭТО",
        "rA": [
            "стерилизация"
        ],
        "wA": [
            "дезинфекция",
            "предстерилизационная очистка",
            "дератизация"
        ]
    },
    {
        "qID": 228,
        "qName": "ОК-1, ОПК-1 ПРОВЕРКА КАЧЕСТВА ПРЕДСТЕРИЛИЗАЦИОННОЙ ОЧИСТКИ ИНСТРУМЕНТОВ ПРОВОДИТСЯ ПУТЕМ ПОСТАНОВКИ ПРОБ  НА",
        "rA": [
            "кровь и полноту отмыва изделий от щелочных компонентов моющих средств"
        ],
        "wA": [
            "наличие остатков крови",
            "полноту отмыва изделий от щелочных компонентов моющих средств",
            "остатки лекарственных веществ"
        ]
    },
    {
        "qID": 229,
        "qName": "ОК-1, ОПК-1 ПРОВЕРКА КАЧЕСТВА ПРЕДСТЕРИЛИЗАЦИОННОЙ ОЧИСТКИ ИНСТРУМЕНТОВ НА НАЛИЧИЕ ОСТАТКОВ КРОВИ ПРОВОДИТСЯ ПУТЕМ ПОСТАНОВКИ ПРОБЫ",
        "rA": [
            "азопирамовой"
        ],
        "wA": [
            "амидопириновой",
            "фенолфталеиновой",
            "йод-крахмальной"
        ]
    },
    {
        "qID": 230,
        "qName": "ОК-1, ОПК-1 ДЛЯ ОБРАБОТКИ  ЗУБНЫХ, ГОРТАННЫХ, НОСОГЛОТОЧНЫХ  ЗЕРКАЛ  ИСПОЛЬЗУЕТСЯ",
        "rA": [
            "погружение в раствор перекиси водорода (3% с последующим промыванием водой)"
        ],
        "wA": [
            "автоклавирование",
            "кипячение",
            "протирание"
        ]
    },
    {
        "qID": 231,
        "qName": "ОК-1, ОПК-1 СТЕРИЛИЗАЦИЯ ПЕРЕВЯЗОЧНОГО МАТЕРИАЛА ПРОИЗВОДИТСЯ МЕТОДОМ",
        "rA": [
            "паровым"
        ],
        "wA": [
            "химическим",
            "паровоздушным",
            "пароформалиновым"
        ]
    },
    {
        "qID": 232,
        "qName": "ОК-1, ОПК-1 ПРОВЕРКА КАЧЕСТВА ПРЕДСТЕРИЛИЗАЦИОННОЙ ОЧИСТКИ  ИНСТРУМЕНТОВ  НА ПОЛНОТУ ОТМЫВА ИЗДЕЛИЙ ОТ ЩЕЛОЧНЫХ КОМПОНЕНТОВ МОЮЩИХ СРЕДСТВ ПРОВОДИТСЯ ПУТЕМ  ПОСТАНОВКИ  ПРОБЫ",
        "rA": [
            "фенолфталеиновой"
        ],
        "wA": [
            "азопирамовой",
            "амидопириновой",
            "йод-крахмальной."
        ]
    },
    {
        "qID": 233,
        "qName": "ОК-1, ОПК-1 ПРИ ПОЛОЖИТЕЛЬНОЙ АЗОПИРАМОВОЙ ПРОБЕ ПАРТИЯ ИЗДЕЛИЙ ПОДЛЕЖИТ",
        "rA": [
            "повторной предстерилизационной обработке"
        ],
        "wA": [
            "повторной дезинфекции",
            "повторной дезинфекции и предстерилизационной обработке",
            "стерилизации"
        ]
    },
    {
        "qID": 234,
        "qName": "ОК-1, ОПК-1 ТЕСТЫ ДЛЯ КОНТРОЛЯ  РЕЖИМА СТЕРИЛИЗАЦИИ БЫВАЮТ",
        "rA": [
            "физические, химические"
        ],
        "wA": [
            "механические",
            "химические, электронные",
            "электронные."
        ]
    },
    {
        "qID": 235,
        "qName": "ОК-1, ОПК-1 СТЕРИЛИЗАЦИЯ ПРОВОДИТСЯ, В ЗАВИСИМОСТИ ОТ ОСОБЕННОСТЕЙ СТЕРИЛИЗУЕМОГО ИЗДЕЛИЯ, МЕТОДАМИ",
        "rA": [
            "воздушным, паровым, химическим"
        ],
        "wA": [
            "воздушным, химическим",
            "паровым, химическим",
            "механическим, химическим"
        ]
    },
    {
        "qID": 236,
        "qName": "ОК-1, ОПК-1 УНИВЕРСАЛЬНЫМ АНТИМИКРОБНЫМ ДЕЙСТВИЕМ ОБЛАДАЮТ",
        "rA": [
            "альдегидсодержащие препараты"
        ],
        "wA": [
            "четвертичные аммониевые соединения",
            "амфотензиды",
            "спирты"
        ]
    },
    {
        "qID": 237,
        "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ДЛЯ ДЕЗИНФЕКЦИИ И СТЕРИЛИЗАЦИИ ПРЕДМЕТОВ МЕДИЦИНСКОГО НАЗНАЧЕНИЯ МОЖНО ИСПОЛЬЗОВАТЬ",
        "rA": [
            "глутаровый альдегид"
        ],
        "wA": [
            "амфолан",
            "гипохлорит лития",
            "хлорамин"
        ]
    },
    {
        "qID": 238,
        "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ОБРАБОТКИ  ПАЛАТ В ПРИСУТСТВИИ БОЛЬНЫХ В  МО СЛЕДУЕТ ИСПОЛЬЗОВАТЬ ПРЕПАРАТЫ, СОДЕРЖАЩИЕ",
        "rA": [
            "ЧАС"
        ],
        "wA": [
            "хлор",
            "альдегиды",
            "спирты"
        ]
    },
    {
        "qID": 239,
        "qName": "ОК-1, ОПК-1 РЕЗУЛЬТАТ АЗОПИРАМОВОЙ ПРОБЫ УЧИТЫВАЕТСЯ ЧЕРЕЗ",
        "rA": [
            "1 минуту"
        ],
        "wA": [
            "5 минут",
            "1 час",
            "6 часов"
        ]
    },
    {
        "qID": 240,
        "qName": "ОК-1, ОПК-1 ОЦЕНКА АЗОПИРАМОВОЙ ПРОБЫ: ФИОЛЕТОВОЕ, СИНЕЕ ИЛИ РОЗОВО-СИРЕНЕВОЕ  ОКРАШИВАНИЕ  ОЗНАЧАЕТ НАЛИЧИЕ НА ИНСТРУМЕНТАХ",
        "rA": [
            "ржавчины или следов крови"
        ],
        "wA": [
            "остатков щелочи от моющего раствора или следов крови",
            "остатков хлорсодержащих или следов крови",
            "остатков хлорсодержащих средств или ржавчины"
        ]
    },
    {
        "qID": 241,
        "qName": "ОК-1, ОПК-1 ФЕНОЛФТАЛЕИНОВАЯ ПРОБА ИСПОЛЬЗУЕТСЯ ДЛЯ ОПРЕДЕЛЕНИЯ НА ИНСТРУМЕНТАРИИ НАЛИЧИЯ",
        "rA": [
            "не отмытых компонентов моющих средств"
        ],
        "wA": [
            "следов крови",
            "ржавчины",
            "остатков хлорсодержащих дезинфицирующих средств"
        ]
    },
    {
        "qID": 242,
        "qName": "ОК-1, ОПК-1 ОЦЕНКА РЕЗУЛЬТАТОВ ФЕНОЛФТАЛЕИНОВОЙ ПРОБЫ: РЕЗУЛЬТАТ СЧИТАЕТСЯ ПОЛОЖИТЕЛЬНЫМ, ЕСЛИ ПОЯВЛЯЕТСЯ ОКРАШИВАНИЕ",
        "rA": [
            "розовое"
        ],
        "wA": [
            "сиреневое",
            "бурое",
            "сине-зеленое",
            "желтое"
        ]
    },
    {
        "qID": 243,
        "qName": "ОК-1, ОПК-1 ПРИ ПОЛОЖИТЕЛЬНОЙ ФЕНОЛФТАЛЕИНОВОЙ ПРОБЕ ПАРТИЯ ИЗДЕЛИЙ МЕДИЦИНСКОГО НАЗНАЧЕНИЯ ПОДЛЕЖИТ",
        "rA": [
            "повторной  отмывке дистилированной водой или водопроводной"
        ],
        "wA": [
            "повторной дезинфекции и предстерилизационной обработке",
            "повторной предстерилизационной обработке",
            "стерилизации"
        ]
    },
    {
        "qID": 244,
        "qName": "ОК-1, ОПК-1 ВОЗДУШНЫМ МЕТОДОМ СТЕРИЛИЗАЦИИ ОБРАБАТЫВАЮТ ИЗДЕЛИЯ",
        "rA": [
            "изделия из металла, стекла и силиконовой резины"
        ],
        "wA": [
            "изделия из металла, стекла, текстильных материалов",
            "резиновые перчатки, изделия из резины и полимерных материалов",
            "каучука"
        ]
    },
    {
        "qID": 245,
        "qName": "ОК-1, ОПК-1 ВЫГРУЗКУ СТЕРИЛЬНОГО ИНСТРУМЕНТАРИЯ  ИЗ СУХОЖАРОВОГО ШКАФА ПРОИЗВОДИТСЯ  ПРИ ТЕМПЕРАТУРЕ",
        "rA": [
            "40-500 С"
        ],
        "wA": [
            "80-1000 С",
            "160-1800 С",
            "140-1600  C"
        ]
    },
    {
        "qID": 246,
        "qName": "ОК-1, ОПК-1 ПРИ ВСКРЫТИИ УПАКОВКИ С ИНСТРУМЕНТАМИ  ЛЮБОГО ВИДА – ИСПОЛЬЗОВАТЬ ЕЕ СОДЕРЖИМОЕ В ТЕЧЕНИЕ",
        "rA": [
            "6 суток;"
        ],
        "wA": [
            "24 часов;",
            "12 часов",
            "1 месяца"
        ]
    },
    {
        "qID": 247,
        "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРОФИЛАКТИЧЕСКИЕ  ПРИВИВКИ  ВОЗДЕЙСТВУЮТ  НА______  ЗВЕНО ЭПИДЕМИЧЕСКОГО ПРОЦЕССА",
        "rA": [
            "третье"
        ],
        "wA": [
            "первое",
            "второе",
            "оперативное"
        ]
    },
    {
        "qID": 248,
        "qName": "ОК-1, ОПК-1 ПРИ ПЕРВИЧНОМ ИММУННОМ  ОТВЕТЕ   ВЫРАБАТЫВАЮТСЯ В ОРГАНИЗМЕ",
        "rA": [
            "Ig M, затем Ig G;"
        ],
        "wA": [
            "только Ig M;",
            "только Ig G;",
            "Ig G, затем Ig M."
        ]
    },
    {
        "qID": 249,
        "qName": "ОК-1, ОПК-1 ПРОВЕСТИ ПРИВИВКУ РЕБЕНКУ ВАКЦИНОЙ, ПРИВЕЗЕННОЙ ИЗ-ЗА РУБЕЖА, ЕСЛИ НАСТАВЛЕНИЕ К ВАКЦИНЕ ОТСУТСТВУЕТ",
        "rA": [
            "нельзя"
        ],
        "wA": [
            "можно, предварительно изучив характеристику вакцину по этикетке",
            "можно, если вакцина  зарегистрирована  в РФ",
            "можно по согласованию с противоэпидемической службой"
        ]
    },
    {
        "qID": 250,
        "qName": "ОК-1, ОПК-1 В СЛУЧАЕ ЭКСТРЕННОЙ НЕОБХОДИМОСТИ ОДНОВРЕМЕННО С АНТИРАБИЧЕСКОЙ ВАКЦИНОЙ МОЖЕТ БЫТЬ ПРОВЕДЕНА ПРОФИЛАКТИКА",
        "rA": [
            "столбняка"
        ],
        "wA": [
            "кори",
            "дифтерии",
            "гепатита В"
        ]
    },
    {
        "qID": 251,
        "qName": "ОК-1, ОПК-1 ЕСТЕСТВЕННЫЙ ПРОТИВОТУБЕРКУЛЕЗНЫЙ ИММУНИТЕТ ВЫРАБАТЫВАЕТСЯ В РЕЗУЛЬТАТЕ",
        "rA": [
            "инфицирования микобактериями туберкулеза"
        ],
        "wA": [
            "вакцинации  БЦЖ",
            "ревакцинации БЦЖ",
            "введения туберкулина"
        ]
    },
    {
        "qID": 252,
        "qName": "ОК-1, ОПК-1 ПОВЕРХНОСТЬ СТОМАТОЛОГИЧЕСКОЙ УСТАНОВКИ ОБРАБАТЫВАЕТСЯ ДЕЗИНФИЦИРУЮЩИМ РАСТВОРОМ",
        "rA": [
            "после приёма каждого пациента"
        ],
        "wA": [
            "1 раз в день",
            "2 раза в день",
            "3 раза в день"
        ]
    },
    {
        "qID": 253,
        "qName": "ОК-1, ОПК-1, ПК-3 КВАРЦЕВАНИЕ СТОМАТОЛОГИЧЕСКОГО КАБИНЕТА СЛЕДУЕТ ПРОВОДИТЬ В ДЕНЬ (КОЛИЧЕСТВО РАЗ)",
        "rA": [
            "3"
        ],
        "wA": [
            "1",
            "2",
            "4"
        ]
    },
    {
        "qID": 254,
        "qName": "ОК-1, ОПК-1 ХРОНИЧЕСКИЕ ЗАБОЛЕВАНИЯ СЕРДЦА, ЛЕГКИХ, ПОЧЕК, ПЕЧЕНИ В СТАДИИ ОБОСТРЕНИЯ, ЛЕЧЕНИЕ СТЕРОИДАМИ ЯВЛЯЮТСЯ ПРОТИВОПОКАЗАНИЯМИ К ВАКЦИНАЦИИ",
        "rA": [
            "временными"
        ],
        "wA": [
            "постоянными",
            "ложными",
            "необходимыми"
        ]
    },
    {
        "qID": 255,
        "qName": "ОК-1, ОПК-1 АНАМНЕСТИЧЕСКИЕ УКАЗАНИЯ НА НАЛИЧИЕ У РОДСТВЕННИКОВ АЛЛЕРГИИ, ЭПИЛЕПСИИ, ОСЛОЖНЕНИЙ ВАКЦИНАЦИИ ЯВЛЯЮТСЯ ПРОТИВОПОКАЗАНИЯМИ К ВАКЦИНАЦИИ",
        "rA": [
            "ложными"
        ],
        "wA": [
            "временными",
            "постоянными",
            "необходимыми"
        ]
    },
    {
        "qID": 256,
        "qName": "ОК-1, ОПК-1 ВВЕДЕНИЕ В ОРГАНИЗМ ЧЕЛОВЕКА МЕДИЦИНСКИХ ИММУНОБИОЛОГИЧЕСКИХ   ПРЕПАРАТОВ ДЛЯ СОЗДАНИЯ СПЕЦИФИЧЕСКОЙ НЕВОСПРИИМЧИВОСТИ К ИНФЕКЦИОННЫМ БОЛЕЗНЯМ – ЭТО",
        "rA": [
            "профилактические прививки"
        ],
        "wA": [
            "иммунопрофилактика инфекционных болезней",
            "национальный календарь прививок",
            "медицинские иммунобиологические препараты"
        ]
    },
    {
        "qID": 257,
        "qName": "ОК-1, ОПК-1 НАЦИОНАЛЬНЫЙ КАЛЕНДАРЬ ПРОФИЛАКТИЧЕСКИХ ПРИВИВОК НЕ ВКЛЮЧАЕТ В ОБЯЗАТЕЛЬНЫЙ ПЕРЕЧЕНЬ  ПРОФИЛАКТИЧЕСКИЕ ПРИВИВКИ ПРОТИВ",
        "rA": [
            "менингококковой инфекции"
        ],
        "wA": [
            "гепатита В;",
            "кори;",
            "коклюша;"
        ]
    },
    {
        "qID": 258,
        "qName": "ОК-1, ОПК-1 НОРМАТИВНЫЙ ПРАВОВОЙ АКТ, УСТАНАВЛИВАЮЩИЙ ПОРЯДОК ПРОВЕДЕНИЯ ГРАЖДАНАМ ПРОФИЛАКТИЧЕСКИХ ПРИВИВОК – ЭТО",
        "rA": [
            "закон об иммунопрофилактике инфекционных заболеваний"
        ],
        "wA": [
            "профилактические прививки",
            "прививки по эпидемическим показаниям",
            "перечень препаратов"
        ]
    },
    {
        "qID": 259,
        "qName": "ОК-1, ОПК-1 АЗОПИРАМОВАЯ ПРОБА ПРОВОДИТСЯ ПОСЛЕ",
        "rA": [
            "предстерилизационной очистки"
        ],
        "wA": [
            "дезинфекции",
            "стерилизации",
            "каждого этапа дезинфекции"
        ]
    },
    {
        "qID": 260,
        "qName": "ОК-1, ОПК-1 ПК-3  ДОКУМЕНТ ИНДИВИДУАЛЬНОГО УЧЕТА, В КОТОРОМ РЕГИСТРИРУЮТСЯ  ВСЕ  ПОЛУЧЕННЫЕ ПРОФИЛАКТИЧЕСКИЕ  ПРИВИВКИ – ЭТО",
        "rA": [
            "сертификат профилактических прививок"
        ],
        "wA": [
            "карта профилактических прививок",
            "история болезни",
            "страховой полис"
        ]
    },
    {
        "qID": 261,
        "qName": "ОК-1, ОПК-1 ДЛЯ ОЦЕНКИ КАЧЕСТВА ПРЕДСТЕРИЛИЗАЦИОННОЙ ОБРАБОТКИ ИНСТРУМЕНТОВ НА НАЛИЧИЕ КРОВИ И БЕЛКОВЫХ ЗАГРЯЗНЕНИЙ ИСПОЛЬЗУЕТСЯ ПРОБА",
        "rA": [
            "амидопириновая"
        ],
        "wA": [
            "йодиноловая",
            "бензидиновая",
            "фенолфталеиновая"
        ]
    },
    {
        "qID": 262,
        "qName": "ОК-1, ОПК-1 ПОСЛЕ ИСПОЛЬЗОВАНИЯ СЛЮНООТСОСЫ",
        "rA": [
            "утилизируют"
        ],
        "wA": [
            "дезинфицируют",
            "стерилизуют",
            "промывают"
        ]
    },
    {
        "qID": 263,
        "qName": "ОК-1, ОПК-1 В ПРИРОДНЫХ ОЧАГАХ КЛЕЩЕВОГО ЭНЦЕФАЛИТА, ПОСЛЕ УДАЛЕНИЯ ПРИСОСАВШИХСЯ ИКСОДОВЫХ КЛЕЩЕЙ ПОСТРАДАВШИМ С ЦЕЛЬЮ ЭКСТРЕННОЙ ПРОФИЛАКТИКИ СЛЕДУЕТ ВВЕСТИ",
        "rA": [
            "специфический иммуноглобулин"
        ],
        "wA": [
            "вакцину",
            "сыворотку",
            "антибиотики"
        ]
    },
    {
        "qID": 264,
        "qName": "ОК-1, ОПК-1 РЕКОМЕНДУЕМЫЙ  МАКСИМАЛЬНЫЙ  СРОК  ХРАНЕНИЯ ВАКЦИН В ПОЛИКЛИНИКЕ",
        "rA": [
            "1 мес."
        ],
        "wA": [
            "до следующей поставки",
            "3 мес.",
            "6 мес."
        ]
    },
    {
        "qID": 265,
        "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ЗАБОЛЕВАЕМОСТЬЮ КАРИЕСОМ НАЗЫВАЮТ",
        "rA": [
            "число впервые выявленных случаев заболевания за определённый промежуток времени"
        ],
        "wA": [
            "число людей, имеющих заболевание на момент обследования",
            "число кариозных, запломбированных и удалённых зубов у одного обследуемого",
            "среднее количество кариозных, удалённых и запломбированных зубов в группе населения"
        ]
    },
    {
        "qID": 266,
        "qName": "ОК-1, ОПК-1 ПРИЧИНОЙ ВОЗНИКНОВЕНИЯ ПОСТИНЪЕКЦИОННОГО АБСЦЕССА ЯВЛЯЕТСЯ",
        "rA": [
            "несоблюдение правил асептики и антисептики во время анестезии"
        ],
        "wA": [
            "высокая доза сосудосуживающего препарата в карпуле",
            "наличие метилпарабена в карпуле местного анестетика",
            "непереносимость местного анестетика"
        ]
    },
    {
        "qID": 267,
        "qName": "ОК-1, ОПК-1,  ПК-17 ПОКАЗАТЕЛЬ ОБЩЕЙ ЗАБОЛЕВАЕМОСТИ ХАРАКТЕРИЗУЕТ",
        "rA": [
            "распространённость заболеваний среди населения"
        ],
        "wA": [
            "изменения распространённости заболеваний во времени",
            "удельный вес конкретного заболевания",
            "распространённость социально-значимых заболеваний"
        ]
    },
    {
        "qID": 268,
        "qName": "ОК-1, ОПК-1, ПК-3  НАИБОЛЕЕ ЭФФЕКТИВНОЕ СРЕДСТВО ПРОФИЛАКТИКИ ГРИППА В ПРЕДЭПИДЕМИЧЕСКИЙ  ПЕРИОД",
        "rA": [
            "гриппозная вакцина"
        ],
        "wA": [
            "человеческий лейкоцитарный интерферон",
            "ремантадин",
            "иммуноглобулин"
        ]
    },
    {
        "qID": 269,
        "qName": "ОК-1, ОПК-1, ПК-17 ЦЕЛЬЮ ЭПИДЕМИОЛОГИЧЕСКИХ ИССЛЕДОВАНИЙ ЯВЛЯЕТСЯ",
        "rA": [
            "разработка мер профилактики и оценка их эффективности"
        ],
        "wA": [
            "изучение распространения заболеваний по группам населения",
            "реформирование системы здравоохранения",
            "анализ демографических показателей"
        ]
    },
    {
        "qID": 270,
        "qName": "ОК-1, ОПК-1, ПК-3 ЛИЦАМ, КОТОРЫЕ  КОНТАКТИРУЮТ С БОЛЬШИМ ЧИСЛОМ ЛЮДЕЙ (ВРАЧИ, ПРОДАВЦЫ, ПЕДАГОГИ И Т. П.), А ТАК ЖЕ ЛЮДЯМ СТАРШЕ 65 ЛЕТ И ЛИЦАМ, СТРАДАЮЩИМ ХРОНИЧЕСКИМИ ЗАБОЛЕВАНИЯМИ СЕРДЕЧНО-СОСУДИСТОЙ СИСТЕМЫ И ЛЕГКИХ, ПОКАЗАНЫ, ПРЕЖДЕ ВСЕГО, ПРИВИВКИ ПРОТИВ",
        "rA": [
            "гриппа"
        ],
        "wA": [
            "дифтерии",
            "туберкулеза",
            "кори"
        ]
    },
    {
        "qID": 271,
        "qName": "ОК-1, ОПК-1,  ПК-17 УСТРАНЕНИЕ ФАКТОРОВ РИСКА И ПРИЧИН ЯВЛЯЕТСЯ ОСНОВНЫМ МЕРОПРИЯТИЕМ",
        "rA": [
            "первичной профилактики стоматологических заболеваний"
        ],
        "wA": [
            "вторичной профилактики стоматологических заболеваний",
            "третичной профилактики стоматологических заболеваний",
            "эпидемиологического обследования населения"
        ]
    },
    {
        "qID": 272,
        "qName": "ОК-1, ОПК-1,  ПК-17 ЭПИДЕМИОЛОГИЧЕСКОЕ СТОМАТОЛОГИЧЕСКОЕ ОБСЛЕДОВАНИЕ НАСЕЛЕНИЯ ПРОВОДЯТ",
        "rA": [
            "врачи-стоматологи"
        ],
        "wA": [
            "гигиенисты",
            "стоматологические медицинские сестры",
            "санитарные врачи"
        ]
    },
    {
        "qID": 273,
        "qName": "ОК-1, ОПК-1, ПК-3 ОБЯЗАТЕЛЬНОСТЬ ПЛАНОВЫХ ПРИВИВОК ПРОТИВ ИНФЕКЦИОННЫХ ЗАБОЛЕВАНИЙ ОПРЕДЕЛЯЕТСЯ",
        "rA": [
            "Законом РФ об иммунопрофилактике инфекционных заболеваний"
        ],
        "wA": [
            "календарем прививок",
            "Приказом Минздрава РФ",
            "Указанием противоэпидемической службы"
        ]
    },
    {
        "qID": 274,
        "qName": "ОК-1, ОПК-1 КРИТЕРИЕМ ОБЪЕКТИВНОЙ ОЦЕНКИ КАЧЕСТВА ИММУНОПРОФИЛАКТИКИ ЯВЛЯЕТСЯ",
        "rA": [
            "результаты серологического мониторинга"
        ],
        "wA": [
            "полнота охвата прививками",
            "снижение заболеваемости",
            "результаты аллергических проб"
        ]
    },
    {
        "qID": 275,
        "qName": "ОК-1, ОПК-1, ПК-3 ГРАЖДАНИН РФ, СОГЛАСНО 157-ФЗ «ОБ ИММУНОПРОФИЛАКТИКЕ ИНФЕКЦИОННЫХ БОЛЕЗНЕЙ» ИМЕЕТ ПРАВО…",
        "rA": [
            "отказаться от прививок за исключением прививок против инфекционных заболеваний, проводимых по эпидемическим показаниям"
        ],
        "wA": [
            "отказаться от прививок, не подписывая отказа от прививок",
            "отказаться от прививок, подписав отказ",
            "не имеет права отказаться от прививок"
        ]
    },
    {
        "qID": 276,
        "qName": "ОК-1, ОПК-1,  ПК-17 КРИТЕРИЕМ ОЦЕНКИ САНИТАРНОГО СОСТОЯНИЯ СТЕРИЛИЗАЦИОННОЙ В ПОЛИКЛИНИКЕ ЯВЛЯЕТСЯ",
        "rA": [
            "бактериологический контроль"
        ],
        "wA": [
            "данные учёта журнала стерилизации",
            "данные визуального контроля стерилизационной",
            "определение концентрации дезинфицирующих растворов"
        ]
    },
    {
        "qID": 277,
        "qName": "ОК-1, ОПК-1,  ПК-17 КРИТЕРИЕМ ОЦЕНКИ САНИТАРНОГО СОСТОЯНИЯ ХИРУРГИЧЕСКОГО КАБИНЕТА ЯВЛЯЕТСЯ",
        "rA": [
            "бактериологический контроль"
        ],
        "wA": [
            "регулярность генеральных уборок",
            "контроль за санитарным состоянием старшей медицинской сестрой",
            "регулярность влажных уборок"
        ]
    },
    {
        "qID": 278,
        "qName": "ОК-1, ОПК-1 НЕОБХОДИМОСТЬ ПЛАНОВЫХ ПРИВИВОК ПРОТИВ СТОЛБНЯКА ВЫЗВАНА, ПРЕЖДЕ ВСЕГО",
        "rA": [
            "высокой летальностью"
        ],
        "wA": [
            "высокой заболеваемостью",
            "высокой смертностью",
            "большими экономическими потерями"
        ]
    },
    {
        "qID": 279,
        "qName": "ОК-1, ОПК-1 КАЖДЫЙ СЛУЧАЙ ПОСТВАКЦИНАЛЬНОГО ОСЛОЖНЕНИЯ",
        "rA": [
            "подлежит расследованию в обязательном порядке комиссионно"
        ],
        "wA": [
            "подлежит расследованию в обязательном порядке главным врачом поликлиники",
            "подлежит расследованию в обязательном порядке врачом эпидемиологом",
            "расследованию не подлежит"
        ]
    },
    {
        "qID": 280,
        "qName": "ОК-1, ОПК-1,  ПК-17 ДЛЯ ОБРАБОТКИ РУК МЕДИЦИНСКОГО ПЕРСОНАЛА ПРИМЕНЯЕТСЯ РАСТВОР",
        "rA": [
            "0,5% Хлоргексидина биглюконата в 70% этиловом спирте"
        ],
        "wA": [
            "3% Перекиси водорода",
            "Перманганата калия в разведении 1:10 000",
            "Фурацилина в разведении 1:5 000"
        ]
    },
    {
        "qID": 281,
        "qName": "ОК-1, ОПК-1, ПК-17 СПЕЦИФИЧНОСТЬ ДИАГНОСТИЧЕСКОГО ТЕСТА – ЭТО",
        "rA": [
            "вероятность отрицательного результата  теста при отсутствии болезни"
        ],
        "wA": [
            "вероятность положительного результата  теста при наличии болезни",
            "прогностичность положительного результата",
            "прогностичность отрицательного результата"
        ]
    },
    {
        "qID": 282,
        "qName": "ОК-1, ОПК-1  ПОСЛЕ ИСПОЛЬЗОВАНИЯ БОРЫ ПОМЕЩАЮТ В",
        "rA": [
            "дезинфицирующий раствор"
        ],
        "wA": [
            "сухожаровой шкаф",
            "гласперленовый стерилизатор",
            "«Терминатор»"
        ]
    },
    {
        "qID": 283,
        "qName": "ОК-1, ОПК-1,  ПК-17 РАНДОМИЗИРОВАННЫЕ  КОНТРОЛИРУЕМЫЕ ИСПЫТАНИЯ – ЭТО ЭКСПЕРИМЕНТАЛЬНЫЕ ИССЛЕДОВАНИЯ,  В КОТОРЫХ",
        "rA": [
            "участники распределены на опытную и контрольную группы случайным образом"
        ],
        "wA": [
            "распределяют пациентов по подгруппам с одинаковым прогнозом",
            "выделяют опытную и контрольную группы в зависимости от  факторов риска",
            "проводят эксперемент"
        ]
    },
    {
        "qID": 284,
        "qName": "ОК-1, ОПК-1,  ПК-17 ВАЛИДНОСТЬ ПОЛУЧЕННОЙ ИНФОРМАЦИИ О РЕЗУЛЬТАТАХ ИССЛЕДОВАНИЙ – ЭТО",
        "rA": [
            "достоверность результатов"
        ],
        "wA": [
            "обоснованность результатов",
            "проверка результатов",
            "сопоставимость результатов"
        ]
    },
    {
        "qID": 285,
        "qName": "ОК-1, ОПК-1,  ПК-17 МЕТА-АНАЛИЗ – ЭТО",
        "rA": [
            "количественный анализ объединенных результатов нескольких РКИ"
        ],
        "wA": [
            "совокупность статистических методов",
            "совокупность статистических методов рассматривающих одну переменную",
            "РКИ проведенные в ВОЗ"
        ]
    },
    {
        "qID": 286,
        "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ФАКТОР РИСКА – ЭТО",
        "rA": [
            "воздействие, приводящее к увеличению риска возникновения заболевания или иному неблагоприятному исходу"
        ],
        "wA": [
            "отношение вероятности того, что событие произойдет, к вероятности того, что событие не произойдет",
            "неслучайное, однонаправленное отклонение результатов от истинных значений",
            "случайное воздействие"
        ]
    },
    {
        "qID": 287,
        "qName": "ОК-1, ОПК-1 ПОСЛЕ РАБОЧЕГО ДНЯ, В ТЕЧЕНИЕ КОТОРОГО ИМЕЛ МЕСТО КОНТАКТ РУК С ХЛОРНЫМИ ПРЕПАРАТАМИ, КОЖУ ОБРАБАТЫВАЮТ ВАТНЫМ ТАМПОНОМ, СМОЧЕННЫМ РАСТВОРОМ",
        "rA": [
            "1%  гипосульфита натрия"
        ],
        "wA": [
            "2%  перекиси водорода",
            "0,05%  хлоргексидина",
            "70%  медицинского спирта"
        ]
    },
    {
        "qID": 288,
        "qName": "ОК-1, ОПК-1,  ПК-17 ОТНОШЕНИЕ ШАНСОВ – ЭТО",
        "rA": [
            "отношение вероятности того, что событие произойдет, к вероятности того, что событие не произойдет;"
        ],
        "wA": [
            "внешнее воздействие, приводящее к увеличению риска возникновения заболевания",
            "неслучайное, однонаправленное отклонение результатов от истинных значений",
            "разность рисков"
            
        ]
    },
    {
        "qID": 289,
        "qName": "[ОК-1, ОПК-1, ПК-17] ДЛЯ ОЦЕНКИ ЭФФЕКТИВНОСТИ ЛЕЧЕНИЯ (ПРОФИЛАКТИЧЕСКОГО ВМЕШАТЕЛЬСТВА) ОСУЩЕСТВЛЯЕТСЯ ПОИСК В ЛИТЕРАТУРНЫХ ИСТОЧНИКАХ ОПИСАНИЯ ИССЛЕДОВАНИЙ, ПРОВОДИМЫХ ПО ТИПУ",
        "rA": [
            "рандомизированных контролируемых испытаний"
        ],
        "wA": [
            "случай-контроль",
            "когортных исследований",
            "случай-контроль и когортных исследований",

        ]
    },
    {
        "qID": 290,
        "qName": "ДЛЯ ОЦЕНКИ ПОТЕНЦИАЛЬНЫХ ФАКТОРОВ РИСКА, ОСУЩЕСТВЛЯЕТСЯ ПОИСК В ЛИТЕРАТУРНЫХ ИСТОЧНИКАХ ОПИСАНИЯ ИССЛЕДОВАНИЙ, ПРОВОДИМЫХ ПО ТИПУ",
        "rA": [
            "случай-контроль и когортных исследований"
        ],
        "wA": [
            "случай-контроль",
            "когортных исследований",
              "рандомизированных контролируемых испытаний"
        ]
    },
    {
        "qID": 291,
        "qName": "ОК-1, ОПК-1, ПК-17 ДЛЯ ОТВЕТА НА ВОПРОС, КАСАЮЩИЙСЯ ТОЧНОСТИ ДИАГНОСТИЧЕСКОГО МЕТОДА, ОСУЩЕСТВЛЯЕТСЯ ПОИСК В ЛИТЕРАТУРНЫХ ИСТОЧНИКАХ ОПИСАНИЯ ИССЛЕДОВАНИЙ, ПРОВОДИМЫХ ПО ТИПУ",
        "rA": [
            "поперечных (срезовых) исследований"
        ],
        "wA": [
            "случай-контроль и когортных исследований",
            "когортных исследований",
            "рандомизированных контролируемых испытаний"
            
        ]
    },
    {
        "qID": 292,
        "qName": "К-1, ОПК-1,  ПК-17 ДЛЯ ОЦЕНКИ ДАЛЬНЕЙШЕГО РАЗВИТИЯ ЗАБОЛЕВАНИЯ (ПРОГНОЗ1. ОСУЩЕСТВЛЯЕТСЯ ПОИСК В ЛИТЕРАТУРНЫХ ИСТОЧНИКАХ ОПИСАНИЯ ИССЛЕДОВАНИЙ, ПРОВОДИМЫХ ПО ТИПУ",
        "rA": [
            "когортных исследований"
        ],
        "wA": [
            "случай-контроль",
            "случай-контроль и когортных исследований",
            "рандомизированных контролируемых испытаний"
        ]
    },
    {
        "qID": 293,
        "qName": "ОК-1, ОПК-1 БОЛЬНОЙ МОЖЕТ ПРЕДСТАВЛЯТЬ ЭПИДЕМИОЛОГИЧЕСКУЮ ОПАСНОСТЬ ДЛЯ ОКРУЖАЮЩИХ В ПЕРИОД РЕКОНВАЛЕСЦЕНЦИИ  ПРИ",
        "rA": [
            "вирусном гепатите В"
        ],
        "wA": [
            "вирусном гепатите А",
            "гриппе",
            "иерсиниозе;"
        ]
    },
    {
        "qID": 294,
        "qName": "ОК-1, ОПК-1 ЭПИДЕМИОЛОГИЧЕСКАЯ ОПАСНОСТЬ БОЛЬНОГО  ДЛЯ ОКРУЖАЮЩИХ В ПЕРИОД РАЗГАРА ЗАБОЛЕВАНИЯ СНИЖАЕТСЯ   ПРИ…",
        "rA": [
            "вирусном гепатите А"
        ],
        "wA": [
            "гриппе",
            "вирусном гепатите В",
            "иерсиниозе"
        ]
    },
    {
        "qID": 295,
        "qName": "ОК-1, ОПК-1 ТИП ВОЗРАСТНОЙ СТРУКТУРЫ НАСЕЛЕНИЯ РОССИЙСКОЙ ФЕДЕРАЦИИ",
        "rA": [
            "регрессивный"
        ],
        "wA": [
            "стационарный",
            "статичный",
            "прогрессивный"
        ]
    },
    {
        "qID": 296,
        "qName": "ОК-1, ОПК-1, ПК-17 ПОКАЗАТЕЛЬ ОБЩЕЙ ЗАБОЛЕВАЕМОСТИ ХАРАКТЕРИЗУЕТ",
        "rA": [
            "распространённость заболеваний среди населения"
        ],
        "wA": [
            "изменения распространённости заболеваний во времени",
            "удельный вес конкретного заболевания",
            "распространённость социально-значимых заболеваний"
        ]
    },
    {
        "qID": 297,
        "qName": "ОК-1, ОПК-1, ПК-17 ДЛЯ РАСЧЁТА КОНКРЕТНОГО ВИДА ЗАБОЛЕВАЕМОСТИ НЕОБХОДИМЫ ДАННЫЕ О ЧИСЛЕ СЛУЧАЕВ КОНКРЕТНОГО ЗАБОЛЕВАНИЯ И",
        "rA": [
            "среднегодовой численности населения"
        ],
        "wA": [
            "числе случаев заболеваний в предыдущие годы",
            "численности трудоспособного населения",
            "числе лиц, прошедших медосмотр"
        ]
    },
    {
        "qID": 298,
        "qName": "ОК-1, ОПК-1, ПК-17 ИЗ УСЛОВИЙ, ВЛИЯЮЩИХ НА ЗДОРОВЬЕ, НАИБОЛЕЕ ЗНАЧИМЫМ, СОГЛАСНО ДАННЫМ ВОЗ, ЯВЛЯЕТСЯ",
        "rA": [
            "образ жизни"
        ],
        "wA": [
            "здравоохранение",
            "наследственность",
            "внешняя среда"
        ]
    },
    {
        "qID": 299,
        "qName": "ОК-1, ОПК-1 О КАЧЕСТВЕ ЛЕЧЕНИЯ В СТАЦИОНАРНЫХ УСЛОВИЯХ СВИДЕТЕЛЬСТВУЕТ ПОКАЗАТЕЛЬ",
        "rA": [
            "летальности"
        ],
        "wA": [
            "количества пролеченных пациентов",
            "среднегодовой занятости койки",
            "оборота койки"
        ]
    },
    {
        "qID": 300,
        "qName": "ОК-1, ОПК-1 О КАЧЕСТВЕ ЛЕЧЕНИЯ В СТАЦИОНАРНЫХ УСЛОВИЯХ СВИДЕТЕЛЬСТВУЕТ ПОКАЗАТЕЛЬ",
        "rA": [
            "послеоперационных осложнений"
        ],
        "wA": [
            "средней продолжительности пребывания на койке",
            "среднегодовой занятости койки",
            "оборота койки"
        ]
    }
]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
