var tests = {
    "tests": [
        {
            "qID": 101,
            "qName": "ОК-1, ОПК-1 ПОКАЗАНИЕМ К ГОСПИТАЛИЗАЦИИ ПРИ ОРВИ ЯВЛЯЕТСЯ",
            "rA": [
                "наличие осложнений"
            ],
            "wA": [
                "цефалгия",
                "анемия легкой степени",
                "фарингит"
            ]
        },
        {
            "qID": 102,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОБЪЕКТОМ ИЗУЧЕНИЯ КЛАССИЧЕСКОЙ ЭПИДЕМИОЛОГИИ ЯВЛЯЕТСЯ",
            "rA": [
                "эпидемический процесс;"
            ],
            "wA": [
                "заболеваемость неинфекционными болезнями;",
                "любые массовые явления в населении;",
                "состояние здоровья населения."
            ]
        },
        {
            "qID": 103,
            "qName": "ОК-1, ОПК-1, ПК-3 МЕХАНИЗМ ПЕРЕДАЧИ ИНФЕКЦИИ СООТВЕТСТВУЕТ",
            "rA": [
                "основной локализации возбудителя в организме хозяина;"
            ],
            "wA": [
                "характеристикам источника инфекции;",
                "путям распространения инфекции;",
                "устойчивости возбудителя."
            ]
        },
        {
            "qID": 104,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ПЕРЕЧИСЛЕННЫХ К МЕДЛЕННЫМ ИНФЕКЦИЯМ ОТНОСЯТСЯ",
            "rA": [
                "ВИЧ-инфекция;"
            ],
            "wA": [
                "туберкулез;",
                "столбняк;",
                "клещевой возвратный тиф;"
            ]
        },
        {
            "qID": 105,
            "qName": "ОК-1, ОПК-1, ПК-3 ВЕРТИКАЛЬНЫЙ ПУТЬ ПЕРЕДАЧИ ИМЕЕТ МЕСТО ПРИ",
            "rA": [
                "токсоплазмозе;"
            ],
            "wA": [
                "геморрагической лихорадке с почечным синдромом;",
                "брюшном тифе;",
                "стафилококкозах;"
            ]
        },
        {
            "qID": 106,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСТОЧНИКОМ ВОЗБУДИТЕЛЯ ИНФЕКЦИИ ЯВЛЯЮТСЯ",
            "rA": [
                "птицы, зараженные арбовирусами;"
            ],
            "wA": [
                "блохи, зараженные чумными бактериями;",
                "вода, зараженная холерными вибрионами;",
                "малярийные комары;"
            ]
        },
        {
            "qID": 107,
            "qName": "ОК-1, ОПК-1, ПК-3 ВЕРТИКАЛЬНЫЙ ПУТЬ ПЕРЕДАЧИ ВОЗМОЖЕН ПРИ",
            "rA": [
                "вирусном гепатите В;"
            ],
            "wA": [
                "скарлатине;",
                "дизентерии;",
                "вирусном гепатите А;"
            ]
        },
        {
            "qID": 108,
            "qName": "ОК-1, ОПК-1, ПК-3 ТЕРМИНОМ  «ДЕКРЕТИРОВАННАЯ» ГРУППА НАСЕЛЕНИЯ ОБОЗНАЧАЕТСЯ",
            "rA": [
                "группа лиц, в отношении которых противоэпидемические мероприятия проводят особым образом;"
            ],
            "wA": [
                "группа населения, имеющая наибольший интенсивный показатель заболеваемости;",
                "группа населения, среди которой отмечается наибольшее число заболеваний;",
                "коллектив, в котором зарегистрирован хотя бы один случай «особо опасной» инфекции."
            ]
        },
        {
            "qID": 109,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 К КАТЕГОРИИ ОТДЕЛЬНЫХ «СОЦИАЛЬНО ЗНАЧИМЫХ БОЛЕЗНЕЙ», ПОДЛЕЖАЩИХ СПЕЦИАЛЬНОМУ УЧЕТУ, ОТНОСИТСЯ",
            "rA": [
                "наркомания"
            ],
            "wA": [
                "гипотиреоз",
                "описторхоз",
                "муковисцидоз"
            ]
        },
        {
            "qID": 110,
            "qName": "ОК-1, ОПК-1, ПК-3 ВОЗМОЖНОСТЬ РЕАЛИЗАЦИИ ВОЗДУШНО-ПЫЛЕВОГО ПУТИ ПЕРЕДАЧИ ЗАВИСИТ",
            "rA": [
                "от устойчивости возбудителя во внешней среде;"
            ],
            "wA": [
                "устойчивость не имеет значения;",
                "от скорости снижения вирулентности возбудителя;",
                "от дисперсности аэрозоля."
            ]
        },
        {
            "qID": 111,
            "qName": "ОК-1, ОПК-1, ПК-3 ИНФЕКЦИЯ, КОТОРАЯ ПЕРЕДАЕТСЯ ВОДНЫМ, ПИЩЕВЫМ И КОНТАКТНО-БЫТОВЫМ ПУТЯМИ",
            "rA": [
                "гепатит А;"
            ],
            "wA": [
                "скарлатина;",
                "чесотка;",
                "ВИЧ-инфекция."
            ]
        },
        {
            "qID": 112,
            "qName": "ОК-1, ОПК-1, ПК-3 ИНФЕКЦИЯ, ПРИ КОТОРОЙ ВОЗМОЖЕН  ПЕРЕХОД ЭПИЗООТИЧЕСКОГО ПРОЦЕССА В ЭПИДЕМИЧЕСКИЙ",
            "rA": [
                "чума;"
            ],
            "wA": [
                "туляремия;",
                "лептоспироз;",
                "бруцеллез."
            ]
        },
        {
            "qID": 113,
            "qName": "ОК-1, ОПК-1, ПК-3 СПЕЦИФИКУ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА ОПРЕДЕЛЯЕТ ФАКТОР",
            "rA": [
                "биологический;"
            ],
            "wA": [
                "социальный;",
                "природный."
            ]
        },
        {
            "qID": 114,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНЫЕ ИСТОЧНИКИ ИНФЕКЦИИ ПРИ ДИФТЕРИИ  В СОВРЕМЕННЫЙ ПЕРИОД",
            "rA": [
                "носители токсигенных штаммов;"
            ],
            "wA": [
                "больные клинически выраженными формами;",
                "носители нетоксигенных штаммов;",
                "больные стертыми формами инфекции."
            ]
        },
        {
            "qID": 115,
            "qName": "ОК-1, ОПК-1, ПК-3 ФАКТОРАМИ ПЕРЕДАЧИ ПРИ ВОЗНИКНОВЕНИИ ПИЩЕВЫХ ВСПЫШЕК ДИЗЕНТЕРИИ ЗОННЕ ЧАЩЕ ВСЕГО СЛУЖАТ",
            "rA": [
                "молочные продукты;"
            ],
            "wA": [
                "мясные продукты;",
                "овощи;",
                "фрукты."
            ]
        },
        {
            "qID": 116,
            "qName": "ОК-1, ОПК-1,  ПК-17 ОПТИМАЛЬНЫЙ РАЗМЕР ГРУППЫ СРАВНЕНИЯ В ИССЛЕДОВАНИИ СЛУЧАЙ – КОНТРОЛЬ",
            "rA": [
                "2-4 контроля на 1 случай;"
            ],
            "wA": [
                "чем больше контролей на один случай, тем надежнее результаты;",
                "1-2 контроля на 1 случай;",
                "1 контроль на 2-А случая;"
            ]
        },
        {
            "qID": 117,
            "qName": "ОК-1, ОПК-1  ВОЗБУДИТЕЛЕМ ВНЕБОЛЬНИЧНОЙ ПНЕВМОНИИ ЧАЩЕ ВСЕГО ЯВЛЯЕТСЯ",
            "rA": [
                "пневмококк"
            ],
            "wA": [
                "клебсиелла",
                "кишечная палочка",
                "легионелла"
            ]
        },
        {
            "qID": 118,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПОСЛЕ ПРИМЕНЕНИЯ ВАКЦИНЫ ФОРМИРУЕТСЯ ПРИОБРЕТЁННЫЙ\tВИД ИММУНИТЕТА",
            "rA": [
                "искусственный активный"
            ],
            "wA": [
                "естественный активный",
                "естественный пассивный",
                "искусственный пассивный"
            ]
        },
        {
            "qID": 119,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ ПОДОЗРЕНИИ У ПАЦИЕНТА ИНФЕКЦИОННОГО ЗАБОЛЕВАНИЯ НЕОБХОДИМО ЗАПОЛНИТЬ",
            "rA": [
                "экстренное извещение об инфекционном заболевании"
            ],
            "wA": [
                "статистический талон для регистрации заключительных диагнозов",
                "журнал учета инфекционных заболеваний",
                "листок ежедневного учета работы врача"
            ]
        },
        {
            "qID": 120,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНЫМИ ИСТОЧНИКАМИ ПРИ МЕНИНГОКОККОВОЙ ИНФЕКЦИИ ЯВЛЯЮТСЯ",
            "rA": [
                "резидентные носители."
            ],
            "wA": [
                "больные клинически выраженными формами;",
                "больные назофарингитом;",
                "транзиторные носители;"
            ]
        },
        {
            "qID": 121,
            "qName": "ОК-1, ОПК-1 ДЛЯ ПРОФИЛАКТИКИ БЕШЕНСТВА ПРИ УКУСЕ СОБАКОЙ ОПАСНОЙ ЛОКАЛИЗАЦИИ В ПЕРВУЮ ОЧЕРЕДЬ НЕОБХОДИМО ПРИМЕНИТЬ",
            "rA": [
                "антирабический иммуноглобулин"
            ],
            "wA": [
                "антибиотик широкого спектра действия",
                "когацел",
                "противостолбнячную сыворотку"
            ]
        },
        {
            "qID": 122,
            "qName": "ОК-1, ОПК-1, ПК-3 С ПРОФИЛАКТИЧЕСКОЙ ЦЕЛЬЮ БАКТЕРИОЛОГИЧЕСКИ ОБСЛЕДУЮТ НА НАЛИЧИЕ ДИФТЕРИИ",
            "rA": [
                "поступающих в детские дома, дома ребенка и специальные учреждения для детей и взрослых;"
            ],
            "wA": [
                "детей, обучающихся в школах и школах-интернатах;",
                "взрослых 30-40 лет;",
                "медицинских работников."
            ]
        },
        {
            "qID": 123,
            "qName": "ОК-1, ОПК-1, ПК-3  ПОД ТЕРМИНОМ «АТИПИЧНАЯ ПНЕВМОНИЯ» ПОНИМАЮТ",
            "rA": [
                "пневмонию, вызванную легионеллами, хламидиями или микоплазмами"
            ],
            "wA": [
                "пневмококковую пневмонию верхнедолевой локализации",
                "вирусную бронхопневмонию",
                "эозинофильный инфильтрат"
            ]
        },
        {
            "qID": 124,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 НОЗОКОМИАЛЬНОЙ ПРИНЯТО НАЗЫВАТЬ ПНЕВМОНИЮ, ВОЗНИКШУЮ",
            "rA": [
                "позднее 48 часов после госпитализации человека"
            ],
            "wA": [
                "у ранее не леченного человека",
                "у больного, лечившегося в домашних условиях от другого заболевания",
                "у беременной женщины после 20 недель беременности"
            ]
        },
        {
            "qID": 125,
            "qName": "ОК-1, ОПК-1, ПК-3 ПОД ЭПИДЕМИЧЕСКИМ ОЧАГОМ ТУБЕРКУЛЕЗНОЙ ИНФЕКЦИИ СЛЕДУЕТ ПОНИМАТЬ",
            "rA": [
                "больного, выделяющего ВК, его жилье и окружение."
            ],
            "wA": [
                "больного, выделяющего ВК;",
                "больного, выделяющего ВК и его жилье;",
                "место работы родителей"
            ]
        },
        {
            "qID": 126,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17  НАИБОЛЕЕ ЧАСТО ВИРУСНАЯ ИНФЕКЦИЯ ПОПАДАЕТ К ПЛОДУ______ПУТЕМ",
            "rA": [
                "трансплацентарным"
            ],
            "wA": [
                "восходящим",
                "аспирационным",
                "лимфогенным"
            ]
        },
        {
            "qID": 127,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНЫМ ИСТОЧНИКОМ ВОЗБУДИТЕЛЯ ТУБЕРКУЛЕЗА ДЛЯ ЧЕЛОВЕКА ЯВЛЯЕТСЯ",
            "rA": [
                "больные люди;"
            ],
            "wA": [
                "предметы окружающей среды;",
                "продукты питания;",
                "здоровье."
            ]
        },
        {
            "qID": 128,
            "qName": "ОК-1, ОПК-1, ПК-3 ЧАЩЕ ДРУГИХ ПОРАЖАЮТСЯ ТУБЕРКУЛЕЗОМ И МОГУТ СЛУЖИТЬ ИСТОЧНИКОМ ИНФЕКЦИИ ТУБЕРКУЛЕЗА СЛЕДУЮЩИЕ ВИДЫ ЖИВОТНЫХ",
            "rA": [
                "крупный рогатый скот;"
            ],
            "wA": [
                "кошки и собаки;",
                "птицы и лошади.",
                "аквариумные рыбки"
            ]
        },
        {
            "qID": 129,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17  ОБЪЕКТОМ ПЕРВИЧНОЙ ПРОФИЛАКТИКИ ЯВЛЯЮТСЯ",
            "rA": [
                "все жители территории"
            ],
            "wA": [
                "реконвалесценты острых заболеваний",
                "больные хроническими заболеваниями",
                "жители в трудоспособном возрасте"
            ]
        },
        {
            "qID": 130,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ЧАЩЕ ЗАБОЛЕВАЮТ ТУБЕРКУЛЕЗОМ И УМИРАЮТ ОТ НЕГО",
            "rA": [
                "мужчины;"
            ],
            "wA": [
                "женщины;",
                "одинаково часто и мужчины и женщины;",
                "животные."
            ]
        },
        {
            "qID": 131,
            "qName": "ОК-1, ОПК-1, ПК-3 ВЫСОКАЯ ЗАБОЛЕВАЕМОСТЬ ТУБЕРКУЛЕЗОМ ОБНАРУЖИВАЕТСЯ В НАСТОЯЩЕЕ ВРЕМЯ У",
            "rA": [
                "этнической группы населения (малые народы Север1. и мигрирующего населения;"
            ],
            "wA": [
                "постоянно живущего населения и аборигенной группы;",
                "мигрирующего населения",
                "медицинские работники"
            ]
        },
        {
            "qID": 132,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ КОНТАКТЕ С БАКТЕРИОВЫДЕЛИТЕЛЕМ ТУБЕРКУЛЕЗА ЧАЩЕ ЗАБОЛЕВАЮТ",
            "rA": [
                "не вакцинированные и не инфицированные"
            ],
            "wA": [
                "вакцинированные БЦЖ;",
                "инфицированные туберкулезом;",
                "медицинские работники"
            ]
        },
        {
            "qID": 133,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРАВОМОЧНОСТЬ ДЕЛЕНИЯ БОЛЬНЫХ АКТИВНЫМ ТУБЕРКУЛЕЗОМ НА 2 ФОРМЫ (ОТКРЫТУЮ И ЗАКРЫТУЮ) БАЗИРУЕТСЯ НА ПРЕДСТАВЛЕНИИ О",
            "rA": [
                "большой заражающей дозе"
            ],
            "wA": [
                "гетерогенности возбудителя;",
                "устойчивости его во внешней среде;",
                "способности к формированию L-форм;"
            ]
        },
        {
            "qID": 134,
            "qName": "ОК-1, ОПК-1, ПК-3 БОЛЬНОЙ ТУБЕРКУЛЕЗОМ НАИБОЛЕЕ ОПАСЕН ДЛЯ ПАЦИЕНТОВ СТАЦИОНАРА",
            "rA": [
                "акушерского;"
            ],
            "wA": [
                "терапевтического;",
                "инфекционного;",
                "хирургического."
            ]
        },
        {
            "qID": 135,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17  СОГЛАСНО КРИТЕРИЯМ ВОЗ, ПОДРОСТКАМИ СЧИТАЮТСЯ ЛИЦА В ВОЗРАСТЕ   ____ЛЕТ",
            "rA": [
                "15-17"
            ],
            "wA": [
                "10-18",
                "12-16",
                "15-20"
            ]
        },
        {
            "qID": 136,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПРОДОЛЖИТЕЛЬНОСТЬ ИЗОЛЯЦИИ ЛИЦ, КОНТАКТИРОВАВШИХ С БОЛЬНЫМ ЧУМОЙ (ТРУПОМ), СОСТАВЛЯЕТ ______СУТОК",
            "rA": [
                "6"
            ],
            "wA": [
                "3",
                "10",
                "15"
            ]
        },
        {
            "qID": 137,
            "qName": "ОК-1, ОПК-1, ПК-3, ОСНОВНЫМ СПОСОБОМ ПРОФИЛАКТИКИ И БОРЬБЫ С КИШЕЧНЫМИ ИНФЕКЦИЯМИ ЯВЛЯЕТСЯ",
            "rA": [
                "комплекс санитарно-гигиенических мер, направленных на прерывание путей передачи"
            ],
            "wA": [
                "иммунизация восприимчивых контингентов",
                "раннее выявление и изоляция больных",
                "выявление и лечение бактерионосителей"
            ]
        },
        {
            "qID": 138,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНЫМ МЕТОДОМ ВЫЯВЛЕНИЯ ТУБЕРКУЛЕЗА У ДЕТЕЙ ЯВЛЯЕТСЯ",
            "rA": [
                "массовая туберкулодиагностика;"
            ],
            "wA": [
                "флюрография;",
                "обследование групп риска;",
                "обследование лиц, обратившихся к фтизиатру."
            ]
        },
        {
            "qID": 139,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОВЕДЕНИЕ МАССОВОЙ ТУБЕРКУЛОДИАГНОСТИКИ ОСУЩЕСТВЛЯЕТСЯ СПЕЦИАЛИСТАМИ",
            "rA": [
                "общей практики;"
            ],
            "wA": [
                "противотуберкулезных  диспансеров;",
                "противотуберкулезных стационаров;",
                "противоэпидемической службы."
            ]
        },
        {
            "qID": 140,
            "qName": "ОК-1, ОПК-1, ПК-3 ВАКЦИНАЦИЯ И РЕВАКЦИНАЦИЯ БЦЖ – ЭТО ПРОФИЛАКТИКА",
            "rA": [
                "генерализованных форм туберкулезной инфекции;"
            ],
            "wA": [
                "всех форм туберкулезной инфекции;",
                "инфицирования туберкулезом;",
                "заражения."
            ]
        },
        {
            "qID": 141,
            "qName": "ОК-1, ОПК-1 ДЛЯ ЭКСТРЕННОЙ ПРОФИЛАКТИКИ КЛЕЩЕВОГО ЭНЦЕФАЛИТА В ПЕРВЫЕ ТРИ ДНЯ ПОСЛЕ ПРИСАСЫВАНИЯ КЛЕЩА ИСПОЛЬЗУЮТ",
            "rA": [
                "гомологичный специфический иммуноглобулин"
            ],
            "wA": [
                "антибиотики",
                "циклоферон",
                "вакцину против клещевого энцефалита"
            ]
        },
        {
            "qID": 142,
            "qName": "ОК-1, ОПК-1 МЕДИЦИНСКИХ РАБОТНИКОВ, ИМЕЮЩИХ КОНТАКТ С КРОВЬЮ И ЕЕ КОМПОНЕНТАМИ, НА HBSAG ОБСЛЕДУЮТ",
            "rA": [
                "1 раз в год"
            ],
            "wA": [
                "1 раз в 2года",
                "ежеквартально",
                "при поступлении на работу"
            ]
        },
        {
            "qID": 143,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСТОЧНИКОМ ВИЧ-ИНФЕКЦИИ ОПРЕДЕЛЕННО МОЖНО СЧИТАТЬ",
            "rA": [
                "ВИЧ-инфицированного;"
            ],
            "wA": [
                "больного туберкулезом;",
                "человека, у которого антитела к ВИЧ обнаружены однократно методом ИФА;",
                "человека с признаками иммунодефицитного состояния;"
            ]
        },
        {
            "qID": 144,
            "qName": "ОК-1, ОПК-1, ПК-3 ВИЧ-ИНФЕКЦИЯ ОТНОСИТЧСЯ К ГРУППЕ ИНФЕКЦИЙ С МЕХАНИЗМОМ ПЕРЕДАЧИ",
            "rA": [
                "контактным;"
            ],
            "wA": [
                "фекально-оральным;",
                "трансмиссивным;",
                "аэрозольным."
            ]
        },
        {
            "qID": 145,
            "qName": "ОК-1, ОПК-1, ПК-3 К ЧИСЛУ СТИХИЙНЫХ БЕДСТВИЙ, КОТОРЫЕ МОГУТ СЕРЬЕЗНО ОСЛОЖНИТЬ ОБСТАНОВКУ ПО ЗАБОЛЕВАЕМОСТИ КИШЕЧНЫМИ ИНФЕКЦИЯМИ, ОТНОСЯТ",
            "rA": [
                "нашествие саранчи"
            ],
            "wA": [
                "наводнения",
                "лесные пожары",
                "торнадо"
            ]
        },
        {
            "qID": 146,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОБСЛЕДОВАНИЕ БЕРЕМЕННЫХ ЖЕНЩИН НА HBSAG",
            "rA": [
                "проводится при постановке на учет и при уходе в декретный отпуск"
            ],
            "wA": [
                "не проводится;",
                "проводится при постановке на учет;",
                "по желанию беременной"
            ]
        },
        {
            "qID": 147,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРИ ВЫЯВЛЕНИИ БОЛЬНОГО ИНФЕКЦИОННОЙ БОЛЕЗНЬЮ ЛЕЧАЩИЙ ВРАЧ ОБЯЗАН",
            "rA": [
                "направить извещение о больном в ФГБУЗ «Центр гигиены и эпидемиологии»"
            ],
            "wA": [
                "выявить всех контактных",
                "определить границы эпидемического очага",
                "сообщить о контактных лицах по месту работы"
            ]
        },
        {
            "qID": 148,
            "qName": "ОК-1, ОПК-1, ПК-3 ДЛЯ ОБРАБОТКИ РУК МЕДИЦИНСКОГО ПЕРСОНАЛА, ЗАГРЯЗНЕННЫХ КРОВЬЮ БОЛЬНОГО ВИЧ-ИНФЕКЦИЕЙ, ИСПОЛЬЗУЮТ ЭТИЛОВЫЙ\t%СПИРТ",
            "rA": [
                "40"
            ],
            "wA": [
                "70",
                "80",
                "60"
            ]
        },
        {
            "qID": 149,
            "qName": "ОК-1, ОПК-1, ПК-3 НАЛИЧИЕ В КРОВИ ОБСЛЕДУЕМОГО ЛИЦА АНТИТЕЛ К ВИЧ СВИДЕТЕЛЬСТВУЕТ О/ОБ",
            "rA": [
                "вероятной инфицированности"
            ],
            "wA": [
                "приобретенном иммунитете;",
                "перенесенной в прошлом инфекции;",
                "невосприимчивости к инфекции;"
            ]
        },
        {
            "qID": 150,
            "qName": "ОК-1, ОПК-1 ОСНОВНЫМ ИНСТРУМЕНТАЛЬНЫМ МЕТОДОМ ОБСЛЕДОВАНИЯ БОЛЬНОГО ПРИ РАННЕЙ ДИАГНОСТИКЕ ТУБЕРКУЛЕЗА ЛЕГКИХ ЯВЛЯЕТСЯ",
            "rA": [
                "флюорография"
            ],
            "wA": [
                "бронхоскопия",
                "спирография",
                "сцинтиграфия"
            ]
        },
        {
            "qID": 151,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ИЗВЕСТНЫХ ПУТЕЙ ПЕРЕДАЧИ  ВИЧ ПРАКТИЧЕСКИ К 100% ЗАРАЖЕНИЮ ПРИВОДИТ",
            "rA": [
                "переливание крови;"
            ],
            "wA": [
                "перинатальное инфицирование;",
                "половой контакт;",
                "внутривенное введение наркотика нестерильным инструментом."
            ]
        },
        {
            "qID": 152,
            "qName": "ОК-1, ОПК-1, ПК-3 ] НАЛЕТ НА МИНДАЛИНАХ РАСПРОСТРАНЯЕТСЯ ЗА ЕЕ ПРЕДЕЛЫ ПРИ",
            "rA": [
                "дифтерии глотки"
            ],
            "wA": [
                "лакунарной ангине",
                "язвенно-некротической ангине",
                "катаральной ангине"
            ]
        },
        {
            "qID": 153,
            "qName": "ОК-1, ОПК-1 ВИЧ-ИНФЕКЦИЯ ПЕРЕДАЕТСЯ\tПУТЕМ",
            "rA": [
                "половым"
            ],
            "wA": [
                "природно-очаговым",
                "воздушно-капельным",
                "трансмиссивным"
            ]
        },
        {
            "qID": 154,
            "qName": "ОК-1, ОПК-1, ПК-3 ИСТОЧНИКОМ ВИЧ-ИНФЕКЦИИ ЯВЛЯЕТСЯ ЧЕЛОВЕК",
            "rA": [
                "в любой стадии болезни, включая терминальную."
            ],
            "wA": [
                "инкубационном периоде;",
                "стадии первичных проявлений болезни;",
                "стадии вторичных проявлений болезни;"
            ]
        },
        {
            "qID": 155,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОДОЛЖИТЕЛЬНОСТЬ ЖИЗНИ  ВИЧ В ИСПОЛЬЗОВАННОМ ШПРИЦЕ ИЛИ ПОЛОЙ ИГЛЕ (БЕЗ СТЕРИЛИЗАЦИИ) СОСТАВЛЯЕТ НЕСКОЛЬКО",
            "rA": [
                "дней"
            ],
            "wA": [
                "минут",
                "часов"
            ]
        },
        {
            "qID": 156,
            "qName": "ОК-1, ОПК-1, ПК-3 ЗАБОЛЕВАЕМОСТЬ  ВИЧ-ИНФЕКЦИЕЙ МОЖНО ХАРАКТЕРИЗОВАТЬ   КАК",
            "rA": [
                "пандемическую"
            ],
            "wA": [
                "спорадической",
                "эпидемической",
                "вспышечной"
            ]
        },
        {
            "qID": 157,
            "qName": "ОК-1, ОПК-1, ПК-3 ВЕДУЩИМ СПОСОБОМ ПЕРЕДАЧИ  ВИЧ В НАСТОЯЩЕЕ ВРЕМЯ В РОССИИ ЯВЛЯЕТСЯ",
            "rA": [
                "половой;"
            ],
            "wA": [
                "вертикальный;",
                "инъекционный среди наркоманов;",
                "шприцевой в МО"
            ]
        },
        {
            "qID": 158,
            "qName": "ОК-1, ОПК-1, ПК-3 САНИТАРНО-ГИГИЕНИЧЕСКИЕ И ПРОТИВОЭПИДЕМИЧЕСКИЕ МЕРОПРИЯТИЯ ПРОВОДЯТСЯ С ЦЕЛЬЮ",
            "rA": [
                "сохранения и укрепления здоровья населения, а также профилактики инфекционных болезней и ликвидации эпидемических очагов"
            ],
            "wA": [
                "недопущения распространения инфекционных болезней",
                "своевременного оказания населению медицинской помощи",
                "предупреждения возникновения и распространения инфекционных заболеваний среди населения"
            ]
        },
        {
            "qID": 159,
            "qName": "ОК-1, ОПК-1, ПК-3 ГРУППОЙ РИСКА ЗАРАЖЕНИЯ ВИЧ-ИНФЕКЦИЕЙ ЯВЛЯЮТСЯ ЛИЦА В ВОЗРАСТЕ",
            "rA": [
                "20-30 лет;"
            ],
            "wA": [
                "до года;",
                "31-40 лет;",
                "50 лет и старше;",
                "дети до 14 лет."
            ]
        },
        {
            "qID": 160,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПОНЯТИЕ «КАРАНТИН» ВКЛЮЧАЕТ",
            "rA": [
                "изоляционные и противоэпидемические мероприятия, направленные на локализацию и ликвидацию эпидемического очага"
            ],
            "wA": [
                "уничтожение насекомых-переносчиков инфекционных болезней",
                "уничтожение в окружающей среде возбудителей инфекционных болезней",
                "ограничительные мероприятия и усиленное медицинское наблюдение, направленные на предупреждение распространения инфекционных болезней"
            ]
        },
        {
            "qID": 161,
            "qName": "ОК-1, ОПК-1, ПК-3 ОБСЕРВАЦИЯ ПРОВОДИТСЯ В РАЙОНАХ ЧРЕЗВЫЧАЙНОЙ СИТУАЦИИ С",
            "rA": [
                "неблагополучным или чрезвычайным санитарно-эпидемическим состоянием"
            ],
            "wA": [
                "неустойчивым санитарно-эпидемическим состоянием",
                "чрезвычайным санитарно-эпидемическим состоянием",
                "появлением групповых неконтагиозных заболеваний"
            ]
        },
        {
            "qID": 162,
            "qName": "ОК-1, ОПК-1, ПК-3 РАСПОРЯЖЕНИЕ О ПРОВЕДЕНИИ ЭКСТРЕННОЙ ПРОФИЛАКТИКИ ВЫДАЕТ",
            "rA": [
                "санитарно-противоэпидемическая комиссия"
            ],
            "wA": [
                "главный врач санэпидемстанции",
                "главный врач инфекционной больницы",
                "эпидемиолог"
            ]
        },
        {
            "qID": 163,
            "qName": "ОК-1, ОПК-1  ПРОДОЛЖИТЕЛЬНОСТЬ ФЕНОМЕНА «ОКНА» ПРИ ВИЧ-ИНФЕКЦИИ СОСТАВЛЯЕТ",
            "rA": [
                "1-1,5 месяца;"
            ],
            "wA": [
                "1 неделю;",
                "2 месяца;",
                "3 месяца."
            ]
        },
        {
            "qID": 164,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 РЕЖИМ КАРАНТИНА ВВОДИТСЯ",
            "rA": [
                "на срок максимального инкубационного периода соответствующего инфекционного заболевания с момента изоляции последнего больного"
            ],
            "wA": [
                "с момента изоляции последнего больного и окончания дезинфекции в очаге заражения",
                "на два инкубационных периода соответствующего инфекционного заболевания",
                "на срок одного инкубационного периода инфекционного заболевания"
            ]
        },
        {
            "qID": 165,
            "qName": "ОК-1, ОПК-1, ПК-3 МАРКЕРАМИ ИЗЛЕЧЕННОСТИ ОТ ГЕПАТИТА В И ЭФФЕКТИВНОСТИ  ВВЕДЕНИЯ ВАКЦИНЫ ПРОТИВ ГЕПАТИТА В ЯВЛЯЮТСЯ",
            "rA": [
                "анти-HBs;"
            ],
            "wA": [
                "HbsAg;",
                "анти-HBcgrM;",
                "HbeAg."
            ]
        },
        {
            "qID": 166,
            "qName": "ОК-1, ОПК-1, ПК-3 ОБСЕРВАЦИЯ ВКЛЮЧАЕТ",
            "rA": [
                "ограничительные мероприятия и усиленное медицинское наблюдение, направленные на предупреждение распространения инфекционных болезней"
            ],
            "wA": [
                "изоляционные и противоэпидемические мероприятия, направленные на локализацию и ликвидацию эпидемического очага",
                "уничтожение в окружающей среде возбудителей инфекционных болезней",
                "изоляцию инфекционных больных"
            ]
        },
        {
            "qID": 167,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ПОПУЛЯЦИОННАЯ СТРАТЕГИЯ ПРЕДПОЛАГАЕТ",
            "rA": [
                "формирование здорового образа жизни на уровне всего населения и обеспечение для этого соответствующих условий"
            ],
            "wA": [
                "своевременное выявление лиц с повышенным уровнем факторов риска и проведение мероприятий по их коррекции",
                "предупреждение прогрессирования хронических неинфекционных заболеваний как за счет коррекции факторов риска, так и за счет своевременного проведения лечения и мер реабилитации",
                "разделение населения на группы в зависимости от возраста"
            ]
        },
        {
            "qID": 168,
            "qName": "ОК-1, ОПК-1, ПК-3 СРЕДИ ПРЕДЛОЖЕННЫХ В НАСТОЯЩЕЕ ВРЕМЯ МЕТОДОВ СПЕЦИФИЧЕСКОЙ ЛАБОРАТОРНОЙ ДИАГНОСТИКИ ВИРУСНЫХ ГЕПАТИТОВ НАИБОЛЕЕ ЧУВСТВИТЕЛЬНЫМ И ДОСТУПНЫМ ЯВЛЯЕТСЯ",
            "rA": [
                "иммуноферментный анализ;"
            ],
            "wA": [
                "реакция преципитации в геле;",
                "встречный иммуноэлектрофорез;",
                "реакция обратной пассивной гемагглютинации;"
            ]
        },
        {
            "qID": 169,
            "qName": "ОК-1, ОПК-1, ПК-3 ИЗ ЧИСЛА ДИАГНОСТИРУЕМЫХ В НАСТОЯЩЕЕ ВРЕМЯ ВИРУСНЫХ ГЕПАТИТОВ ХРОНИЧЕСКОЕ ТЕЧЕНИЕ НАИБОЛЕЕ ЧАСТО ПРИОБРЕТАЕТ  ГЕПАТИТ",
            "rA": [
                "С;"
            ],
            "wA": [
                "Е;",
                "А;",
                "В."
            ]
        },
        {
            "qID": 170,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 СТРАТЕГИЯ ВЫСОКОГО РИСКА ЗАКЛЮЧАЕТСЯ В",
            "rA": [
                "своевременном выявлении лиц с повышенным уровнем факторов риска и проведение мероприятий по их коррекции"
            ],
            "wA": [
                "формировании здорового образа жизни на уровне всего населения и обеспечение для этого соответствующих условий",
                "предупреждении прогрессирования хронических неинфекционных заболеваний как за счет коррекции факторов риска, так и за счет своевременного проведения лечения и мер реабилитации",
                "разделение населения на группы в зависимости от возраста"
            ]
        },
        {
            "qID": 171,
            "qName": "ОК-1, ОПК-1, ПК-3  ПРИ УСТАНОВЛЕНИИ ДИАГНОЗА \"ТОНЗИЛЛОФАРИНГИТ\" С НАЛЕТОМ НА МИНДАЛИНАХ ОБЯЗАН НАЗНАЧИТЬ",
            "rA": [
                "мазок из миндалин на дифтерию"
            ],
            "wA": [
                "анализ крови на вирус иммунодефицита человека",
                "анализ крови на реакцию вассермана",
                "анализ крови на реакцию видаля"
            ]
        },
        {
            "qID": 172,
            "qName": "ОК-1, ОПК-1 МОЖНО РЕКОМЕНДОВАТЬ ГРУДНОЕ ВСКАРМЛИВАНИЕ  НОВОРОЖДЕННЫХ ОТ ВИЧ-ИНФИЦИРОВАННЫХ МАТЕРЕЙ",
            "rA": [
                "нет;"
            ],
            "wA": [
                "да;",
                "да, если слизистая полости рта новорожденного без повреждений;",
                "да, если не прорезались зубы;",
                "нет, если соски имеют трещины."
            ]
        },
        {
            "qID": 173,
            "qName": "ОК-1, ОПК-1 ПРИ НАЛИЧИИ ОСТРОЙ ЛАКУНАРНОЙ АНГИНЫ СЛЕДУЕТ ИСКЛЮЧИТЬ",
            "rA": [
                "дифтерию"
            ],
            "wA": [
                "грипп",
                "парагрипп",
                "паратонзиллярный абсцесс"
            ]
        },
        {
            "qID": 174,
            "qName": "ОК-1, ОПК-1 ДИСПАНСЕРНОЕ НАБЛЮДЕНИЕ ЗА ВИЧ-ИНФИЦИРОВАННЫМИ И БОЛЬНЫМИ СПИД ОСУЩЕСТВЛЯЮТ",
            "rA": [
                "врачи КИЗ (кабинетов инфекционных заболеваний) поликлиник"
            ],
            "wA": [
                "инфекционные больницы",
                "кожно-венерические диспансеры",
                "поликлиники ближайшего регионального центра СПИД"
            ]
        },
        {
            "qID": 175,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ЧАСТОТА ПРОФИЛАКТИЧЕСКОЙ ВАКЦИНАЦИИ ОТ ГРИППА БОЛЬНЫХ ХРОНИЧЕСКОЙ ОБСТРУКТИВНОЙ БОЛЕЗНЬЮ ЛЁГКИХ ЛЕГКОЙ И СРЕДНЕЙ СТЕПЕНИ ТЯЖЕСТИ СОСТАВЛЯЕТ 1 РАЗ В",
            "rA": [
                "год"
            ],
            "wA": [
                "полгода",
                "2 года",
                "3 года"
            ]
        },
        {
            "qID": 176,
            "qName": "ОК-1, ОПК-1, ПК-3 ВТОРИЧНАЯ ПРОФИЛАКТИКА ВКЛЮЧАЕТ",
            "rA": [
                "мероприятия, предупреждающие развитие осложнений и рецидивов заболеваний"
            ],
            "wA": [
                "проведение прививок",
                "мероприятия, предупреждающие развитие заболеваний",
                "выявление заболеваний"
            ]
        },
        {
            "qID": 177,
            "qName": "ОК-1, ОПК-1 ПРАВИЛА ОБЕЗЗАРАЖИВАНИЯ РУК МЕДИЦИНСКОГО ПЕРСОНАЛА (ДЛЯ ПРОФИЛАКТИКИ ВИЧ) ПРИ ЗАГРЯЗНЕНИИ ИХ КРОВЬЮ ИЛИ СЫВОРОТКОЙ",
            "rA": [
                "обработать 70% спиртом, вымыть водой с мылом, повторно обработать 70% спиртом;"
            ],
            "wA": [
                "обработать тампоном, смоченным 96% спиртом;",
                "вымыть с водой и мылом, затем обработать тампоном, смоченным 0,5% раствором хлорамина, повторно вымыть с водой и мылом;",
                "тщательно вымыть руки с мылом;",
                "снять «щипком» капли крови или сыворотки сухим тампоном, обработать руки 1% раствором хлорамина;"
            ]
        },
        {
            "qID": 178,
            "qName": "ОК-1, ОПК-1 ПК-17 НАИБОЛЕЕ ЭФФЕКТИВНЫМИ  МЕРАМИ  ПРОФИЛАКТИКИ ВИЧ СРЕДИ НАСЕЛЕНИЯ ЯВЛЯЮТСЯ",
            "rA": [
                "санитарно-просветительная работа среди населения;"
            ],
            "wA": [
                "применение медикаментов и вакцин по специфической профилактике, угрожаемых контингентов;",
                "массовое обследование для выявления всех инфицированных;",
                "изоляция инфицированных и больных СПИД;"
            ]
        },
        {
            "qID": 179,
            "qName": "ОК-1, ОПК-1,ПК-17 К ФАКТОРАМ РИСКА У ПОЖИЛЫХ, НЕПОСРЕДСТВЕННО ВЛИЯЮЩИМ НА СМЕРТНОСТЬ, ОТНОСИТСЯ",
            "rA": [
                "высокое систолическое ад на плечевой артерии"
            ],
            "wA": [
                "высокое диастолическое ад на плечевой артерии",
                "высокое систолическое ад на голени",
                "низкое систолическое АД на голени"
            ]
        },
        {
            "qID": 180,
            "qName": "ОК-1, ОПК-1, ПК-17 К ОСНОВНЫМ ПРОФИЛАКТИЧЕСКИМ МЕРОПРИЯТИЯМ САХАРНОГО ДИАБЕТА 2 ТИПА ОТНОСЯТСЯ",
            "rA": [
                "рациональное питание, физическая активность, предупреждение ожирения и его лечение"
            ],
            "wA": [
                "рациональное питание, физическая активность",
                "предупреждение ожирения и его лечение",
                "рациональное питание, профилактика атеросклероза"
            ]
        },
        {
            "qID": 181,
            "qName": "ОК-1, ОПК-1 ОДЕВАТЬ РЕЗИНОВЫЕ ПЕРЧАТКИ ДЛЯ ПРОФИЛАКТИКИ ВИЧ НЕОБХОДИМО ПРИ ИНЪЕКЦИЯХ",
            "rA": [
                "любых;"
            ],
            "wA": [
                "внутривенных;",
                "подкожных;",
                "внутримышечных;",
                "накожных."
            ]
        },
        {
            "qID": 182,
            "qName": "ОК-1, ОПК-1 ВЕДУЩИМИ ВОЗБУДИТЕЛЯМИ ИНФЕКЦИЙ КРОВОТОКА, СВЯЗАННЫХ С КАТЕТЕРИЗАЦИЕЙ, ЯВЛЯЮТСЯ",
            "rA": [
                "Коагулазо отрицательные стафилококки;"
            ],
            "wA": [
                "Staphylococcus aureus;",
                "Pseudomonas aeruginosa;",
                "Acinetobacter calcoaceticus;"
            ]
        },
        {
            "qID": 183,
            "qName": "ОК-1, ОПК-1  ПРИ ПОДОЗРЕНИИ НА ТУБЕРКУЛЕЗ ОБСЛЕДОВАНИЮ ПОДЛЕЖАТ БОЛЬНЫЕ С ЖАЛОБАМИ НА",
            "rA": [
                "кашель с мокротой, потливость, потерю массы тела"
            ],
            "wA": [
                "слабость, одышку, тяжесть за грудиной, потливость",
                "потливость, одышку, головную боль, потерю массы тела",
                "учащенное сердцебиение, потливость, малый субфебрилитет"
            ]
        },
        {
            "qID": 184,
            "qName": "ОК-1, ОПК-1 У БОЛЬНОГО В ХИРУРГИЧЕСКОМ ОТДЕЛЕНИИ ПОСЛЕ ОПЕРАЦИИ ВЫЯВЛЕН УРОГЕНИТАЛЬНЫЙ ХЛАМИДИОЗ. НЕОБХОДИМЫЕ МЕРЫ",
            "rA": [
                "продолжить лечение в данном отделении"
            ],
            "wA": [
                "срочный перевод в инфекционную больницу;",
                "изоляция больного в боксе;",
                "перевести в урологическое отделение"
            ]
        },
        {
            "qID": 185,
            "qName": "ОК-1, ОПК-1 САМЫЙ ВЫСОКИЙ РИСК ВОЗНИКНОВЕНИЯ ГСИ ПРЕДСТАВЛЯЮТ ОПЕРАТИВНЫЕ ВМЕШАТЕЛЬСТВА ИЗ КЛАССА",
            "rA": [
                "грязные;"
            ],
            "wA": [
                "условно-чистые;",
                "загрязненные, контаминированные;",
                "чистые."
            ]
        },
        {
            "qID": 186,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ОСОБЕННОСТИ РАЗВИТИЯ ЭПИДЕМИЧЕСКОГО ПРОЦЕССА  ИСМП ОБУСЛОВЛЕНЫ ПРЕИМУЩЕСТВЕННО",
            "rA": [
                "особенностями лечебно-диагностического процесса;"
            ],
            "wA": [
                "биологическими свойствами возбудителей;",
                "наличием носителей среди медицинского персонала",
                "особенностями резистентности пациента"
            ]
        },
        {
            "qID": 187,
            "qName": "ОК-1, ОПК-1, ПК-3 УЧЕТНАЯ ФОРМА 058/У – ЭТО",
            "rA": [
                "экстренное извещение об инфекционном заболевании, пищевом, остром профессиональном отравлении, необычной реакции на прививку"
            ],
            "wA": [
                "извещение о больном с впервые в жизни установленным диагнозом рака или другого злокачественного новообразования",
                "извещение о больном с впервые в жизни установленным диагнозом активного туберкулеза, венерической болезни, трихофитии, микроспории, фавуса, чесотки, трахомы, психического заболевания",
                "статистический талон для регистрации заключительных (уточненных) диагнозов"
            ]
        },
        {
            "qID": 188,
            "qName": "ОК-1, ОПК-1 ЧАСТОТА ЗАБОЛЕВАНИЙ, ВЫЯВЛЕННЫХ ПРИ ПРОФИЛАКТИЧЕСКИХ ОСМОТРАХ, НАЗЫВАЕТСЯ",
            "rA": [
                "патологической пораженностью"
            ],
            "wA": [
                "распространенностью",
                "первичной заболеваемостью",
                "болезненностью"
            ]
        },
        {
            "qID": 189,
            "qName": "ОК-1, ОПК-1, ПК-17 ЭКСТЕНСИВНЫЙ ПОКАЗАТЕЛЬ ХАРАКТЕРИЗУЕТ",
            "rA": [
                "структуру явления"
            ],
            "wA": [
                "репрезентативность",
                "достоверность",
                "взаимосвязь признаков"
            ]
        },
        {
            "qID": 190,
            "qName": "ОК-1, ОПК-1 БАКТЕРИЕМИИ  В ОТДЕЛЕНИИ РЕАНИМАЦИИ ЧАЩЕ ВЫЗЫВАЮТСЯ",
            "rA": [
                "коагулазонегативным стафилококком;"
            ],
            "wA": [
                "золотистым стафилококком;",
                "стрептококком",
                "кишечной палочкой"
            ]
        },
        {
            "qID": 191,
            "qName": "ОК-1, ОПК-1 РИСК ВОЗНИКНОВЕНИЯ  ИСМП  ПРИ ПРОВЕДЕНИИ ОПЕРАТИВНЫХ ВМЕШАТЕЛЬСТВ С ВЫСОКИМ РИСКОМ РАЗВИТИЯ ЭНДОГЕННОЙ ИНФЕКЦИИ МОЖЕТ БЫТЬ СНИЖЕН ЗА СЧЕТ",
            "rA": [
                "адекватной антибиотикопрофилактики;"
            ],
            "wA": [
                "санации носителей стафилококка;",
                "увеличение кратности воздухообмена в операционной",
                "показателей здоровья персонала"
            ]
        },
        {
            "qID": 192,
            "qName": "ОК-1, ОПК-1 ИСМП   ВЫЗЫВАЮТСЯ МИКРООРГАНИЗМАМИ",
            "rA": [
                "патогенными и условно-патогенными"
            ],
            "wA": [
                "патогенными;",
                "условно-патогенными;",
                "грибами"
            ]
        },
        {
            "qID": 193,
            "qName": "ОК-1, ОПК-1, ПК-3 ЭКСТРЕННОЕ ИЗВЕЩЕНИЕ В УЧРЕЖДЕНИЕ ПРОТИВОЭПИДЕМИЧЕСКОЙ СЛУЖБЫ МЕДИЦИНСКИЙ РАБОТНИК  ОТПРАВЛЯЕТ",
            "rA": [
                "при подозрении на инфекционное заболевание"
            ],
            "wA": [
                "только после бактериологического подтверждение заболевания",
                "только после консультации с врачом-инфекционистом",
                "после госпитализации больного"
            ]
        },
        {
            "qID": 194,
            "qName": "ОК-1, ОПК-1 БОЛЬНОЙ ПРЕДСТАВЛЯЕТ ЭПИДЕМИОЛОГИЧЕСКУЮ ОПАСНОСТЬ ДЛЯ ОКРУЖАЮЩИХ В КОНЦЕ ИНКУБАЦИОННОГО ПЕРИОДА ПРИ",
            "rA": [
                "вирусном гепатите А"
            ],
            "wA": [
                "брюшном тифе",
                "сальмонеллезе",
                "иерсиниозе"
            ]
        },
        {
            "qID": 195,
            "qName": "ОК-1, ОПК-1, ПК-3 ПРОТИВОЭПИДЕМИЧЕСКИЕ МЕРОПРИЯТИЯ – ЭТО МЕРОПРИЯТИЯ, НАПРАВЛЕННЫЕ НА ПРОФИЛАКТИКУ",
            "rA": [
                "инфекционных заболеваний"
            ],
            "wA": [
                "неинфекционных заболеваний",
                "инфекционных и неинфекционных заболеваний",
                "заболеваний отдельных групп населения"
            ]
        },
        {
            "qID": 196,
            "qName": "ОК-1, ОПК-1 ОБЯЗАТЕЛЬНЫМ УСЛОВИЕМ ДЛЯ ПРОВЕДЕНИЯ МЕРОПРИЯТИЙ ПО ИНАКТИВАЦИИ ВИЧ ЯВЛЯЕТСЯ",
            "rA": [
                "предстерилизационная очистка инструментов"
            ],
            "wA": [
                "кипячение инструментов",
                "применение дезинфицирующих средств в повышенных концентрациях",
                "заключительная дезинфекция"
            ]
        },
        {
            "qID": 197,
            "qName": "ОК-1, ОПК-1 ВЕДУЩИМИ СПОСОБАМИ ЗАЩИТЫ ОТ ДИФТЕРИИ ЯВЛЯЮТСЯ",
            "rA": [
                "вакцинопрофилактика"
            ],
            "wA": [
                "антибиотикопрофилактика",
                "меры разобщения",
                "дезинфекционные мероприятия"
            ]
        },
        {
            "qID": 198,
            "qName": "ОК-1, ОПК-1 СРЕДСТВО УПРАВЛЕНИЯ ЭПИДЕМИЧЕСКИМ ПРОЦЕССОМ АЭРОЗОЛЬНЫХ ИНФЕКЦИЙ",
            "rA": [
                "иммунопрофилактика"
            ],
            "wA": [
                "изоляционные мероприятия",
                "дезинфекционные мероприятия",
                "санитарно-гигиенические мероприятия"
            ]
        },
        {
            "qID": 199,
            "qName": "ОК-1, ОПК-1, ПК-3, ПК-17 ЭФФЕКТИВНОСТЬ ПРОТИВОЭПИДЕМИЧЕСКИХ МЕРОПРИЯТИЙ – ЭТО",
            "rA": [
                "достижение необходимого результата за счет эффективного  мероприятия"
            ],
            "wA": [
                "соответствие  мероприятий нормативным требованиям",
                "соответствие используемых средств национальным (международным) стандартам",
                "предотвращение морального ущерба"
            ]
        },
        {
            "qID": 200,
            "qName": "ОК-1, ОПК-1, ПК-3 ОСНОВНОЙ МЕТОД ДЕЗИНФЕКЦИИ ОБЪЕКТОВ ВНЕШНЕЙ СРЕДЫ",
            "rA": [
                "химический"
            ],
            "wA": [
                "механический",
                "физический",
                "очистка"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
