var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Не является специфическим маркером активности гепатита Е:",
            "rA": [
                "Ig G"
            ],
            "wA": [
                "РНК вируса",
                "Антиген вируса",
                "Ig М"
            ]
        },
        {
            "qID": 2,
            "qName": "Ранняя диагностика гепатита А – это выявление:",
            "rA": [
                "Антигена вируса в фекалиях"
            ],
            "wA": [
                "Антигена вируса в крови",
                "Ig М",
                "Ig G"
            ]
        },
        {
            "qID": 3,
            "qName": "Специфическими маркерами формирования иммунитета против  гепатита Е  являются наличие в крови:",
            "rA": [
                "Ig G"
            ],
            "wA": [
                "РНК вируса",
                "Антигена вируса",
                "Ig М"
            ]
        },
        {
            "qID": 4,
            "qName": "Специфическими маркерами формирования вирусоносительства  гепатитом  В  являются наличие в крови :",
            "rA": [
                "HBs ag"
            ],
            "wA": [
                "HBe ag",
                "HBc ag",
                "ДНК вируса"
            ]
        },
        {
            "qID": 5,
            "qName": "Споры необходимы бактериям для:",
            "rA": [
                "Сохранения во внешней среде"
            ],
            "wA": [
                "Размножения",
                "Сопротивления защитным силам микроорганизма"
            ]
        },
        {
            "qID": 6,
            "qName": "Для выявления зерен волютина используется окраска по:",
            "rA": [
                "Нейссеру"
            ],
            "wA": [
                "Бурри",
                "Граму",
                "Цилю-Нильсону",
                "Ожешко"
            ]
        },
        {
            "qID": 7,
            "qName": "Для выявления капсул используется окраска по:",
            "rA": [
                "Бурри"
            ],
            "wA": [
                "Граму",
                "Цилю-Нильсону",
                "Нейссеру",
                "Ожешко"
            ]
        },
        {
            "qID": 8,
            "qName": "Пигменты бактерий выполняют следующие функции, кроме:",
            "rA": [
                "Выполнение каталитической функции"
            ],
            "wA": [
                "Защита от действия света",
                "Защита от действия инфракрасных лучей",
                "Антибиотические свойства"
            ]
        },
        {
            "qID": 9,
            "qName": "Бактериальную клетку от эукариотной отличают следующие признаки:",
            "rA": [
                "Отсутствие ядерной мембраны"
            ],
            "wA": [
                "Наличие эндоплазматической сети",
                "Наличие цитоплазматической мембраны"
            ]
        },
        {
            "qID": 10,
            "qName": "Пастеризацию используют для стерилизации:",
            "rA": [
                "Молочных продуктов"
            ],
            "wA": [
                "Бактериальных петель",
                "Питательных сред",
                "Стеклянной посуды",
                "Споросодержащего материала"
            ]
        },
        {
            "qID": 11,
            "qName": "Текущим паром стерилизуют:",
            "rA": [
                "Среды с аминокислотами"
            ],
            "wA": [
                "Простые питательные среды",
                "Бактериологические петли",
                "Пипетки, пробки, колбы"
            ]
        },
        {
            "qID": 12,
            "qName": "В лаг-фазе происходит:",
            "rA": [
                "адаптация микроорганизмов к питательной среде"
            ],
            "wA": [
                "быстрое размножение микроорганизмов",
                "быстрая гибель микроорганизмов",
                "выравнивание скорости размножения и скорости гибели"
            ]
        },
        {
            "qID": 13,
            "qName": "Для стерилизации одноразовых пластмассовых изделий медицинского назначения в промышленности применяют:",
            "rA": [
                "гамма излучение"
            ],
            "wA": [
                "УФО-излучение",
                "дробную стерилизацию",
                "стерилизацию текучим паром"
            ]
        },
        {
            "qID": 14,
            "qName": "Спорообразованием размножаются:",
            "rA": [
                "Актиномицеты"
            ],
            "wA": [
                "Бактерии",
                "Микоплазмы",
                "Микобактерии"
            ]
        },
        {
            "qID": 15,
            "qName": "Назовите микробы, не входящие в состав нормальной микрофлоры толстого кишечника:",
            "rA": [
                "шигеллы"
            ],
            "wA": [
                "лактобактерии",
                "бифидобактерии",
                "катенобактерии",
                "бактероиды",
                "эшерихии"
            ]
        },
        {
            "qID": 16,
            "qName": "Назовите микробы, не входящие в состав факультативной микрофлоры толстого кишечника:",
            "rA": [
                "бледная трепонема"
            ],
            "wA": [
                "клостридии",
                "синегнойная палочка",
                "энтеробактерии",
                "грибы кандида",
                "протей"
            ]
        },
        {
            "qID": 17,
            "qName": "Санитарно-показательными микробами для воды являются:",
            "rA": [
                "кишечная палочка"
            ],
            "wA": [
                "иерсении",
                "вирусы",
                "вибрионы",
                "микоплазмы"
            ]
        },
        {
            "qID": 18,
            "qName": "Коли-титр водопроводной воды должен быть:",
            "rA": [
                "больше 333"
            ],
            "wA": [
                "меньше 333",
                "333",
                "111",
                "меньше 111"
            ]
        },
        {
            "qID": 19,
            "qName": "Санитарно-показательными микробами для почвы являются:",
            "rA": [
                "клостридии"
            ],
            "wA": [
                "вирусы",
                "стафиллококки",
                "микоплазмы",
                "сарцины"
            ]
        },
        {
            "qID": 20,
            "qName": "Комменсализм – это форма симбиоза, при которой:",
            "rA": [
                "один организм живет за счет другого, не причиняя ему вреда"
            ],
            "wA": [
                "оба партнера получают взаимную выгоду"
            ]
        },
        {
            "qID": 21,
            "qName": "Метабиоз – это форма симбиоза, при которой:",
            "rA": [
                "один организм продолжает процесс, вызванный другим"
            ],
            "wA": [
                "два партнера получают взаимную выгоду"
            ]
        },
        {
            "qID": 22,
            "qName": "Микробный пейзаж тела человека представлен микробами кроме:",
            "rA": [
                "амминифицирующими микробами"
            ],
            "wA": [
                "транзиторными микробами",
                "условно-патогенными микробами",
                "постоянно живущими микробами"
            ]
        },
        {
            "qID": 23,
            "qName": "В кишечнике практически здоровых людей должны преобладать микроорганизмы:",
            "rA": [
                "анаэробные"
            ],
            "wA": [
                "аэробные",
                "микроаэрофильные",
                "факультативно-аэробные"
            ]
        },
        {
            "qID": 24,
            "qName": "Оксидоредуктазы:",
            "rA": [
                "Катализирует окислительно-восстановительные реакции."
            ],
            "wA": [
                "Отщепляет химические группы не гидролитическим путем.",
                "Вызывают расщепление протеинов, углеводов, липидов путем присоединения молекулы воды.",
                "Способствуют реакциям биосинтеза.",
                "Осуществляют перенос отдельных атомов от молекул к молекулам"
            ]
        },
        {
            "qID": 25,
            "qName": "Механизмы персистенции являются,  кроме:",
            "rA": [
                "Спорообразования"
            ],
            "wA": [
                "Инактивация факторами",
                "Капсула",
                "К-антиген",
                "Антигенная мимикрия"
            ]
        },
        {
            "qID": 26,
            "qName": "Поступление питательных веществ в клетку осуществляется различными путями, кроме:",
            "rA": [
                "Переноса отдельных атомов от молекул к молекулам"
            ],
            "wA": [
                "Активного транспорта",
                "Простой диффузии",
                "Транслокации групп"
            ]
        },
        {
            "qID": 27,
            "qName": "Пассивный транспорт идет:",
            "rA": [
                "Без затрат энергии"
            ],
            "wA": [
                "С затратой энергии",
                "С участием пермиаз"
            ]
        },
        {
            "qID": 28,
            "qName": "Экзоферменты:",
            "rA": [
                "Катализируют внутриклеточный метаболизм"
            ],
            "wA": [
                "Не выделятся в окружающую среду",
                "Не расщепляют макромолекул"
            ]
        },
        {
            "qID": 29,
            "qName": "Основной питательной средой являются:",
            "rA": [
                "Мясопептонный агар"
            ],
            "wA": [
                "Кровяной агар",
                "Сывороточный МПА",
                "Сахарный МПБ"
            ]
        },
        {
            "qID": 30,
            "qName": "Атигенами аденовирусов являются все,  кроме:",
            "rA": [
                "Н-антиген"
            ],
            "wA": [
                "А-антиген",
                "С-антиген",
                "В-антиген"
            ]
        },
        {
            "qID": 31,
            "qName": "Ферменты агрессии:",
            "rA": [
                "Коллагеназа"
            ],
            "wA": [
                "Не разрушают ткани",
                "Не разрушают клеток",
                "Эндоферменты"
            ]
        },
        {
            "qID": 32,
            "qName": "При подозрении на лептоспироз не исследуют:",
            "rA": [
                "Мазок из зева"
            ],
            "wA": [
                "Кровь",
                "Мочу",
                "Ликвор",
                "Воду"
            ]
        },
        {
            "qID": 33,
            "qName": "Для специфической профилактики инфекции применяются кроме:",
            "rA": [
                "Антибиотики"
            ],
            "wA": [
                "Сыворотки",
                "Гамма-глобулин",
                "Бактериофаги"
            ]
        },
        {
            "qID": 34,
            "qName": "Назовите путь передачи холеры:",
            "rA": [
                "Алиментарный"
            ],
            "wA": [
                "Воздушно - капельный",
                "Трансмиссивный",
                "Воздушно - полевой",
                "Вертикальный"
            ]
        },
        {
            "qID": 35,
            "qName": "К какому виду инфекции относится холера:",
            "rA": [
                "Особо опасная"
            ],
            "wA": [
                "Госпитальная",
                "Зоонозная",
                "Аутоинфекция",
                "Хроническая"
            ]
        },
        {
            "qID": 36,
            "qName": "Какой путь передачи возбудителя наиболее часто вызывает развитие эпидемии:",
            "rA": [
                "Аэрогенный"
            ],
            "wA": [
                "Трансмиссивный",
                "Половой"
            ]
        },
        {
            "qID": 37,
            "qName": "Какая из нижеперечисленных бактерий не является возбудителем зоонозов:",
            "rA": [
                "Bacillus subtilis"
            ],
            "wA": [
                "Brucella melitensis",
                "Francisella tularensis",
                "Bacillus anthracis",
                "Yersinia pestis"
            ]
        },
        {
            "qID": 38,
            "qName": "Вакцины-это:",
            "rA": [
                "Антиген"
            ],
            "wA": [
                "Антитела",
                "Сыворотка"
            ]
        },
        {
            "qID": 39,
            "qName": "Из чего не получают вакцины:",
            "rA": [
                "Из иммунных сывороток"
            ],
            "wA": [
                "Из микроорганизмов",
                "Из вирусов",
                "Из токсинов"
            ]
        },
        {
            "qID": 40,
            "qName": "Механизм действия  альфа-интерферона:",
            "rA": [
                "Ингибирование синтеза белка"
            ],
            "wA": [
                "Ингибирование адсорбции вируса",
                "Ингибирование раздевания вируса"
            ]
        },
        {
            "qID": 41,
            "qName": "Методы определения антибиотико чувствительности кроме:",
            "rA": [
                "Биологический"
            ],
            "wA": [
                "Метод индикаторных дисков",
                "Метод серийных разведений"
            ]
        },
        {
            "qID": 42,
            "qName": "Фаговая конверсия-это:",
            "rA": [
                "Приобритение токсигенности"
            ],
            "wA": [
                "Потеря вирулентности",
                "Потеря токсигенности"
            ]
        },
        {
            "qID": 43,
            "qName": "Антибиотики вызывают следующие побочные действия, кроме:",
            "rA": [
                "Воспалительных реакций"
            ],
            "wA": [
                "Развития аллергических реакций",
                "Дисбактериоза",
                "Нарушение формирования полноценного иммунитета",
                "Токсических реакций"
            ]
        },
        {
            "qID": 44,
            "qName": "Антибиотики - это:",
            "rA": [
                "Продукты метоболизма бактерий"
            ],
            "wA": [
                "Продукты метоболизма лейкоцитов",
                "Продукты метоболизма вирусов",
                "Продукты метоболизма простейших"
            ]
        },
        {
            "qID": 45,
            "qName": "Плазмиды – это:",
            "rA": [
                "Фрагмент ДНК"
            ],
            "wA": [
                "Разновидность включений в цитоплазму",
                "Аналог цитоплазматического ретикулума",
                "РНК"
            ]
        },
        {
            "qID": 46,
            "qName": "Антибиотикоустойчивость определяется:",
            "rA": [
                "R-плазмидой"
            ],
            "wA": [
                "F-плазмидой",
                "Бактериальной плазмидой",
                "Транспозоном",
                "IS-последовательностью"
            ]
        },
        {
            "qID": 47,
            "qName": "В конъюгации участвует:",
            "rA": [
                "Пили 2 типа"
            ],
            "wA": [
                "Пили 1 типа",
                "Умеренные фаги",
                "Профаги"
            ]
        },
        {
            "qID": 48,
            "qName": "Способность бактерий к конъюгации связана с наличием:",
            "rA": [
                "Половых пилей"
            ],
            "wA": [
                "Жгутиков",
                "Пилей общего типа",
                "РНК"
            ]
        },
        {
            "qID": 49,
            "qName": "Конъюгация генетически детерминирована:",
            "rA": [
                "F-плазмидой"
            ],
            "wA": [
                "Профагом",
                "Хромосомной мутацией",
                "Транспозонами"
            ]
        },
        {
            "qID": 50,
            "qName": "Стерилизация сухим жаром проводится:",
            "rA": [
                "В печи Пастера"
            ],
            "wA": [
                "В автоклаве",
                "На водяной бане",
                "В аппарате Коха",
                "С помощью УФО"
            ]
        },
        {
            "qID": 51,
            "qName": "Оптимальная температура для возбудителя чумы:",
            "rA": [
                "25 градусов"
            ],
            "wA": [
                "37градусов",
                "42 градусов"
            ]
        },
        {
            "qID": 52,
            "qName": "Основные признаки плазмид,  кроме:",
            "rA": [
                "Расположение   только в  составе хромосомы"
            ],
            "wA": [
                "Автономность репликации",
                "Трансмиссивность",
                "Расположение в составе хомосомы и в цитоплазме"
            ]
        },
        {
            "qID": 53,
            "qName": "Локализация персистенции вируса полиомиелита:",
            "rA": [
                "Эпителии кишечника"
            ],
            "wA": [
                "Макрофаги",
                "ЦНС",
                "Фибробласты"
            ]
        },
        {
            "qID": 54,
            "qName": "Грамотрицательные бактерии:",
            "rA": [
                "энтеробактерии"
            ],
            "wA": [
                "коринебактерии",
                "микобактерии",
                "бациллы"
            ]
        },
        {
            "qID": 55,
            "qName": "Грамположительные бактерии:",
            "rA": [
                "бациллы"
            ],
            "wA": [
                "менингококки",
                "кишечные палочки",
                "вибрионы",
                "спирохеты"
            ]
        },
        {
            "qID": 56,
            "qName": "Живая вакцина против полиомиелита содержит:",
            "rA": [
                "Раствор высокодисперсных антигенов"
            ],
            "wA": [
                "Смесь двух типов вируса",
                "Взвесь убитых вирусов"
            ]
        },
        {
            "qID": 57,
            "qName": "Энтеровирус типа 70 не имеет тропизма к:",
            "rA": [
                "эпителиям  кожи"
            ],
            "wA": [
                "эпителиям конъюнктивы",
                "эпителиям роговицы",
                "нейронам спинного мозга"
            ]
        },
        {
            "qID": 58,
            "qName": "Энтеровирус типа 71 вызывает:",
            "rA": [
                "Асептический менингит и энцефалит"
            ],
            "wA": [
                "Конъюнктивит",
                "ОРВИ",
                "Пневмонию"
            ]
        },
        {
            "qID": 59,
            "qName": "Первый принцип лабораторной диагностики инфекционных заболеваний:",
            "rA": [
                "Обнаружение возбудителя"
            ],
            "wA": [
                "Определение специфических изменений в организме",
                "Определение антител",
                "Определение ГЗТ"
            ]
        },
        {
            "qID": 60,
            "qName": "К второму  принципу лабораторной диагностики инфекционных заболеваний не относятся:",
            "rA": [
                "Обнаружение ДНК вирусов"
            ],
            "wA": [
                "Определение специфических изменений в организме",
                "Определение антител",
                "Определение ГЗТ"
            ]
        },
        {
            "qID": 61,
            "qName": "Is-последовательности  - это:",
            "rA": [
                "ФрагментДНК"
            ],
            "wA": [
                "Фрагмент РНК",
                "Разновидность включений в цитоплазму",
                "Аналог цитоплазматического ретикулума"
            ]
        },
        {
            "qID": 62,
            "qName": "Вирус натуральной оспы не передается:",
            "rA": [
                "Половым путем"
            ],
            "wA": [
                "Воздушно-капельным путем",
                "Воздушно-пылевым путем",
                "Контактно-бытовым путем"
            ]
        },
        {
            "qID": 63,
            "qName": "Вирус натуральной оспы характеризуется наличием:",
            "rA": [
                "Образованием телец Гварниери"
            ],
            "wA": [
                "РНК",
                "Образованием телец Бабеша-Негри",
                "Обратной траскриптазы"
            ]
        },
        {
            "qID": 64,
            "qName": "РСК Борде-Жангу  используются для серодиагностики:",
            "rA": [
                "Хронической гонореи"
            ],
            "wA": [
                "Сифилиса",
                "Острой гонореи",
                "Брюшного тифа"
            ]
        },
        {
            "qID": 65,
            "qName": "РСК Вассермана  используются для серодиагностики:",
            "rA": [
                "Сифилиса"
            ],
            "wA": [
                "Острой гонореи",
                "Хронической гонореи",
                "Бршного тифа"
            ]
        },
        {
            "qID": 66,
            "qName": "Ранняя диагностика брюшного тифа:",
            "rA": [
                "Выделение гемокультуры в 1 неделю заболевания"
            ],
            "wA": [
                "Выделение гемокультуры",
                "Выделение копрокультуры",
                "Выделение уринокультуры"
            ]
        },
        {
            "qID": 67,
            "qName": "Эффекторы специфической антимикробной защиты:",
            "rA": [
                "Антитела"
            ],
            "wA": [
                "Антигены",
                "Фагоциты",
                "Комплемент"
            ]
        },
        {
            "qID": 68,
            "qName": "Специфические антиадгезины в системе колонизационной резистентности слизистых оболочек:",
            "rA": [
                "Антитела"
            ],
            "wA": [
                "Лизоцим",
                "Фагоциты",
                "Комплемент"
            ]
        },
        {
            "qID": 69,
            "qName": "Не являются антимикробными факторами секретов слизистых оболочек:",
            "rA": [
                "Апаптоз микроорганизмов"
            ],
            "wA": [
                "Лизоцим",
                "Лактоферрин",
                "Катионные белки",
                "Нормальная микрофлора"
            ]
        },
        {
            "qID": 70,
            "qName": "Положительные аллергические пробы выявляют:",
            "rA": [
                "Наличие возбудителя в организме"
            ],
            "wA": [
                "Наличие стерильного иммунитета",
                "Гуморального иммунитета",
                "Врожденного иммунитета"
            ]
        },
        {
            "qID": 71,
            "qName": "Механизм антивирусной активности антител:",
            "rA": [
                "Антителозависимая цитотоксичность"
            ],
            "wA": [
                "Подавление вирогении",
                "МНС-зависимое распознавание инфицированных клеток."
            ]
        },
        {
            "qID": 72,
            "qName": "Факторы, функциональная кооперация которых является основной при внутримакрофагальных инфекциях:",
            "rA": [
                "Т-лимфоциты"
            ],
            "wA": [
                "Антитела",
                "Нейтрофилы",
                "Комплемент"
            ]
        },
        {
            "qID": 73,
            "qName": "Эффекторы антитоксического иммунитета:",
            "rA": [
                "Антитела"
            ],
            "wA": [
                "Макрофаги",
                "Комплемент",
                "Т-лимфоциты"
            ]
        },
        {
            "qID": 74,
            "qName": "Факторы, функциональная кооперация которых не является основой иммунитета против пиогенных инфекций:",
            "rA": [
                "Т-лимфоциты."
            ],
            "wA": [
                "Нейтрофилы",
                "Антитела",
                "Комплемент"
            ]
        },
        {
            "qID": 75,
            "qName": "Основной метод микробиологической диагностики прионных болезней:",
            "rA": [
                "Вирусологический"
            ],
            "wA": [
                "Микроскопический",
                "Метод Здродовского",
                "Метод Романовского-Гимзе"
            ]
        },
        {
            "qID": 76,
            "qName": "Прионы  - это:",
            "rA": [
                "особые инфекционные агенты белковой природы"
            ],
            "wA": [
                "РНК-содержащие частицы.",
                "нитевидные микроорганизмы",
                "Риккетсии"
            ]
        },
        {
            "qID": 77,
            "qName": "Болезнь Лайма вызывает:",
            "rA": [
                "Borrelia burgdorferi"
            ],
            "wA": [
                "Mycobacterium Kansasii",
                "Mycobacterium. leprae",
                "Mycobacterium  avium"
            ]
        },
        {
            "qID": 78,
            "qName": "Основной микроскопический метод выявления возбудителя Лаймы:",
            "rA": [
                "метод Романовского-Гимзе"
            ],
            "wA": [
                "метод Ожешко",
                "метод Здродовского",
                "метод Грама"
            ]
        },
        {
            "qID": 79,
            "qName": "Профилактика болезни Лайма основана на:",
            "rA": [
                "Предупреждение укусов клещей"
            ],
            "wA": [
                "Вакцинопрофилактика (убитая вакцина)",
                "Введении лепромина А."
            ]
        },
        {
            "qID": 80,
            "qName": "Для лабораторной диагностики 1-й стадии болезни Лайма используют материал:",
            "rA": [
                "Cоскоб с очагов кожных поражений"
            ],
            "wA": [
                "Кровь",
                "Спинно-мозговую жидкость",
                "Сыворотка крови"
            ]
        },
        {
            "qID": 81,
            "qName": "Природным резервуаром возбудителя болезни Лайма является:",
            "rA": [
                "Мелкие грызуны, олени и лоси"
            ],
            "wA": [
                "Человек",
                "Иксодовый клещ"
            ]
        },
        {
            "qID": 82,
            "qName": "На месте укуса клеща при  болезни Лайма образуется:",
            "rA": [
                "Красная папула"
            ],
            "wA": [
                "Твердый шанкр.",
                "Мягкий шанкр",
                "Экзема"
            ]
        },
        {
            "qID": 83,
            "qName": "Borrelia burgdorferi  относятся к:",
            "rA": [
                "Извитым формам"
            ],
            "wA": [
                "Коккам",
                "Палочковидным бактериям",
                "Нитевидным"
            ]
        },
        {
            "qID": 84,
            "qName": "Какой вирус гепатита может передаваться через плаценту только в случае высокой вирусемии:",
            "rA": [
                "Вирус гепатита С"
            ],
            "wA": [
                "Вирус гепатита А",
                "Вирус гепатита В",
                "Вирус гепатита D",
                "Вирус гепатита Е"
            ]
        },
        {
            "qID": 85,
            "qName": "Начиная с какой стадии болезни Лайма осуществляется определение Ig M или нарастания титра IgG:",
            "rA": [
                "2-стадия"
            ],
            "wA": [
                "1-стадия",
                "3-стадия"
            ]
        },
        {
            "qID": 86,
            "qName": "Из какого биологического материала можно выделить  Listeria  interrogans в 1-ую неделю лептоспироза?:",
            "rA": [
                "Крови"
            ],
            "wA": [
                "Ликвора",
                "Мочи",
                "Испражнений"
            ]
        },
        {
            "qID": 87,
            "qName": "Отличия вирусов ЕСНО от Коксаки:",
            "rA": [
                "Не вызывает заболевание у мышей"
            ],
            "wA": [
                "Наличие РНК",
                "Наличие капсида",
                "Наличие суперкапсида"
            ]
        },
        {
            "qID": 88,
            "qName": "Метод обнаружения специфических изменений при гепатите А:",
            "rA": [
                "Определение антител в сыворотке кров"
            ],
            "wA": [
                "Выявление РНК вируса",
                "Выявление антигена вируса"
            ]
        },
        {
            "qID": 89,
            "qName": "Второй принцип лабораторной диагностики гепатита С:",
            "rA": [
                "Определение антител в сыворотке крови"
            ],
            "wA": [
                "Выявление РНК вируса",
                "Выявление антигена вируса",
                "Выявление возбудителя"
            ]
        },
        {
            "qID": 90,
            "qName": "Источники заражения гепатитом Е:",
            "rA": [
                "Больной человек и вирусоноситель"
            ],
            "wA": [
                "Животные (больные и вирусоносители)",
                "Инфицированные пищевые продукты",
                "Вода"
            ]
        },
        {
            "qID": 91,
            "qName": "Пути заражения гепатитом Е:",
            "rA": [
                "Алиментарный"
            ],
            "wA": [
                "Парентеральный",
                "Вертикальный",
                "Трансмиссивный"
            ]
        },
        {
            "qID": 92,
            "qName": "Специфическая профилактика гепатита А:",
            "rA": [
                "Инактивированная вакцина"
            ],
            "wA": [
                "Живая вакцина",
                "Химическая вакцина",
                "Рекомбинантная  вакцина"
            ]
        },
        {
            "qID": 93,
            "qName": "Основной  путь заражения гепатитом С:",
            "rA": [
                "Парентеральный"
            ],
            "wA": [
                "Контактно-бытовой",
                "Алиментарный",
                "Трансмиссивный"
            ]
        },
        {
            "qID": 94,
            "qName": "Иммунитет при гепатите С:",
            "rA": [
                "Слабонапряженный"
            ],
            "wA": [
                "Напряженный гуморальный",
                "Напряженный клеточный",
                "Инфекционный"
            ]
        },
        {
            "qID": 95,
            "qName": "Антигенная структура вируса гепатита С не включает антигены:",
            "rA": [
                "HBs ag"
            ],
            "wA": [
                "С- core антигена",
                "NS 2-5",
                "gpE1 -2"
            ]
        },
        {
            "qID": 96,
            "qName": "В хронически инфицированных клетках ДНК вируса гепатита В может находится:",
            "rA": [
                "В ДНК клетки- хозяина"
            ],
            "wA": [
                "В клеточной стенке гепатоцитов",
                "В цитоплазме клеток"
            ]
        },
        {
            "qID": 97,
            "qName": "Не могут  реплицироваться во  внепеченочных клетках:",
            "rA": [
                "Вирус гепатита D"
            ],
            "wA": [
                "Вирус гепатита А",
                "Вирус гепатита В",
                "Вирус гепатита С",
                "Вирус гепатита Е"
            ]
        },
        {
            "qID": 98,
            "qName": "Специфическая профилактика гепатита D:",
            "rA": [
                "Не разработана"
            ],
            "wA": [
                "Живая вакцина",
                "Химическая вакцина",
                "Рекомбинантная  вакцина",
                "Инактивированная вакцина"
            ]
        },
        {
            "qID": 99,
            "qName": "У вируса гепатита D нет:",
            "rA": [
                "Собственного суперкапсида"
            ],
            "wA": [
                "Нуклеиновой кислот",
                "Суперкапсида",
                "РНК"
            ]
        },
        {
            "qID": 100,
            "qName": "Основной фактор передачи вируса гепатита С  - это:",
            "rA": [
                "Кровь"
            ],
            "wA": [
                "Пища",
                "Вода",
                "Молоко",
                "Воздух"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
