var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Назовите элективную среду для стафилококков:",
            "rA": [
                "Агар с 10% хлористого натрия"
            ],
            "wA": [
                "Агар с 6,5% хлористого натрия",
                "Сывороточный агар",
                "Щелочной агар",
                "Шоколадный агар"
            ]
        },
        {
            "qID": 2,
            "qName": "Идентификация стафилококка  не проводится по:",
            "rA": [
                "Аллергической пробе"
            ],
            "wA": [
                "Ферменту плазмокоагулазе",
                "Капсулообразованию",
                "Цвету колонии на среде Плоскирева",
                "Росту на бессывороточном агаре"
            ]
        },
        {
            "qID": 3,
            "qName": "Какие патогенные микробы могут быть обнаружены в гнойной ране:",
            "rA": [
                "Эшерихии"
            ],
            "wA": [
                "Франциселлы",
                "Бруцеллы",
                "Коринебактерии"
            ]
        },
        {
            "qID": 4,
            "qName": "После перенесения дифтерии иммунитет:",
            "rA": [
                "Антитоксический, антибактериальный"
            ],
            "wA": [
                "Инфекционный",
                "Нестирильный",
                "Слабо напряженный"
            ]
        },
        {
            "qID": 5,
            "qName": "Для профилактики внутрибольничных инфекций необходимо все перечисленное, кроме:",
            "rA": [
                "Проведения вакцинации больных"
            ],
            "wA": [
                "Соблюдения нормы санитарно-показательных микроорганизмов для лечебных учреждений",
                "Проведения контроля стерильности лекарственных средств",
                "Повышения качества медицинского обслуживания больных",
                "Проведения бактериологического исследования персонала"
            ]
        },
        {
            "qID": 6,
            "qName": "Назовите основной метод диагностики хронической гонореи:",
            "rA": [
                "РСК Борде-Жангу"
            ],
            "wA": [
                "Микроскопия мазков",
                "РСК Вассермана",
                "Аллергическая проба",
                "Биопроба"
            ]
        },
        {
            "qID": 7,
            "qName": "Назовите метод диагностики острой гонореи:",
            "rA": [
                "Микроскопия мазков"
            ],
            "wA": [
                "РСК Борде-Жангу",
                "РСК Вассермана",
                "Аллергическая проба",
                "Биопроба"
            ]
        },
        {
            "qID": 8,
            "qName": "Терминальное расположение спор характерно для:",
            "rA": [
                "Clostridium tetani"
            ],
            "wA": [
                "Bacillus anthracis",
                "Klostridium botulinum",
                "Bacillus subtilis",
                "Bacillus cereus"
            ]
        },
        {
            "qID": 9,
            "qName": "Основной фактор патогенности возбудителя ботулизма:",
            "rA": [
                "Экзотоксин"
            ],
            "wA": [
                "Жгутики",
                "Эндотоксин",
                "Капсула",
                "Протеолитические ферменты"
            ]
        },
        {
            "qID": 10,
            "qName": "Для экстренной профилактики и лечения анаэробных инфекции используют:",
            "rA": [
                "Антитоксические сыворотки"
            ],
            "wA": [
                "Интерферон",
                "Анатоксин",
                "Живую вакцину"
            ]
        },
        {
            "qID": 11,
            "qName": "Менингококк растет:",
            "rA": [
                "При 37º на сывороточном агаре"
            ],
            "wA": [
                "При 37º на бессывороточном агаре",
                "при 22º на сывороточном агаре",
                "На кровяном агаре",
                "На желточно- солевом агаре"
            ]
        },
        {
            "qID": 12,
            "qName": "Возбудителями коклюша являются:",
            "rA": [
                "Бордетеллы"
            ],
            "wA": [
                "Иерсинии",
                "Шигеллы",
                "Франциселлы",
                "Серрации"
            ]
        },
        {
            "qID": 13,
            "qName": "Дифтерийный анатоксин применяется:",
            "rA": [
                "Для создания активного антитоксического иммунитета"
            ],
            "wA": [
                "В лечебных целях",
                "С целью диагностики",
                "Для идентификации бактерий",
                "Для создания пассивного иммунитета"
            ]
        },
        {
            "qID": 14,
            "qName": "При бактериоскопической диагностике туберкулеза используют:",
            "rA": [
                "Метод Циль - Нильсена"
            ],
            "wA": [
                "Метод Бурри",
                "Метод Нейссера",
                "Метод «висячей капли»",
                "Метод Грамма"
            ]
        },
        {
            "qID": 15,
            "qName": "Исследуемым материалом при менингите является все, кроме:",
            "rA": [
                "Ликвора"
            ],
            "wA": [
                "Крови",
                "Носоглоточного материала",
                "Мочи"
            ]
        },
        {
            "qID": 16,
            "qName": "Вакцина БЦЖ - это:",
            "rA": [
                "Ослабленная культура M.bovis"
            ],
            "wA": [
                "Убитая культура",
                "Ослабленная культура",
                "Убитая культура",
                "Химическая вакцина"
            ]
        },
        {
            "qID": 17,
            "qName": "Менингококк не вызывает:",
            "rA": [
                "Колиэнтерит"
            ],
            "wA": [
                "Менингит",
                "Назофарингит",
                "Артрит",
                "Сепсис"
            ]
        },
        {
            "qID": 18,
            "qName": "Противодифтерийная антитоксическая сыворотка применяется:",
            "rA": [
                "Для создания пассивного иммунитета"
            ],
            "wA": [
                "Для создания активного иммунитета",
                "С целью диагностики"
            ]
        },
        {
            "qID": 19,
            "qName": "При бактериологической диагностике дифтерии используют:",
            "rA": [
                "Среду Клауберга"
            ],
            "wA": [
                "Среду Левенштейна - Йенсена",
                "Сахарный агар",
                "Среду Плоскирева",
                "МПБ"
            ]
        },
        {
            "qID": 20,
            "qName": "Назовите морфологические признаки коринебактерии дифтерии:",
            "rA": [
                "палочки с булавовидными утолщениями, расположенные под углом"
            ],
            "wA": [
                "Ветвящиеся тонкие нити",
                "Кислотоустойчивые полиморфные палочки",
                "Грамотрицательные диплококки",
                "Палочки овоидной формой с биполярной окраской"
            ]
        },
        {
            "qID": 21,
            "qName": "Для создания активного антитоксического иммунитета против дифтерии используют:",
            "rA": [
                "Дифтерийный анатоксин"
            ],
            "wA": [
                "Убитую вакцину",
                "Противодифтерийную антитоксическую сыворотку",
                "Дифтерийный токсин",
                "Ослабленную культуру коринебактерий"
            ]
        },
        {
            "qID": 22,
            "qName": "Для создания клеточного иммунитета  используют:",
            "rA": [
                "БЦЖ вакцину"
            ],
            "wA": [
                "Убитую вакцину",
                "Противодифтерийную антитоксическую сыворотку",
                "Дифтерийный  анатоксин"
            ]
        },
        {
            "qID": 23,
            "qName": "Для ранней диагностики брюшного тифа исследуют:",
            "rA": [
                "Кровь"
            ],
            "wA": [
                "мочу",
                "Мокроту",
                "Испражнения",
                "Слизь из зева"
            ]
        },
        {
            "qID": 24,
            "qName": "Назовите среду обогащения для сальмонелл:",
            "rA": [
                "Среда Раппопорт"
            ],
            "wA": [
                "МПА",
                "Среда Плоскирева",
                "Среда Эндо",
                "Среда Левина"
            ]
        },
        {
            "qID": 25,
            "qName": "Наиболее устоичивы во внешней среде шигеллы вида:",
            "rA": [
                "Зонне"
            ],
            "wA": [
                "Дизентерии",
                "Флекснера",
                "Бойда"
            ]
        },
        {
            "qID": 26,
            "qName": "Назвать вид бактерий, не способный к пигментообразованию:",
            "rA": [
                "Shigella"
            ],
            "wA": [
                "Sarcina",
                "Pseudomonas  aeruginosa",
                "Staphylococcus"
            ]
        },
        {
            "qID": 27,
            "qName": "Наиболее часто заболевания мочевыводящей системы вызывают:",
            "rA": [
                "Chlamidia  trachomatis"
            ],
            "wA": [
                "Микобактерии",
                "Условно – патогенные энтеробактерии",
                "Сальмонеллы",
                "Шигеллы"
            ]
        },
        {
            "qID": 28,
            "qName": "Назовите характер роста протея:",
            "rA": [
                "Ползучий рост"
            ],
            "wA": [
                "Колонии с красным пигментом",
                "Колонии питательная среда окрашена в синий свет",
                "Колонии с золотистым пигментом",
                "Колонии бесцветные"
            ]
        },
        {
            "qID": 29,
            "qName": "Назовите дифференцирующий признак для Klebsiella  pneumoniae",
            "rA": [
                "Капсулообразование"
            ],
            "wA": [
                "Пигментообразование",
                "Плазмокоагулазная активность",
                "Рост на кровяном агаре"
            ]
        },
        {
            "qID": 30,
            "qName": "Плазмиды среди бактерии не распространяются:",
            "rA": [
                "От бактерии к вирусам"
            ],
            "wA": [
                "По вертикали",
                "По горизонтали"
            ]
        },
        {
            "qID": 31,
            "qName": "Возбудители особоопасных инфекций относятся к группе риска:",
            "rA": [
                "1 - я"
            ],
            "wA": [
                "2 - я",
                "3 – я",
                "4 - я"
            ]
        },
        {
            "qID": 32,
            "qName": "Работа с возбудителями особоопасных инфекций  проводятся в лаборатории",
            "rA": [
                "Базовых"
            ],
            "wA": [
                "Специальных",
                "Особого режима",
                "Режимных"
            ]
        },
        {
            "qID": 33,
            "qName": "Какой путь передачи возбудителя наиболее часто вызывает развитие эпидемии:",
            "rA": [
                "Аэрогенный"
            ],
            "wA": [
                "Трансмиссивный",
                "Половой"
            ]
        },
        {
            "qID": 34,
            "qName": "Какая из нижеперечисленных бактерий не является возбудителем зоонозов:",
            "rA": [
                "Bacillus subtilis"
            ],
            "wA": [
                "Brucella melitensis",
                "Francisella tularensis",
                "Bacillus anthracis",
                "Yersinia pestis"
            ]
        },
        {
            "qID": 35,
            "qName": "Для возбудителя холеры характерны:",
            "rA": [
                "Монотрихи"
            ],
            "wA": [
                "Образуют споры",
                "Образуют капсулы",
                "Лофотрихи",
                "Перитрихи"
            ]
        },
        {
            "qID": 36,
            "qName": "Назовите путь передачи холеры:",
            "rA": [
                "Алиментарный"
            ],
            "wA": [
                "Воздушно - капельный",
                "Трансмиссивный",
                "Воздушно - полевой",
                "Вертикальный"
            ]
        },
        {
            "qID": 37,
            "qName": "К какому виду инфекции относится холера:",
            "rA": [
                "Особо опасная"
            ],
            "wA": [
                "Госпитальная",
                "Зоонозная",
                "Аутоинфекция",
                "Хроническая"
            ]
        },
        {
            "qID": 38,
            "qName": "К семейству Spirochaetaceae относятся следующие роды, кроме:",
            "rA": [
                "Leptospira"
            ],
            "wA": [
                "Spirochaeta",
                "Borrelia",
                "Treponema"
            ]
        },
        {
            "qID": 39,
            "qName": "К патогенным спирохетам не относится род:",
            "rA": [
                "Crystyspira"
            ],
            "wA": [
                "Borrelia",
                "Treponema",
                "Leptospira"
            ]
        },
        {
            "qID": 40,
            "qName": "Какой из дрожжеподобных грибов чаще вызывает кандидоз:",
            "rA": [
                "Candida albicans"
            ],
            "wA": [
                "Candida tropicalis",
                "Candida krusei",
                "Candida pseudotropicalis"
            ]
        },
        {
            "qID": 41,
            "qName": "Элективной средой для Candida albicans является:",
            "rA": [
                "Среда Сабуро"
            ],
            "wA": [
                "Среда Эндо",
                "Среда Плоскирева",
                "Среда Левина",
                "Среда Клауберга"
            ]
        },
        {
            "qID": 42,
            "qName": "Септицемия-это:",
            "rA": [
                "Размножение бактерии в крови"
            ],
            "wA": [
                "Размножение бактерии во внутренних органах",
                "Размножение бактерии во внутренних органах и в крови",
                "Циркуляция токсинов в крови"
            ]
        },
        {
            "qID": 43,
            "qName": "Низшие грибы образуют:",
            "rA": [
                "Мицелий не септированный"
            ],
            "wA": [
                "Мицелий септированный"
            ]
        },
        {
            "qID": 44,
            "qName": "К прокариотам не относятся:",
            "rA": [
                "Простейшие"
            ],
            "wA": [
                "Микоплазмы",
                "Хламидии",
                "Спирохеты",
                "Цианобактерии"
            ]
        },
        {
            "qID": 45,
            "qName": "Для культивирования хламидий  используют:",
            "rA": [
                "Культуру ткани"
            ],
            "wA": [
                "Сывороточный агар",
                "Среду Эндо",
                "Сахарный агар",
                "Среду Клауберга"
            ]
        },
        {
            "qID": 46,
            "qName": "Хламидии относятся:",
            "rA": [
                "К грамотрицательным бактериям"
            ],
            "wA": [
                "К вирусам",
                "К грамположительным бактериям"
            ]
        },
        {
            "qID": 47,
            "qName": "Колонии микоплазмы являются:",
            "rA": [
                "В виде «глазуньи»"
            ],
            "wA": [
                "Появляются через 24 часа",
                "Округлой формы",
                "R-колонии"
            ]
        },
        {
            "qID": 48,
            "qName": "Какой из указанных методов не применяется в диагностике вирусных инфекций:",
            "rA": [
                "Бактериоскопический"
            ],
            "wA": [
                "Серологический",
                "Вирусоскопический",
                "Заражение лабораторных животных",
                "Метод тканевых культур"
            ]
        },
        {
            "qID": 49,
            "qName": "Полуперевиваемые тканевые культуры получают из:",
            "rA": [
                "Ткани эмбриона человека"
            ],
            "wA": [
                "Нормальной ткани человека",
                "Нормальной ткани животного",
                "Опухолевой ткани"
            ]
        },
        {
            "qID": 50,
            "qName": "Перевиваемые тканевые культуры получают из:",
            "rA": [
                "Опухолевой ткани"
            ],
            "wA": [
                "Нормальной ткани человека",
                "Нормальной ткани животного",
                "Ткани эмбриона человека"
            ]
        },
        {
            "qID": 51,
            "qName": "Вирусы отличаются от риккетсий:",
            "rA": [
                "Дизъюнктивным способом размножения"
            ],
            "wA": [
                "Сферической формой",
                "Палочковидной формой",
                "Внутриклеточным паразитизмом",
                "Сперматозоидной формой"
            ]
        },
        {
            "qID": 52,
            "qName": "Каким методом нельзя определить размеры вириона:",
            "rA": [
                "Иммунодиффузии в агар"
            ],
            "wA": [
                "Ультрафильтрации",
                "Седиментации",
                "Ультрацентрифугированием"
            ]
        },
        {
            "qID": 53,
            "qName": "Какое семейство вирусов не относится к ДНК-содержащим?",
            "rA": [
                "Picornoviridae"
            ],
            "wA": [
                "Poxviridae",
                "Herpesviridae",
                "Adenoviridae",
                "Hepadnoviridae"
            ]
        },
        {
            "qID": 54,
            "qName": "Какое семейство вирусов не относится к РНК-содержащим?",
            "rA": [
                "Adenoviridae"
            ],
            "wA": [
                "Bunyamviridae",
                "Togaviridae",
                "Picornoviridae",
                "Rhabdoviridae"
            ]
        },
        {
            "qID": 55,
            "qName": "Какая стадия отсутствует в репродукции вирусов:",
            "rA": [
                "Бинарное деление"
            ],
            "wA": [
                "Неспецифическая адсорбция",
                "Специфическая адсорбция",
                "Синтез вирусных белков",
                "Сборка вириона"
            ]
        },
        {
            "qID": 56,
            "qName": "Персистенция вирусов – это:",
            "rA": [
                "Длительное пребывание вирусов в организме"
            ],
            "wA": [
                "Появление антител к антигенам вируса",
                "Исследование сыворотки крови"
            ]
        },
        {
            "qID": 57,
            "qName": "Какой из методов не применяется при культивировании вирусов:",
            "rA": [
                "Культивирование на элективных средах"
            ],
            "wA": [
                "Заражение  восприимчивых животных",
                "Заражение куриного эмбриона",
                "Культивирование в первичных тканевых культурах",
                "Культивирование в перевиваемых тканевых культурах"
            ]
        },
        {
            "qID": 58,
            "qName": "Какой из методов не используется при индикации вирусов:",
            "rA": [
                "Реакция опсонизации"
            ],
            "wA": [
                "Определение ЦПД",
                "Реакция гемадсорбции",
                "Реакция гемагглютинации",
                "Бляшкообразование"
            ]
        },
        {
            "qID": 59,
            "qName": "Первично-трипсинизированные культуры клеток выдерживают:",
            "rA": [
                "5-10 пассажей"
            ],
            "wA": [
                "10-15 пассажей",
                "15-20 пассажей",
                "20-25 пассажей",
                "25-30 пассажей"
            ]
        },
        {
            "qID": 60,
            "qName": "Перевиваемые тканевые культуры обладают следующими свойствами, кроме одного:",
            "rA": [
                "Получаются из опухолевых клеток"
            ],
            "wA": [
                "Применяется в течение одной генерации",
                "Используются в научных целях",
                "Используются в диагностических целях"
            ]
        },
        {
            "qID": 61,
            "qName": "Суперкапсид входит в состав:",
            "rA": [
                "Сложных вирусов"
            ],
            "wA": [
                "Простых вирусов",
                "Цитоплазматической мембраны",
                "Клеточной стенки"
            ]
        },
        {
            "qID": 62,
            "qName": "Бактериофаги – это:",
            "rA": [
                "Вирусы бактерий"
            ],
            "wA": [
                "Антибиотико-подобные вещества, бактериального происхождения",
                "Антибиотико-подобные вещества, синтезируемые растениями"
            ]
        },
        {
            "qID": 63,
            "qName": "Строение бактериофага характеризуют следующие структуры, кроме:",
            "rA": [
                "Рибосомы"
            ],
            "wA": [
                "Хвост",
                "Нити",
                "Базальная пластинка5.\tНК"
            ]
        },
        {
            "qID": 64,
            "qName": "Результат взаимодействия умеренного бактериофага с бактериальной клеткой – это:",
            "rA": [
                "Лизогенизация"
            ],
            "wA": [
                "Лизис",
                "Увеличение скорости деления клеток"
            ]
        },
        {
            "qID": 65,
            "qName": "Результат взаимодействия вирулентного бактериофага с бактериальной клеткой это:",
            "rA": [
                "Лизис"
            ],
            "wA": [
                "Лизогенизация",
                "Увеличение скорости деления клеток"
            ]
        },
        {
            "qID": 66,
            "qName": "Какие размеры имеет вирус гриппа:",
            "rA": [
                "100 нм"
            ],
            "wA": [
                "30 нм",
                "250 нм",
                "350 нм",
                "200 нм"
            ]
        },
        {
            "qID": 67,
            "qName": "Возбудитель кори отличается от других парамиксовирусов:",
            "rA": [
                "Отсутствием нейраминидазы"
            ],
            "wA": [
                "Наличием нейраминидазы"
            ]
        },
        {
            "qID": 68,
            "qName": "Укажите, какие структуры образуют геном ВИЧ:",
            "rA": [
                "Однонитевая РНК"
            ],
            "wA": [
                "Две нити + РНК",
                "ДНК",
                "Сегментированная РНК"
            ]
        },
        {
            "qID": 69,
            "qName": "Укажите клеточные популяции, наиболее чувствительные к инфицированию ВИЧ:",
            "rA": [
                "Т – хелперы"
            ],
            "wA": [
                "Эндотелиоциты",
                "Гепатоциты",
                "Нейроны",
                "В - лимфоциты"
            ]
        },
        {
            "qID": 70,
            "qName": "ВИЧ не передается:",
            "rA": [
                "Аэрогенным путем"
            ],
            "wA": [
                "Парентерально",
                "Трансплацентарно",
                "Половым путем"
            ]
        },
        {
            "qID": 71,
            "qName": "К какому семейству принадлежит ВИЧ:",
            "rA": [
                "Ретровирусы"
            ],
            "wA": [
                "Арбовирусы",
                "Гепадновирусы",
                "Аденовирусы",
                "Тогавирусы"
            ]
        },
        {
            "qID": 72,
            "qName": "Назовите фермент, который имеет ВИЧ:",
            "rA": [
                "Обратная транскриптаза"
            ],
            "wA": [
                "ДНК - аза",
                "РНК – аза",
                "Нейраминидаза",
                "Гемагглютинин"
            ]
        },
        {
            "qID": 73,
            "qName": "Патогенным для человека являются следующие серотипы  вируса полиомиелита:",
            "rA": [
                "1 - 3тип"
            ],
            "wA": [
                "4 тип",
                "5 тип",
                "7тип"
            ]
        },
        {
            "qID": 74,
            "qName": "Для какого заболевания характерно наличие в клетках телец Бабеша – Негри:",
            "rA": [
                "Бешенство"
            ],
            "wA": [
                "Ветряная оспа",
                "Клещевой энцефалит",
                "Краснуха",
                "Аденовирусная инфекция"
            ]
        },
        {
            "qID": 75,
            "qName": "Отметьте свойства, характерные для вирусов герпеса:",
            "rA": [
                "Вызывает латентную инфекцию"
            ],
            "wA": [
                "Имеют РНК",
                "Нет суперкапсида",
                "Простой вирус"
            ]
        },
        {
            "qID": 76,
            "qName": "Видоспецифический антиген Vibrio  cholerae :",
            "rA": [
                "О-антиген"
            ],
            "wA": [
                "Н- антиген",
                "К-антиген"
            ]
        },
        {
            "qID": 77,
            "qName": "При идентификации Pseudomonas aeruginosa не учитывают:",
            "rA": [
                "Тинкториальные и морфологические признаки"
            ],
            "wA": [
                "Пигментообразование",
                "Специфического запаха",
                "Рост при 42 градусах"
            ]
        },
        {
            "qID": 78,
            "qName": "Вирус натуральной оспы не образует:",
            "rA": [
                "Тельца Бабеша-Негри"
            ],
            "wA": [
                "Внутриядерные включения",
                "Бляшки на хорионаллантоисной оболочке"
            ]
        },
        {
            "qID": 79,
            "qName": "Цитотоксины блокируют:",
            "rA": [
                "Синтез белка клеток"
            ],
            "wA": [
                "Функцию тканевых систем",
                "Активность ферментов"
            ]
        },
        {
            "qID": 80,
            "qName": "Эритрогенин синтезирует:",
            "rA": [
                "Streptococcus pyogenes"
            ],
            "wA": [
                "Bordetella  pertussis",
                "Вирусы",
                "Грибы",
                "Микоплазмы"
            ]
        },
        {
            "qID": 81,
            "qName": "Назвать питательную среду для идентификации Escherichia coli:",
            "rA": [
                "Среда Эндо"
            ],
            "wA": [
                "Среда Сабуро",
                "Желточно – солевой агар",
                "Среда Китта – Тароции",
                "Среда Плоскирева"
            ]
        },
        {
            "qID": 82,
            "qName": "В семейство Bacillaceae входят микроорганизмы:",
            "rA": [
                "Спорообразующие"
            ],
            "wA": [
                "Капсулообразующие",
                "Грамм (-)-ные"
            ]
        },
        {
            "qID": 83,
            "qName": "Токсины - блокаторы функции тканевых систем:",
            "rA": [
                "Энтеротоксины"
            ],
            "wA": [
                "Гемолизины",
                "Гистотоксины",
                "Эксофолиатины"
            ]
        },
        {
            "qID": 84,
            "qName": "Токсины- блокаторы функции тканевых систем:",
            "rA": [
                "Тетаноспазмин Cl tetani"
            ],
            "wA": [
                "Тетанолизины Cl tetani",
                "Гемолизины",
                "Лейкоцидины"
            ]
        },
        {
            "qID": 85,
            "qName": "Для оценки уровня микробного обсеменения воздуха в операционной не применяется:",
            "rA": [
                "Определение бактерий группы кишечных палочек"
            ],
            "wA": [
                "Определение количества бактерий",
                "Определение золотистых стафилококков"
            ]
        },
        {
            "qID": 86,
            "qName": "Наиболее эпидемиологическое значение при воздушно-пылевом передачи инфекции принадлежит:",
            "rA": [
                "Мелкокапельной фазе аэрозоля"
            ],
            "wA": [
                "Крупнокапельной фазе аэрозоля",
                "Бактериальной пыли"
            ]
        },
        {
            "qID": 87,
            "qName": "Отметьте вирус, заражение которым опасно для беременных в отношении возникновения уродства плода:",
            "rA": [
                "Вирус краснухи"
            ],
            "wA": [
                "Аденовирусы",
                "Вирус кори",
                "Вирус Коксаки"
            ]
        },
        {
            "qID": 88,
            "qName": "Медленные вирусные инфекции не характеризуются:",
            "rA": [
                "летальным исходом"
            ],
            "wA": [
                "Длительным инкубационным периодомпоражением ЦНС",
                "медленным прогрессированием болезни",
                "коротким инкубационным периодом"
            ]
        },
        {
            "qID": 89,
            "qName": "Прионы являются возбудителями :",
            "rA": [
                "Конформационных болезней(неправильное сворачивание клеточного белка)"
            ],
            "wA": [
                "Медленной вирусной инфекции",
                "Вироидных инфекций",
                "Микозов"
            ]
        },
        {
            "qID": 90,
            "qName": "Прионы не передаются:",
            "rA": [
                "Аэрогенным путем"
            ],
            "wA": [
                "Алиментарным путем",
                "При гемотрансфузии",
                "Через иммунобиологические препараты"
            ]
        },
        {
            "qID": 91,
            "qName": "Морфологию бактерий изучают:",
            "rA": [
                "Микроскопическим методом"
            ],
            "wA": [
                "Бактериологическим методом",
                "Биологическим методом",
                "ПЦР"
            ]
        },
        {
            "qID": 92,
            "qName": "Методы изучения культуральных признаков бактерий:",
            "rA": [
                "Бактериологическим методом"
            ],
            "wA": [
                "Иммерсионной микроскоп",
                "Микроскопическим методом",
                "Биологическим методом",
                "ПЦР"
            ]
        },
        {
            "qID": 93,
            "qName": "Цитолиз гепатоцитов при гепатите В происходит в основном за счет:",
            "rA": [
                "Иммунологических реакций"
            ],
            "wA": [
                "Репродукции вирусов"
            ]
        },
        {
            "qID": 94,
            "qName": "Не является специфическим маркером активности гепатита В",
            "rA": [
                "HBc ag"
            ],
            "wA": [
                "HBs ag",
                "HBe ag",
                "ДНК вируса"
            ]
        },
        {
            "qID": 95,
            "qName": "Специфическим маркером формирования иммунитета против гепатита В  является наличие в крови:",
            "rA": [
                "anti HBs антител"
            ],
            "wA": [
                "anti.HBe антител",
                "anti HBc  антител",
                "anti HBs Ig G"
            ]
        },
        {
            "qID": 96,
            "qName": "Не является специфическим маркером формирования хронического гепатита В:",
            "rA": [
                "HBe ag"
            ],
            "wA": [
                "HBs ag",
                "ДНК вируса"
            ]
        },
        {
            "qID": 97,
            "qName": "Специфическим маркером активности гепатита D является наличие в крови:",
            "rA": [
                "HD ag"
            ],
            "wA": [
                "HBs ag",
                "HBc ag",
                "ДНК вируса"
            ]
        },
        {
            "qID": 98,
            "qName": "Специфическим маркером формирования иммунитета против гепатита D  являются наличие в крови: ",
            "rA": [
                "anti. HD ag Ig G"
            ],
            "wA": [
                "anti HBs антител",
                "anti. HD ag  антител ",
                "anti HBc  антител",
                "anti HBs Ig G"
            ]
        },
        {
            "qID": 99,
            "qName": "Не являются специфическим маркером активности гепатита A:",
            "rA": [
                "Ig G"
            ],
            "wA": [
                "РНК вируса",
                "Антигена вируса",
                "Ig М"
            ]
        },
        {
            "qID": 100,
            "qName": "Специфическими маркерами формирования иммунитета против  гепатита A  являются наличие в крови:",
            "rA": [
                "Ig G"
            ],
            "wA": [
                "РНК вируса",
                "Антигена вируса",
                "Ig М"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
