var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Одновременное заражение различными возбудителями:",
            "rA": [
                "микстинфекция"
            ],
            "wA": [
                "Реинфекция",
                "Суперинфекция",
                "Моноинфекция",
                "Вторичная инфекция"
            ]
        },
        {
            "qID": 2,
            "qName": "Заражение только одним возбудителем:",
            "rA": [
                "Моноинфекция"
            ],
            "wA": [
                "Микстинфекция",
                "Суперинфекция",
                "Реинфекция",
                "Вторичная инфекция"
            ]
        },
        {
            "qID": 3,
            "qName": "Целенаправленное передвижение бактерий в окружающей среде:",
            "rA": [
                "Хемотаксис"
            ],
            "wA": [
                "Инвазия",
                "Агрессия",
                "Адгезия",
                "Пенетрация"
            ]
        },
        {
            "qID": 4,
            "qName": "Патогенный фактор возбудителя, проявляющийся прикреплением к поверхности клетки:",
            "rA": [
                "Адгезия"
            ],
            "wA": [
                "Агрессия",
                "Инвазия",
                "Пенетрация",
                "Хемотаксис"
            ]
        },
        {
            "qID": 5,
            "qName": "Антраксин:",
            "rA": [
                "Аллерген"
            ],
            "wA": [
                "Анатоксин",
                "Экзотоксин",
                "Эндотоксин",
                "Гамма-глобулин"
            ]
        },
        {
            "qID": 6,
            "qName": "Патогенность Y.pestіs связана:",
            "rA": [
                "Мышиным токсином"
            ],
            "wA": [
                "Образованием гемагглютининов",
                "Продукцией гиалуронидазы",
                "Продукцией плазмокоагулазы",
                "Наличием цитохрома"
            ]
        },
        {
            "qID": 7,
            "qName": "Остаточный патогенный фактор некоторых бактерии, проявляющийся после гибели микроба:",
            "rA": [
                "Эндотоксин"
            ],
            "wA": [
                "Экзотоксин",
                "Патогенные ферменты",
                "Эксфолиативные токсины",
                "Антигены"
            ]
        },
        {
            "qID": 8,
            "qName": "Характерные свойства эндотоксинов:",
            "rA": [
                "Термостабильны"
            ],
            "wA": [
                "Очень токсичны",
                "Менее ядовиты",
                "Термолабильны",
                "Активные антигены"
            ]
        },
        {
            "qID": 9,
            "qName": "Патогенный фактор, заключающийся в проникновении микроорганизма внутрь клеток макроорганизма:",
            "rA": [
                "Инвазия"
            ],
            "wA": [
                "Агрессия",
                "Адгезия",
                "Колонизация",
                "Пенетрация"
            ]
        },
        {
            "qID": 10,
            "qName": "Инфицирование тем же возбудителем, проходящее до выздоровления:",
            "rA": [
                "Суперинфекция"
            ],
            "wA": [
                "Рецидив",
                "Реинфекция",
                "Вторичная инфекция",
                "Сепсис"
            ]
        },
        {
            "qID": 11,
            "qName": "Пирогенами являются:",
            "rA": [
                "Эндотоксины"
            ],
            "wA": [
                "Патогенные ферменты",
                "Экзотоксины",
                "Аллергены",
                "Пурины"
            ]
        },
        {
            "qID": 12,
            "qName": "К ферментам патогенности относятся:",
            "rA": [
                "Плазмокоагулаза"
            ],
            "wA": [
                "Лигаза",
                "Трансфераза",
                "Полимераза",
                "Липаза"
            ]
        },
        {
            "qID": 13,
            "qName": "Что вызывает у новорожденного эксфолиативный токсин:",
            "rA": [
                "Пузырчатку"
            ],
            "wA": [
                "Пупочный сепсис",
                "Диарею",
                "Конъюнктивит",
                "Плеврит"
            ]
        },
        {
            "qID": 14,
            "qName": "Какой микроорганизм продуцирует эксфолиативный токсин:",
            "rA": [
                "Стафилококк"
            ],
            "wA": [
                "Стрептококк",
                "Гонококк",
                "Синегнойная палочка",
                "Энтеропатогенная кишечная палочка"
            ]
        },
        {
            "qID": 15,
            "qName": "Какой микроорганизм вырабатывает эритрогенный токсин:",
            "rA": [
                "Стрептококк"
            ],
            "wA": [
                "Гонококк",
                "Менингококк",
                "Синегнойная палочка",
                "Стафилококк"
            ]
        },
        {
            "qID": 16,
            "qName": "Какие  микроорганизмы  вызывают скарлатину:",
            "rA": [
                "Стрептококк"
            ],
            "wA": [
                "Коринебактерии",
                "Стафилококк",
                "Клебсиеллы",
                "Сарцины"
            ]
        },
        {
            "qID": 17,
            "qName": "Эритрогенный токсин индуцирует:",
            "rA": [
                "Скарлатину"
            ],
            "wA": [
                "Пузырчатку",
                "Диарею",
                "Бленнорею",
                "Характерную сыпь"
            ]
        },
        {
            "qID": 18,
            "qName": "Проба Шика это:",
            "rA": [
                "Реакция нейтрализации токсина"
            ],
            "wA": [
                "Реакция связывания комплемента",
                "Реакция непрямой гемагглютинации",
                "Реакция агглютинации",
                "Реакция лизиса"
            ]
        },
        {
            "qID": 19,
            "qName": "После введения разбавленного дифтерийного токсина, реакция оказалась отрицательной, выберите правильную трактовку результата анализа:",
            "rA": [
                "У пациента имеется иммунитет к дифтерии"
            ],
            "wA": [
                "У пациента снижена резистентность",
                "У пациента наблюдается ареактивность иммунной системы",
                "Иммунитет к дифтерии отсутствует",
                "У пациента имеется гиперчувствительность к дифтерии"
            ]
        },
        {
            "qID": 20,
            "qName": "Почему у безмикробных животных не созревает иммунная система:",
            "rA": [
                "Нет антигенного раздражения"
            ],
            "wA": [
                "Не поступают протеины с пищей",
                "Эпителий кишечника не способен адгезировать микроорганизмы",
                "Отсутствуют стволовые клетке в организме гнотобионта",
                "Отсутствует тимус"
            ]
        },
        {
            "qID": 21,
            "qName": "Что такое оппортунистическая инфекция:",
            "rA": [
                "Инфекция, вызываемая УПМ"
            ],
            "wA": [
                "Вирусная",
                "Протозойная",
                "Бактериальная",
                "Грибковая"
            ]
        },
        {
            "qID": 22,
            "qName": "Способность к полноценному синтезу іg проявляется:",
            "rA": [
                "К первому году жизни"
            ],
            "wA": [
                "К моменту рождения",
                "К первому месяцу жизни",
                "К 5-6 месяцам",
                "К 5-6 годам"
            ]
        },
        {
            "qID": 23,
            "qName": "Почему иммунная система беременной женщины не отторгает чужеродные клетки плода:",
            "rA": [
                "Плацента ограждает плод от проникновения Т- и В-лимфоцитов"
            ],
            "wA": [
                "Плацента пропускает іgм",
                "Плацента пропускает іgа",
                "Плацента пропускает іgg",
                "Плацента является механическим барьером для цитокинов"
            ]
        },
        {
            "qID": 24,
            "qName": "Иммунитет при лептоспирозах:",
            "rA": [
                "Постинфекционный"
            ],
            "wA": [
                "Протективный",
                "Тканевой",
                "Нестерильный",
                "Фагоцитарный"
            ]
        },
        {
            "qID": 25,
            "qName": "Какие антитела могут проходить через плаценту от матери к плоду:",
            "rA": [
                "Іg G"
            ],
            "wA": [
                "Іg M",
                "Іg A",
                "Іg E",
                "Іg D"
            ]
        },
        {
            "qID": 26,
            "qName": "Классы иммуноглобулинов, обуславливающие пассивную иммунизацию плода:",
            "rA": [
                "Іg G"
            ],
            "wA": [
                "Іg D",
                "Іg A",
                "Іg E",
                "Іg M"
            ]
        },
        {
            "qID": 27,
            "qName": "Для палочек ботулизма характерно образование:",
            "rA": [
                "Нейротоксина"
            ],
            "wA": [
                "Гиалуронидазы",
                "Плазмокоагулазы",
                "Тетаноспазмина",
                "Эндотоксина"
            ]
        },
        {
            "qID": 28,
            "qName": "К - антиген бактерий входит в состав:",
            "rA": [
                "Капсулы"
            ],
            "wA": [
                "Жгутиков",
                "Клеточной стенки",
                "ЦПМ",
                "Пилей"
            ]
        },
        {
            "qID": 29,
            "qName": "Диагностические сыворотки используют для:",
            "rA": [
                "Ппостановки серологических реакций"
            ],
            "wA": [
                "Лечения",
                "Ииндикации микроорганизмов",
                "Ппрофилактики",
                "Ввыявление микробов во внешней среде"
            ]
        },
        {
            "qID": 30,
            "qName": "Назовите неправильный ответ при характеристике иммунных сывороток:",
            "rA": [
                "Иммунитет не вырабатывается"
            ],
            "wA": [
                "Создается искусственный иммунитет",
                "Используются для серотерапии",
                "Проводится экстренная профилактика",
                "Антитела нейтрализуют белковый токсин"
            ]
        },
        {
            "qID": 31,
            "qName": "Аллергией называется:",
            "rA": [
                "Повышенная чувствительность организма"
            ],
            "wA": [
                "Нарушение иммунного статуса",
                "Нарушение структуры и функции органов и тканей",
                "Наследственная предрасположенность к гиперфункции",
                "Способ нейтрализации генетически чужеродных веществ"
            ]
        },
        {
            "qID": 32,
            "qName": "Инфекционная аллергия:",
            "rA": [
                "Гиперчувствительность замедленного типа"
            ],
            "wA": [
                "Гиперчувствительность немедленного типа",
                "В основе лежит гуморальный ответ",
                "Развивается при введении сывороток",
                "Развивается при первичном введении антигена"
            ]
        },
        {
            "qID": 33,
            "qName": "Для развития оппортунистических инфекций имеет значение:",
            "rA": [
                "Иммунодефицитные состояния"
            ],
            "wA": [
                "Нарушение целостности покровов",
                "Иммунологическая память",
                "Аутоиммунные заболевания",
                "Иммунологический паралич"
            ]
        },
        {
            "qID": 34,
            "qName": "Клиническая картина оппортунистических инфекций зависит от:",
            "rA": [
                "Локализации поражения"
            ],
            "wA": [
                "Возбудителя болезни",
                "Инвазивности возбудителя",
                "Способа заражения",
                "Интерференции фагоцитарного механизма"
            ]
        },
        {
            "qID": 35,
            "qName": "Возбудителями ятрогенных инфекций являются:",
            "rA": [
                "Условно-патогенные микробы"
            ],
            "wA": [
                "Зоонозные инфекции",
                "Только высоковирулентные возбудители",
                "Туберкулезная палочка",
                "Актиномицеты"
            ]
        },
        {
            "qID": 36,
            "qName": "Для спида характерным является:",
            "rA": [
                "Снижение Т - хелперов"
            ],
            "wA": [
                "Увеличение продукции интерлейкина - 2",
                "Увеличение продукции гамма-интерферона",
                "Снижение В-лимфоцитов",
                "Увеличение всех лимфоцитов"
            ]
        },
        {
            "qID": 37,
            "qName": "Проявлением анафилактического типа аллергических реакции могут быть:",
            "rA": [
                "Анафилактический шок"
            ],
            "wA": [
                "Аллергия при инфекционных заболеваниях",
                "Контактная аллергия",
                "Цитотоксическая реакция",
                "Сывороточная болезнь"
            ]
        },
        {
            "qID": 38,
            "qName": "Химические вакцины:",
            "rA": [
                "Представляют полноценные антигенные комплексы"
            ],
            "wA": [
                "Содержат цельные микробные клетки",
                "Получают из микробов при нагревании и обработке формалином",
                "Высушивают методом лиофильной сушки",
                "Приводят к выработке антитоксического иммунитета"
            ]
        },
        {
            "qID": 39,
            "qName": "Тяжелая раневая инфекция, характеризующаяся поражением нервной системы:",
            "rA": [
                "Столбняк"
            ],
            "wA": [
                "Сибирская язва",
                "Полиомиелит",
                "Менингит",
                "Лейшманиоз"
            ]
        },
        {
            "qID": 40,
            "qName": "Микоплазмы:",
            "rA": [
                "Поражают мочеполовой тракт"
            ],
            "wA": [
                "Вызывают заболевания с острым течением",
                "Вызывают ОКИ",
                "Поражают слизистую тонкого кишечника",
                "Выявляются по ЦПД на культуре клеток"
            ]
        },
        {
            "qID": 41,
            "qName": "Какой период инфекционного заболевания характеризуется появлением первых неспецифических симптомов заболевания:",
            "rA": [
                "Продромальный"
            ],
            "wA": [
                "Инкубационный",
                "Разгар болезни",
                "Реконвалесценсии",
                "Бактерионосительство"
            ]
        },
        {
            "qID": 42,
            "qName": "Какой период инфекционного заболевания характеризуется появлением специфических симптомов заболевания:",
            "rA": [
                "Разгар болезни"
            ],
            "wA": [
                "Продромальный",
                "Реконвалесценсии",
                "Бактерионосительство",
                "Инкубационный"
            ]
        },
        {
            "qID": 43,
            "qName": "Период реконвалесценсии характеризуется:",
            "rA": [
                "Прекращением размножения и гибелью возбудителя"
            ],
            "wA": [
                "Появлением специфических симптомов заболевания",
                "Появлением неспецифических симптомов заболевания",
                "Адгезией микробов на чувствительных клетках организма",
                "Сохранением возбудителя в организме"
            ]
        },
        {
            "qID": 44,
            "qName": "При первичном иммунном ответе первыми вырабатываются антитела класса:",
            "rA": [
                "Іg M"
            ],
            "wA": [
                "Іg A",
                "Іg G",
                "Іg E",
                "Іg D"
            ]
        },
        {
            "qID": 45,
            "qName": "При вторичном иммунном ответе первыми вырабатываются антитела класса:",
            "rA": [
                "Іg G"
            ],
            "wA": [
                "Іg M",
                "Іg E",
                "Іg D",
                "Іg A"
            ]
        },
        {
            "qID": 46,
            "qName": "Для лабораторной диагностики ботулизма используют:",
            "rA": [
                "Реакцию нейтрализации на белых мышах"
            ],
            "wA": [
                "Реакцию агглютинации",
                "РПГА",
                "Аллергическую пробу",
                "Реакцию Асколи"
            ]
        },
        {
            "qID": 47,
            "qName": "Для лечения ботулизма используют:",
            "rA": [
                "Поливалентную антитоксичекую сыворотку"
            ],
            "wA": [
                "Бактериофаг",
                "Антимикробную сыворотку",
                "Антибиотики",
                "Аутовакцину"
            ]
        },
        {
            "qID": 48,
            "qName": "К антигенам бруцелл относится:",
            "rA": [
                "Vі-антиген"
            ],
            "wA": [
                "Протективный",
                "Н-антиген",
                "К-антиген",
                "Пептидогликан"
            ]
        },
        {
            "qID": 49,
            "qName": "Что не относится к стадиям фагоцитоза:",
            "rA": [
                "Интеграция в геном клетки"
            ],
            "wA": [
                "Хемотаксис",
                "Адгезия",
                "Эндоцитоз",
                "Внутриклеточное переваривание"
            ]
        },
        {
            "qID": 50,
            "qName": "Бруцеллы характеризуются:",
            "rA": [
                "Мелкими размерами"
            ],
            "wA": [
                "Грамположительной окраской",
                "Подвижностью",
                "Спорообразованием",
                "Не требовательны к питательным средам"
            ]
        },
        {
            "qID": 51,
            "qName": "Созревание Т-лимфоцитов происходит в:",
            "rA": [
                "Тимусе"
            ],
            "wA": [
                "Костном мозге",
                "Селезенке",
                "Лимфоузлах",
                "Печени"
            ]
        },
        {
            "qID": 52,
            "qName": "Созревание В-лимфоцитов присходит в :",
            "rA": [
                "Костном мозге"
            ],
            "wA": [
                "Тимусе",
                "Селезенке",
                "Печени",
                "Лимфоузлах"
            ]
        },
        {
            "qID": 53,
            "qName": "В реакции Райта выявляют:",
            "rA": [
                "Агглютинины"
            ],
            "wA": [
                "Преципитины",
                "Комплементсвязывающие антитела",
                "Тромбоцитобактерины",
                "Гемолизины"
            ]
        },
        {
            "qID": 54,
            "qName": "Укажите типы аллергических реакций:",
            "rA": [
                "Все вышеуказанное"
            ],
            "wA": [
                "Анафилактический",
                "Цитотоксический",
                "Иммунокомплексный",
                "Клеточный"
            ]
        },
        {
            "qID": 55,
            "qName": "Аллергическое состояние при бруцеллезе выявляют с помощью:",
            "rA": [
                "Пробы Бюрне"
            ],
            "wA": [
                "Пробы Манту",
                "Туберкулина",
                "Антраксина",
                "Люэтина"
            ]
        },
        {
            "qID": 56,
            "qName": "Профилактика бруцеллеза проводится с помощью:",
            "rA": [
                "Обезвреживания продуктов и сырья животного происхождения"
            ],
            "wA": [
                "Бактериофага",
                "Убитой вакцины",
                "Гамма-глобулина",
                "Анатоксина"
            ]
        },
        {
            "qID": 57,
            "qName": "Укажите вакцину, полученную путем генной инженерии:",
            "rA": [
                "Против гепатита В"
            ],
            "wA": [
                "СТИ",
                "БЦЖ",
                "Менингококковая",
                "Брюшнотифознаф"
            ]
        },
        {
            "qID": 58,
            "qName": "Какая из бруцелл чаще вызывает бруцеллез у коз и овец:",
            "rA": [
                "Brucella melіtensіs"
            ],
            "wA": [
                "Brucella abortus",
                "Brucella suіs",
                "Brucella canіs",
                "Brucella ovіs"
            ]
        },
        {
            "qID": 59,
            "qName": "Бруцеллы:",
            "rA": [
                "Не образуют спор"
            ],
            "wA": [
                "Лишены жгутиков",
                "Имеют капсулу",
                "Не требовательны к питательным средам",
                "Размножаются быстро"
            ]
        },
        {
            "qID": 60,
            "qName": "Укажите путь заражения псевдотуберкулезом:",
            "rA": [
                "Алиментарный"
            ],
            "wA": [
                "Воздушно-капельный",
                "Половой",
                "Трансмиссивный",
                "Вертикальный"
            ]
        },
        {
            "qID": 61,
            "qName": "Bac. Anthracіs:",
            "rA": [
                "Грамположительные палочки с \"обрубленными\" концами"
            ],
            "wA": [
                "Грамотрицательные палочки с закругленными концами",
                "Палочки, располагающиеся под углом",
                "Палочки, располагающиеся частоколом",
                "Имеют форму изогнутой палочки"
            ]
        },
        {
            "qID": 62,
            "qName": "При заражении сибирской язвой наиболее опасны:",
            "rA": [
                "Мясо и мясные продукты"
            ],
            "wA": [
                "Вода",
                "Овощи",
                "Рыбные продукты",
                "Птицы"
            ]
        },
        {
            "qID": 63,
            "qName": "В пробе Пизу определяют разложение:",
            "rA": [
                "Цистиназы"
            ],
            "wA": [
                "Уреазы",
                "Сахарозы",
                "Глюкозы",
                "Маннозы"
            ]
        },
        {
            "qID": 64,
            "qName": "В пробе Закса определяют разложение:",
            "rA": [
                "Мочевины"
            ],
            "wA": [
                "Галактозы",
                "Цистиназы",
                "Мальтозы",
                "Сахарозы"
            ]
        },
        {
            "qID": 65,
            "qName": "Токсин, соединяющийся с поверхностными структурами нервных клеток и вызывающий судороги:",
            "rA": [
                "Тетаноспазмин"
            ],
            "wA": [
                "Тетанолизин",
                "Эксфолиатин",
                "Эритрогенин",
                "Гемолизин"
            ]
        },
        {
            "qID": 66,
            "qName": "Культуральный свойства M. Bovіs:",
            "rA": [
                "S-формы колоний, мелкие, серые"
            ],
            "wA": [
                "R-формы колонии, сухие с ароматным запахом",
                "Маслянистые",
                "S-формы колоний, желтые",
                "В виде цветка \"маргаритки\""
            ]
        },
        {
            "qID": 67,
            "qName": "Лепромин применяется для постановки:",
            "rA": [
                "Реакции Мицуды"
            ],
            "wA": [
                "Пробы Манту",
                "Реакции Дика",
                "Реакции Шика",
                "Пробы Закса"
            ]
        },
        {
            "qID": 68,
            "qName": "Кожно-аллергическая проба при бруцеллезе:",
            "rA": [
                "Проба Бюрне"
            ],
            "wA": [
                "Проба Манту",
                "Проба Дика",
                "Проба Закса",
                "Проба Пизу"
            ]
        },
        {
            "qID": 69,
            "qName": "Источники инфекции при сибирской язве:",
            "rA": [
                "Больные сельскохозяйственные животные"
            ],
            "wA": [
                "Грызуны",
                "Домашние птицы",
                "Больной человек",
                "Бактерионоситель"
            ]
        },
        {
            "qID": 70,
            "qName": "Для выявления неполных антител при бруцеллезе используется реакция:",
            "rA": [
                "Кумбса"
            ],
            "wA": [
                "Кунса",
                "РПГА",
                "Опсоно-фагоцитарная",
                "Проба Бюрне"
            ]
        },
        {
            "qID": 71,
            "qName": "Сколько периодов различают в клинической картине сифилиса:",
            "rA": [
                "Четыре"
            ],
            "wA": [
                "Один",
                "Два",
                "Три",
                "Пять"
            ]
        },
        {
            "qID": 72,
            "qName": "Что характерно для первичного сифилиса:",
            "rA": [
                "Твердый шанкр"
            ],
            "wA": [
                "Мягкий шанкр",
                "Гумма",
                "Сыпь",
                "Поражение ЦНС"
            ]
        },
        {
            "qID": 73,
            "qName": "Какая клиническая картина наблюдается при вторичном сифилисе:",
            "rA": [
                "Высыпания на коже"
            ],
            "wA": [
                "Гуммы",
                "Твердый шанкр",
                "Спинная сухотка",
                "Мягкий шанкр"
            ]
        },
        {
            "qID": 74,
            "qName": "В третьем периоде сифилиса появляются:",
            "rA": [
                "Гуммы"
            ],
            "wA": [
                "Твердый шанкр",
                "Высыпания на коже",
                "Мягкий шанкр",
                "Поражается ЦНС"
            ]
        },
        {
            "qID": 75,
            "qName": "Употребление каких продуктов является наиболее опасным при заражении бруцеллезом:",
            "rA": [
                "Молоко, брынза, масло, мясо"
            ],
            "wA": [
                "Вода",
                "Овощи",
                "Рыбные продукты",
                "Птицы"
            ]
        },
        {
            "qID": 76,
            "qName": "Возбудителя чумы открыл:",
            "rA": [
                "Иерсен"
            ],
            "wA": [
                "Готшлих",
                "Китазато",
                "Леффлер",
                "Гикошима"
            ]
        },
        {
            "qID": 77,
            "qName": "Какие антитела преобладают при первичном эпидемическом сыпном тифе:",
            "rA": [
                "Іg М"
            ],
            "wA": [
                "Іg А",
                "Іg Е",
                "Іg G",
                "Іg D"
            ]
        },
        {
            "qID": 78,
            "qName": "При болезни Брилля в крови преобладают:",
            "rA": [
                "Іg G"
            ],
            "wA": [
                "Іg M",
                "Іg A",
                "Іg E",
                "Іg D"
            ]
        },
        {
            "qID": 79,
            "qName": "Биологический метод диагностики эндемического сыпного тифа предусматривает заражение:",
            "rA": [
                "Самцов морских свинок"
            ],
            "wA": [
                "Кроликов",
                "Мышей",
                "Обезьян",
                "Крыс"
            ]
        },
        {
            "qID": 80,
            "qName": "Возбудитель сифилиса относится к роду:",
            "rA": [
                "Treponema"
            ],
            "wA": [
                "Borrelіa",
                "Bordetella",
                "Leptospіra",
                "Mycobacterіum"
            ]
        },
        {
            "qID": 81,
            "qName": "Укажите семейство стафилококков:",
            "rA": [
                "Mіcrococcaceae"
            ],
            "wA": [
                "Neіserіaceae",
                "Streptococcaceae",
                "Bacіllaceae",
                "Brucellaceae"
            ]
        },
        {
            "qID": 82,
            "qName": "Для стафилококков характерно:",
            "rA": [
                "Гроздевидное расположение"
            ],
            "wA": [
                "Ланцетовидная форма",
                "Грамотрицательная окраска",
                "Спорообразование",
                "Деление в одной плоскости"
            ]
        },
        {
            "qID": 83,
            "qName": "Колонии стафилококков:",
            "rA": [
                "Пигментированные, выпуклые с ровным краем"
            ],
            "wA": [
                "Плоские, прозрачные с неровным краем",
                "Мелкие в виде \"росинок\"",
                "В виде \"яичницы-глазуньи\"",
                "В виде капелек ртути"
            ]
        },
        {
            "qID": 84,
            "qName": "Морфология кишечных палочек:",
            "rA": [
                "Гамотрицательыне средних размеров"
            ],
            "wA": [
                "Грамположительные, крупные",
                "Расположение цепочкой",
                "Образование спор",
                "Попарное расположение"
            ]
        },
        {
            "qID": 85,
            "qName": "Стафилококки, вырабатывающие эксфоллиатин, вызывают:",
            "rA": [
                "Пузырчатку новорожденных"
            ],
            "wA": [
                "Скарлатину",
                "Пищевые отравления",
                "Энтериты",
                "Сепсис"
            ]
        },
        {
            "qID": 86,
            "qName": "Для диагностики стафилококкового сепсиса применяют:",
            "rA": [
                "Посев крови на сахарный бульон"
            ],
            "wA": [
                "Прямую микроскопию крови",
                "Посев крови на кровяной агар",
                "Посев крови на ЖСА",
                "Метод иммунофлюоресценции"
            ]
        },
        {
            "qID": 87,
            "qName": "Для выявления источника инфекции при стафилококковых заболеваниях используют:",
            "rA": [
                "Фаготипирование"
            ],
            "wA": [
                "Реакцию преципитации",
                "Оценку токсичности",
                "Определение ферментативной активности",
                "РСК"
            ]
        },
        {
            "qID": 88,
            "qName": "На среде Плоскирева шигеллы образуют колонии:",
            "rA": [
                "Бесцветные"
            ],
            "wA": [
                "Темно-красные",
                "Сине-черные",
                "Зеленовато-бежевые",
                "С гемолизом"
            ]
        },
        {
            "qID": 89,
            "qName": "Культуральные свойства возбудителя брюшного тифа:",
            "rA": [
                "На висмут-сульфит агаре- черные колонии"
            ],
            "wA": [
                "На среде Эндо- красные колонии",
                "На МПБ- пленка",
                "Шероховатые колонии",
                "Точечные колонии"
            ]
        },
        {
            "qID": 90,
            "qName": "Морфологические особенности стрептококков:",
            "rA": [
                "Расположение в виде цепочек"
            ],
            "wA": [
                "Бобовидная форма",
                "Гроздевидное расположение",
                "В виде \"крыльев чайки\"",
                "Палочковидная форма"
            ]
        },
        {
            "qID": 91,
            "qName": "Культуральные свойства стрептококков:",
            "rA": [
                "Образуют мелкие зернистые колонии"
            ],
            "wA": [
                "Растут на простых средах",
                "На бульоне дают равномерное помутнение",
                "Колони золотистого и белого цвета",
                "Температурный оптимум 42 градуса"
            ]
        },
        {
            "qID": 92,
            "qName": "Возбудитель инфекционного заболевания, экзотоксин которого является самым сильным из всех биологических ядов:",
            "rA": [
                "Clostrіdіum botulіnum"
            ],
            "wA": [
                "Yersіnіa pestіs",
                "Bacіllus cereus",
                "Vіbrіo cholerae",
                "Salmonella typhy"
            ]
        },
        {
            "qID": 93,
            "qName": "Str. рyogenes не вызывает:",
            "rA": [
                "Энтерит"
            ],
            "wA": [
                "Ревматизм",
                "Гломерулонефрит",
                "Скарлатину",
                "Рожистого воспаления"
            ]
        },
        {
            "qID": 94,
            "qName": "В патогенезе скарлатины играет роль:",
            "rA": [
                "Эритрогенный токсин"
            ],
            "wA": [
                "Энтеротоксин",
                "Лецитиназа",
                "Фибринолизин",
                "Плазмокоагулаза"
            ]
        },
        {
            "qID": 95,
            "qName": "Защиту от фагоцитоза у стрептококков обеспечивает:",
            "rA": [
                "М-белок"
            ],
            "wA": [
                "Спора",
                "Хемотаксический фактор",
                "Капсид",
                "Белок А"
            ]
        },
        {
            "qID": 96,
            "qName": "Возбудитель, вызывающий воздушно-капельную инфекцию, имеющий поверхностный антиген-гемагглютинин и специфический антиген-нейраминидазу:",
            "rA": [
                "Вирус гриппа"
            ],
            "wA": [
                "Вирус полиомиелита",
                "Вирус гепатита",
                "Вирус бешенства",
                "Вирус Коксаки"
            ]
        },
        {
            "qID": 97,
            "qName": "Наличие антитоксического иммунитета против скарлатины у детей определяют реакцией:",
            "rA": [
                "Дика"
            ],
            "wA": [
                "Шика",
                "Бюрне",
                "Манту",
                "Пирке"
            ]
        },
        {
            "qID": 98,
            "qName": "Вирус полиомиелита характеризуется всем, кроме:",
            "rA": [
                "Крупный вирус"
            ],
            "wA": [
                "Относится к пикорнавирусам",
                "Содержат РНК",
                "Обладает нейротропностью",
                "Обладает ЦПД"
            ]
        },
        {
            "qID": 99,
            "qName": "К путям передачи при СПИД относятся все, кроме:",
            "rA": [
                "Трансмиссивный"
            ],
            "wA": [
                "Половой",
                "Парентеральный",
                "Заражение ребенка от матери",
                "Загрязненный кровью инструментарий"
            ]
        },
        {
            "qID": 100,
            "qName": "Назовите, для каких стрептококков характерно образование прозрачной зоны гемолиза на кровяном агаре:",
            "rA": [
                "Str. Pyogenes"
            ],
            "wA": [
                "Str. Pneumonіae",
                "Str. Faecalіs",
                "Str. Salіvarіus",
                "Str. Mutans"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
