var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Клеточная стенка бактерий:",
            "rA": [
                "Придает бактериям определенную форму"
            ],
            "wA": [
                "Постоянная структура клетки",
                "Слизистое образование",
                "Состоит только из белка",
                "Образуется при неблагоприятных условиях"
            ]
        },
        {
            "qID": 2,
            "qName": "При окраске по Граму применяют:",
            "rA": [
                "Генцианвиолет."
            ],
            "wA": [
                "Метиленовый синий",
                "Везувин",
                "Азур-эозин",
                "Серную кислоту"
            ]
        },
        {
            "qID": 3,
            "qName": "Кандида относятся к царству:",
            "rA": [
                "Eucaryotae"
            ],
            "wA": [
                "Procarіotae",
                "Vіra.",
                "Anіmalіa",
                "Protozоа"
            ]
        },
        {
            "qID": 4,
            "qName": "Метод, используемый для выявления патогенных простейших в крови:",
            "rA": [
                "\"толстая\" капля"
            ],
            "wA": [
                "Фиксированный неокрашенный мазок",
                "\"висячая\" капля",
                "\"раздавленная\" капля",
                "Фиксированный окрашенный мазок"
            ]
        },
        {
            "qID": 5,
            "qName": "Чистая культура микробов, выделенная из определенного источника и отличающаяся от других представителей вида, называется:",
            "rA": [
                "штаммом"
            ],
            "wA": [
                "Клоном",
                "Подвидом",
                "Колонией",
                "Вариантом"
            ]
        },
        {
            "qID": 6,
            "qName": "Бактерии, не имеющие клеточную стенку:",
            "rA": [
                "Микоплазмы"
            ],
            "wA": [
                "Хламидии",
                "Риккетсии",
                "Спирохеты",
                "Актиномицеты"
            ]
        },
        {
            "qID": 7,
            "qName": "Дрожжеподобные грибы относятся к классу:",
            "rA": [
                "Дейтеромицеты"
            ],
            "wA": [
                "Зигомицеты",
                "Аскомицеты",
                "Базидиомицеты",
                "Оомицет"
            ]
        },
        {
            "qID": 8,
            "qName": "С какой целью фиксируют мазки:",
            "rA": [
                "Для прикрепления бактерий к предметному стеклу"
            ],
            "wA": [
                "Для выявления капсулы",
                "Для выявления жгутиков",
                "Для обезжиривания препаратов",
                "Для сохранения размеров бактерий"
            ]
        },
        {
            "qID": 9,
            "qName": "В каждой бактериологической лаборатории должны быть предусмотрены:",
            "rA": [
                "помещения для приготовления питательных сред и стерилизации посуды"
            ],
            "wA": [
                "Боксы для работы с отдельными группами вирусов",
                "Боксы для работы с отдельными группами микроскопических грибов",
                "Учебные аудитории",
                "Препараторская"
            ]
        },
        {
            "qID": 10,
            "qName": "Что изучает медицинская микробиология:",
            "rA": [
                "Патогенные и условно патогенные микроорганизмы"
            ],
            "wA": [
                "Фитопатогенные микроорганизмы",
                "Фотобактерии",
                "Растения",
                "Гельминты"
            ]
        },
        {
            "qID": 11,
            "qName": "Заслуги Пастера в микробиологии:",
            "rA": [
                "Разработка пастеризации"
            ],
            "wA": [
                "Открытие вирусов",
                "Открытие возбудителя туберкулеза",
                "Воспроизвел экспериментальный сифилис",
                "Открытие возбудителя холеры"
            ]
        },
        {
            "qID": 12,
            "qName": "Основной таксономической единицей в микробиологии является:",
            "rA": [
                "Bид"
            ],
            "wA": [
                "Род",
                "Семейство",
                "Порядок",
                "Класс"
            ]
        },
        {
            "qID": 13,
            "qName": "Принципиальным отличием в организации прокариотической клетки от эукариотической является:",
            "rA": [
                "Отсутствие внутриклеточных мембран"
            ],
            "wA": [
                "Отсутствие рибосом",
                "Отсутствие внутриплазматических включений",
                "Отсутствие ЦПМ",
                "Наличие клеточной стенки"
            ]
        },
        {
            "qID": 14,
            "qName": "Значение спор у бацилл:",
            "rA": [
                "Защищают микроорганизм от неблагоприятных воздействий"
            ],
            "wA": [
                "Размножение бактерий",
                "Не сохраняют вид в неблагоприятных условиях",
                "Участие в адгезии микроорганизмов",
                "Накопление питательных веществ"
            ]
        },
        {
            "qID": 15,
            "qName": "Для вирусов характерно:",
            "rA": [
                "Паразитируют внутри клетки"
            ],
            "wA": [
                "Размножаются делением",
                "Имеют клеточное строение",
                "Растут только в аэробных условиях",
                "Образуют споры"
            ]
        },
        {
            "qID": 16,
            "qName": "Строение вирусов изучается методом:",
            "rA": [
                "Электронной микроскопии"
            ],
            "wA": [
                "Световой микроскопии",
                "Темнопольной микроскопии",
                "Люминесцентной микроскопии",
                "Фазово-контрастной микроскопией"
            ]
        },
        {
            "qID": 17,
            "qName": "Тканевые культуры используются для:",
            "rA": [
                "Выращивания вирусов"
            ],
            "wA": [
                "Выращивания бактерий",
                "Выращивания грибов",
                "Получения антибиотиков",
                "Постановки серологических реакций"
            ]
        },
        {
            "qID": 18,
            "qName": "Методы обнаружения (индикации) вирусов на тканевых культурах:",
            "rA": [
                "Цитопатическое действие"
            ],
            "wA": [
                "Газообразование",
                "Трансформация",
                "Коньюгация",
                "Диссоциация"
            ]
        },
        {
            "qID": 19,
            "qName": "Методы обнаружения (индикации) вирусов на курином эмбрионе:",
            "rA": [
                "Гемагглютинация"
            ],
            "wA": [
                "Иммунофлюоресценция",
                "Трансформация",
                "Гемадсорбция",
                "Бляшкообразование"
            ]
        },
        {
            "qID": 20,
            "qName": "Какие методы применяют для титрования фага:",
            "rA": [
                "Грациа и Аппельмана"
            ],
            "wA": [
                "Грациа и Кротова",
                "Коха и Пастера",
                "Дригальского и Видаля",
                "Райта и Вассермана"
            ]
        },
        {
            "qID": 21,
            "qName": "Ученный впервые использовавший раствор карболовой кислоты для обеззараживания ран:",
            "rA": [
                "Листер"
            ],
            "wA": [
                "Кох",
                "Пастер",
                "Ивановский",
                "Флеминг"
            ]
        },
        {
            "qID": 22,
            "qName": "Ученый, впервые сформулировавший понятия об активном и пассивном иммунитете:",
            "rA": [
                "Эрлих"
            ],
            "wA": [
                "Мечников",
                "Кох",
                "Пастер",
                "Леффлер"
            ]
        },
        {
            "qID": 23,
            "qName": "Чистая культура это:",
            "rA": [
                "Совокупность микроорганизмов одного вида"
            ],
            "wA": [
                "Совокупность микроорганизмов разных видов",
                "Совокупность микроорганизмов одного рода",
                "Совокупность микроорганизмов разных родов",
                "Совокупность грамотрицательных микроорганизмов"
            ]
        },
        {
            "qID": 24,
            "qName": "Термостат используется для:",
            "rA": [
                "Выращивания микроорганизмов"
            ],
            "wA": [
                "Стерилизации лабораторной посуды",
                "Стерилизации хирургических инструментов",
                "Стерилизации питательных сред",
                "Стимуляции спорообразования бактерий"
            ]
        },
        {
            "qID": 25,
            "qName": "Размножение бактерий происходит путем:",
            "rA": [
                "Поперечным изоморфным делением"
            ],
            "wA": [
                "Продольным делением",
                "Почкованием",
                "Экзоспорами",
                "Образованием фильтрующих форм"
            ]
        },
        {
            "qID": 26,
            "qName": "Питательная среда для культивирования анаэробов:",
            "rA": [
                "Среда Китта-Тароцци"
            ],
            "wA": [
                "МПА",
                "МПБ",
                "Среды Гисса",
                "Щелочной агар"
            ]
        },
        {
            "qID": 27,
            "qName": "Лаг-фаза это:",
            "rA": [
                "Фаза адаптации и начала интенсивного роста"
            ],
            "wA": [
                "Фаза максимального роста и интенсивного деления",
                "Фаза, при которой число бактериальных клеьток не увеличивается",
                "Фаза, при которой число жизнеспособных клеток неизменно и находится на максимальном уровне",
                "Фаза отмирания бактерий"
            ]
        },
        {
            "qID": 28,
            "qName": "Фаза логарифмического роста:",
            "rA": [
                "Фаза максимального роста и интенсивного деления"
            ],
            "wA": [
                "Фаза начала адаптации и интенсивного роста",
                "Фаза, при которой число бактериальных клеток не увеличивается",
                "Фаза, при которой числоло жизнеспособных клеток неизменно и находится на максимальном уровне",
                "Фаза отмирания бактерий"
            ]
        },
        {
            "qID": 29,
            "qName": "Максимальная стационарная фаза:",
            "rA": [
                "Число жизнеспособных клеток неизменно и находится на максимальном уровне"
            ],
            "wA": [
                "Фаза адаптации и начала интенсивного роста",
                "Фаза максимального роста и интенсивного деления",
                "Фаза, при которой число бактериальных клеток не увеличиваетсяя",
                "Фаза отмирания бактерий"
            ]
        },
        {
            "qID": 30,
            "qName": "Культивирование аэробов предусматривает использование:",
            "rA": [
                "Термостата"
            ],
            "wA": [
                "Свечей Шарберлена",
                "Аппарата Аристовского",
                "Эксикатора",
                "Свечей Омельянского"
            ]
        },
        {
            "qID": 31,
            "qName": "Конститутивные ферменты:",
            "rA": [
                "Постоянно синтезируются в микробных клетках в определенных концентрациях"
            ],
            "wA": [
                "Концентрация резко вырастает при наличии соответствующего субстрата",
                "В отсутствии субстрата находятся в следовых количествах",
                "Концентрация не зависит от наличия соответствующего субстрата",
                "Относятся к факторам роста микроорганизмов"
            ]
        },
        {
            "qID": 32,
            "qName": "У беременной женщины в сыворотке крови в ИФА обнаружили антитела к вирусу СПИД. Какой результат ИФА считается положительным и достаточным при СПИД:",
            "rA": [
                "Из трех повторных - два анализа положительные"
            ],
            "wA": [
                "Достаточно однократного положительного результата",
                "Из трех повторных - один анализ положительный",
                "Из двух повторных - два анализа положительных",
                "Достаточно двухкратного положительного результата"
            ]
        },
        {
            "qID": 33,
            "qName": "Пигменты микроорганизмов:",
            "rA": [
                "Предохраняют от воздействия УФ-лучей"
            ],
            "wA": [
                "Участвуют в получении энергии",
                "Участвуют в биологическом окислении",
                "Являются источником углерода",
                "Являются источником азота"
            ]
        },
        {
            "qID": 34,
            "qName": "Ферментом патогенности бактерий не является:",
            "rA": [
                "Пенициллиназа"
            ],
            "wA": [
                "Плазмокоагулаза",
                "Гиалуронидаза",
                "Лецитиназа",
                "Стрептокиназа"
            ]
        },
        {
            "qID": 35,
            "qName": "Определение сахаролитических ферментов производят при посеве на:",
            "rA": [
                "Среды Гисса"
            ],
            "wA": [
                "Среду Вильсон-Блера",
                "Молоко",
                "Среду Китт-Тароцци",
                "Кровяной агар"
            ]
        },
        {
            "qID": 36,
            "qName": "Период генерации это:",
            "rA": [
                "Период в течении которого осуществляется деление клетки"
            ],
            "wA": [
                "Время адаптации микробов к к изменившимся условиям среды",
                "Период восстановления поврежденных структур",
                "Объединение с бактериальной хромосомой",
                "Период уменьшения скорости отмирания клеток"
            ]
        },
        {
            "qID": 37,
            "qName": "При снятии петлей изолированной колонии с МПА установлено, Что колония слизистая, тянется за петлей. Что можно сказать о микробе:",
            "rA": [
                "Обладает слизистой капсулой"
            ],
            "wA": [
                "Образует спору",
                "Выделяет ацетилметилкарбинол",
                "Имеет фермент триптафаназу",
                "Способен утилизировать цитрат"
            ]
        },
        {
            "qID": 38,
            "qName": "В окрашенных мазках из мокроты больного воспалением легких обнаружены ланцетовидной формы попарно расположенные кокки фиолетового цвета с неокрашенной каймой вокруг. Что представляет собой эта кайма:",
            "rA": [
                "Капсулу"
            ],
            "wA": [
                "Споры",
                "Цитоплазматическую мембрану",
                "Оболочку",
                "Жировосковые вещества"
            ]
        },
        {
            "qID": 39,
            "qName": "У гомосексуалиста на нижних конечностях наблюдаются высыпания, сосудистая опухлость, парное увеличение паховых лимфатических узлов, положительная ИФА. Укажите, какой метод необходимо использовать для окончательного диагноза ВИЧ- инфекции:",
            "rA": [
                "Иммуноблотинг"
            ],
            "wA": [
                "Радиоиммунный анализ",
                "РПГА",
                "Реакцию коагуляции",
                "Иммунофлюоресценция"
            ]
        },
        {
            "qID": 40,
            "qName": "L-формы бактерий:",
            "rA": [
                "Бактерии, утратившие клеточную стенку, но сохранившие способность к размножению"
            ],
            "wA": [
                "Протопласты",
                "Окружены пептидогликаном",
                "Имеют наружную мембрану",
                "Бактерии, имеющие регидную клеточную стенку"
            ]
        },
        {
            "qID": 41,
            "qName": "О чем свидетельствует наличие антител к вирусу СПИД:",
            "rA": [
                "Человек заражен ВИЧ"
            ],
            "wA": [
                "У человека имеется иммунитет от возможного заражения СПИД",
                "Человек находится в инкубационном периоде",
                "Имеются оппортунистические инфекции",
                "Наблюдается выздоровление"
            ]
        },
        {
            "qID": 42,
            "qName": "Значение спор у возбудителя сибирской язвы:",
            "rA": [
                "Способствуют сохранению вида в неблагоприятных условиях"
            ],
            "wA": [
                "Участвуют в размножении",
                "Накопление дополнительных питательных веществ",
                "Являются признаками дегенерации клетки",
                "Участвуют в адгезии"
            ]
        },
        {
            "qID": 43,
            "qName": "В мазке обнаружены палочки, располагающиеся цепочкой с овальным красным, центрально расположенным образованием. Каким методом окрашен мазок:",
            "rA": [
                "Ожешко"
            ],
            "wA": [
                "Леффлера",
                "Грама",
                "Циль-Нильсена",
                "Бурри"
            ]
        },
        {
            "qID": 44,
            "qName": "Входные ворота при менингококковой инфекции:",
            "rA": [
                "слизистая оболочка верхних дыхательных путей"
            ],
            "wA": [
                "Желудочно-кишечный тракт",
                "Кожные покровы",
                "Слизистая половых путей",
                "Слизистая глаза"
            ]
        },
        {
            "qID": 45,
            "qName": "Простые методы окраски позволяют:",
            "rA": [
                "Изучить форму микробов"
            ],
            "wA": [
                "Выявить оболочку",
                "Окрасить капсулу",
                "Изучить структуру бактериальной клетки",
                "Окрасить жгутики"
            ]
        },
        {
            "qID": 46,
            "qName": "Что необходимо сделать для постановки диагноза СПИД:",
            "rA": [
                "ИФА"
            ],
            "wA": [
                "РНГА",
                "Радиоиммунный анализ",
                "Реакцию коагуляции",
                "Иммунофлюоресценции"
            ]
        },
        {
            "qID": 47,
            "qName": "В мазке из культуры микробов под объективом видны скопления кокков по форме напоминающие пакеты или тюки синего цвета. Назовите эти кокки:",
            "rA": [
                "Сарцины"
            ],
            "wA": [
                "Стафилококки",
                "Микрококки",
                "Менингококки",
                "Стрептококки"
            ]
        },
        {
            "qID": 48,
            "qName": "Кислотоустойчивость характерна для:",
            "rA": [
                "Туберкулезной палочки"
            ],
            "wA": [
                "Дифтерийной палочки",
                "Брюшнотифозной палочки",
                "Стафилококков",
                "Риккетсий"
            ]
        },
        {
            "qID": 49,
            "qName": "Окрашивание по Циль-Нильсену применяют для выявления:",
            "rA": [
                "Кислотоустойчивых бактерий"
            ],
            "wA": [
                "Спор",
                "Капсул",
                "Зерен волютина",
                "Цитоплазматической мембраны"
            ]
        },
        {
            "qID": 50,
            "qName": "Чем отличается метод темнопольной микроскопии от других методов:",
            "rA": [
                "Объект освещен косыми боковыми лучами не попадающими в объектив"
            ],
            "wA": [
                "Дает увеличение в 250 тысяч раз",
                "Используется для изучения структуры вирусов и бактерий",
                "Разрешающая способность микроскопа 0,2 мкм"
            ]
        },
        {
            "qID": 51,
            "qName": "У больного температура 39 градусов, озноб, сильная головная боль, рвота, ригидность мышц затылка. Выделена чистая культура грамотрицательных бобовидных кокков, расположенных попарно. Какой берут материал на исследование при данном заболевании:",
            "rA": [
                "Спинно-мозговую жидкость"
            ],
            "wA": [
                "Мочу",
                "Слизь из носоглотки",
                "Кровь",
                "Испражнения"
            ]
        },
        {
            "qID": 52,
            "qName": "Морфологические особенности спирохет:",
            "rA": [
                "Относятся к извитым формам бактерий"
            ],
            "wA": [
                "Наличие спор",
                "Оформленное ядро",
                "Наличие зерен волютина",
                "Сократимость протоплазмы"
            ]
        },
        {
            "qID": 53,
            "qName": "От других групп микроорганизмов актиномицеты отличаются тем, что:",
            "rA": [
                "Имеют вид длинных ветвящихся нитей"
            ],
            "wA": [
                "Грамотрицательные",
                "Кислотоустойчивые",
                "Имеют зерна волютина",
                "В составе пептидогликана обнаружены арабиноза, галактоза"
            ]
        },
        {
            "qID": 54,
            "qName": "N. Menіngіtіdіs отличаются от непатогенных нейсерий:",
            "rA": [
                "Не растут при температуре 22ӘС"
            ],
            "wA": [
                "Положительной оксидазной пробой",
                "Не растут при температуре 37ӘС",
                "Грамотрицательны",
                "Вегетируют на слизистых верхних дыхательных путей"
            ]
        },
        {
            "qID": 55,
            "qName": "Для риккетсий характерно:",
            "rA": [
                "Полиморфизм"
            ],
            "wA": [
                "Подвижность",
                "Кислотоустойчивость",
                "Ригидная оболочка",
                "Наличие зерен волютина"
            ]
        },
        {
            "qID": 56,
            "qName": "Морфологические особенности хламидий:",
            "rA": [
                "Морфология зависит от стадии внутриклеточного развития"
            ],
            "wA": [
                "Кислотоустойчивые микроорганизмы",
                "Образование внутриклеточных включений",
                "В организме образуют капсулу",
                "Имеют только РНК"
            ]
        },
        {
            "qID": 57,
            "qName": "Для морфологии и строения грибов характерно:",
            "rA": [
                "Образование мицелия"
            ],
            "wA": [
                "Отсутствие клеточной стенки",
                "Образование капсулы",
                "Диффузно расположенная ядерная субстанция"
            ]
        },
        {
            "qID": 58,
            "qName": "Постинфекционный иммунитет при менингите:",
            "rA": [
                "Прочный антимикробный"
            ],
            "wA": [
                "Тканевой",
                "Непрочный",
                "Пассивный",
                "Антитоксический"
            ]
        },
        {
            "qID": 59,
            "qName": "Инкубационный период при синдроме приобретенного иммунного дефицита:",
            "rA": [
                "2-4 недели, до 10 лет больше"
            ],
            "wA": [
                "Отсутствует",
                "Характеризуется появлением слабости, поноса, ночных потов",
                "2-3 часа",
                "Развитие осложнений"
            ]
        },
        {
            "qID": 60,
            "qName": "Расположение кокков в мазке-препарате зависит от:",
            "rA": [
                "Деления в разных плоскостях"
            ],
            "wA": [
                "Размеров кокков",
                "Количества и расположения жгутиков",
                "Различия в капсулообразовании",
                "Процесса коньюгации"
            ]
        },
        {
            "qID": 61,
            "qName": "Как называются кокки, располагающиеся в виде гроздьев винограда:",
            "rA": [
                "Стафилококки"
            ],
            "wA": [
                "Стрептококки",
                "Сарцины",
                "Бациллы",
                "Микрококки"
            ]
        },
        {
            "qID": 62,
            "qName": "Органелла бактерий, препятствующая фагоцитозу:",
            "rA": [
                "Капсула"
            ],
            "wA": [
                "Спора",
                "Клеточная стенка",
                "Жгутики",
                "Цитоплазма"
            ]
        },
        {
            "qID": 63,
            "qName": "Метод применяемый для окрашивания кислотоустойчивых бактерий:",
            "rA": [
                "Циль-Нильсена"
            ],
            "wA": [
                "Романовского-Гимза",
                "Грама",
                "Здродовского",
                "Бурри"
            ]
        },
        {
            "qID": 64,
            "qName": "Метод окрашивания спирохет:",
            "rA": [
                "Романовского-Гимза"
            ],
            "wA": [
                "Грама",
                "Циль-Нильсена",
                "Здродовского",
                "Бурри"
            ]
        },
        {
            "qID": 65,
            "qName": "Функции жгутиков:",
            "rA": [
                "Обеспечивают подвижность"
            ],
            "wA": [
                "Защищают бактерии от неблагоприятных внешних воздействий",
                "Придают определенную форму бактериям",
                "Осуществляют транспорт растворенных веществ в клетку",
                "Участвуют в делении клетки"
            ]
        },
        {
            "qID": 66,
            "qName": "Как называются кокки, располагающиеся цепочками:",
            "rA": [
                "Стрептококки"
            ],
            "wA": [
                "Сарцины",
                "микрококки",
                "Стафилококки",
                "Бациллы"
            ]
        },
        {
            "qID": 67,
            "qName": "Длительность сохранения спор во внешней среде:",
            "rA": [
                "Несколько лет"
            ],
            "wA": [
                "Несколько часов",
                "Несколько минут",
                "Несколько дней",
                "Несколько недель"
            ]
        },
        {
            "qID": 68,
            "qName": "В каких единицах измеряются размеры бактерий:",
            "rA": [
                "Микрометры"
            ],
            "wA": [
                "Нанометры",
                "Миллиметры",
                "Ангстремы",
                "Сантиметры"
            ]
        },
        {
            "qID": 69,
            "qName": "Вирион представляет собой:",
            "rA": [
                "Полноценную вирусную частицу"
            ],
            "wA": [
                "Молекулу ДНК",
                "Молекулу РНК",
                "Капсид",
                "Суперкапсид"
            ]
        },
        {
            "qID": 70,
            "qName": "Размеры вириона измеряются в:",
            "rA": [
                "Нанометрах"
            ],
            "wA": [
                "Миллиметрах",
                "Сантиметрах",
                "Ангстремах",
                "Микрометрах"
            ]
        },
        {
            "qID": 71,
            "qName": "Клон:",
            "rA": [
                "Культура микроорганизмов, полученная из одной особи."
            ],
            "wA": [
                "Совокупность особей одного вида.",
                "Культура, выделенная из определенного источника.",
                "Совокупность особей, имеющих один фенотип.",
                "Микробные особи одного вида, выращенные на питательной среде."
            ]
        },
        {
            "qID": 72,
            "qName": "Бактерии:",
            "rA": [
                "Микроорганизмы, не имеющие оформленного ядра."
            ],
            "wA": [
                "Относятся к эукариотам.",
                "Имеют ядерную оболочку.",
                "Имеют вирион.",
                "Мельчайшие, не видимые в световом микроскопе частицы."
            ]
        },
        {
            "qID": 73,
            "qName": "Капсид состоит из :",
            "rA": [
                "Капсомеров"
            ],
            "wA": [
                "Липополисахаридной оболочки",
                "Липопротеидной оболочки",
                "ДНК",
                "РНК"
            ]
        },
        {
            "qID": 74,
            "qName": "Возбудитель ботулизма образует:",
            "rA": [
                "Нейротоксин"
            ],
            "wA": [
                "Гиалуронидазу",
                "Фибринолизин",
                "Тетанолизин",
                "Эндотоксин"
            ]
        },
        {
            "qID": 75,
            "qName": "Аспергилла относятся к царству:",
            "rA": [
                "Eucaryotae."
            ],
            "wA": [
                "Procarіotae.",
                "Vіra.",
                "Protozoa.",
                "Anіmalіa"
            ]
        },
        {
            "qID": 76,
            "qName": "Адгезия:",
            "rA": [
                "Способность прикрепляться к клеткам."
            ],
            "wA": [
                "Защита от фагоцитоза.",
                "Способность к распространению возбудителя.",
                "Способность размножаться на поверхности клеток.",
                "Способность проникать в клетки и ткани."
            ]
        },
        {
            "qID": 77,
            "qName": "Экзотоксины:",
            "rA": [
                "Термолабильные белки."
            ],
            "wA": [
                "Липополисахариды.",
                "Капсомеры.",
                "Вещества, избирательно подавляющие жизнедеятельность микроорганизмов.",
                "Природные антибиотики."
            ]
        },
        {
            "qID": 78,
            "qName": "Эндотоксины:",
            "rA": [
                "Термостабильные липополисахариды"
            ],
            "wA": [
                "Мембранотоксины.",
                "Антиэлонгаторы,",
                "Белковые вещества.",
                "Постоянно выделяются в окружающую среду."
            ]
        },
        {
            "qID": 79,
            "qName": "Периоды инфекционного заболевания:",
            "rA": [
                "Реконвалесценция."
            ],
            "wA": [
                "Инвазия.",
                "Манифестная.",
                "Рекомбинация.",
                "Септикопиемия."
            ]
        },
        {
            "qID": 80,
            "qName": "Гонококки вызывают:",
            "rA": [
                "Гонорею"
            ],
            "wA": [
                "Ревматизм",
                "Гепатит",
                "Скарлатину",
                "Столбняк"
            ]
        },
        {
            "qID": 81,
            "qName": "Для микроскопического метода диагностики гонореи берут:",
            "rA": [
                "Отделяемое из уретры"
            ],
            "wA": [
                "СМЖ",
                "Пунктат из бубона",
                "Кровь больного",
                "Испражнения"
            ]
        },
        {
            "qID": 82,
            "qName": "Микробиологические методы исследования при гонококковых заболеваниях:",
            "rA": [
                "Микроскопия мазков из патологического материала"
            ],
            "wA": [
                "Заражение лабораторных животных",
                "Реакция преципитации",
                "Реакция нейтрализации",
                "Посев на щелочной агар"
            ]
        },
        {
            "qID": 83,
            "qName": "Ускоренная диагностика газовой анаэробной инфекции:",
            "rA": [
                "Газово-жидкостная хромотография"
            ],
            "wA": [
                "Метод Ермольевой",
                "Выявляет наличие клостридий",
                "Реакция нейтрализации",
                "Биологический метод"
            ]
        },
        {
            "qID": 84,
            "qName": "Входные ворота инфекции при гонорее:",
            "rA": [
                "Цилиндрический эпителий слизистой оболочки мочеполового тракта"
            ],
            "wA": [
                "Слизистая оболочка трахеи и бронхов",
                "Слизистая оболочка кишечного тракта",
                "Кожные покровы",
                "Кровь"
            ]
        },
        {
            "qID": 85,
            "qName": "Диагностика острой гонореи:",
            "rA": [
                "Бактериоскопический метод"
            ],
            "wA": [
                "РСК",
                "Биологический метод",
                "Реакция агглютинации",
                "Аллергическая проба"
            ]
        },
        {
            "qID": 86,
            "qName": "Заболевания, вызванные условно-патогенными микроорганизмами характеризуются:",
            "rA": [
                "Полиэтиологичностью."
            ],
            "wA": [
                "Строго выраженной органной локализацией.",
                "Отсутствием продромального периода.",
                "Подавлением одной популяции другой.",
                "Одинаковым инкубационным периодом."
            ]
        },
        {
            "qID": 87,
            "qName": "Инфекция:",
            "rA": [
                "Заражение."
            ],
            "wA": [
                "Микробиоценоз.",
                "Подавление жизнедеятельности одной популяции другой.",
                "Форма существования двух патогенных микробов.",
                "Симбиоз нормальной микрофлоры с макроорганизмом."
            ]
        },
        {
            "qID": 88,
            "qName": "Инфекционные заболевания характеризуются:",
            "rA": [
                "Цикличностью течения."
            ],
            "wA": [
                "Отсутствием контагиозности.",
                "Одинаковым инкубационным периодом.",
                "Отсутствием продромального периода.",
                "Вызываются только бактериями."
            ]
        },
        {
            "qID": 89,
            "qName": "Формы инфекции в зависимости от распространения микробов:",
            "rA": [
                "Очаговая."
            ],
            "wA": [
                "Острая.",
                "Хроническая.",
                "Эндогенная.",
                "Рецидив."
            ]
        },
        {
            "qID": 90,
            "qName": "Реинфекция:",
            "rA": [
                "Повторное заражение тем же возбудителем после выздоровления"
            ],
            "wA": [
                "Повторное заражение бактериями другого вида.",
                "Возникает при заболеваниях со стойким иммунитетом.",
                "Возникает за счет нормальной микрофлоры.",
                "Повторное заражение тем же возбудителем до ликвидации первичного заболевания"
            ]
        },
        {
            "qID": 91,
            "qName": "Формы инфекции по источнику возбудителя:",
            "rA": [
                "Зоонозная."
            ],
            "wA": [
                "Пандемия.",
                "Латентная.",
                "Экзогенная.",
                "Бактериемия."
            ]
        },
        {
            "qID": 92,
            "qName": "Рецидив:",
            "rA": [
                "Возникновение болезни через некоторое время после ее прекращения за счет оставшихся в организме возбудителей."
            ],
            "wA": [
                "Повторное заболевание после полного выздоровления за счет вторичного заражения извне.",
                "В организме вегетирует патогенный микроб, но заболевания не возникает.",
                "Форма инфекции при которой к основному заболеванию присоединяется другое.",
                "Повторное заболевание той же инфекцией, наступившее до ликвидации первичного заболевания."
            ]
        },
        {
            "qID": 93,
            "qName": "Укажите форму инфекции:",
            "rA": [
                "Рецидив."
            ],
            "wA": [
                "Мутуализм.",
                "Сенсибилизация.",
                "Реконвалесценция.",
                "Продром"
            ]
        },
        {
            "qID": 94,
            "qName": "Выберите состояние, когда микроб попадает в кровь и размножается в ней:",
            "rA": [
                "Сепсис."
            ],
            "wA": [
                "Токсинемия.",
                "Бактериемия.",
                "Септикопиемия.",
                "Лейкемия."
            ]
        },
        {
            "qID": 95,
            "qName": "Сколько периодов развития  инфекционного заболевания:",
            "rA": [
                "Четыре"
            ],
            "wA": [
                "Три.",
                "Пять",
                "Шесть",
                "Два"
            ]
        },
        {
            "qID": 96,
            "qName": "Выберите и дополните определение - \"Суперинфекция - это…:",
            "rA": [
                "Если заболевание возобновилось до выздоровления в результате инфицирования тем же возбудителем."
            ],
            "wA": [
                "Когда инфекция вызвана разными видами микробов.",
                "Когда заболевание возникает после клинического выздоровления без повторного заражения, за счет оставшихся в организме возбудителей.",
                "Состояние, когда организм перенес какую-либо инфекцию и вторично заболевает в результате нового заражения тем же возбудителем.",
                "Когда к первоначальной, основной, уже развившейся болезни присоединяется другая, вызываемая новым возбудителем."
            ]
        },
        {
            "qID": 97,
            "qName": "Выберите бактерии, которые секретируют энтеротоксины:",
            "rA": [
                "Холерный вибрион."
            ],
            "wA": [
                "Бруцеллы.",
                "Возбудитель чумы.",
                "Пневмококки.",
                "Гонококк."
            ]
        },
        {
            "qID": 98,
            "qName": "Для патогенных микробов характерны:",
            "rA": [
                "Нозологическая специфичность и органотропность."
            ],
            "wA": [
                "Полиэтиологичность.",
                "Отсутствие характерной клинической картины.",
                "Вызывают заболевания только на фоне первичного инфекционного заболевания.",
                "Не имеют строго выраженной органной локализации."
            ]
        },
        {
            "qID": 99,
            "qName": "Особенность вирусной инфекции:",
            "rA": [
                "Облигатный внутриклеточный паразитизм."
            ],
            "wA": [
                "Короткий инкубационный период.",
                "Развитие бактериемии.",
                "Отсутствие взаимодействия между геномом вируса и геномом клетки макроорганизма.",
                "Отсутствием специфичности действия."
            ]
        },
        {
            "qID": 100,
            "qName": "Самозаражение путем переноса возбудителя из одного биотопа в другой называется:",
            "rA": [
                "Аутоинфекция"
            ],
            "wA": [
                "Реинфекция",
                "Рецидив",
                "Моноинфекция",
                "Бактерионосительство"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
