var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Через верхне глазничную щель проходят следующие образования",
            "rA": [
                "глазодвигательные нервы"
            ],
            "wA": [
                "зрительный нерв",
                "верхне глазничная артерия",
                "глазная артерия"
            ]
        },
        {
            "qID": 2,
            "qName": "Веки являются",
            "rA": [
                "защитным аппаратом органа зрения"
            ],
            "wA": [
                "частью глазного яблока",
                "слезным аппаратом органа зрения",
                "частью фиброзной оболочки глаза"
            ]
        },
        {
            "qID": 3,
            "qName": "К слезопродуцирующим органам относятся",
            "rA": [
                "слезная железа и добавочные слезные железки"
            ],
            "wA": [
                "слезные точки",
                "слезные канальцы",
                "слезный мешок"
            ]
        },
        {
            "qID": 4,
            "qName": "Роговая оболочка состоит",
            "rA": [
                "из пяти слоев"
            ],
            "wA": [
                "из двух слоев",
                "из трех слоев",
                "из четырех слоев"
            ]
        },
        {
            "qID": 5,
            "qName": "Склера предназначена",
            "rA": [
                "для защиты внутренних образований глаза"
            ],
            "wA": [
                "для трофики глаза",
                "для преломления света",
                "для аккомодации"
            ]
        },
        {
            "qID": 6,
            "qName": "Сосудистая оболочка глаза состоит из всех перечисленных отделов, кроме",
            "rA": [
                "сетчатки"
            ],
            "wA": [
                "хориоидеи",
                "ресничного тела",
                "радужки"
            ]
        },
        {
            "qID": 7,
            "qName": "Внутриглазную жидкость вырабатывает",
            "rA": [
                "ресничное тело"
            ],
            "wA": [
                "радужка",
                "хориоидея",
                "хрусталик"
            ]
        },
        {
            "qID": 8,
            "qName": "Сетчатка выполняет функцию",
            "rA": [
                "восприятия света"
            ],
            "wA": [
                "преломления света",
                "трофическую",
                "питательную"
            ]
        },
        {
            "qID": 9,
            "qName": "Хориоидея питает",
            "rA": [
                "сетчатку"
            ],
            "wA": [
                "ресничное тело",
                "хрусталик",
                "радужку"
            ]
        },
        {
            "qID": 10,
            "qName": "Влага передней камеры служит для",
            "rA": [
                "всего вышеперечисленного"
            ],
            "wA": [
                "питания роговицы",
                "преломления света",
                "выведения отработанных продуктов обмена"
            ]
        },
        {
            "qID": 11,
            "qName": "Цветоощущение исследуется",
            "rA": [
                "таблицами Рабкина"
            ],
            "wA": [
                "таблицами Сивцева Головина",
                "на четырехточечном цветотесте",
                "на периметре"
            ]
        },
        {
            "qID": 12,
            "qName": "Колбочковый аппарат глаза осуществляет в первую очередь функцию",
            "rA": [
                "центрального зрения"
            ],
            "wA": [
                "светоощущения",
                "адаптации к свету",
                "периферического зрения"
            ]
        },
        {
            "qID": 13,
            "qName": "Гомонимная и гетеронимная гемианопсия наблюдается у больных",
            "rA": [
                "патологических изменениях зрительных путей и ЦНС"
            ],
            "wA": [
                "при дегенеративных изменениях сетчатки",
                "помутнениях роговицы",
                "помутнениях хрусталика"
            ]
        },
        {
            "qID": 14,
            "qName": "Световая адаптация глаз   это",
            "rA": [
                "приспособление глаза к различным уровням яркости света"
            ],
            "wA": [
                "видение предметов на различном расстоянии",
                "приспособление к яркому свету",
                "аккомодация"
            ]
        },
        {
            "qID": 15,
            "qName": "Авитаминозом, который клинически проявляется такими глазными проявлениями, как ксероз, кератомаляция и гемералопия.является дефицит",
            "rA": [
                "витамина А"
            ],
            "wA": [
                "витамина группы В",
                "витамина С",
                "витамина Д"
            ]
        },
        {
            "qID": 16,
            "qName": "Для формирования бинокулярного зрения необходимо",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "параллельное положение осей обоих глаз",
                "наличие двух глаз",
                "острота обоих глаз не менее 0,4"
            ]
        },
        {
            "qID": 17,
            "qName": "Пределами изменения физической рефракции глаза в норме являются!",
            "rA": [
                "от 52 до 71 Дптр"
            ],
            "wA": [
                "от 0 до 20 Дптр",
                "от 21 до 51 Дптр",
                "от 72 до 91 Дптр"
            ]
        },
        {
            "qID": 18,
            "qName": "Клиническая рефракция   это",
            "rA": [
                "соотношение между физической рефракцией и длиной оси глаза"
            ],
            "wA": [
                "преломляющая сила оптической системы, выраженная в диоптриях",
                "преломляющая сила хрусталика",
                "главные плоскости оптической системы"
            ]
        },
        {
            "qID": 19,
            "qName": "Дальнейшая точка ясного видения   это",
            "rA": [
                "точка, к которой установлен глаз в состоянии покоя аккомодации"
            ],
            "wA": [
                "точка, расположенная в 1 метре от глаза",
                "точка, расположенная в области передней главной плоскости",
                "точка ясного видения при максимальном напряжении аккомодации"
            ]
        },
        {
            "qID": 20,
            "qName": "Преломляющей силой линзы называется",
            "rA": [
                "величина, обратная фокусному расстоянию линзы"
            ],
            "wA": [
                "радиус кривизны передней поверхности линзы",
                "радиус кривизны задней поверхности линзы",
                "фокусное расстояние линзы"
            ]
        },
        {
            "qID": 21,
            "qName": "Отрицательная сферическая линза",
            "rA": [
                "уменьшает изображение и корригирует миопию"
            ],
            "wA": [
                "увеличивает изображение и корригирует гиперметропию",
                "увеличивает изображение и корригирует миопию",
                "уменьшает изображение и корригирует гиперметропию"
            ]
        },
        {
            "qID": 22,
            "qName": "Рефрактометр служит",
            "rA": [
                "для объективного определения рефракции глаза"
            ],
            "wA": [
                "для определения полей зрения",
                "для определения бинокулярного зрения",
                "для определения светоощущения"
            ]
        },
        {
            "qID": 23,
            "qName": "Пресбиопия развивается",
            "rA": [
                "с 40 лет"
            ],
            "wA": [
                "к 10 годам",
                "к 20 годам",
                "к 30 годам"
            ]
        },
        {
            "qID": 24,
            "qName": "Оптическую коррекцию при гиперметропии назначают",
            "rA": [
                "при постоянном или периодическом сходящемся косоглазии"
            ],
            "wA": [
                "при наличие катаракты",
                "при частых капризах ребенка",
                "перед хирургическом лечении"
            ]
        },
        {
            "qID": 25,
            "qName": "Для чтения эмметропу в возрасте 60 лет требуются очки",
            "rA": [
                "+3,0 диоптрии"
            ],
            "wA": [
                "+1,0 диоптрия",
                "+2,0 диоптрии",
                "+4,0 диоптрии"
            ]
        },
        {
            "qID": 26,
            "qName": "Противопоказанием к операции кератотомии служит все, кроме",
            "rA": [
                "неправильного астигматизма"
            ],
            "wA": [
                "воспалительных заболеваний глазного яблока",
                "халазиона",
                "прогрессирующей миопии"
            ]
        },
        {
            "qID": 27,
            "qName": "Пресбиопия   это",
            "rA": [
                "возрастная гиперметропия"
            ],
            "wA": [
                "косоглазие",
                "астигматизм",
                "возрастная миопия"
            ]
        },
        {
            "qID": 28,
            "qName": "Основными причинами паралича аккомодации являются",
            "rA": [
                "отравления атропином и при инстиляциях атропином"
            ],
            "wA": [
                "глаукома",
                "неврит",
                "катаракта"
            ]
        },
        {
            "qID": 29,
            "qName": "В связи с аккомодацией различают косоглазие",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "неаккомодационное",
                "частично аккмодационное",
                "аккомодационное"
            ]
        },
        {
            "qID": 30,
            "qName": "Амблиопия чаще встречается",
            "rA": [
                "при монолатеральном косоглазии"
            ],
            "wA": [
                "при альтернирующем косоглазии",
                "при паралитическом косоглазии",
                "при вертикальном косоглазии"
            ]
        },
        {
            "qID": 31,
            "qName": "Прямая окклюзия   это",
            "rA": [
                "выкпючение «лучше видящего глаза»"
            ],
            "wA": [
                "выключение «хуже видящего глаза»",
                "попеременное выключение глаза",
                "выключение глаза на целый день"
            ]
        },
        {
            "qID": 32,
            "qName": "Мейбомиевы железы, расположенные в хрящевой пластинке век выделяют",
            "rA": [
                "сальный секрет"
            ],
            "wA": [
                "слезу",
                "слизистый секрет",
                "внутриглазную жидкость"
            ]
        },
        {
            "qID": 33,
            "qName": "Бактерицидное действие слезы обеспечивает присутствие в ней",
            "rA": [
                "лизоцима"
            ],
            "wA": [
                "лидазы",
                "хемотрипсина",
                "фосфатазы"
            ]
        },
        {
            "qID": 34,
            "qName": "Показания к вскрытию абсцесса",
            "rA": [
                "появление флюктуации"
            ],
            "wA": [
                "выраженная гиперемия век",
                "выраженный отек",
                "болезненность при пальпации"
            ]
        },
        {
            "qID": 35,
            "qName": "Клинические признаки рожистого воспаления век включают",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "выраженную гиперемию и отек век",
                "резкую границу с нормальной тканью",
                "увеличение региональных лимфатических узлов"
            ]
        },
        {
            "qID": 36,
            "qName": "При лагофтальме возможно развитие",
            "rA": [
                "ксероза роговицы"
            ],
            "wA": [
                "эрозии роговицы из за травматизма",
                "экзофтальма",
                "эндофтальма"
            ]
        },
        {
            "qID": 37,
            "qName": "Эпикантус   это ...",
            "rA": [
                "кожная складка, соединяющая веки"
            ],
            "wA": [
                "опущение верхнего века",
                "узкая глазная щель",
                "плотное образование на верхнем веке"
            ]
        },
        {
            "qID": 38,
            "qName": "Наиболее частым осложнением со стороны органа зрения при эпидемическом паротите может быть",
            "rA": [
                "дакриоаденит"
            ],
            "wA": [
                "блефарит",
                "атрофия зрительного нерва",
                "каналикулит"
            ]
        },
        {
            "qID": 39,
            "qName": "К воспалительным заболеваниям век относятся все, кроме",
            "rA": [
                "дакриоцистит"
            ],
            "wA": [
                "блефарит",
                "ячмень",
                "меймобеит"
            ]
        },
        {
            "qID": 40,
            "qName": "При заболевании корью ранними офтальмологическими ее симптомами могут быть",
            "rA": [
                "светобоязнь"
            ],
            "wA": [
                "помутнение роговицы",
                "покраснение глаз",
                "гнойное отделяемое из конъюнктивальной полости"
            ]
        },
        {
            "qID": 41,
            "qName": "Наиболее частые изменения органа зрения при врожденной патологии соединительной ткани у детей",
            "rA": [
                "помутнение роговицы"
            ],
            "wA": [
                "косоглазие",
                "отслойка сетчатки",
                "нистагм"
            ]
        },
        {
            "qID": 42,
            "qName": "Диффузное острое воспаление ретробульбарной клетчатки   это ...",
            "rA": [
                "флегмона"
            ],
            "wA": [
                "остеопериостит",
                "фурункул",
                "ячмень"
            ]
        },
        {
            "qID": 43,
            "qName": "Наиболее характерные признаки злокачественной опухоли орбиты",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "ограничение подвижности глазного яблока",
                "относительно быстрое снижение зрительной функции",
                "экзофтальм, отек век и окружающих глаз тканей"
            ]
        },
        {
            "qID": 44,
            "qName": "Флегмону слезного мешка вскрывают через кожу при наличии",
            "rA": [
                "абсцесса в области слезного мешка"
            ],
            "wA": [
                "плотной опухоли слезного мешка",
                "гиперемии и припухлости в этой области",
                "свища в указанной зоне"
            ]
        },
        {
            "qID": 45,
            "qName": "Лечение весеннего катара включает",
            "rA": [
                "лечение кортикостероидами"
            ],
            "wA": [
                "хирургическое лечение",
                "лечение антибиотиками",
                "лечение противовиручными препаратами"
            ]
        },
        {
            "qID": 46,
            "qName": "Чувствительность роговицы страдает при поражении",
            "rA": [
                "тройничного нерва"
            ],
            "wA": [
                "лицевого нерва",
                "глазодвигательного нерва",
                "зрительного нерва"
            ]
        },
        {
            "qID": 47,
            "qName": "Наиболее информативным методом диагностики офтальмогерпеса является",
            "rA": [
                "полимеразная цепная реакция"
            ],
            "wA": [
                "цитологическая диагностика",
                "метод флюоресцирующих антител",
                "микроскопическая диагностика"
            ]
        },
        {
            "qID": 48,
            "qName": "Сочетание признаков   светобоязнь, слезотечение. блеФароспазм, чувство инородного тела под верхним веком   характерно для ...",
            "rA": [
                "кератита"
            ],
            "wA": [
                "катаракты",
                "отслойки сетчатки",
                "атрофии зрительного нерва"
            ]
        },
        {
            "qID": 49,
            "qName": "Для кератита не характерно",
            "rA": [
                "повышенное внутриглазное давление"
            ],
            "wA": [
                "снижение тактильной чувствительности роговицы",
                "наличие инфильтратов роговицы",
                "перикорнеальная или смешанная инъекция роговицы"
            ]
        },
        {
            "qID": 50,
            "qName": "Эрозия роговицы может сопровождаться",
            "rA": [
                "светобоязнью"
            ],
            "wA": [
                "сужением полей зрения",
                "повышением ВГД",
                "косоглазием"
            ]
        },
        {
            "qID": 51,
            "qName": "В этиологии склеритов и эпискперитов не имеет значения",
            "rA": [
                "гипертоническая болезнь"
            ],
            "wA": [
                "сифилис",
                "туберкулез",
                "ревматическая болезнь"
            ]
        },
        {
            "qID": 52,
            "qName": "Парез лицевого нерва может привести",
            "rA": [
                "кератопатии и кератиту"
            ],
            "wA": [
                "к повышению внутриглазного давления",
                "нистагму и косоглазию",
                "спазму аккомодации"
            ]
        },
        {
            "qID": 53,
            "qName": "Противопоказанием к назначению контактных линз является",
            "rA": [
                "нарушение целостности роговицы"
            ],
            "wA": [
                "гипертоническая болезнь",
                "глазные операции в анамнезе",
                "тромбоз центральной вены сетчатки"
            ]
        },
        {
            "qID": 54,
            "qName": "Снижение остроты зрения при заболеваниях роговицы может быть связано",
            "rA": [
                "с любым из перечисленного"
            ],
            "wA": [
                "с помутнением роговицы",
                "с васкуляризацией роговицы",
                "с нарушением нормальной сферичности роговицы"
            ]
        },
        {
            "qID": 55,
            "qName": "Какой симптом из роговичного синдрома преобладает при кератите",
            "rA": [
                "светобоязнь"
            ],
            "wA": [
                "слезотечение",
                "гнойное отделяемое",
                "чувство инородного тела под верхним веком"
            ]
        },
        {
            "qID": 56,
            "qName": "Для лечения внутриглазного герпеса используются все перечисленные средства, за исключением",
            "rA": [
                "антибиотиков"
            ],
            "wA": [
                "противовирусных средств",
                "иммунокорригирующих средств",
                "антихолинэстеразных средств"
            ]
        },
        {
            "qID": 57,
            "qName": "Лечение исходов кератитов",
            "rA": [
                "кератопластика"
            ],
            "wA": [
                "элефаропластика",
                "плеоптика",
                "диплоптика"
            ]
        },
        {
            "qID": 58,
            "qName": "Основная жалоба при иридоциклите",
            "rA": [
                "боль в глазу"
            ],
            "wA": [
                "светобоязнь",
                "покраснение глаза",
                "чувство песка в глазу"
            ]
        },
        {
            "qID": 59,
            "qName": "Основные клинические признаки иридоиикпита",
            "rA": [
                "преципитаты"
            ],
            "wA": [
                "красный рефлекс с глазного дна",
                "застойный ДЗН",
                "отек век"
            ]
        },
        {
            "qID": 60,
            "qName": "Ревматический артрите характерной триадой поражений глаз называется",
            "rA": [
                "синдром Стилла"
            ],
            "wA": [
                "синдром Марфана",
                "болезнь Тея Сакса",
                "синдром «голубых склер»"
            ]
        },
        {
            "qID": 61,
            "qName": "Экстренная помощь при иридоциклите включает инстилляции ...",
            "rA": [
                "1% р ром атропина сульфата"
            ],
            "wA": [
                "1% р ром пилокарпина",
                "2% р ром борной кислоты",
                "3% колларгола"
            ]
        },
        {
            "qID": 62,
            "qName": "Наибольшая вероятность развития диабетических ретинопатий зависит от ...",
            "rA": [
                "длительности течения диабета"
            ],
            "wA": [
                "остроты течения процесса",
                "наличия сопутствующих заболеваний у больных",
                "сахарным диабетом",
                "наличия диабетической катаракты"
            ]
        },
        {
            "qID": 63,
            "qName": "Симптом «раздавленного помидора» наблюдается ПРИ ...",
            "rA": [
                "тромбозе центральной вены сетчатки"
            ],
            "wA": [
                "неврите зрительного нерва",
                "эмболии центральной артерии сетчатки",
                "отслойке сетчатки"
            ]
        },
        {
            "qID": 64,
            "qName": "Микроаневризмы характерны",
            "rA": [
                "для диабетической ретинопатии"
            ],
            "wA": [
                "для ретинопатии почечного генеза",
                "для гипертонической ретинопатии",
                "для атеросклеротической ретинопатии"
            ]
        },
        {
            "qID": 65,
            "qName": "При заболеваниях почек, которые могут проявиться такими изменениями на глазном дне. как неравномерное сужение артерий, отек диска зрительного нерва, белесоватые очажки, сливающиеся в «фигуру звезды» в центре глазного дна:",
            "rA": [
                "гломерулонефрит"
            ],
            "wA": [
                "мочекаменная болезнь",
                "пиелонефрит",
                "пиелорэктазия"
            ]
        },
        {
            "qID": 66,
            "qName": "Ретинобластома   это ...",
            "rA": [
                "злокачественная внутриглазная опухоль, проявляющаяся к 2 3 годам"
            ],
            "wA": [
                "повышение внутриглазного давления",
                "кровоизлияние в стекловидное тело",
                "злокачественная опухоль орбиты"
            ]
        },
        {
            "qID": 67,
            "qName": "Атрофия зрительного нерва может наблюдаться в исходе",
            "rA": [
                "глаукомы"
            ],
            "wA": [
                "катаракты",
                "халазиона",
                "кератита"
            ]
        },
        {
            "qID": 68,
            "qName": "Наиболее часто застойный диск зрительного нерва встречается",
            "rA": [
                "при опухолях головного мозга"
            ],
            "wA": [
                "при гипертонической болезни",
                "при лейкозах",
                "при пансинуситах"
            ]
        },
        {
            "qID": 69,
            "qName": "Лечение диабетической катаракты у больных диабетом должно дополнительно к общей терапии включать",
            "rA": [
                "местное применение витаминных и антиоксидантных средств"
            ],
            "wA": [
                "местное (глазное) применение кортикостероидов",
                "местное применение рассасывающих средств",
                "местное применение антибиотиков"
            ]
        },
        {
            "qID": 70,
            "qName": "Степень зрелости катаракты, наиболее удобная для оперативного вмешательства",
            "rA": [
                "незрелая"
            ],
            "wA": [
                "начальная",
                "зрелая",
                "перезрелая"
            ]
        },
        {
            "qID": 71,
            "qName": "Артифакия   это ...",
            "rA": [
                "наличие в глазу искусственного хрусталика"
            ],
            "wA": [
                "отсутствие в глазу хрусталика",
                "локализция хрусталика в стекловидном теле",
                "подвывих хрусталика"
            ]
        },
        {
            "qID": 72,
            "qName": "Операция по иссечению стекловидного тела называется",
            "rA": [
                "витрэктомия"
            ],
            "wA": [
                "кератотомия",
                "ленсэктомия",
                "иридэктомия"
            ]
        },
        {
            "qID": 73,
            "qName": "Внутриглазное давление при остром приступе глаукомы",
            "rA": [
                "резко повышено"
            ],
            "wA": [
                "повышено",
                "не изменено",
                "понижено"
            ]
        },
        {
            "qID": 74,
            "qName": "Врожденная глаукома может быть глазным проявлением",
            "rA": [
                "факоматозов (ангиоматоз, нейрофиброматоз)"
            ],
            "wA": [
                "внутриклеточных липоидозов",
                "галактоземии",
                "гистиоцитоза"
            ]
        },
        {
            "qID": 75,
            "qName": "Ребенка, страдающего врожденной глаукомой. следует оперировать",
            "rA": [
                "в течение первого месяца после установления диагноза"
            ],
            "wA": [
                "при безуспешной консервативной терапии",
                "не моложе 14 лет",
                "когда ребенку надо идти в школу"
            ]
        },
        {
            "qID": 76,
            "qName": "После купирования острого приступа глаукомы необходимо",
            "rA": [
                "через 24 часа произвести операцию"
            ],
            "wA": [
                "продолжать примененение миотиков и наблюдение",
                "назначить сосудорасширяющие препараты",
                "рекомендовать курсы инъекций тауфона 2 раза в год"
            ]
        },
        {
            "qID": 77,
            "qName": "Абсолютный признак проникающего ранения роговицы",
            "rA": [
                "наличие раны, проходящей через все слои"
            ],
            "wA": [
                "боль",
                "роговицы",
                "гифема",
                "светобоязнь"
            ]
        },
        {
            "qID": 78,
            "qName": "При рваной ране тканей глазницы с птозом и экзофтальмом общий хирург приемного покоя обязан сделать все, кроме",
            "rA": [
                "срочно провести ПХО раны"
            ],
            "wA": [
                "наложить повязку и отправить больного к специалисту",
                "сделать инъекцию антибиотиков и обезболивающих средств",
                "ввести противостолбнячную сыворотку"
            ]
        },
        {
            "qID": 79,
            "qName": "Кровоизляние в стекловидное тело называется",
            "rA": [
                "гемофтальм"
            ],
            "wA": [
                "гифема",
                "симблефарон",
                "гипопион"
            ]
        },
        {
            "qID": 80,
            "qName": "Лучшим дезинтоксикационным средством в патогенетической терапии ожогов глаз является",
            "rA": [
                "плазма ожоговых реконвалесцентов"
            ],
            "wA": [
                "внутривенное введение глюкозы",
                "внутримышечное введение витаминов группы В",
                "десенсибилизирующие средства"
            ]
        },
        {
            "qID": 81,
            "qName": "Хирургическое лечение показано при следующих осложнениях ожога глаз",
            "rA": [
                "всех вышеперечисленных"
            ],
            "wA": [
                "бельмо роговицы",
                "язва роговицы",
                "фистула роговицы"
            ]
        },
        {
            "qID": 82,
            "qName": "Верхняя прямая мышца иннервируется",
            "rA": [
                "глазодвигательным нервом"
            ],
            "wA": [
                "отводящим нервом",
                "блоковым нервом",
                "лицевым нервом"
            ]
        },
        {
            "qID": 83,
            "qName": "Склеру в заднем отделе прободают",
            "rA": [
                "зрительный нерв и центральная артерия сетчатки"
            ],
            "wA": [
                "зрительный нерв и глазодвигательный нерв",
                "зрительный нерв и центральная вена сетчатки",
                "зрительный нерв"
            ]
        },
        {
            "qID": 84,
            "qName": "Питание хрусталика осуществляется за счет",
            "rA": [
                "внутриглазной жидкости"
            ],
            "wA": [
                "краевой петлистой сети",
                "слезы",
                "центральной артерии сетчатки"
            ]
        },
        {
            "qID": 85,
            "qName": "Ресничное тело состоит из ... частей",
            "rA": [
                "2"
            ],
            "wA": [
                "3",
                "4",
                "5"
            ]
        },
        {
            "qID": 86,
            "qName": "К оптическим средам глаза относятся все, кроме",
            "rA": [
                "радужки"
            ],
            "wA": [
                "роговицы",
                "хрусталика",
                "стекловидного тела"
            ]
        },
        {
            "qID": 87,
            "qName": "Особенности венозного кровообращения в коже век",
            "rA": [
                "анастомозируют с глубокими венами орбиты"
            ],
            "wA": [
                "имеют множество клапанов",
                "образуют краевую петлистую сеть",
                "ход крови в них замедлен"
            ]
        },
        {
            "qID": 88,
            "qName": "Сетчатка является",
            "rA": [
                "периферическим отделом зрительного анализатора  диафрагмой"
            ],
            "wA": [
                "преломляющей системой",
                "дренажной системой"
            ]
        },
        {
            "qID": 89,
            "qName": "Колбочки сосредоточены",
            "rA": [
                "в макуле"
            ],
            "wA": [
                "в области забчатой линии",
                "по периферии сетчатки",
                "вокруг ДЗН"
            ]
        },
        {
            "qID": 90,
            "qName": "Топографически зрительный нерв делят на ... отдела",
            "rA": [
                "4"
            ],
            "wA": [
                "1",
                "2",
                "3"
            ]
        },
        {
            "qID": 91,
            "qName": "Светоощущение может быть",
            "rA": [
                "с правильной проекцией"
            ],
            "wA": [
                "без проекции",
                "с косой проекцией",
                "с кривой проекцией"
            ]
        },
        {
            "qID": 92,
            "qName": "В черепной ямке в области турецкого седла осуществляется",
            "rA": [
                "частичный перекрест внутренних половин нервов"
            ],
            "wA": [
                "частичный перекрест наружных половин нервов",
                "полный перекрест нервных волокон",
                "частичный перекрест правой части нервных волокон"
            ]
        },
        {
            "qID": 93,
            "qName": "Острота зрения по таблицам Сивцева Головина исследуется на расстоянии ... метров",
            "rA": [
                "5"
            ],
            "wA": [
                "6",
                "7",
                "10"
            ]
        },
        {
            "qID": 94,
            "qName": "Нормальное цветоощущение называется",
            "rA": [
                "трихромазией"
            ],
            "wA": [
                "гемералопией",
                "дихромазией",
                "астенопией"
            ]
        },
        {
            "qID": 95,
            "qName": "Палочковый аппарат глаза осуществляет",
            "rA": [
                "периферическое зрение"
            ],
            "wA": [
                "бинокулярное зрение",
                "цветоощущение",
                "центральное зрение"
            ]
        },
        {
            "qID": 96,
            "qName": "Гомонимная гемианопсия характеризуется",
            "rA": [
                "выпадением височной половины в одном глазу и носовой   в другом"
            ],
            "wA": [
                "выпадением височных половин поля зрения",
                "выпадением носовых половин поля зрения",
                "выпадением поля зрения на одном глазу"
            ]
        },
        {
            "qID": 97,
            "qName": "Бинокулярное зрение призвано обеспечить",
            "rA": [
                "слияние (фузию) двойных изображений в единое"
            ],
            "wA": [
                "приспособление глаза к различным уровням освещенности",
                "цветоразличение",
                "поле зрения"
            ]
        },
        {
            "qID": 98,
            "qName": "Эмметропия   это ...",
            "rA": [
                "лучи после прохождения оптических сред концентрируются на сетчатке"
            ],
            "wA": [
                "лучи концентрируются перед сетчаткой",
                "лучи не пересекаются в центральной зоне сетчатки",
                "лучи пересекаются в разных плоскостях оптических сред"
            ]
        },
        {
            "qID": 99,
            "qName": "Аметропия",
            "rA": [
                "миопия"
            ],
            "wA": [
                "эмметропия",
                "мидриаз",
                "анизейкония"
            ]
        },
        {
            "qID": 100,
            "qName": "Для гиперметропии характерна",
            "rA": [
                "слабая преломляющая способность оптических сред глаза"
            ],
            "wA": [
                "сильная преломляющая способность оптических сред глаза",
                "отсутствие единой фокусной точки",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 101,
            "qName": "По течению миопия может быть",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "стационарной",
                "быстропрогрессирующей",
                "медленнопрогрессирующей"
            ]
        },
        {
            "qID": 102,
            "qName": "Миопия корригируется",
            "rA": [
                "рассеивающими сферическими линзами"
            ],
            "wA": [
                "собирающими сферическими линзами",
                "призматическими линзами",
                "цилиндрическими линзами"
            ]
        },
        {
            "qID": 103,
            "qName": "40 летнему больному с гиперметропической рефракцией +2,0 D необходимо выписать очки для близи",
            "rA": [
                "+ 3,0 D"
            ],
            "wA": [
                "+ 1,0 D",
                "+ 2,0 D",
                "+ 4,0 D"
            ]
        },
        {
            "qID": 104,
            "qName": "При астигматизме ...",
            "rA": [
                "преломленные глазом лучи не могут собраться в одну точку"
            ],
            "wA": [
                "после преломления оптической системой могут фокусироваться только за сетчаткой",
                "параллельно идущие лучи сходятся перед сетчаткой",
                "преломленные лучи фокусируются на сетчатке"
            ]
        },
        {
            "qID": 105,
            "qName": "При спазме аккомодации в условиях цикпоплегии острота зрения вдаль",
            "rA": [
                "улучшается"
            ],
            "wA": [
                "ухудшается",
                "не изменяется",
                "улучшается частично"
            ]
        },
        {
            "qID": 106,
            "qName": "Устранение миопии возможно с помощью ... лазера",
            "rA": [
                "эксимерного"
            ],
            "wA": [
                "рубинового",
                "ксенонового",
                "аргонового"
            ]
        },
        {
            "qID": 107,
            "qName": "Основной симптом содружественного косоглазия",
            "rA": [
                "расстройство или отсутствие бинокулярного зрения"
            ],
            "wA": [
                "ограничение подвижности глаза в сторону пораженной мышцы",
                "отсутствие подвижности в сторону пораженной мышцы",
                "жалобы на двоение"
            ]
        },
        {
            "qID": 108,
            "qName": "При паралитическом косоглазии",
            "rA": [
                "первичный угол отклонения меньше вторичного"
            ],
            "wA": [
                "первичный угол отклонения равен вторичному",
                "первичный угол отклонения больше вторичного",
                "верно все перечисленное"
            ]
        },
        {
            "qID": 109,
            "qName": "Нистагм   это ...",
            "rA": [
                "самопроизвольные колебательные движения глазных яблок"
            ],
            "wA": [
                "изменение симметричного положения глаз при исключении условий для бинокулярного зрения",
                "попеременное отклонение глазных яблок",
                "отсутствие движения глазных яблок"
            ]
        },
        {
            "qID": 110,
            "qName": "Ячмень   это ...",
            "rA": [
                "острое гнойное воспаление волосяного мешочка или сальной железы края век"
            ],
            "wA": [
                "фолликулы бледно розового цвета в области нижней переходной с кладки",
                "плотное безболезненное образование в толще хряща век",
                "воспаление края век"
            ]
        },
        {
            "qID": 111,
            "qName": "Халазион представляет собой",
            "rA": [
                "хроническое пролиферативное воспаление мейбомиевой железы и хряща вокруг него"
            ],
            "wA": [
                "плоские пятна, реже узелки желтого цвета в толще кожи век, чаще у внутреннего угла глаза",
                "редкая форма рака желез хряща века",
                "складка истонченной кожи над наружным углом глазной щели"
            ]
        },
        {
            "qID": 112,
            "qName": "Лагофтальм развивается вследствие",
            "rA": [
                "расстройства иннервации лицевого нерва"
            ],
            "wA": [
                "расстройства иннервации глазодвигательного нерва",
                "расстройства инннервации блокового нерва",
                "расстройства иннервации зрительного нерва"
            ]
        },
        {
            "qID": 113,
            "qName": "Дакриоаденит   это ...",
            "rA": [
                "воспаление слезной железы"
            ],
            "wA": [
                "воспаление переходных складок конъюнктивы",
                "воспаление слезного мешка",
                "воспаление фиброзной капсулы"
            ]
        },
        {
            "qID": 114,
            "qName": "Основная жалоба при хроническом дакриоцистите",
            "rA": [
                "упорное слезотечение"
            ],
            "wA": [
                "чувство тяжести в глазу",
                "ограничение подвижности глазного яблока",
                "выпячивание глазного яблока"
            ]
        },
        {
            "qID": 115,
            "qName": "При теноните выражены следующие симптомы, кроме",
            "rA": [
                "зуда в веках"
            ],
            "wA": [
                "хемоз",
                "экзофтальм",
                "ограничение подвижности глазного яблока"
            ]
        },
        {
            "qID": 116,
            "qName": "Экзофтальм может быть двусторонним",
            "rA": [
                "при эндокринных расстройствах"
            ],
            "wA": [
                "при врожденной глаукоме",
                "при кератоконусе",
                "при катаракте"
            ]
        },
        {
            "qID": 117,
            "qName": "Доброкачественные опухоли глаза  все, кроме",
            "rA": [
                "саркома"
            ],
            "wA": [
                "нейрофиброма",
                "глиома",
                "гемангиома"
            ]
        },
        {
            "qID": 118,
            "qName": "Виды инъекций глазного яблока",
            "rA": [
                "конъюнктивальная"
            ],
            "wA": [
                "общирная",
                "внутримышечная",
                "локальная"
            ]
        },
        {
            "qID": 119,
            "qName": "Отек конъюнктивы называется",
            "rA": [
                "хемоз"
            ],
            "wA": [
                "гифема",
                "ксероз",
                "сидероз"
            ]
        },
        {
            "qID": 120,
            "qName": "Острый эпидемический кератоконъюнктивит вызывается",
            "rA": [
                "аденовирусами"
            ],
            "wA": [
                "хламидиями",
                "бактериями",
                "грибками"
            ]
        },
        {
            "qID": 121,
            "qName": "Основными клиническими признаками конъюнктивита являются",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "инъекция сосудов конъюнктивы",
                "отделяемое",
                "отек слизистой глазного яблока и переходных складок",
                "изменение поверхности конъюнктивы век и переходных складок"
            ]
        },
        {
            "qID": 122,
            "qName": "Дифтерийный конъюнктивит характеризуется",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "образованием звездчатых рубцов",
                "трудно отделяющимися серовато",
                "грязными пленками, оставляющими язвенную поверхность отделяемое мутное, жидкое с хлопьями"
            ]
        },
        {
            "qID": 123,
            "qName": "Гонобленнорея у новорожденных развивается",
            "rA": [
                "на 2 3 сутки после рождения"
            ],
            "wA": [
                "на первые сутки после рождения",
                "на первый год после рождения",
                "в первый месяц после рождения"
            ]
        },
        {
            "qID": 124,
            "qName": "Опасность гонобленнореи у новорожденных заключается",
            "rA": [
                "в поражении роговицы"
            ],
            "wA": [
                "в развитии симблефарона",
                "в повышении внутриглазного давления",
                "в возникновении отслойки сетчатки"
            ]
        },
        {
            "qID": 125,
            "qName": "К последствиям трахомы относится",
            "rA": [
                "трихиаз"
            ],
            "wA": [
                "халькоз",
                "эпикантус",
                "хемоз"
            ]
        },
        {
            "qID": 126,
            "qName": "Для хламидиозов характерно",
            "rA": [
                "обнаружение цитоплазматических включений (телец Гальберштедтера Провачека) в эпителиальных клетках соскобов конъюнктивы"
            ],
            "wA": [
                "обнаружение диплобациллы Моракса Аксенфельда в соскобе конъюнктивы",
                "обнаружение бациллы Леффлера в соскобе конъюнктивы",
                "обнаружение кокков Нейссера"
            ]
        },
        {
            "qID": 127,
            "qName": "Туберкулезно аллергический кератит характеризуется наличием ...",
            "rA": [
                "фликтены"
            ],
            "wA": [
                "язвы",
                "гипопиона",
                "гифемы"
            ]
        },
        {
            "qID": 128,
            "qName": "Снижение чувствительности роговицы характерно",
            "rA": [
                "для герпетического кератита"
            ],
            "wA": [
                "для фликтенулезного кератита",
                "для паренхиматозного кератита",
                "для поверхностного кератита"
            ]
        },
        {
            "qID": 129,
            "qName": "Клиническими признаками гнойной язвы роговицы является все, кроме",
            "rA": [
                "серого цвета ДЗН"
            ],
            "wA": [
                "отечной роговицы",
                "инфильтрата с желтоватым оттенком",
                "гипопиона"
            ]
        },
        {
            "qID": 130,
            "qName": "Кератопластика с оптической целью показана при ...",
            "rA": [
                "помутнении роговицы"
            ],
            "wA": [
                "васкуляризации роговицы",
                "помутнении хрусталика",
                "помутнении стекловидного тела"
            ]
        },
        {
            "qID": 131,
            "qName": "Ксероз роговицы развивается при всех состояниях, кроме",
            "rA": [
                "при паратрахоме  при ожогах глаз"
            ],
            "wA": [
                "при гипо  и авитаминозе витамина А",
                "при трахоме",
                "при лагофтальме различного происхождения"
            ]
        },
        {
            "qID": 132,
            "qName": "Боль при иридоциклите ...",
            "rA": [
                "локальная"
            ],
            "wA": [
                "иррадиирующая",
                "разлитая",
                "отсутствует"
            ]
        },
        {
            "qID": 133,
            "qName": "При склеивании зрачкового края радужки с передней капсулой хрусталика наступает",
            "rA": [
                "заращение (occlusio) зрачка"
            ],
            "wA": [
                "помутнение роговицы",
                "гипотония",
                "бельмо"
            ]
        },
        {
            "qID": 134,
            "qName": "При циклите определяется",
            "rA": [
                "болезненность или повышенная чувствительность глазного яблока при пальпации"
            ],
            "wA": [
                "расширение зрачка",
                "опущение верхнего века",
                "болезненность в точке выхода тройничного нерва"
            ]
        },
        {
            "qID": 135,
            "qName": "Часто в исходе иридоциклита наблюдается",
            "rA": [
                "вторичная (увеальная)глаукома"
            ],
            "wA": [
                "подвывих хрусталика",
                "тракционная отслойка сетчатки",
                "помутнение роговицы"
            ]
        },
        {
            "qID": 136,
            "qName": "Панувеит   это воспаление ...",
            "rA": [
                "всех отделов сосудистого тракта"
            ],
            "wA": [
                "радужной оболочки",
                "цилиарного тела",
                "собственно сосудистой оболочки"
            ]
        },
        {
            "qID": 137,
            "qName": "Жалобы при задних увеитах",
            "rA": [
                "отсутствуют"
            ],
            "wA": [
                "на боль в области глазного яблока",
                "на покраснение глазного яблока",
                "на косоглазие"
            ]
        },
        {
            "qID": 138,
            "qName": "Диагностика хориоидита отновывается на данных:",
            "rA": [
                "офтальмоскопии"
            ],
            "wA": [
                "гониоскопии",
                "офтальмометрии",
                "рентгенографии"
            ]
        },
        {
            "qID": 139,
            "qName": "При эмболии центральной артерии сетчатки характерно",
            "rA": [
                "резкое снижение зрения до нескольких сотых"
            ],
            "wA": [
                "сохранение зрения",
                "постепенное снижение остроты зрения",
                "появление радужных кругов при взгляде на источник света"
            ]
        },
        {
            "qID": 140,
            "qName": "Лечение при тромбозе центральной вены сетчатки должно включать",
            "rA": [
                "лазерное лечение"
            ],
            "wA": [
                "антибиотики",
                "оксигенотерапию",
                "криоэкстракцию"
            ]
        },
        {
            "qID": 141,
            "qName": "Первая врачебная помощь при эмболии центральной артерии сетчатки",
            "rA": [
                "внутривенное введение 2,4% раствора эуфиллина"
            ],
            "wA": [
                "обильное промывание проточной водой",
                "внутривенное введение антибиотика",
                "наложение повязки"
            ]
        },
        {
            "qID": 142,
            "qName": "Факоэмульсификаиия производится",
            "rA": [
                "при помощи ультразвука"
            ],
            "wA": [
                "при помощи лазера",
                "при помощи холода",
                "при помощи ультрафиолета"
            ]
        },
        {
            "qID": 143,
            "qName": "Афакия   это ...",
            "rA": [
                "отсутствие хрусталика"
            ],
            "wA": [
                "помутнение хрусталика",
                "набухание хрусталика",
                "имплантация искусственного хрусталика"
            ]
        },
        {
            "qID": 144,
            "qName": "К аномалиям развития хрусталика относятся",
            "rA": [
                "микрофакия"
            ],
            "wA": [
                "кератоконус",
                "кератоглобус",
                "катаракта"
            ]
        },
        {
            "qID": 145,
            "qName": "Офтальмоскопические изменения при неврите зрительного нерва все, кроме",
            "rA": [
                "диск зрительного нерва бледный"
            ],
            "wA": [
                "диск зрительного нерва гиперемирован",
                "границы диска зрительного нерва стушеваны",
                "вены расширены"
            ]
        },
        {
            "qID": 146,
            "qName": "При атрофии зрительного нерва цвет диска зрительного нерва",
            "rA": [
                "бледный"
            ],
            "wA": [
                "не изменен",
                "гиперемирован",
                "синюшный"
            ]
        },
        {
            "qID": 147,
            "qName": "Резкое снижение остроты зрения на обоих глазах отмечается при",
            "rA": [
                "поражении зрительного нерва метиловым спиртом"
            ],
            "wA": [
                "неврите зрительного нерва",
                "диабетической ретинопатии",
                "глаукоме"
            ]
        },
        {
            "qID": 148,
            "qName": "При ретинобластоме отмечается",
            "rA": [
                "желто белый рефлекс в области зрачка"
            ],
            "wA": [
                "увеличение диаметра роговицы",
                "красный рефлекс в области зрачка",
                "покраснение глаза"
            ]
        },
        {
            "qID": 149,
            "qName": "Мидриаз развивается",
            "rA": [
                "при остром приступе глаукомы"
            ],
            "wA": [
                "при остром хориоретините",
                "при остром иридоциклите",
                "при остром конъюнктивите"
            ]
        },
        {
            "qID": 150,
            "qName": "По степени компенсации глаукома подразделяется на ...",
            "rA": [
                "все перечисленные"
            ],
            "wA": [
                "компенсированную",
                "субкомпенсированную",
                "некомпенсированную"
            ]
        },
        {
            "qID": 151,
            "qName": "Глаукоматозные изменения на глазном дне",
            "rA": [
                "экскавация диска зрительного нерва"
            ],
            "wA": [
                "симптом «раздавленного помидора»",
                "симптом «вишневой косточки»",
                "микроаневризмы сосудов"
            ]
        },
        {
            "qID": 152,
            "qName": "При остром приступе глаукомы при пальпаторном исследовании глазное яблоко",
            "rA": [
                "плотное"
            ],
            "wA": [
                "'нормальное",
                "мягкое",
                "'эластичное"
            ]
        },
        {
            "qID": 153,
            "qName": "При остром приступе глаукомы зрачок",
            "rA": [
                "расширен"
            ],
            "wA": [
                "не изменен",
                "сужен",
                "'неправильной формы"
            ]
        },
        {
            "qID": 154,
            "qName": "Экстренная помощь при остром приступе глаукомы включает все, кроме",
            "rA": [
                "кератопротекторов"
            ],
            "wA": [
                "'анальгетиков",
                "диуретиков",
                "местных гипотензивных средств"
            ]
        },
        {
            "qID": 155,
            "qName": "К бета адреноблокаторам относятся",
            "rA": [
                "тимолол"
            ],
            "wA": [
                "фосфакол",
                "пилокарпин",
                "трусопт"
            ]
        },
        {
            "qID": 156,
            "qName": "Для врожденной глаукомы характерно",
            "rA": [
                "буфтальм"
            ],
            "wA": [
                "экзофтальм",
                "анофтальм",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 157,
            "qName": "Рентгенлокализация инородного тела проводится с помощью",
            "rA": [
                "протеза Комберга Балтина"
            ],
            "wA": [
                "диафаноскопа",
                "офтальмоскопа",
                "стеклянной палочки"
            ]
        },
        {
            "qID": 158,
            "qName": "Кровоизлияние в переднюю камеру называется",
            "rA": [
                "гифема"
            ],
            "wA": [
                "гемофтальм",
                "рубеоз",
                "сидероз"
            ]
        },
        {
            "qID": 159,
            "qName": "Халькоз глаза   это ...",
            "rA": [
                "отложение в тканях глазного яблока солей меди"
            ],
            "wA": [
                "отложение в тканях и средах глазного яблока солей железа",
                "кровоизлияние в стекловидное тело",
                "выпадение хрусталика в переднюю камеру"
            ]
        },
        {
            "qID": 160,
            "qName": "Клинические признаки эндофтамита",
            "rA": [
                "при исследовании в проходящем свете желтое"
            ],
            "wA": [
                "гной в передней камере",
                "отложение гноя на радужке",
                "свечение зрачка",
                "отек века"
            ]
        },
        {
            "qID": 161,
            "qName": "Симпатическая офтальмия развивается",
            "rA": [
                "как воспалительный процесс во втором глазу вследствие хронического иридоциклита в травмированном глазу"
            ],
            "wA": [
                "вследствие несмыкания век",
                "за счет образования в стекловидном теле соединительнотканных тяжей",
                "как исход кровоизлияния в стекловидное тело"
            ]
        },
        {
            "qID": 162,
            "qName": "При вывихе хрусталика в стекловидное тело отмечается",
            "rA": [
                "дрожание радужки"
            ],
            "wA": [
                "гифема",
                "гемофтальм",
                "гиперемия диска зрительного нерва"
            ]
        },
        {
            "qID": 163,
            "qName": "Ожог кислотой может вызвать развитие",
            "rA": [
                "коагуляционного некроза"
            ],
            "wA": [
                "колликвационного некроза",
                "и того, и другого",
                "ни того, ни другого"
            ]
        },
        {
            "qID": 164,
            "qName": "При ожоге щелочью с целью оказания экстренной помощи необходимо закапать",
            "rA": [
                "2% р р борной кислоты"
            ],
            "wA": [
                "3% р р бикарбоната натрия",
                "1% р р пилокарпина гидрохлорида",
                "0,9% р р хлорида натрия"
            ]
        },
        {
            "qID": 165,
            "qName": "При ожоге Ill ей степени роговица",
            "rA": [
                "приобретает вид «матового стекла»"
            ],
            "wA": [
                "остается прозрачной",
                "становится гиперемированной",
                "становится васкуляризированной"
            ]
        },
        {
            "qID": 166,
            "qName": "Симблефарон   это ...",
            "rA": [
                "сращение конъюнктивы век с конъюнктивой глазного яблока"
            ],
            "wA": [
                "наличие крови в передней камере",
                "наличие инородного тела в хурсталике",
                "наличие крови в стекловидном теле"
            ]
        },
        {
            "qID": 167,
            "qName": "Электроофтальмия развивается ПРИ воздействии ...",
            "rA": [
                "УФО облучения"
            ],
            "wA": [
                "электрического разряда",
                "инфракрасного излучения",
                "СВЧ излучения"
            ]
        },
        {
            "qID": 168,
            "qName": "Верхняя стенка орбиты граничит ...",
            "rA": [
                "лобной пазухи"
            ],
            "wA": [
                "решетчатой пазухи",
                "гайморовой пазухи",
                "полостью носа"
            ]
        },
        {
            "qID": 169,
            "qName": "Слезный мешок книзу лежит",
            "rA": [
                "кпереди от фасции"
            ],
            "wA": [
                "во внутреннем углу орбиты",
                "в средней черепной ямке",
                "сзади фасции"
            ]
        },
        {
            "qID": 170,
            "qName": "Нижняя косая мышца берет начало",
            "rA": [
                "от надкостницы нижне внутреннего края орбиты"
            ],
            "wA": [
                "от сухожильного кольца",
                "от фасции",
                "от нижней прямой мышцы"
            ]
        },
        {
            "qID": 171,
            "qName": "Блоковый нерв иннервирует",
            "rA": [
                "верхнюю косую мышцу"
            ],
            "wA": [
                "наружную прямую мышцу",
                "верхнюю прямую мышцу",
                "'внутреннюю прямую мышцу"
            ]
        },
        {
            "qID": 172,
            "qName": "Мышца, поднимающая верхнее веко, иннервируется",
            "rA": [
                "глазодвигательным нервом"
            ],
            "wA": [
                "'блоковым нервом",
                "'лицевым нервом",
                "зрительным нервом"
            ]
        },
        {
            "qID": 173,
            "qName": "Под кожей век расположена",
            "rA": [
                "круговая мышца век"
            ],
            "wA": [
                "плотная соединительная пластинка",
                "конъюнктива",
                "жировая клетчатка"
            ]
        },
        {
            "qID": 174,
            "qName": "Конъюнктива выполняет... функцию",
            "rA": [
                "защитную"
            ],
            "wA": [
                "слезопродуцирующую",
                "светопроводящую",
                "формообразующую"
            ]
        },
        {
            "qID": 175,
            "qName": "Задняя пограничная пластинка роговицы ближе к лимбу принимает участие в образовании",
            "rA": [
                "корнеосклеральной трабекулы"
            ],
            "wA": [
                "зрачка",
                "ресничного тела",
                "радужки"
            ]
        },
        {
            "qID": 176,
            "qName": "Мышечные артерии после прикрепления прямых мышц к склере называются ...",
            "rA": [
                "передними ресничными артериями"
            ],
            "wA": [
                "задними длинными ресничными артериями",
                "задними короткими артериями",
                "боковыми ресничными артериями"
            ]
        },
        {
            "qID": 177,
            "qName": "Чувствительную иннервацию роговицы осуществляет",
            "rA": [
                "тройничный нерв"
            ],
            "wA": [
                "блоковый нерв",
                "отводящий нерв",
                "зрительный нерв"
            ]
        },
        {
            "qID": 178,
            "qName": "Сквозь отверстия решетчатой пластинки склеры проходят",
            "rA": [
                "пучки волокон зрительного нерва"
            ],
            "wA": [
                "пучки волокон блокового нерва",
                "пучки волокон глазодвигательного нерва",
                "пучки волокон отводящего нерва"
            ]
        },
        {
            "qID": 179,
            "qName": "В центре радужки находится",
            "rA": [
                "зрачок"
            ],
            "wA": [
                "трабекула",
                "лимб",
                "крипта"
            ]
        },
        {
            "qID": 180,
            "qName": "Самой обширной частью сосудистой оболочки является",
            "rA": [
                "хориоидея"
            ],
            "wA": [
                "радужка",
                "ресничное тело",
                "сетчатка"
            ]
        },
        {
            "qID": 181,
            "qName": "Важную роль в поддержании тургора глаза играет",
            "rA": [
                "гиалуроновая кислота"
            ],
            "wA": [
                "плазма крови",
                "аскорбиновая кислота",
                "борная кислота"
            ]
        },
        {
            "qID": 182,
            "qName": "Зрительный нерв проходит вблизи",
            "rA": [
                "и того, и другого"
            ],
            "wA": [
                "решетчатой пазухи",
                "'основной пазухи",
                "ни того, ни другого"
            ]
        },
        {
            "qID": 183,
            "qName": "Методом Гиршберга можно определить",
            "rA": [
                "угол отклонения глазного яблока"
            ],
            "wA": [
                "'размеры глазного яблока",
                "'параметры внутриглазного давления",
                "'границы внутриглазной опухоли"
            ]
        },
        {
            "qID": 184,
            "qName": "ЭхоофтальмограФия используется для всего, кроме",
            "rA": [
                "для определения внутриглазного давления"
            ],
            "wA": [
                "для диагностики новообразований",
                "для диагностики отслойки сетчатки",
                "при подозрении на внедрение инородных тел"
            ]
        },
        {
            "qID": 185,
            "qName": "Острота зрения",
            "rA": [
                "обратно пропорциональна углу зрения"
            ],
            "wA": [
                "прямо пропорциональна углу зрения",
                "'непропорциональна углу зрения",
                "равна углу зрения"
            ]
        },
        {
            "qID": 186,
            "qName": "Дихромазия наблюдается во всех Формах, кроме",
            "rA": [
                "гемералопия"
            ],
            "wA": [
                "протанопия",
                "дейтеранопия",
                "тританопия"
            ]
        },
        {
            "qID": 187,
            "qName": "Гомонимная гемианопсия характеризуется",
            "rA": [
                "выпадением височных половин поля зрения в обоих глазах"
            ],
            "wA": [
                "выпадением носовой половины в одном глазу и височной половины поля зрения в другом глазу",
                "'сужением поля зрения в одном глазу",
                "'наличием скотомы в другом глазу"
            ]
        },
        {
            "qID": 188,
            "qName": "Адаптацией называется ...",
            "rA": [
                "изменение световой чувствительности глаза при изменении освещенности"
            ],
            "wA": [
                "'способность глаза фокусировать изображение рассматриваемых предметов на сетчатке независимо от расстояния, на котором находится предмет",
                "'преломление света в оптической системе",
                "разная рефракция в главных мередианах глаза"
            ]
        },
        {
            "qID": 189,
            "qName": "Зрение одним глазом дает представление о всех свойствах предмета, кроме",
            "rA": [
                "глубине"
            ],
            "wA": [
                "'высоте",
                "'ширине",
                "форме"
            ]
        },
        {
            "qID": 190,
            "qName": "Клиническую рефракцию характеризует",
            "rA": [
                "положение главного фокуса оптической системы глаза по отношению к сетчатке"
            ],
            "wA": [
                "преломляющую способность оптической системы глаза",
                "способность глаза фокусировать изображение рассматриваемых предметов независимо от расстояния, на котором находится предмет",
                "максимальная острота зрения"
            ]
        },
        {
            "qID": 191,
            "qName": "Эмметропия   это ...",
            "rA": [
                "соразмерная рефракция"
            ],
            "wA": [
                "несоразмерная рефракция",
                "сочетание в одном глазу разных видов рефракций",
                "разная рефракция в разных глазах"
            ]
        },
        {
            "qID": 192,
            "qName": "Для миопии характерно расположение главного фокуса оптической системы",
            "rA": [
                "перед глазом"
            ],
            "wA": [
                "за глазом",
                "на сетчатке",
                "нет единого фокуса"
            ]
        },
        {
            "qID": 193,
            "qName": "Прогрессирующая миопия является",
            "rA": [
                "миопической болезнью"
            ],
            "wA": [
                "аномалией рефракции",
                "соразмерной рефракцией",
                "показанием к кератотомии"
            ]
        },
        {
            "qID": 194,
            "qName": "Парез аккомодации возникает",
            "rA": [
                "при поражении парасимпатической части глазодвигательного нерва"
            ],
            "wA": [
                "при поражении лицевого нерва",
                "при поражении симпатического нерва",
                "при поражении зрительного нерва"
            ]
        },
        {
            "qID": 195,
            "qName": "Альтернирующее косоглазие",
            "rA": [
                "попеременное отклонение то одного, то другого глаза"
            ],
            "wA": [
                "отклонение одного глаза в период отсутствия фиксации какого либо объекта",
                "постоянное отклонение одного и того же глаза",
                "периодически возникающее отклонение глазного яблока"
            ]
        },
        {
            "qID": 196,
            "qName": "Расходящееся косоглазие чаще наблюдается",
            "rA": [
                "при миопии"
            ],
            "wA": [
                "при эмметропии",
                "при гиперметропии",
                "при пресбиопии"
            ]
        },
        {
            "qID": 197,
            "qName": "Метод прямой окклюзии заключается",
            "rA": [
                "в выключении лучше видящего глаза наложением монокулярной повязки в выключении глазного яблока на 12 часов"
            ],
            "wA": [
                "в создании близорукости с помощью положительных стекол",
                "в выключении аккомодации фиксирующего глаза путем атропинизации"
            ]
        },
        {
            "qID": 198,
            "qName": "Скрытое косоглазие связано",
            "rA": [
                "с отсутствием полной гармонии в тонусе и деятельности глазодвигательных мышц"
            ],
            "wA": [
                "парезом одной или нескольких глазодвигательных мышц",
                "с нерегулярным ношением очков",
                "с ношением окклюзии"
            ]
        },
        {
            "qID": 199,
            "qName": "Ячмень может сочетаться со всеми заболеваниями, кроме",
            "rA": [
                "с дакриоаденитом"
            ],
            "wA": [
                "с конъюнктивитом",
                "с фурункулезом",
                "с дакриоциститом"
            ]
        },
        {
            "qID": 200,
            "qName": "Лечение вирусных конъюнктивитов заключается",
            "rA": [
                "в местном применении противовирусных средств"
            ],
            "wA": [
                "в назначении антибиотиков",
                "в назначении витаминов",
                "всего вышеперечисленного"
            ]
        },
        {
            "qID": 201,
            "qName": "Для исследования функциональной проходимости слезоотводящих путей проводят",
            "rA": [
                "окрашивание слезы 3% раствором колларгола"
            ],
            "wA": [
                "окрашивание слезы 1% р ром флюоресцеина",
                "диафаноскопию",
                "офтальмоскопию"
            ]
        },
        {
            "qID": 202,
            "qName": "Эпителиально эндотелиальная дегенерация может развиться",
            "rA": [
                "после экстракции катаракты"
            ],
            "wA": [
                "после травм",
                "после вирусной инфекции",
                "после глаукомы"
            ]
        },
        {
            "qID": 203,
            "qName": "Эктазии склеры характеризуются",
            "rA": [
                "появлением бугристых выпячиваний аспидно¬черного цвета"
            ],
            "wA": [
                "резким покраснением глаза",
                "припуханием темно красного цвета",
                "эффектом «голубых склер»"
            ]
        },
        {
            "qID": 204,
            "qName": "Сужение зрачка называется",
            "rA": [
                "миоз"
            ],
            "wA": [
                "мидриаз",
                "анизейкония",
                "рубеоз"
            ]
        },
        {
            "qID": 205,
            "qName": "Вторичные увеиты могут развиться",
            "rA": [
                "при кератите"
            ],
            "wA": [
                "халазионе",
                "при блефарите",
                "при неврите"
            ]
        },
        {
            "qID": 206,
            "qName": "Бомбаж радужки может наблюдаться при",
            "rA": [
                "иридоциклите"
            ],
            "wA": [
                "хориоретините",
                "отслойке сетчатки",
                "вывихе хрусталика"
            ]
        },
        {
            "qID": 207,
            "qName": "Для диагностики хориоидита применяют",
            "rA": [
                "офтальмоскопию"
            ],
            "wA": [
                "гониоскопию",
                "тонографию",
                "эхобиометрию"
            ]
        },
        {
            "qID": 208,
            "qName": "Симптомом переднего увеита является",
            "rA": [
                "стушеванность рисунка радужки"
            ],
            "wA": [
                "отек век",
                "изменение цвета ДЗН",
                "мидриаз"
            ]
        },
        {
            "qID": 209,
            "qName": "В случаях поздней диагностики меланомы хориоидеи может развиваться",
            "rA": [
                "прорастание опухоли в глазницу £"
            ],
            "wA": [
                "блефарит",
                "катаракта",
                "иридоциклит"
            ]
        },
        {
            "qID": 210,
            "qName": "Острая непроходимость центральной артерии сетчатки может встречаться у больных, страдающих",
            "rA": [
                "гипертонической болезнью"
            ],
            "wA": [
                "панкреатитом",
                "алкоголизмом",
                "бронхитом"
            ]
        },
        {
            "qID": 211,
            "qName": "Патогенетическим лечением центрального серозного хориоретинита является",
            "rA": [
                "блокада дефектов базальной пластинки методом лазеркоагуляции"
            ],
            "wA": [
                "снижение внутриглазного давления методом иридэктомии",
                "все перечисленное",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 212,
            "qName": "Для неврита зрительного нерва характерно",
            "rA": [
                "появление плазморрагий на диске зрительного нерва"
            ],
            "wA": [
                "образование экскавации диска зрительного нерва",
                "появление отслойки сетчатки",
                "все вышеперечисленное"
            ]
        },
        {
            "qID": 213,
            "qName": "При первичной атрофии диска зрительного нерва границы",
            "rA": [
                "отчетливые"
            ],
            "wA": [
                "размыты",
                "не определяются",
                "состояние границ не имеет значения"
            ]
        },
        {
            "qID": 214,
            "qName": "Для диагностики врожденной глаукомы важно обнаружение",
            "rA": [
                "ассиметрии в размерах роговицы и глазного яблока на двух глазах"
            ],
            "wA": [
                "отсутствия отклонения глазного яблока",
                "полного объема движений глазного яблока",
                "ассиметрии в размерах глазных щелей"
            ]
        },
        {
            "qID": 215,
            "qName": "ПРИСТУП ВТОРИЧНОЙ факогенной глаукомы развивается",
            "rA": [
                "в результате патологического увеличения размеров хрусталика при незрелой катаракте"
            ],
            "wA": [
                "при остром приступе глаукомы",
                "при помутнении хрусталика",
                "после удаления хрусталика"
            ]
        },
        {
            "qID": 216,
            "qName": "С целью купирования острого приступа глаукомы назначают",
            "rA": [
                "миотики"
            ],
            "wA": [
                "анестетики",
                "мидриатики",
                "антибиотики"
            ]
        },
        {
            "qID": 217,
            "qName": "Выраженным гипотензивным действием обладают",
            "rA": [
                "ганглиоблокаторы"
            ],
            "wA": [
                "анальгетики",
                "анестетики",
                "кортикостероиды"
            ]
        },
        {
            "qID": 218,
            "qName": "Механизм действия ингибиторов карбоангидразы",
            "rA": [
                "уменьшение скорости образования водянистой влаги"
            ],
            "wA": [
                "улучшение оттока из глаза 'деблокирующее действие на угол передней камеры и шлеммов канал",
                "'Стимуляция доплнительных путей оттока водянистой влаги"
            ]
        },
        {
            "qID": 219,
            "qName": "Операции на цилиарном теле направлены",
            "rA": [
                "на уменьшение продукции внутриглазной жидкости"
            ],
            "wA": [
                "на устранение последствий зрачкового блока",
                "на создание нового пути оттока из передней камеры в подконъюнктивальное пространство",
                "на увеличение продукции внутриглазной жидкости"
            ]
        },
        {
            "qID": 220,
            "qName": "Катаракта   это ...",
            "rA": [
                "помутнение хрусталика"
            ],
            "wA": [
                "'воспаление хрусталика",
                "помутнение роговицы",
                "'Смещение хрусталика"
            ]
        },
        {
            "qID": 221,
            "qName": "Вторичная катаракта развивается",
            "rA": [
                "после экстракапсулярной экстракции катаракты"
            ],
            "wA": [
                "после перенесенного увеита",
                "после перенесенного кератита",
                "после перенесенного склерита"
            ]
        },
        {
            "qID": 222,
            "qName": "Хрусталик можно исследовать",
            "rA": [
                "при биомикроскопии"
            ],
            "wA": [
                "при офтальмоскопии",
                "при диафаноскопии",
                "при тонометрии"
            ]
        },
        {
            "qID": 223,
            "qName": "Передняя полярная катаракта представляет собой",
            "rA": [
                "ограниченное помутнение белого цвета, расположенное у переднего полюса хрусталика"
            ],
            "wA": [
                "ограниченное помутнение белого цвета, расположенное у заднего полюса хрусталика",
                "ограниченное помутнение белого цвета, расположенное в коре хрусталика",
                "ни одно из перечисленного"
            ]
        },
        {
            "qID": 224,
            "qName": "Консервативная терапия при катаракте назначается с целью",
            "rA": [
                "предупреждения прогрессирования начальных стадий катаракты"
            ],
            "wA": [
                "снижения внутриглазного давления",
                "рассасывания помутнения",
                "как альтернатива хирургическому лечению"
            ]
        },
        {
            "qID": 225,
            "qName": "Основной метод лечения катаракты",
            "rA": [
                "факоэмульсификация"
            ],
            "wA": [
                "энуклеация",
                "пластика",
                "витрэктомия"
            ]
        },
        {
            "qID": 226,
            "qName": "При афакии передняя камера",
            "rA": [
                "глубокая"
            ],
            "wA": [
                "мелкая",
                "неравномерной глубины",
                "отсутствует"
            ]
        },
        {
            "qID": 227,
            "qName": "Изменения глаз при гипертонической болезни могут протекать в виде",
            "rA": [
                "ретинопатии"
            ],
            "wA": [
                "хориопатии",
                "неврита зрительного нерва",
                "атрофии зрительного нерва"
            ]
        },
        {
            "qID": 228,
            "qName": "Одним из основных симптомов при базедовой болезни является",
            "rA": [
                "экзофтальм"
            ],
            "wA": [
                "кровоизлияния",
                "отслойка сетчатки",
                "эписклерит"
            ]
        },
        {
            "qID": 229,
            "qName": "При заражении токсоплазмой в более поздние сроки беременности у ребенка может обнаружиться",
            "rA": [
                "врожденная глаукома"
            ],
            "wA": [
                "блефароптоз",
                "анофтальм",
                "косоглазие"
            ]
        },
        {
            "qID": 230,
            "qName": "Все глазные инородные тела подлежат",
            "rA": [
                "удалению в ранние сроки"
            ],
            "wA": [
                "сохранению",
                "удалению черз 14 дней",
                "удалению через месяц"
            ]
        },
        {
            "qID": 231,
            "qName": "При экстренной помощи при проникающем ранении необходимо закапать",
            "rA": [
                "0,25% раствор левомецитин"
            ],
            "wA": [
                "0,25% раствор тимолола",
                "1% раствор пилокарпина",
                "1% раствор атропина сульфат"
            ]
        },
        {
            "qID": 232,
            "qName": "При эндофтальмите при исследовании в проходящем свете отмечается",
            "rA": [
                "желтовато зеленый рефлекс"
            ],
            "wA": [
                "красный рефлекс",
                "серый рефлекс",
                "белый рефлекс"
            ]
        },
        {
            "qID": 233,
            "qName": "При симпатическом воспалении показано применение",
            "rA": [
                "кортикостероидов"
            ],
            "wA": [
                "нейролептиков",
                "диуретиков",
                "ганглиоблокаторов"
            ]
        },
        {
            "qID": 234,
            "qName": "Подкожная эмфизема век развивается вследствие",
            "rA": [
                "проникновения воздуха из соседних полостей носа"
            ],
            "wA": [
                "проникновения влаги передней камеры через поврежденную капсулу хрусталика",
                "понижения внутриглазного давления",
                "повышения внутриглазного давления"
            ]
        },
        {
            "qID": 235,
            "qName": "При переломах костей глазницы возможно развитие",
            "rA": [
                "энофтальма"
            ],
            "wA": [
                "повышения внутриглазного давления",
                "вывиха хрусталика",
                "анофтальма"
            ]
        },
        {
            "qID": 236,
            "qName": "В лечение гемофтальма включается все, кроме",
            "rA": [
                "антибиотикотерапия"
            ],
            "wA": [
                "кровоостанавливающая терапия",
                "рассасывающая терапия",
                "витрэктомия"
            ]
        },
        {
            "qID": 237,
            "qName": "Вывихнутый хрусталик",
            "rA": [
                "блокирует угол передней камеры"
            ],
            "wA": [
                "блокирует ресничное тело",
                "блокирует сетчатку",
                "блокирует стекловидное тело"
            ]
        },
        {
            "qID": 238,
            "qName": "При посттравматических дырчатых разрывах сетчатки показана",
            "rA": [
                "лазеркоагуляция сетчатки"
            ],
            "wA": [
                "криоаппликация цилиарного тела",
                "термокоагуляция роговицы",
                "трабекулоэктомия"
            ]
        },
        {
            "qID": 239,
            "qName": "Под действием щелочей развивается",
            "rA": [
                "колликвационный некроз"
            ],
            "wA": [
                "коагуляционный некроз",
                "все перечисленное",
                "ничего из перечисленного"
            ]
        },
        {
            "qID": 240,
            "qName": "Лечение при ожогах глаз включает в себя все, кроме:",
            "rA": [
                "гипотензивных препаратов"
            ],
            "wA": [
                "антибиотиков",
                "антикоагулянтов",
                "аутосыворотки"
            ]
        },
        {
            "qID": 241,
            "qName": "В результате ультрафиолетового облучения может развиться",
            "rA": [
                "электроофтальмия"
            ],
            "wA": [
                "огневая катаракта",
                "морская болезнь",
                "глаукома"
            ]
        },
        {
            "qID": 242,
            "qName": "Допризывник жалуется офтальмологу на отсутствие ориентации в темноте в течение 2 3 месяцев. Каков предварительный диагноз?",
            "rA": [
                "гемералопия"
            ],
            "wA": [
                "глаукома",
                "иридоциклит",
                "отслойка сетчатки"
            ]
        },
        {
            "qID": 243,
            "qName": "Нижняя глазничная щель соединяет орбиту",
            "rA": [
                "с крылонебной ямкой"
            ],
            "wA": [
                "с задней черепной ямкой",
                "со средней черепной ямкой",
                "с гайморовой пазухой"
            ]
        },
        {
            "qID": 244,
            "qName": "Верхняя прямая мышца обеспечивает ПОВОРОТ глаза",
            "rA": [
                "кверху и кнутри"
            ],
            "wA": [
                "книзу и кнутри",
                "кнаружи",
                "кверху и кнаружи"
            ]
        },
        {
            "qID": 245,
            "qName": "Блоковый нерв иннервирует",
            "rA": [
                "верхнюю косую мышцу"
            ],
            "wA": [
                "наружную прямую мышцу",
                "нижнюю прямую мышцу",
                "внутреннюю прямую мышцу"
            ]
        },
        {
            "qID": 246,
            "qName": "Хрящ века находится",
            "rA": [
                "позади вековой части круговой мышцы"
            ],
            "wA": [
                "позади слезного мясца",
                "позади слезной железы",
                "позади орбитальной фасции"
            ]
        },
        {
            "qID": 247,
            "qName": "Склера состоит",
            "rA": [
                "из эписклеры"
            ],
            "wA": [
                "из роговицы",
                "из эпителиоцитов",
                "из внутриглазной жидкости"
            ]
        },
        {
            "qID": 248,
            "qName": "Дилятатор зрачка обусловливает",
            "rA": [
                "расширение зрачка"
            ],
            "wA": [
                "сужение зрачка",
                "понижение внутриглазного давления",
                "изменение цвета глаз"
            ]
        },
        {
            "qID": 249,
            "qName": "Чувствительную иннервацию радужки осуществляет",
            "rA": [
                "тройничный нерв"
            ],
            "wA": [
                "парасимпатический нерв",
                "симпатический нерв",
                "зрительный нерв"
            ]
        },
        {
            "qID": 250,
            "qName": "Самым наружным слоем сетчатки является",
            "rA": [
                "пигментный слой"
            ],
            "wA": [
                "наружная пограничная мембрана",
                "наружный зернистый слой",
                "наружный ядерный слой"
            ]
        },
        {
            "qID": 251,
            "qName": "Диск зрительного нерва   это",
            "rA": [
                "место выхода зрительного нерва из сетчатки"
            ],
            "wA": [
                "скопление палочек",
                "скопление колбочек",
                "^центральная ямка сетчатки"
            ]
        },
        {
            "qID": 252,
            "qName": "Первый нейрон зрительного анализатора",
            "rA": [
                "кпетки нейроэпителия"
            ],
            "wA": [
                "ганглиозные клетки",
                "биполярные клетки",
                "пигментные клетки"
            ]
        },
        {
            "qID": 253,
            "qName": "Задняя камера расположена",
            "rA": [
                "позади радужки"
            ],
            "wA": [
                "позади стекловидного тела",
                "позади хрусталика",
                "позади роговицы"
            ]
        },
        {
            "qID": 254,
            "qName": "Стекловидное тело сходно по составу",
            "rA": [
                "с цереброспинальной жидкостью"
            ],
            "wA": [
                "со слезой",
                "с лимфой",
                "с внутриглазной жидкостью"
            ]
        },
        {
            "qID": 255,
            "qName": "Задние и передние ресничные артерии участвуют в кровоснабжении",
            "rA": [
                "сосудистого тракта и склеры"
            ],
            "wA": [
                "склеры и сетчатки",
                "хрусталика",
                "стекловидного тела"
            ]
        },
        {
            "qID": 256,
            "qName": "В состав ресничного узла входят",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "чувствительные волокна носоресничного нерва",
                "парасимпатические волокна глазодвигательного нерва",
                "симпатические волокна сплетения внутренней сонной артерии"
            ]
        },
        {
            "qID": 257,
            "qName": "Зрительный тракт заканчивается у",
            "rA": [
                "коленчатых тел"
            ],
            "wA": [
                "шпорной борозды",
                "подушки зрительных бугров",
                "заднего полюса глазного яблока"
            ]
        },
        {
            "qID": 258,
            "qName": "При поверхностной инъекции",
            "rA": [
                "краснота глаза уменьшается по мере приближения к роговице"
            ],
            "wA": [
                "краснота выражена в области ресничных краев век",
                "краснота глаза выражена вокруг роговицы",
                "краснота одинаковой интенсивности по всем секторам"
            ]
        },
        {
            "qID": 259,
            "qName": "С целью выявления функции слезной железы проводят",
            "rA": [
                "пробу с полоской фильтровальной бумаги шириной 0,5 см"
            ],
            "wA": [
                "пробу с флюоресцеином",
                "слезно носовую пробу с колларголом",
                "тонометрию"
            ]
        },
        {
            "qID": 260,
            "qName": "Гониоскопия   метод, предназначенный для осмотра...",
            "rA": [
                "угла передней камеры"
            ],
            "wA": [
                "конъюнктивы",
                "глазного дна",
                "хрусталика"
            ]
        },
        {
            "qID": 261,
            "qName": "С целью определения передне заднего размера глазного яблока применяется",
            "rA": [
                "эхобиометрия"
            ],
            "wA": [
                "окулография",
                "пахиметрия",
                "периметрия"
            ]
        },
        {
            "qID": 262,
            "qName": "Светоощущение с неправильной проекцией расценивается в случае, когда больной",
            "rA": [
                "неправильно определяет проекцию света хотя бы с одной стороны"
            ],
            "wA": [
                "не ощущает света",
                "правильно определяет проекцию света",
                "не может прочитать 1 строчку по таблице Сивцева  Головина"
            ]
        },
        {
            "qID": 263,
            "qName": "Восприятие глазом того или иного цветового тона зависит",
            "rA": [
                "от длины волны излучения"
            ],
            "wA": [
                "от степени освещенности",
                "от остроты зрения",
                "ничего из вышеперечисленного"
            ]
        },
        {
            "qID": 264,
            "qName": "Абсолютная световая чувствительность характеризуется",
            "rA": [
                "порогом восприятия света"
            ],
            "wA": [
                "порогом различения",
                "длиной волны излучения",
                "границами поля зрения"
            ]
        },
        {
            "qID": 265,
            "qName": "Симптоматическая гемералопия связана",
            "rA": [
                "с поражением фоторецепторов сетчатки"
            ],
            "wA": [
                "с гиповитаминозом витамина А",
                "с гиповитаминозом витамина С",
                "с поражением симпатической системы"
            ]
        },
        {
            "qID": 266,
            "qName": "Рефракцией называется ...",
            "rA": [
                "преломление света в оптической системе"
            ],
            "wA": [
                "способность глаза видеть при минимальном освещении",
                "восприятие длины волны излучения",
                "способность определять размеры и глубину предмета"
            ]
        },
        {
            "qID": 267,
            "qName": "Для коррекции астигматизма применяют",
            "rA": [
                "собирающие цилиндрические линзы"
            ],
            "wA": [
                "рассеивающие сферические линзы",
                "собирающие сферические линзы",
                "бифокальные линзы"
            ]
        },
        {
            "qID": 268,
            "qName": "Преломляющая сила оптической системы по мере роста глаза",
            "rA": [
                "уменьшается"
            ],
            "wA": [
                "увеличивается",
                "не изменяется",
                "может изменяться по разному"
            ]
        },
        {
            "qID": 269,
            "qName": "Пресбиопия развивается в связи с",
            "rA": [
                "уменьшением аккомодативной способности хрусталика"
            ],
            "wA": [
                "углублением передней камеры",
                "дистрофическими изменениями в радужке",
                "ростом глазного яблока"
            ]
        },
        {
            "qID": 270,
            "qName": "Для укрепления склеры при миопии применяется",
            "rA": [
                "введение в тенноново пространство взвеси измельченного гомохряща"
            ],
            "wA": [
                "плеоптика",
                "пломбирование склеры",
                "лазерное лечение"
            ]
        },
        {
            "qID": 271,
            "qName": "Птоз верхнего века может быть",
            "rA": [
                "при параличе мышцы, поднимающей верхнее веко"
            ],
            "wA": [
                "при параличе зрительного нерва",
                "при параличе блокового нерва",
                "при параличе отводящего нерва"
            ]
        },
        {
            "qID": 272,
            "qName": "Колобома века   это",
            "rA": [
                "дефект края века в виде треугольной или полукруглой выемки"
            ],
            "wA": [
                "укорочение и сужение глазной щели",
                "полулунная кожная складка у внутренних углов глазной щели",
                "опущение верхнего века"
            ]
        },
        {
            "qID": 273,
            "qName": "Среди заболеваний конъюнктивы выделяют все группы, кроме:",
            "rA": [
                "помутнения"
            ],
            "wA": [
                "воспаления",
                "дистрофии",
                "новообразования"
            ]
        },
        {
            "qID": 274,
            "qName": "С целью диагностики конъюнктивита необходимо определить",
            "rA": [
                "флору и чувствительность к антибиотикам"
            ],
            "wA": [
                "угол передней камеры",
                "измерить внутриглазное давление",
                "размеры глазного яблока"
            ]
        },
        {
            "qID": 275,
            "qName": "Возбудителем острого эпидемического кератоконъюнктивита являются",
            "rA": [
                "аденовирусы"
            ],
            "wA": [
                "бактерии",
                "хламидии",
                "риновирусы"
            ]
        },
        {
            "qID": 276,
            "qName": "Гонобленнорея у новорожденных развивается",
            "rA": [
                "на 2 3 день жизни"
            ],
            "wA": [
                "в первые часы жизни",
                "в 1 ый день жизни",
                "в первые две недели жизни"
            ]
        },
        {
            "qID": 277,
            "qName": "Клинический признак дифтерийного конъюнктивита",
            "rA": [
                "наличие серых налетов пленок, спаянных с подлежащей тканью"
            ],
            "wA": [
                "боль при движении глазного яблока",
                "ухудшения зрения вблизь",
                "диплопия"
            ]
        },
        {
            "qID": 278,
            "qName": "Врожденные аномалии развития сосудистой оболочки чаще всего проявляются",
            "rA": [
                "колобомами"
            ],
            "wA": [
                "птозом",
                "иритами",
                "циклитами"
            ]
        },
        {
            "qID": 279,
            "qName": "При вовлечении в воспалительный процесс ресничного тела появляются",
            "rA": [
                "преципитаты на задней поверхности роговицы"
            ],
            "wA": [
                "геморрагии",
                "фолликулы",
                "хемоз"
            ]
        },
        {
            "qID": 280,
            "qName": "При периферическом увейте отмечается воспаление",
            "rA": [
                "плоской части ресничного тела и прилежащей части хориоидеи"
            ],
            "wA": [
                "зрачковой зоны радужки",
                "периферии радужной оболочки",
                "зрачка"
            ]
        },
        {
            "qID": 281,
            "qName": "Помутнение стекловидного тела при иридоциклитах может отмечаться вследствие",
            "rA": [
                "обильной серозной экссудации"
            ],
            "wA": [
                "развития заращения зрачка",
                "образования преципитатов",
                "вовлечения в воспалительный процесс хрусталика"
            ]
        },
        {
            "qID": 282,
            "qName": "При генерализации токсоплазмозного процесса в последние месяцы беременности отмечаются следующие изменения:",
            "rA": [
                "хориоретиниты"
            ],
            "wA": [
                "отслойки сетчатки",
                "анофтальм",
                "эмболия центральной артерии сетчатки"
            ]
        },
        {
            "qID": 283,
            "qName": "Жалобы больных при отслойке сетчатки на ...",
            "rA": [
                "выпадение поля зрения"
            ],
            "wA": [
                "гемералопию",
                "боль в глазу",
                "радужные круги при взгляде на источник света"
            ]
        },
        {
            "qID": 284,
            "qName": "В случае поздней диагностики меланомы хориоидеи может развиваться все, кроме",
            "rA": [
                "периферического увеита"
            ],
            "wA": [
                "вторичной глаукомы",
                "прорастания опухоли в глазницу",
                "отслойки сетчатки"
            ]
        },
        {
            "qID": 285,
            "qName": "Диагностика отслойки сетчатки производится с помощью",
            "rA": [
                "ультразвукового метода"
            ],
            "wA": [
                "рентгенологического метода",
                "тонометрии",
                "гониоскопа"
            ]
        },
        {
            "qID": 286,
            "qName": "Для неврита зрительного нерва характерно",
            "rA": [
                "сужение поля зрения, особенно на красный цвет"
            ],
            "wA": [
                "резкая боль",
                "ощущение песка в глазах",
                "выпадение ресниц"
            ]
        },
        {
            "qID": 287,
            "qName": "Глубина передней камеры при остром приступе глаукомы",
            "rA": [
                "мелкая"
            ],
            "wA": [
                "нормальная",
                "глубокая",
                "неравномерная"
            ]
        },
        {
            "qID": 288,
            "qName": "Глаукоматозная атрофия зрительного нерва проявляется",
            "rA": [
                "побледнением диска зрительного нерва с экскавацией"
            ],
            "wA": [
                "гиперемией диска зрительного нерва с проминенцией",
                "стушеванностью границ диска зрительного нерва",
                "явлениями застойного диска зрительного нерва"
            ]
        },
        {
            "qID": 289,
            "qName": "Методы лечения глаукомы",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "консервативное",
                "хирургическое",
                "лазерное"
            ]
        },
        {
            "qID": 290,
            "qName": "Факогенная глаукома может возникнуть в случаях, кроме",
            "rA": [
                "зрелой возрастной катаракты"
            ],
            "wA": [
                "патологического увеличения хрусталика при незрелой старческой катаракте",
                "перезрелой старческой катаракте",
                "смещения хрусталика (вывихе в переднюю камеру)"
            ]
        },
        {
            "qID": 291,
            "qName": "С целью купирования острого приступа глаукомы назначают",
            "rA": [
                "1% раствор пилокарпина по схеме"
            ],
            "wA": [
                "1% раствор атропина",
                "0,25% раствор левомецитина",
                "2,5% раствор ирифрина"
            ]
        },
        {
            "qID": 292,
            "qName": "Для усиления гипотензивного действия тимолола его можно сочетать",
            "rA": [
                "с миотиками"
            ],
            "wA": [
                "с мидриатиками",
                "с антибиотиками",
                "с кератопротекторами"
            ]
        },
        {
            "qID": 293,
            "qName": "Под влиянием миотиков происходит все, кроме",
            "rA": [
                "уменьшения содержания воды в тканях"
            ],
            "wA": [
                "миоза",
                "оттягивания радужной оболочки от угла передней камеры",
                "открытия закрытых отделов угла передней камеры"
            ]
        },
        {
            "qID": 294,
            "qName": "Фистулизирующие операции применяются при",
            "rA": [
                "первичной глаукоме"
            ],
            "wA": [
                "катаракте",
                "отслойке сетчатки"
            ]
        },
        {
            "qID": 295,
            "qName": "Цель иридэктомии",
            "rA": [
                "устранение последствий зрачкового блока"
            ],
            "wA": [
                "устранение функционального блока венозного синуса склеры",
                "создание нового пути оттока из передней камеры глаза в подконъюнктивальное пространство",
                "активация увеасклерального оттока"
            ]
        },
        {
            "qID": 296,
            "qName": "При катаракте возможно появление жалоб на",
            "rA": [
                "снижение зрения"
            ],
            "wA": [
                "локальную боль",
                "боль при движении глазного яблока",
                "появление центральной скотомы"
            ]
        },
        {
            "qID": 297,
            "qName": "При зрелой стадии катаракты при боковом освещении хрусталик имеет",
            "rA": [
                "серо белый цвет с перламутровым оттенком"
            ],
            "wA": [
                "вид жидкой массы молочного цвета",
                "гомогенный вид грязно серого цвета",
                "неравномерное помутнение"
            ]
        },
        {
            "qID": 298,
            "qName": "Осложненная катаракта возникает при",
            "rA": [
                "всех перечисленных случаях"
            ],
            "wA": [
                "хроническом вялотекущем увейте",
                "глаукоме",
                "увеопатиях"
            ]
        },
        {
            "qID": 299,
            "qName": "Консервативная терапия при катаракте назначается с целью",
            "rA": [
                "предупреждения прогрессирования начальных стадий помутнения хрусталика"
            ],
            "wA": [
                "снижения внутриглазного давления",
                "рассасывания помутнения",
                "как альтернатива хирургического лечения"
            ]
        },
        {
            "qID": 300,
            "qName": "Методы лечения катаракты",
            "rA": [
                "факоэмульсификация"
            ],
            "wA": [
                "энуклеация",
                "пластика",
                "витрэктомия"
            ]
        },
        {
            "qID": 301,
            "qName": "При афакии передняя камера",
            "rA": [
                "глубокая"
            ],
            "wA": [
                "мелкая",
                "неравномерной глубины",
                "нормальная"
            ]
        },
        {
            "qID": 302,
            "qName": "К врожденным патологическим состояниям стекловидного тела относят",
            "rA": [
                "гиперплазию стекловидного тела"
            ],
            "wA": [
                "гемофтальм",
                "колобому",
                "гифему"
            ]
        },
        {
            "qID": 303,
            "qName": "Для диабетической катаракты характерно",
            "rA": [
                "быстрое прогрессирование"
            ],
            "wA": [
                "медленное прогрессирование",
                "отсутствие прогрессирования",
                "очень медленное прогрессирование"
            ]
        },
        {
            "qID": 304,
            "qName": "Изменения на глазном дне при заболеваниях почек следующие",
            "rA": [
                "фигура «звезды» в макулярной области"
            ],
            "wA": [
                "экскавация ДЗН",
                "симптом Салюса Гунна",
                "микроаневризмы"
            ]
        },
        {
            "qID": 305,
            "qName": "При синдроме Горнера отмечается",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "энофтальм",
                "птоз",
                "миоз"
            ]
        },
        {
            "qID": 306,
            "qName": "К злокачественным опухолям органа зрения относятся все, кроме",
            "rA": [
                "гемангиомы"
            ],
            "wA": [
                "карциномы",
                "саркомы",
                "меланомы"
            ]
        },
        {
            "qID": 307,
            "qName": "Для диагностики мелких инородных тел в переднем отделе глаза применяют",
            "rA": [
                "бесскелетную рентгенографию по Фогту"
            ],
            "wA": [
                "диафаноскопию",
                "офтальмоскопию",
                "пахиметрию"
            ]
        },
        {
            "qID": 308,
            "qName": "С целью анестезии роговицы необходимо закапать",
            "rA": [
                "0,25% раствор дикаина"
            ],
            "wA": [
                "0,25% раствор тимолола",
                "0,25% раствор левомецитина",
                "0,25% раствор атропина"
            ]
        },
        {
            "qID": 309,
            "qName": "Травматическая катаракта развивается вследствие",
            "rA": [
                "проникновения влаги передней камеры через поврежденную капсулу хрусталика"
            ],
            "wA": [
                "развития аутоаллергических процессов",
                "понижения внутриглазного давления",
                "повышения внутриглазного давления"
            ]
        },
        {
            "qID": 310,
            "qName": "Явления халькоза и сидероза чаще проявляются",
            "rA": [
                "через несколько месяцев"
            ],
            "wA": [
                "через 1 сутки",
                "через несколько лет",
                "через 14 суток"
            ]
        },
        {
            "qID": 311,
            "qName": "Симпатическое воспаление представляет собой",
            "rA": [
                "вялотекущий фибринозно пластический увеит"
            ],
            "wA": [
                "склерозирующий кератит",
                "эписклерит",
                "отслойку сетчатки"
            ]
        },
        {
            "qID": 312,
            "qName": "При воздействии сильного инфракрасного облучения может развиться",
            "rA": [
                "электроофтальмия"
            ],
            "wA": [
                "огневая катаракта",
                "отек сетчатки",
                "глаукома"
            ]
        },
        {
            "qID": 313,
            "qName": "Нижняя прямая мышца иннервируется ... нервом",
            "rA": [
                "глазодвигательным"
            ],
            "wA": [
                "отводящим",
                "блоковым",
                "зрительным"
            ]
        },
        {
            "qID": 314,
            "qName": "Слезное озеро ограничивается",
            "rA": [
                "внутренним углом глазной щелш"
            ],
            "wA": [
                "наружным углом глазной щели",
                "и тем, и другим",
                "ни тем, ни другим"
            ]
        },
        {
            "qID": 315,
            "qName": "Верхняя орбитопальпебральная складка втягивается вглубь прикрепляющимися к ней волокнами",
            "rA": [
                "мышцы, поднимающей верхнее веко"
            ],
            "wA": [
                "мышцы, суживающей зрачок",
                "мышцы, расширяющей зрачок",
                "круговой мышцы"
            ]
        },
        {
            "qID": 316,
            "qName": "Длина слезного мешка составляет ... мм",
            "rA": [
                "10 12"
            ],
            "wA": [
                "1 3",
                "6  8",
                "21 26"
            ]
        },
        {
            "qID": 317,
            "qName": "Слезная артерия кровоснабжает все, кроме",
            "rA": [
                "внутренние отделы верхнего века"
            ],
            "wA": [
                "слезную железу",
                "наружные отделы верхнего века",
                "наружные отделы нижнего века"
            ]
        },
        {
            "qID": 318,
            "qName": "К двигательным нервам относятся все, кроме",
            "rA": [
                "зрительного нерва"
            ],
            "wA": [
                "глазодвигательного нерва",
                "блокового нерва",
                "отводящнго нерва"
            ]
        },
        {
            "qID": 319,
            "qName": "Передняя и задняя камеры глазного яблока разделяются",
            "rA": [
                "радужкой"
            ],
            "wA": [
                "хрусталиком",
                "стекловидным телом",
                "лимбом"
            ]
        },
        {
            "qID": 320,
            "qName": "Связки, поддерживающие хрусталик прикрепляются к ...",
            "rA": [
                "ресничному телу"
            ],
            "wA": [
                "склере",
                "лимбу",
                "радужке"
            ]
        },
        {
            "qID": 321,
            "qName": "Сосудистая система хориоидеи представлена ... артериями",
            "rA": [
                "задними короткими ресничными"
            ],
            "wA": [
                "задними длинными ресничными",
                "передними ресничными",
                "центральной артерией сетчатки"
            ]
        },
        {
            "qID": 322,
            "qName": "По химическому составу стекловидное тело сходно с ...",
            "rA": [
                "цереброспинальной жидкостью"
            ],
            "wA": [
                "камерной влагой",
                "слезой",
                "ни тем, ни другим"
            ]
        },
        {
            "qID": 323,
            "qName": "Изнутри к пигментному эпителию сетчатки прилегают... клетки",
            "rA": [
                "нейроэпителия"
            ],
            "wA": [
                "ганглиозные",
                "биполярные",
                "ни одни из перечисленных"
            ]
        },
        {
            "qID": 324,
            "qName": "Светоощущение осуществляется",
            "rA": [
                "палочками"
            ],
            "wA": [
                ">колбочками",
                "и теми, и другими",
                "ни теми, ни другими"
            ]
        },
        {
            "qID": 325,
            "qName": "Гетеронимная гемианопсия характеризуется выпадением",
            "rA": [
                "височных половин поля зрения"
            ],
            "wA": [
                "височной половины в одном глазу и носовой",
                "в другом",
                "участков поля зрения различной формы",
                "поля зрения на одном глазу"
            ]
        },
        {
            "qID": 326,
            "qName": "Определение у больного светощущения проводят с помощью ...",
            "rA": [
                "офтальмоскопа"
            ],
            "wA": [
                "рефрактометра",
                "кератометра",
                "кампиметра"
            ]
        },
        {
            "qID": 327,
            "qName": "Слияние (фузия) двойных изображений в единое является функцией ... зрения",
            "rA": [
                "бинокулярного"
            ],
            "wA": [
                "центрального",
                "периферического",
                "монокулярного"
            ]
        },
        {
            "qID": 328,
            "qName": "Лучи после прохождения оптических сред концентрируются на сетчатке при ....",
            "rA": [
                "эмметропии"
            ],
            "wA": [
                "миопии",
                "гиперметропии",
                "анизометропии"
            ]
        },
        {
            "qID": 329,
            "qName": "Слабая преломляющая способность оптических сред глаза характерна",
            "rA": [
                "для гиперметропии"
            ],
            "wA": [
                "для миопии",
                "для астигматизма",
                "для эмметропии"
            ]
        },
        {
            "qID": 330,
            "qName": "Гиперметропия корригируется",
            "rA": [
                "собирающими сферическими линзами"
            ],
            "wA": [
                "рассеивающими сферическими линзами",
                "призматическими линзами",
                "цилиндрическими линзами"
            ]
        },
        {
            "qID": 331,
            "qName": "50 летнему больному с гиперметропической рефракцией +2,0D необходимо выписать очки для близи",
            "rA": [
                "+ 4,0 D"
            ],
            "wA": [
                "+ 1,0 D",
                "+ 2,0 D",
                "+ 3,0 D"
            ]
        },
        {
            "qID": 332,
            "qName": "При астигматизме ....",
            "rA": [
                "преломленные глазом лучи не могут собраться в одну точку"
            ],
            "wA": [
                "после преломления оптической системой могут фокусироваться только за сетчаткой",
                "параллельно идущие лучи сходятся перед сетчаткой",
                "преломленные лучи фокусируются на сетчатке"
            ]
        },
        {
            "qID": 333,
            "qName": "При миопии в условиях циклоплегии острота зрения",
            "rA": [
                "не изменяется"
            ],
            "wA": [
                "улучшается",
                "ухудшается",
                "становится больше нормы"
            ]
        },
        {
            "qID": 334,
            "qName": "При прогрессирующей миопии проводят",
            "rA": [
                "укрепление склеры"
            ],
            "wA": [
                "циклодиатермокоагуляцию",
                "фистулизирующие операции",
                "теномиопластику"
            ]
        },
        {
            "qID": 335,
            "qName": "При паралитическом косоглазии больные жалуются на ...",
            "rA": [
                "двоение"
            ],
            "wA": [
                "боль при движениях глаз",
                "чувство инородного тела",
                "покраснение глаза"
            ]
        },
        {
            "qID": 336,
            "qName": "Содружественное косоглазие характеризуется ...",
            "rA": [
                "первичный угол отклонения равен вторичному"
            ],
            "wA": [
                "ограничением или отсутствием подвижности глаза в сторону пораженной мышцы",
                "первичный угол отклонения меньше вторичного",
                "наличием двоения"
            ]
        },
        {
            "qID": 337,
            "qName": "К заболеваниям нервно мышечного аппарата век относятся все, кроме",
            "rA": [
                "блефарохалазиса"
            ],
            "wA": [
                "паралича круговой мышцы век",
                "птоза",
                "выворота век"
            ]
        },
        {
            "qID": 338,
            "qName": "Лечение ячменя должно включать",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "сульфаниламиды",
                "сухое тепло",
                "УВЧ терапия"
            ]
        },
        {
            "qID": 339,
            "qName": "Характерный признак острого эпидемического конъюнктивита",
            "rA": [
                "вовлечение в процесс конъюнктивы глазного яблока"
            ],
            "wA": [
                "наличие пленок, плотно спаянных с подлежащей тканью",
                "пролиферативное воспаление мейбомиевой железы и хряща вокруг него",
                "складка истонченной кожи над наружным углом глазной щели"
            ]
        },
        {
            "qID": 340,
            "qName": "Гемангиома может быть",
            "rA": [
                "всеми перечисленными"
            ],
            "wA": [
                "капиллярной",
                "ветвистой",
                "кавернозной"
            ]
        },
        {
            "qID": 341,
            "qName": "В сканирование является",
            "rA": [
                "двухмерным акустическим исследованием"
            ],
            "wA": [
                "одномерной эхографией",
                "графической записью потенциалов",
                "методом осмотра глазного дна"
            ]
        },
        {
            "qID": 342,
            "qName": "При поверхностной инъекции конъюнктива глазного яблока имеет",
            "rA": [
                "ярко красный цвет"
            ],
            "wA": [
                "сиренево фиолетовый оттенок",
                "желтоватый оттенок",
                "темно бордовый цвет"
            ]
        },
        {
            "qID": 343,
            "qName": "Дакриоаденит является осложнением общих инфекций",
            "rA": [
                "всех перечисленных"
            ],
            "wA": [
                "гриппа",
                "ангины",
                "эпидемического паротита"
            ]
        },
        {
            "qID": 344,
            "qName": "Положительная канальцевая проба свидетельствует",
            "rA": [
                "о сохранении присасывающей функции канальцев"
            ],
            "wA": [
                "о достаточном объеме слезы",
                "об отсутствии проходимости слезной жидкости",
                "о нормальной функции слезного мешка"
            ]
        },
        {
            "qID": 345,
            "qName": "При эпискперитах в процесс вовлекаются",
            "rA": [
                "преимущественно поверхностные слои склеры"
            ],
            "wA": [
                "глубокие слои склеры",
                "роговица",
                "конъюнктива в этом секторе склеры"
            ]
        },
        {
            "qID": 346,
            "qName": "Для гематогенных кератитов туберкулезной этиологии характерно все, кроме",
            "rA": [
                "нарушения чувствительности роговицы"
            ],
            "wA": [
                "более вялого течения",
                "поражения, как правило, одного глаза",
                "формирования в исходе грубого бельма"
            ]
        },
        {
            "qID": 347,
            "qName": "При лечении кератомикозов необходимо исключить применение",
            "rA": [
                "кортикостероидов"
            ],
            "wA": [
                "антимикотических средств",
                "криоаппликаций",
                "витаминов"
            ]
        },
        {
            "qID": 348,
            "qName": "К глубоким Формам послепервичного герпетического кератита относятся все, кроме",
            "rA": [
                "древовидного кератита"
            ],
            "wA": [
                "метагерпетического кератита",
                "дисковидного кератита",
                "глубокого диффузного кератита"
            ]
        },
        {
            "qID": 349,
            "qName": "Лентовидная дегенерация роговицы чаще развивается",
            "rA": [
                "при болезни Стилла"
            ],
            "wA": [
                "при эписклерите",
                "при катаракте",
                "при пузырьковом кератите"
            ]
        },
        {
            "qID": 350,
            "qName": "С целью купирования приступа при синдроме глаукомоциклитических кризов необходимы",
            "rA": [
                "кортикостероиды и мидриатики"
            ],
            "wA": [
                "ангиопротекторы",
                "кортикостероиды и миотики",
                "миотики"
            ]
        },
        {
            "qID": 351,
            "qName": "Для диагностики новообразований сосудистой оболочки применяют",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "эхоофтальмографию",
                "радиоизотопную диагностику",
                "флюоресцентную ангиографию"
            ]
        },
        {
            "qID": 352,
            "qName": "При слабовыраженной симптоматике для диагностики центрального серозного хориоретинита целесообразно применение",
            "rA": [
                "флюоресцентной ангиографии"
            ],
            "wA": [
                "биомикроскопии",
                "ретгендиагностика по Комбергу Балтину",
                "диафаноскопии"
            ]
        },
        {
            "qID": 353,
            "qName": "Симптом «раздавленного помидора» наблюдается",
            "rA": [
                "при тромбозе центральной вены сетчатки"
            ],
            "wA": [
                "при неврите зрительного нерва",
                "при эмболии центральной артерии сетчатки",
                "при застойном диске зрительного нерва"
            ]
        },
        {
            "qID": 354,
            "qName": "Для ретинальных кровоизлияний характерен",
            "rA": [
                "ярко красный цвет"
            ],
            "wA": [
                "красновато серый",
                "желто красный цвет",
                "желтовато зеленоватый цвет"
            ]
        },
        {
            "qID": 355,
            "qName": "Для ретиноваскулитов ревматической этиологии характерно",
            "rA": [
                "наличие муфт"
            ],
            "wA": [
                "цианотичность сетчатки",
                "бледность диска зрительного нерва",
                "обширные кровоизлияния"
            ]
        },
        {
            "qID": 356,
            "qName": "Для лечения отслойки сетчатки применяются",
            "rA": [
                "вдавление склеры силикиновой губкой"
            ],
            "wA": [
                "факоэмульсификацию",
                "склеро пластику",
                "гониотомию"
            ]
        },
        {
            "qID": 357,
            "qName": "Ишемия диска зрительного нерва является",
            "rA": [
                "следствием нарушения кровообращения в системе артерий, питающих нерв"
            ],
            "wA": [
                "в результате заполнения сосудистой воронки экссудатом",
                "результатом повышения внутричерепного давления",
                "осложнением отслойки сетчатки"
            ]
        },
        {
            "qID": 358,
            "qName": "Больные с застойным диском предъявляют жалобы",
            "rA": [
                "зрительные функции долго остаются в норме"
            ],
            "wA": [
                "на резкое снижение зрения",
                "на кратковременное затуманивание зрения",
                "на снижение зрения на отдельные цвета"
            ]
        },
        {
            "qID": 359,
            "qName": "Офтальмоскопическая картина неврита зрительного нерва характеризуется",
            "rA": [
                "всем перечисленным"
            ],
            "wA": [
                "гиперемией диска зрительного нерва",
                "стушеванностью границ диска зрительного нерва",
                "умеренным расширением артерий и вен"
            ]
        },
        {
            "qID": 360,
            "qName": "Ретинобластома берет начало",
            "rA": [
                "в зернистых слоях сетчатки"
            ],
            "wA": [
                "в колбочках",
                "в палочках",
                "в области диска зрительного нерва"
            ]
        },
        {
            "qID": 361,
            "qName": "При симптоме Штельвага отмечается",
            "rA": [
                "редкое мигание"
            ],
            "wA": [
                "широкое раскрытие глазных щелей, при котором над роговицей видна часть склеры",
                "ослабление конвергенции",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 362,
            "qName": "Риногенные заболевания лежат в основе",
            "rA": [
                "хронических дакриоциститов"
            ],
            "wA": [
                "конъюнктивитов",
                "отслойки сетчатки",
                "помутнения хрусталика"
            ]
        },
        {
            "qID": 363,
            "qName": "Заболевания тройничного нерва часто сопровождаются",
            "rA": [
                "нейропаралитическим кератитом"
            ],
            "wA": [
                "отслойкой сетчатки",
                "глаукомой",
                "иридоциклитом"
            ]
        },
        {
            "qID": 364,
            "qName": "Для опухолей мозга типичны",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "застойные диски",
                "гемианопсии",
                "зрительные расстройства коркового происхождения"
            ]
        },
        {
            "qID": 365,
            "qName": "Синдром верхней глазничной щели включает все, кроме",
            "rA": [
                "изменения цвета радужки"
            ],
            "wA": [
                "экзофтальма",
                "полной неподвижности глазного яблока",
                "резкого снижения чувствительности роговицы и кожи век"
            ]
        },
        {
            "qID": 366,
            "qName": "Методом в «проходящим свете» исследуют",
            "rA": [
                "хрусталик"
            ],
            "wA": [
                "радужку",
                "ДЗН",
                "сетчатку"
            ]
        },
        {
            "qID": 367,
            "qName": "В начальной стадии корковой катаракты отмечаются следующие изменения",
            "rA": [
                "субкапсулярные вакуоли и расслоение хрусталиковых волокон"
            ],
            "wA": [
                "пигмент на передней капсуле и расслоение хрусталиковых волокон",
                "«оводнение» хрусталика",
                "все перечисленное"
            ]
        },
        {
            "qID": 368,
            "qName": "При экстракапсулярном способе экстракции катаракты извлекаются",
            "rA": [
                "ядро и хрусталиковые массы"
            ],
            "wA": [
                "задняя капсула хрусталика",
                "хрусталик в капсуле",
                "стекловидное тело"
            ]
        },
        {
            "qID": 369,
            "qName": "Отсутствие хрусталика называется ...",
            "rA": [
                "афакия"
            ],
            "wA": [
                "артифакия",
                "хемоз",
                "гифема"
            ]
        },
        {
            "qID": 370,
            "qName": "Водянистая влага образуется в",
            "rA": [
                "цилиарном теле"
            ],
            "wA": [
                "трабекулах",
                "склеральном синусе",
                "лимбе"
            ]
        },
        {
            "qID": 371,
            "qName": "При повышении внутриглазного давления",
            "rA": [
                "ухудшаются условия для циркуляции крови по сосудам глаза"
            ],
            "wA": [
                "появляются округлые утолщения по ходу нервных волокон",
                "диск пропитывается экссудатом",
                "подвергается раздражению один и тот же участок сетчатки"
            ]
        },
        {
            "qID": 372,
            "qName": "В классификации глаукомы выделены следующие стадии, кроме",
            "rA": [
                "незрелая"
            ],
            "wA": [
                "начальная",
                "далекозашедшая",
                "терминальная"
            ]
        },
        {
            "qID": 373,
            "qName": "Главным звеном в патогенезе закрытоугольной формы первичной глаукомы",
            "rA": [
                "блокада угла передней камеры корнем радужки"
            ],
            "wA": [
                "нарушение нормальной функции дренажной системы глаза",
                "патологическая проницаемость капилляров сетчатой и сосудистой оболочек глазного яблока",
                "помутнение хрусталика"
            ]
        },
        {
            "qID": 374,
            "qName": "Болевой синдром при начальной стадии открытоугольной глаукомы",
            "rA": [
                "отсутствует"
            ],
            "wA": [
                "локальная боль",
                "головная боль",
                "иррадиирующая боль"
            ]
        },
        {
            "qID": 375,
            "qName": "Для ранней диагностики закрытоугольной глаукомы используют",
            "rA": [
                "нагрузочную пробу"
            ],
            "wA": [
                "пробу Ширмера",
                "пробу Веста",
                "пробу Норна"
            ]
        },
        {
            "qID": 376,
            "qName": "К инстилляционным Формам ингибиторов карбоангидразы относится",
            "rA": [
                "азопт"
            ],
            "wA": [
                "пилокарпин",
                "глицерол",
                "ксалатан"
            ]
        },
        {
            "qID": 377,
            "qName": "Вторичная увеальная глаукома развивается в результате",
            "rA": [
                "перенесенного иридоциклита"
            ],
            "wA": [
                "набухающей катаракты",
                "тромбоза центральной вены сетчатки",
                "внутриглазного новообразования"
            ]
        },
        {
            "qID": 378,
            "qName": "Основной частью Фистулизирующей операции является",
            "rA": [
                "формирование лимбального отверстия"
            ],
            "wA": [
                "выкраивание бельма",
                "замена стекловидного тела",
                "удаление мутного хрусталика"
            ]
        },
        {
            "qID": 379,
            "qName": "При СИНУСОТОМИИ производится",
            "rA": [
                "вскрытие наружной стенки синуса"
            ],
            "wA": [
                "разрез внутренней стенки синуса",
                "рассечение угла передней камеры",
                "удаление мутного хрусталика"
            ]
        },
        {
            "qID": 380,
            "qName": "Для уточнения локализации амагнитного осколка применяют",
            "rA": [
                "ультразвук"
            ],
            "wA": [
                "экзоофтальмометр",
                "синоптофор",
                "диафаноскопию с применением волоконной оптики"
            ]
        },
        {
            "qID": 381,
            "qName": "Гемофтальм развивается вследствие",
            "rA": [
                "проникновения крови в стекловидное тело из сосудов цилиарного тела и сетчатки"
            ],
            "wA": [
                "блокады зрачка хрусталиком",
                "проникновение крови в переднюю камеру",
                "проникновение крови под конъюнктиву"
            ]
        },
        {
            "qID": 382,
            "qName": "При посттравматических дырчатых разрывах сетчатки показана",
            "rA": [
                "лазеркоагуляция"
            ],
            "wA": [
                "синусотомия",
                "кератотомия",
                "иридэктомия"
            ]
        },
        {
            "qID": 383,
            "qName": "При ожоге 1 ой степени наблюдаются",
            "rA": [
                "поверхностные эрозии роговицы"
            ],
            "wA": [
                "некроз конъюнктивы",
                "бельмо роговица",
                "неврит"
            ]
        },
        {
            "qID": 384,
            "qName": "При ожогах I1 IV степени следует вводить",
            "rA": [
                "противостолбнячную сыворотку по Безредке"
            ],
            "wA": [
                "атропин",
                "эуфиллин",
                "адреналин"
            ]
        },
        {
            "qID": 385,
            "qName": "Профилактика профессиональных поражений органа зрения заключается",
            "rA": [
                "и то, и другое"
            ],
            "wA": [
                "в строжайшем соблюдении правил техники безопасности",
                "неукоснительном соблюдении нормативов предельно допустимых концентраций ядовитых газов, паров и пыли в воздухе рабочих помещений",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 386,
            "qName": "Внутренняя стенка орбиты отделяет глазницу",
            "rA": [
                "от решетчатой пазухи"
            ],
            "wA": [
                "от лобной пазухи",
                "от гайморовой пазухи",
                "от средней черепной ямки"
            ]
        },
        {
            "qID": 387,
            "qName": "Канал зрительного нерва открывается",
            "rA": [
                "в среднюю черепную ямку"
            ],
            "wA": [
                "в ресничный узел",
                "в слезный мешок",
                "в височную ямку"
            ]
        },
        {
            "qID": 388,
            "qName": "Круговая мышца век иннервируется",
            "rA": [
                "лицевым нервом"
            ],
            "wA": [
                "блоковым нервом",
                "отводящим нервом",
                "зрительным нервом"
            ]
        },
        {
            "qID": 389,
            "qName": "Конъюнктива выстилает",
            "rA": [
                "заднюю поверхность век и склеру",
                "склеру и роговицу"
            ],
            "wA": [
                "роговицу",
                "ресничное тело"
            ]
        },
        {
            "qID": 390,
            "qName": "Слезная железа располагается",
            "rA": [
                "под верхне наружным краем глазницы"
            ],
            "wA": [
                "в височной ямке",
                "в орбите",
                "у медиального края орбиты"
            ]
        },
        {
            "qID": 391,
            "qName": "ФУНКЦИИ роговицы",
            "rA": [
                "светопроведение и светопреломление"
            ],
            "wA": [
                "образование внутриглазной жидкости",
                "светопроведение и световосприятие",
                "светорегуляция"
            ]
        },
        {
            "qID": 392,
            "qName": "Краевая петлистая сеть образуется за счет",
            "rA": [
                "лимбальных сосудов"
            ],
            "wA": [
                "слезной артерии",
                "ветвей задних коротких ресничных артерий",
                "центральной артерией сетчатки"
            ]
        },
        {
            "qID": 393,
            "qName": "Образование ядра в хрусталике приводит",
            "rA": [
                "к уменьшению объема аккомодации"
            ],
            "wA": [
                "к увеличению объема аккомодации",
                "объем аккомодации не изменяется",
                "ни к одному из перечисленных"
            ]
        },
        {
            "qID": 394,
            "qName": "Ресничное тело участвует",
            "rA": [
                "в аккомодации"
            ],
            "wA": [
                "в светопроведении",
                "в светорегуляции",
                "в световосприятии"
            ]
        },
        {
            "qID": 395,
            "qName": "Сетчатка микроскопически представляет собой цепь нейронов",
            "rA": [
                "всех перечисленных"
            ],
            "wA": [
                "фоторецепторного",
                "ассоциативного",
                "ганглионарного"
            ]
        },
        {
            "qID": 396,
            "qName": "Зрительный нерв относится",
            "rA": [
                "ко II  ой паре черепно мозговых нервов"
            ],
            "wA": [
                "к 1 ой паре черепно мозговых нервов",
                "к III  ой паре черепно мозговых нервов",
                "к IV   ой паре черепно мозговых нервов"
            ]
        },
        {
            "qID": 397,
            "qName": "Задние короткие ресничные артерии питают",
            "rA": [
                "хориоидею"
            ],
            "wA": [
                "радужку",
                "ресничное тело",
                "роговицу"
            ]
        },
        {
            "qID": 398,
            "qName": "Чувствительную иннервацию радужки осуществляет",
            "rA": [
                "тройничный нерв"
            ],
            "wA": [
                "блоковый нерв",
                "отводящий нерв",
                "зрительный нерв"
            ]
        },
        {
            "qID": 399,
            "qName": "Методом в «проходящем свете» исследуют",
            "rA": [
                "прозрачные среды глаза"
            ],
            "wA": [
                "защитный аппарат глаза",
                "глазное дно",
                "подвижность глазного яблока"
            ]
        },
        {
            "qID": 400,
            "qName": "Электроретинография используется как метод диагностики",
            "rA": [
                "при различных заболеваниях сетчатки"
            ],
            "wA": [
                "при различных заболеваниях роговицы",
                "при различных заболеваниях склеры",
                "при различных заболеваниях склеры"
            ]
        },
        {
            "qID": 401,
            "qName": "В зрительном анализаторе имеются",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "рецепторный отдел",
                "проводниковый отдел",
                "корковый отдел"
            ]
        },
        {
            "qID": 402,
            "qName": "Центральное зрение осуществляется",
            "rA": [
                "колбочками"
            ],
            "wA": [
                "палочками",
                "роговицей",
                "радужкой"
            ]
        },
        {
            "qID": 403,
            "qName": "Объективные методы исследования остроты зрения основаны",
            "rA": [
                "на появлении оптокинетического нистагма"
            ],
            "wA": [
                "на способности раздражения колбочек при воздействии света",
                "на способности отражения лучей света от рассматриваемых предметов",
                "на способности преломления лучей света"
            ]
        },
        {
            "qID": 404,
            "qName": "Правильная проекция света свидетельствует",
            "rA": [
                "о нормальной функции периферических отделов сетчатки"
            ],
            "wA": [
                "о нормальном цветоощущении",
                "о нормальных границах диска зрительного нерва",
                "о нормальных границах поля зрения"
            ]
        },
        {
            "qID": 405,
            "qName": "Восприятие предметов, окрашенных в красный цвет называется",
            "rA": [
                "эритропсия"
            ],
            "wA": [
                "ксантопсия",
                "хлоропсия",
                "фотопсия"
            ]
        },
        {
            "qID": 406,
            "qName": "Проекция в пространстве диска зрительного нерва называется",
            "rA": [
                "слепое пятно"
            ],
            "wA": [
                "гемианопсия",
                "макула",
                "друза"
            ]
        },
        {
            "qID": 407,
            "qName": "Гемералопия может быть",
            "rA": [
                "симптоматической"
            ],
            "wA": [
                "биназальной",
                "гомонимной",
                "битемпоральной"
            ]
        },
        {
            "qID": 408,
            "qName": "Основной рефлекторный механизм бинокулярного зрения",
            "rA": [
                "фузионный рефлекс"
            ],
            "wA": [
                "мигательный рефлекс",
                "зрачковый рефлекс",
                "световой рефлекс"
            ]
        },
        {
            "qID": 409,
            "qName": "Физическая рефракция характеризует",
            "rA": [
                "преломляющую способность оптической системы глаза"
            ],
            "wA": [
                "положение главного фокуса оптической системы глаза по отношению к сетчатке",
                "способность глаза фокусировать изображение, рассматриваемых предметов независимо от расстояния, на котором находится предмет",
                "расположение главных меридианов глаза"
            ]
        },
        {
            "qID": 410,
            "qName": "Аметропия   это ...",
            "rA": [
                "несоразмерная рефракция"
            ],
            "wA": [
                "соразмерная рефракция",
                "разная рефракция в разных глазах",
                "разновеликое изображение на сетчатках"
            ]
        },
        {
            "qID": 411,
            "qName": "Аккомодация каждого глаза в отдельности называется",
            "rA": [
                "абсолютной"
            ],
            "wA": [
                "относительной",
                "ложной",
                "истинной"
            ]
        },
        {
            "qID": 412,
            "qName": "Непрогрессирующая миопия является",
            "rA": [
                "аномалией рефракции"
            ],
            "wA": [
                "миопической болезнью",
                "соразмерной рефракцией",
                "анизометропией"
            ]
        },
        {
            "qID": 413,
            "qName": "Анизометропией называется ...",
            "rA": [
                "неодинаковая рефракция обоих глаз"
            ],
            "wA": [
                "способность глаза фокусировать изображения рассматриваемых предметов независимо от расстояния, на котором находится предмет",
                "сочетание в одном глазу разных видов рефракций",
                "разные размеры изображения"
            ]
        },
        {
            "qID": 414,
            "qName": "Монолатеральное косоглазие бывает, когда от общей точки фиксации",
            "rA": [
                "постоянно отклоняется один и тот же глаз"
            ],
            "wA": [
                "отклоняется то один, то другой глаз",
                "глаз отклоняется только кнутри",
                "все перечисленное"
            ]
        },
        {
            "qID": 415,
            "qName": "Аккомодационное косоглазие устраняется при ...",
            "rA": [
                "полной коррекции аметропии"
            ],
            "wA": [
                "назначении прямой окклюзии",
                "назначении лазерстимуляции",
                "медикаментозном лечении"
            ]
        },
        {
            "qID": 416,
            "qName": "Основная цель лечения содружественного косоглазия",
            "rA": [
                "восстановление или формирование (отсутствовавших) бинокулярных связей"
            ],
            "wA": [
                "восстановление сумеречного зрения",
                "снижение внутриглазного давления",
                "повышение остроты зрения"
            ]
        },
        {
            "qID": 417,
            "qName": "Энофтальм проявляется",
            "rA": [
                "при переломах стенок глазницы с расхождением костных отломков"
            ],
            "wA": [
                "при параличах и парезах симпатического нерва",
                "при повышении внутриглазного давления",
                "при всех перечисленных"
            ]
        },
        {
            "qID": 418,
            "qName": "Тенонит  это ...",
            "rA": [
                "воспаление влагалища глазного яблока"
            ],
            "wA": [
                "диффузное гнойное во спаление орбитальной клетчатки",
                "воспалительный процесс, захватывающий костную стенку",
                "воспаление наружной оболочки глазного яблока"
            ]
        },
        {
            "qID": 419,
            "qName": "Синдром Горнера   это симптомокомплекс, включающий все, кроме",
            "rA": [
                "мидриаза"
            ],
            "wA": [
                "миоза",
                "птоза",
                "энофтальма"
            ]
        },
        {
            "qID": 420,
            "qName": "Блефарофимоз   это",
            "rA": [
                "укорочение и сужение глазной щели"
            ],
            "wA": [
                "хроническое пролиферативное воспаление хряща века",
                "неполное смыкание глазной щели",
                "опущение верхнего века"
            ]
        },
        {
            "qID": 421,
            "qName": "Первичный очаг инфекции при паратрахоме",
            "rA": [
                "мочеполовые пути"
            ],
            "wA": [
                "глаза",
                "легкие",
                "мелкие суставы"
            ]
        },
        {
            "qID": 422,
            "qName": "Эпидемический кератоконъюнктивит вызывается",
            "rA": [
                "8 ым серотипом аденовирусов"
            ],
            "wA": [
                "хламидиями",
                "палочкой Леффлера",
                "стрептококком"
            ]
        },
        {
            "qID": 423,
            "qName": "При птеригиуме рекомендуется",
            "rA": [
                "оперативное удаление"
            ],
            "wA": [
                "назначение антибиотиков",
                "назначение ферментов",
                "лазерное лечение"
            ]
        },
        {
            "qID": 424,
            "qName": "Хламидии высокочувствительны",
            "rA": [
                "к антибиотикам фторхинолового ряда"
            ],
            "wA": [
                "к кортикостероидам",
                "к цефалоспоринам",
                "к [3 блокаторам"
            ]
        },
        {
            "qID": 425,
            "qName": "Функциональную проходимость слезоотводящих путей проверяют",
            "rA": [
                "окрашиванием слезы 3% раствором колларгола"
            ],
            "wA": [
                "экзоофтальмометром",
                "алгизиметром",
                "диафаноскопом"
            ]
        },
        {
            "qID": 426,
            "qName": "Структуры слезных путей развиваются",
            "rA": [
                "при хроническом конъюнктивите"
            ],
            "wA": [
                "при хроническом увейте",
                "при дакриоадените",
                "при повышении внутриглазного давления"
            ]
        },
        {
            "qID": 427,
            "qName": "Основной признак воспаления слезного мешка",
            "rA": [
                "слизисто гнойное отделяемое из слезных точек при надавливании на область слезного мешка"
            ],
            "wA": [
                "сращение век",
                "некротизация эпителия",
                "болезненность и уплотнение в верхне латеральном секторе орбиты"
            ]
        },
        {
            "qID": 428,
            "qName": "Роговичный синдром включаетвсе перечисленное, кроме",
            "rA": [
                "чувство инородного тела под верхним веком",
                "слезотечение",
                "светобоязнь"
            ],
            "wA": [
                "изменение глубины передней камеры"
            ]
        },
        {
            "qID": 429,
            "qName": "Эрозия роговицы характеризуется",
            "rA": [
                "отторжением эпителия"
            ],
            "wA": [
                "образованием «фасетки»",
                "инфильтрацией роговицы",
                "углублением передней камеры"
            ]
        },
        {
            "qID": 430,
            "qName": "Лечение герпетических кератитов",
            "rA": [
                "ацикловир"
            ],
            "wA": [
                "ПАСК",
                "левомицетин",
                "арутимол"
            ]
        },
        {
            "qID": 431,
            "qName": "Первичные опухоли склеры",
            "rA": [
                "фиброма"
            ],
            "wA": [
                "гемангиома",
                "меланома",
                "ретинобластома"
            ]
        },
        {
            "qID": 432,
            "qName": "При вовлечении в воспалительный процесс ресничного тела появляются",
            "rA": [
                "преципитаты на задней поверхности роговицы"
            ],
            "wA": [
                "геморрагии",
                "фолликулы",
                "хемоз"
            ]
        },
        {
            "qID": 433,
            "qName": "Для синдрома Фукса характерно",
            "rA": [
                "наличие преципитатов и отсутствие признаков воспаления глаза"
            ],
            "wA": [
                "наличие преципитатов и признаков воспаления глаза",
                "наличие признаков востамения",
                "воспаление мелких суставов"
            ]
        },
        {
            "qID": 434,
            "qName": "При периферическом увейте отмечается воспаление",
            "rA": [
                "плоской части ресничного тела и прилежащей части хориоидеи"
            ],
            "wA": [
                "зрачковой зоны радужки",
                "макулярной зоны",
                "всех перечисленных"
            ]
        },
        {
            "qID": 435,
            "qName": "Свежие хориоидальные очаги имеют",
            "rA": [
                "нечеткие границы"
            ],
            "wA": [
                "четкие границы",
                "пигментацию",
                "очаги некроза"
            ]
        },
        {
            "qID": 436,
            "qName": "Жалобы больных при пигментной дистрофии сетчатки",
            "rA": [
                "на гемералопию"
            ],
            "wA": [
                "на искажение предметов",
                "на двоение",
                "на появление скотомы"
            ]
        },
        {
            "qID": 437,
            "qName": "Диагностика отслойки сетчатки производится с помощью",
            "rA": [
                "ультразвукового метода"
            ],
            "wA": [
                "рентгенологического метода",
                "и того, и другого",
                "ни того, ни другого"
            ]
        },
        {
            "qID": 438,
            "qName": "Для ретинобластомы характерно",
            "rA": [
                "желтое свечение зрачка"
            ],
            "wA": [
                "ограничение подвижности глазного яблока",
                "развитие иридоциклита",
                "развитие острого приступа глаукомы"
            ]
        },
        {
            "qID": 439,
            "qName": "Гипертонический ангиосклероз сосудов сетчатки соответствует",
            "rA": [
                "гипертонической болезни ll ой стадии"
            ],
            "wA": [
                "гипертонической болезни 1 ой стадии",
                "гипертонической болезни Ill ей стадии",
                "гипертонической болезни IV ой стадии"
            ]
        },
        {
            "qID": 440,
            "qName": "Острая непроходимости центральной артерии сетчатки встречается привсех состояниях, кроме",
            "rA": [
                "цирроза печени"
            ],
            "wA": [
                "порока сердца",
                "гипертонической болезни",
                "эндокардита"
            ]
        },
        {
            "qID": 441,
            "qName": "Фотокоагуляция при диабетической ретинопатии позволяет",
            "rA": [
                "выключать новообразованные сосуды"
            ],
            "wA": [
                "сохранить колбочки и палочки",
                "устранить тромбоз центральной вены сетчатки",
                "расширить границы поля зрения"
            ]
        },
        {
            "qID": 442,
            "qName": "Для опухолей мозга типичны",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "гемианопсии",
                "застойные диски зрительных нервов",
                "зрительные расстройства коркового происхождения"
            ]
        },
        {
            "qID": 443,
            "qName": "Вторичная атрофия зрительного нерва является следствием всех состояний, кроме",
            "rA": [
                "катаракты"
            ],
            "wA": [
                "сосудистых ишемий",
                "неврита",
                "застоя"
            ]
        },
        {
            "qID": 444,
            "qName": "Общие заболевания, приводящие к развитию катаракты все, кроме",
            "rA": [
                "тиреотоксикоза"
            ],
            "wA": [
                "сахарного диабета",
                "миотонической дистрофии",
                "тетании"
            ]
        },
        {
            "qID": 445,
            "qName": "В незрелой стадии катаракты отмечается",
            "rA": [
                "усиление процессов оводнения"
            ],
            "wA": [
                "потеря хрусталиком воды",
                "гомогенизация хрусталиковых волокон",
                "лизис хрусталикового вещества"
            ]
        },
        {
            "qID": 446,
            "qName": "При афакии можно наблюдать",
            "rA": [
                "дрожание радужки (иридоденез)"
            ],
            "wA": [
                "перикорнеальную инъекцию",
                "преципитаты",
                "иридодиализ"
            ]
        },
        {
            "qID": 447,
            "qName": "Интракапсулярным способом извлекают",
            "rA": [
                "хрусталик в капсуле"
            ],
            "wA": [
                "стекловидное тело при гемофтальме",
                "ядро хрусталика и хрусталиковые массы",
                "хрусталик с помощью ультразвука"
            ]
        },
        {
            "qID": 448,
            "qName": "Дифференциальный диагноз острого приступа глаукомы следует проводить",
            "rA": [
                "с острым иридоциклитом"
            ],
            "wA": [
                "с острым дакриоаденитом",
                "с острым дакриоциститом",
                "с острым конъюнктивитом"
            ]
        },
        {
            "qID": 449,
            "qName": "Глаукоматозная атрофия зрительного нерва проявляется",
            "rA": [
                "побледнением диска зрительного нерва с экскавацией"
            ],
            "wA": [
                "гиперемией диска зрительного нерва с проминенцией",
                "гиперемией с кровоизлияниями",
                "стушеванностью границ диска зрительного нерва"
            ]
        },
        {
            "qID": 450,
            "qName": "При врожденной глаукоме применяются",
            "rA": [
                "гониотомия"
            ],
            "wA": [
                "склеропластика",
                "кератотомия",
                "кератомилез"
            ]
        },
        {
            "qID": 451,
            "qName": "Механизм действия бета адреноблокаторов",
            "rA": [
                "подавление продукции водянистой влаги"
            ],
            "wA": [
                "улучшение оттока из глаза",
                "увеличение диуреза",
                "деблокирующее действие на угол передней камеры и шлеммов канал"
            ]
        },
        {
            "qID": 452,
            "qName": "К осмотическим средствам длительного действия относится",
            "rA": [
                "маннитол"
            ],
            "wA": [
                "трентал",
                "корвалол",
                "кавинтон"
            ]
        },
        {
            "qID": 453,
            "qName": "С целью устранения последствий зрачкового блока применяется",
            "rA": [
                "иридэктомия"
            ],
            "wA": [
                "циклодиализ",
                "фистулизирующая операция",
                "кератотомия"
            ]
        },
        {
            "qID": 454,
            "qName": "При тупых травмах носа (при нарушении целостности пластинки решетчатой кости) возможно развитие",
            "rA": [
                "орбитальной эмфиземы"
            ],
            "wA": [
                "острого приступа глаукомы",
                "гипотонии глазного яблока",
                "отслойки сетчатки"
            ]
        },
        {
            "qID": 455,
            "qName": "При контузиях глазного яблока могут наступить расстройства аккомодации вследствие",
            "rA": [
                "пареза ресничной мышцы"
            ],
            "wA": [
                "помутнения хрусталика",
                "изменений в углу передней камеры",
                "изменения кривизны роговицы"
            ]
        },
        {
            "qID": 456,
            "qName": "Достоверными признаками прободного ранения глазного яблока являются",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "сквозная рана роговицы",
                "выпадение внутренних оболочек",
                "наличие инородного тела внутри глаза"
            ]
        },
        {
            "qID": 457,
            "qName": "На рентгенограмме с протезом Комберга Балтина в прямой проекции можно определить",
            "rA": [
                "меридиан, по которому располагается инородное тело"
            ],
            "wA": [
                "расстояние от инородного тела от лимба",
                "расстояние от инородного тела до сетчатки",
                "меридиан с более сильным преломлением"
            ]
        },
        {
            "qID": 458,
            "qName": "Признаки сидероза глаза следующие:",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "пятна ржавого цвета в передних слоях хрусталика",
                "токсическая ретинопатия",
                "нейроретинопатия"
            ]
        },
        {
            "qID": 459,
            "qName": "Для эндофтальмита характерен",
            "rA": [
                "серо желтый рефлекс с глазного дна"
            ],
            "wA": [
                "розовый рефлекс с глазного дна",
                "красный рефлекс с глазного дна",
                "желто зеленый рефлекс с глазного дна"
            ]
        },
        {
            "qID": 460,
            "qName": "При симпатической офтальмии целесообразно назначение",
            "rA": [
                "кортикостероидов"
            ],
            "wA": [
                "ферментов",
                "ангиопротекторов",
                "витаминов"
            ]
        },
        {
            "qID": 461,
            "qName": "Ожог IV степени характеризуется",
            "rA": [
                "всем перечисленным"
            ],
            "wA": [
                "глубоким некрозом конъюнктивы",
                "глубоким некрозом роговицы в виде «фарфорового стекла»",
                "ни одним из перечисленных"
            ]
        },
        {
            "qID": 462,
            "qName": "При ожоге известью необходимо",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "удалить частицы извести",
                "промыть конъюнктивальную полость водой",
                "закапать 2% раствор борной кислоты"
            ]
        },
        {
            "qID": 463,
            "qName": "Симптомы электроофтальмии включают все, кроме",
            "rA": [
                "мелкая передняя камера"
            ],
            "wA": [
                "светобоязнь",
                "слезотечение",
                "гиперемия конъюнктивы"
            ]
        },
        {
            "qID": 464,
            "qName": "В результате отравления соединениями свинца могут развиться",
            "rA": [
                "поражение сетчатки и зрительного нерва"
            ],
            "wA": [
                "поражение радужки",
                "поражение угла передней камеры",
                "поражение ресничного тела"
            ]
        },
        {
            "qID": 465,
            "qName": "Орбита имеет ФОРМУ",
            "rA": [
                "четырехгранной пирамиды"
            ],
            "wA": [
                "квадрата",
                "шара",
                "параллелепипеда"
            ]
        },
        {
            "qID": 466,
            "qName": "Нижняя глазничная щель соединяет орбиту",
            "rA": [
                "с крылонебной ямкой"
            ],
            "wA": [
                "со средней черепной ямкой",
                "с решетчатой пазухой",
                "со всеми вышеперечисленными"
            ]
        },
        {
            "qID": 467,
            "qName": "Наружная прямая мышца иннервируется",
            "rA": [
                "отводящим нервом"
            ],
            "wA": [
                "глазодвигательным нервом",
                "блоковым нервом",
                "зрительным нервом"
            ]
        },
        {
            "qID": 468,
            "qName": "В круговой мышце век различают",
            "rA": [
                "и ту, и другую"
            ],
            "wA": [
                "глазничную часть",
                "вековую часть"
            ]
        },
        {
            "qID": 469,
            "qName": "Слезные сосочки располагаются",
            "rA": [
                "у внутреннего угла глазной щели"
            ],
            "wA": [
                "у наружного угла глазной щели",
                "в слезном мешке",
                "на слезной железе"
            ]
        },
        {
            "qID": 470,
            "qName": "Конъюнктива выстилает",
            "rA": [
                "роговицу"
            ],
            "wA": [
                "заднюю поверхность век",
                "глазное яблоко до роговицы",
                "хрусталик"
            ]
        },
        {
            "qID": 471,
            "qName": "Полупрозрачная зона перехода роговицы в склеру называется",
            "rA": [
                "лимб"
            ],
            "wA": [
                "трабекула",
                "склеральный синус",
                "экватор"
            ]
        },
        {
            "qID": 472,
            "qName": "Передняя поверхность радужки имеет",
            "rA": [
                "радиарную исчерченность"
            ],
            "wA": [
                "гладкую поверхность",
                "отросчатую поверхность",
                "секторальное строение"
            ]
        },
        {
            "qID": 473,
            "qName": "Внутриглазная жидкость из задней камеры переходит",
            "rA": [
                "в переднюю камеру"
            ],
            "wA": [
                "в трабекулярную сеть",
                "в венозную систему крови",
                "в спинно мозговую жидкость"
            ]
        },
        {
            "qID": 474,
            "qName": "Хрусталик имеет вид",
            "rA": [
                "двояковыпуклой линзы"
            ],
            "wA": [
                "диска",
                "полусферы",
                "двояковогнутой линзы"
            ]
        },
        {
            "qID": 475,
            "qName": "Светочувствительный слой сетчатки составляют",
            "rA": [
                "палочки и колбочки"
            ],
            "wA": [
                "клетки пигментного эпителия",
                "биполярные клетки",
                "ганглиозные клетки"
            ]
        },
        {
            "qID": 476,
            "qName": "Место выхода зрительного нерва из сетчатки называется",
            "rA": [
                "диск"
            ],
            "wA": [
                "макула",
                "зубчатая линия",
                "лимб"
            ]
        },
        {
            "qID": 477,
            "qName": "Глазной нерв (1 я ветвь тройничного нерва) делится в орбите на следующие ветви",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "слезный нерв",
                "носоресничный нерв",
                "лобный нерв"
            ]
        },
        {
            "qID": 478,
            "qName": "Гиперемия глазного яблока может быть поверхностной или",
            "rA": [
                "конъюнктивальной"
            ],
            "wA": [
                "перикорнеальной",
                "застойной",
                "смешанной"
            ]
        },
        {
            "qID": 479,
            "qName": "Щелевая лампа представляет собой комбинацию интенсивного источника света и ...",
            "rA": [
                "бинокулярного микроскопа"
            ],
            "wA": [
                "лупы +20,0 D",
                "лупы+13,0 D",
                "вогнутого зеркала"
            ]
        },
        {
            "qID": 480,
            "qName": "У грудных детей остроту зрения определяют",
            "rA": [
                "ориентировочно путем определения фиксации глазом ребенка ярких предметов"
            ],
            "wA": [
                "по таблице Орловой",
                "по таблице Сивцева Головина",
                "по таблице Рабкина"
            ]
        },
        {
            "qID": 481,
            "qName": "К приобретенным расстройствам цветоощущения относятся все, кроме",
            "rA": [
                "гемералопии"
            ],
            "wA": [
                "эритропсии",
                "ксантопсии",
                "хлоропсии"
            ]
        },
        {
            "qID": 482,
            "qName": "Биназальная гемианопсия развивается при поражении",
            "rA": [
                "неперекрещенных волокон зрительного пути в области зрительного перекреста"
            ],
            "wA": [
                "перекрещенных волокон зрительного пути в области зрительного перекреста",
                "и то, и другое",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 483,
            "qName": "При полном выпадении зрительной функции в области скотомы она обозначается как",
            "rA": [
                "абсолютная"
            ],
            "wA": [
                "относительная",
                "положительная",
                "отрицательная"
            ]
        },
        {
            "qID": 484,
            "qName": "Световая чувствительность глаза зависит",
            "rA": [
                "от степени освещенности"
            ],
            "wA": [
                "от преломляющей системы глаза",
                "от того, и другого",
                "ни от того, ни от другого"
            ]
        },
        {
            "qID": 485,
            "qName": "Фузионный рефлекс   это ...",
            "rA": [
                "способность к слиянию в коре большого мозга двух изображений от обеих сетчаток в единую стереоскопическую картину"
            ],
            "wA": [
                "способность преломления света в оптической системе глаза",
                "способность глаза фокусировать изображения предметов независимо от расстояния, на котором находится предмет",
                "способность восприятия волн различной длины"
            ]
        },
        {
            "qID": 486,
            "qName": "Объективные методы определения рефракции",
            "rA": [
                "и то, и другое"
            ],
            "wA": [
                "скиаскопия",
                "рефрактометрия",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 487,
            "qName": "При астигматизме при исследовании в двух взаимно перпендикулярных меридианах отмечаются",
            "rA": [
                "разная преломляющая сила"
            ],
            "wA": [
                "разные фокусные расстояния4",
                "и то, и другое",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 488,
            "qName": "В ( ) линзах",
            "rA": [
                "проходящие через них параллельные лучи, превращаются в расходящиеся"
            ],
            "wA": [
                "проходящие через них параллельные лучи, превращаются в сходящиеся и собираются в главном фокусе линзы",
                "проходящие через них параллельные лучи не меняют своего направления",
                "ничего из перечисленного"
            ]
        },
        {
            "qID": 489,
            "qName": "Аккомодация глаз при определенной конвергенции зрительных осей называется",
            "rA": [
                "относительной"
            ],
            "wA": [
                "абсолютной",
                "положительной",
                "отрицательной"
            ]
        },
        {
            "qID": 490,
            "qName": "Нарушение аккомодации...",
            "rA": [
                "парез аккомодации"
            ],
            "wA": [
                "диплопия",
                "гемианопсия",
                "фузия"
            ]
        },
        {
            "qID": 491,
            "qName": "Содружественное косоглазие характеризуется",
            "rA": [
                "нарушением бинокулярного зрения"
            ],
            "wA": [
                "расширением зрачка",
                "помутнением хрусталика",
                "повышением внутриглазного давления"
            ]
        },
        {
            "qID": 492,
            "qName": "Система мероприятий, направленных на ликвидацию амблиопии и восстановление остроты зрения называется",
            "rA": [
                "плеоптическим лечением"
            ],
            "wA": [
                "ортоптическим лечением",
                "хирургическим лечением",
                "консервативным лечением"
            ]
        },
        {
            "qID": 493,
            "qName": "Тенонит   это",
            "rA": [
                "воспаление влагалища глазного яблока"
            ],
            "wA": [
                "диффузное воспаление орбитальной клетчатки",
                "воспаление краев век",
                "воспаление наружной оболочки глазного яблока"
            ]
        },
        {
            "qID": 494,
            "qName": "Саркома развивается из",
            "rA": [
                "из влагалища глазного яблока"
            ],
            "wA": [
                "надкостницы",
                "жировой клетчатки",
                "мышц"
            ]
        },
        {
            "qID": 495,
            "qName": "Воспалительный отек век характеризуется всем, кроме",
            "rA": [
                "снижением ВГД"
            ],
            "wA": [
                "выраженным покраснением кожи",
                "повышением местной температуры",
                "болезненностью при пальпации"
            ]
        },
        {
            "qID": 496,
            "qName": "Лечение халазиона",
            "rA": [
                "удаление с капсулой"
            ],
            "wA": [
                "факоэмульсификация",
                "гониотомия",
                "лазерное лечение"
            ]
        },
        {
            "qID": 497,
            "qName": "Эпидемический геморрагический конъюнктивит вызывается",
            "rA": [
                "пикорновирусами"
            ],
            "wA": [
                "вирусом простого герпеса",
                "хламидиями",
                "стафилококками"
            ]
        },
        {
            "qID": 498,
            "qName": "Трахома характеризуется",
            "rA": [
                "всем вышеперечисленным"
            ],
            "wA": [
                "диффузной воспалительной инфильтрацией слизистой оболочки и аденоидного слоя",
                "образованием фолликулов",
                "гиперплазией сосочков, замещающихся рубцовой тканью"
            ]
        },
        {
            "qID": 499,
            "qName": "Дакриоцистит новорожденных развивается вследствие",
            "rA": [
                "атрезии нижнего конца носослезного протока"
            ],
            "wA": [
                "анизейконии",
                "анизометропии",
                "амблиопии"
            ]
        },
        {
            "qID": 500,
            "qName": "Выворот слезной точки часто встречается при следующих состояниях, кроме",
            "rA": [
                "хронических дакриоцистинах"
            ],
            "wA": [
                "хронических блефароконъюнктивитах",
                "рубцовых изменениях век",
                "старческой атонии века"
            ]
        },
        {
            "qID": 501,
            "qName": "Наиболее часто кератит проявляется",
            "rA": [
                "образованием инфильтрата"
            ],
            "wA": [
                "свечением зрачка желто зеленого цвета",
                "изменением формы роговицы",
                "помутнением хрусталика"
            ]
        },
        {
            "qID": 502,
            "qName": "При паренхиматозном кератите выделяют следующие периоды",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "инфильтрации",
                "васкуляризации",
                "рассасывания"
            ]
        },
        {
            "qID": 503,
            "qName": "Поверхностные Формы послепервичного герпетического кератита все, кроме",
            "rA": [
                "дисковидного"
            ],
            "wA": [
                "эпителиального",
                "пузырькового",
                "древовидного"
            ]
        },
        {
            "qID": 504,
            "qName": "Глубокий диффузный герпетический кератит протекает на Фоне",
            "rA": [
                "иридоциклита"
            ],
            "wA": [
                "хориоидита",
                "отслойки сетчатки",
                "дакриоцистита"
            ]
        },
        {
            "qID": 505,
            "qName": "Дифференциально диагностический признак между кератитами и первичными дистрофиями роговицы",
            "rA": [
                "наличие или отсутствие васкуляризации"
            ],
            "wA": [
                "передние синехии",
                "задние синехии",
                "наличие или отсутствие кератоконуса"
            ]
        },
        {
            "qID": 506,
            "qName": "Основным методом устранения стойкого помутнения роговицы является",
            "rA": [
                "кератопластика"
            ],
            "wA": [
                "криотерапия",
                "кератомилез",
                "кератотомия"
            ]
        },
        {
            "qID": 507,
            "qName": "Аниридия  это",
            "rA": [
                "отсутствие радужки"
            ],
            "wA": [
                "отсутствие хрусталика",
                "смещение зрачка",
                "отсутствие зрачка"
            ]
        },
        {
            "qID": 508,
            "qName": "Объективный признак вовлечения в воспалительный процесс цилиарного тела",
            "rA": [
                "появление преципитатов на задней поверхности роговицы"
            ],
            "wA": [
                "гифема",
                "иридодонез",
                "гемофтальм"
            ]
        },
        {
            "qID": 509,
            "qName": "Для диагностики хориоидита применяют",
            "rA": [
                "метод прямой офтальмоскопии"
            ],
            "wA": [
                "биомикроскопию",
                "пробу Ширмера",
                "гониоскопию"
            ]
        },
        {
            "qID": 510,
            "qName": "При панувеите происходит поражение радужки, ресничного тела и ...",
            "rA": [
                "собственно сосудистой оболочки"
            ],
            "wA": [
                "роговицы",
                "хрусталика",
                "сетчатки"
            ]
        },
        {
            "qID": 511,
            "qName": "Причиной внутриглазной гипотензии считают",
            "rA": [
                "глубокие дистрофические процессы в ресничном теле"
            ],
            "wA": [
                "сужение калибра сосудов",
                "нарушение оттока внутриглазной жидкости",
                "наличие опухоли головного мозга"
            ]
        },
        {
            "qID": 512,
            "qName": "Наиболее часто разрывы сетчатки появляются",
            "rA": [
                "соответственно месту прикрепления верхней косой мышцы"
            ],
            "wA": [
                "в области макулы",
                "в области зубчатой линии",
                "в области диска зрительного нерва"
            ]
        },
        {
            "qID": 513,
            "qName": "Для ангиоматозов сетчатки характерно",
            "rA": [
                "образование на периферии сетчатки сосудистых клубочков и узлов"
            ],
            "wA": [
                "образование в центре сетчатки сосудистых клубочков и узлов",
                "появление вуалеподобной пленки серого цвета",
                "побледнение сетчатки"
            ]
        },
        {
            "qID": 514,
            "qName": "Ретиношизисом называется ...",
            "rA": [
                "расщепление сетчатки на две пластинки по наружному плексиформному слою"
            ],
            "wA": [
                "побледнение сетчатки",
                "появление вуалеподобной пленки серого цвета",
                "появление очагов кровоизлияний"
            ]
        },
        {
            "qID": 515,
            "qName": "В возникновении ретинобластомы большое значение имеет",
            "rA": [
                "передача по типу неправильного доминантного наследования"
            ],
            "wA": [
                "внутриутробное заражение токсоплазмозом",
                "перенесенная травма глаза",
                "внутриутробная гипертермия"
            ]
        },
        {
            "qID": 516,
            "qName": "После тромбоза центральной вены сетчатки может развиться",
            "rA": [
                "вторичная глаукома"
            ],
            "wA": [
                "атрофия зрительного нерва",
                "панувеит",
                "отслойка сетчатки"
            ]
        },
        {
            "qID": 517,
            "qName": "При воспалительных заболеваниях мозга и его оболочек неврит зрительного нерва имеет",
            "rA": [
                "нисходящий характер"
            ],
            "wA": [
                "восходящий характер",
                "и то, и другое",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 518,
            "qName": "При тяжелом течении неврит зрительного нерва заканчивается",
            "rA": [
                "вторичной атрофией зрительного нерва"
            ],
            "wA": [
                "глаукомой",
                "отслойкой сетчатки",
                "хориоретинитом"
            ]
        },
        {
            "qID": 519,
            "qName": "Метиловый спирт обладает избирательным свойством поражать",
            "rA": [
                "зрительный нерв"
            ],
            "wA": [
                "тройничный нерв",
                "стекловидное тело",
                "хрусталик"
            ]
        },
        {
            "qID": 520,
            "qName": "Застойный диск зрительного нерва развивается",
            "rA": [
                "при аневризмах головного мозга"
            ],
            "wA": [
                "при тиреотоксикозе",
                "при сахарном диабете",
                "при всех вышеперечисленных"
            ]
        },
        {
            "qID": 521,
            "qName": "Самый характерный симптом отечного экзофтальма",
            "rA": [
                "отек орбитальных и периорбитальных тканей"
            ],
            "wA": [
                "нарушение репозиции глазного яблока",
                "застойный диск зрительного нерва",
                "косоглазие"
            ]
        },
        {
            "qID": 522,
            "qName": "При симптоме Мебиуса наблюдается",
            "rA": [
                "затруднение конвергенции"
            ],
            "wA": [
                "редкое мигание",
                "пигментация кожи верхнего века",
                "отставание верхнего века при взгляде вниз"
            ]
        },
        {
            "qID": 523,
            "qName": "Галактоземия в первые 2 3 месяца жизни к быстрому развитию приводит к развитию",
            "rA": [
                "катаракты"
            ],
            "wA": [
                "глаукомы",
                "кератоконуса",
                "отслойке сетчатки"
            ]
        },
        {
            "qID": 524,
            "qName": "При прогрессирующем параличе отмечаются",
            "rA": [
                "рефлекторная неподвижность зрачков"
            ],
            "wA": [
                "изменение формы зрачков",
                "простая атрофия зрительных нервов"
            ]
        },
        {
            "qID": 525,
            "qName": "При врожденной катаракте может развиться",
            "rA": [
                "амблиопия"
            ],
            "wA": [
                "кератоконус",
                "заращение зрачка",
                "отслойка сетчатки"
            ]
        },
        {
            "qID": 526,
            "qName": "При перезрелой катаракте происходит все кроме,",
            "rA": [
                "помутнение капсулы хрусталика"
            ],
            "wA": [
                "распад белковых молекул",
                "превращение коры хрусталика в жидкую массу",
                "вторичное набухание"
            ]
        },
        {
            "qID": 527,
            "qName": "Факолитическая глаукома развивается",
            "rA": [
                "при резорбционной морганиевой катаракте"
            ],
            "wA": [
                "при внутриглазных опухолях",
                "при алкоголизме",
                "при ожирении"
            ]
        },
        {
            "qID": 528,
            "qName": "Недостатком пилокарпина является",
            "rA": [
                "кратковременность гипотензивного действия"
            ],
            "wA": [
                "токсичность",
                "плохая переносимость",
                "все вышеперечисленное"
            ]
        },
        {
            "qID": 529,
            "qName": "Тимолол относится",
            "rA": [
                "к бета адреноблокаторам"
            ],
            "wA": [
                "к ингибиторам карбоангидразы",
                "к осмотическим средствам",
                "к миотикам"
            ]
        },
        {
            "qID": 530,
            "qName": "Для подкожной эмфиземы характерным является",
            "rA": [
                "крепитация"
            ],
            "wA": [
                "экзофтальм",
                "появление «лимонной корочки»",
                "симптом «вишневой косточки»"
            ]
        },
        {
            "qID": 531,
            "qName": "При методе рентгенлокализации по Комбергу  Балтину используется",
            "rA": [
                "протез индикатор"
            ],
            "wA": [
                "зонд",
                "1% раствор флюоресцеина",
                "раствор йодпипола"
            ]
        },
        {
            "qID": 532,
            "qName": "Первая помощь при проникающих ранениях глаза заключается",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "в инстилляции в конъюнктивальный мешок дезинфицирующего средства",
                "в наложении бинокулярной повязки",
                "во введении противостолбнячной сыворотки"
            ]
        },
        {
            "qID": 533,
            "qName": "Осложнения проникающих ранений глаза",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "травматическая катаракта",
                "травматические иридоцикпиты",
                "симпатическое воспаление"
            ]
        },
        {
            "qID": 534,
            "qName": "При контузиях век возникают",
            "rA": [
                "подкожные кровоизлияния"
            ],
            "wA": [
                "сосочки",
                "фолликулы",
                "гифема"
            ]
        },
        {
            "qID": 535,
            "qName": "При свежих особо тяжелых ожогах (III IV степени) необходимо произвести",
            "rA": [
                "экстренную послойную кератопластику"
            ],
            "wA": [
                "иридэктомию",
                "скперопластику",
                "миопистику"
            ]
        },
        {
            "qID": 536,
            "qName": "Зрачок расширен",
            "rA": [
                "при остром приступе глаукомы"
            ],
            "wA": [
                "при конъюнктивите",
                "при остром иридоциклите",
                "при отслойке сетчатки"
            ]
        },
        {
            "qID": 537,
            "qName": "Верхняя глазничная щель расположена между",
            "rA": [
                "большим и малым крылом клиновидной кости"
            ],
            "wA": [
                "малым крылом клиновидной кости и решетчатой костью",
                "решетчатой костью и лобной костью",
                "лобной костью и слезной костью"
            ]
        },
        {
            "qID": 538,
            "qName": "Нижняя прямая мышца иннервируется",
            "rA": [
                "глазодвигательным нервом"
            ],
            "wA": [
                "отводящим нервом",
                "блоковым нервом",
                "зрительным нервом"
            ]
        },
        {
            "qID": 539,
            "qName": "Внутренняя прямая мышца начинается",
            "rA": [
                "от сухожильного кольца"
            ],
            "wA": [
                "от надкостницы нижнее внутреннего края орбиты",
                "от внутреннего края орбиты",
                "все вышеперечисленное"
            ]
        },
        {
            "qID": 540,
            "qName": "Задняя поверхность век выстилается",
            "rA": [
                "конъюнктивой"
            ],
            "wA": [
                "кожей",
                "и тем, и другим",
                "ни тем, ни другим"
            ]
        },
        {
            "qID": 541,
            "qName": "Около корня каждой ресницы располагаются",
            "rA": [
                "сальные железы"
            ],
            "wA": [
                "слезные сосочки",
                "слезные точки",
                "слезные железы"
            ]
        },
        {
            "qID": 542,
            "qName": "Слезная железа имеет",
            "rA": [
                "вековую и глазничную части"
            ],
            "wA": [
                "гладкую и радиарную части",
                "правую и левую части",
                "верхнюю и нижнюю части"
            ]
        },
        {
            "qID": 543,
            "qName": "Геометрическая ось глаза соединяет",
            "rA": [
                "пер.едний и задний полюс"
            ],
            "wA": [
                "передний и задний экватор",
                "правое и левое глазное яблоко",
                "наружнюю и внутренние оболочки"
            ]
        },
        {
            "qID": 544,
            "qName": "Фиброзная оболочка глазного яблока состоит",
            "rA": [
                "из роговицы и склеры"
            ],
            "wA": [
                "из радужки и ресничного тела",
                "из тенноновой капсулы",
                "из сосудистой и сетчатой оболочек"
            ]
        },
        {
            "qID": 545,
            "qName": "Внутриглазная жидкость из задней в переднюю камеру попадает",
            "rA": [
                "через зрачок"
            ],
            "wA": [
                "через трабекулярную сеть",
                "через шлеммов канал",
                "через фистулу"
            ]
        },
        {
            "qID": 546,
            "qName": "Периферия ресничного края радужки прикрыта",
            "rA": [
                "полупрозрачным лимбом"
            ],
            "wA": [
                "роговицей",
                "трабекулярной сетью",
                "склерой"
            ]
        },
        {
            "qID": 547,
            "qName": "Хориоидея",
            "rA": [
                "не имеет чувствительную иннервацию"
            ],
            "wA": [
                "имеет чувствительную иннервацию",
                "имеет двигательную иннервацию",
                "имеет два типа иннервации"
            ]
        },
        {
            "qID": 548,
            "qName": "Внутренний зернистый слой сетчатки представлен",
            "rA": [
                "телами и ядрами биполярных нейроцитов"
            ],
            "wA": [
                "палочками",
                "ганглионарными нейроцитами",
                "колбочками"
            ]
        },
        {
            "qID": 549,
            "qName": "Вдоль зрительного нерва направляется",
            "rA": [
                "центральная артерия сетчатки"
            ],
            "wA": [
                "задняя короткая ресничная",
                "задняя длинная ресничная артерия",
                "мышечная артерия"
            ]
        },
        {
            "qID": 550,
            "qName": "Центральный нейрон берет начало",
            "rA": [
                "в области шпорной борозды"
            ],
            "wA": [
                "в области четверохолмия",
                "в латеральном коленчатом теле",
                "в нейроэпителии сетчатки"
            ]
        },
        {
            "qID": 551,
            "qName": "В состав ресничного узла входят",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "чувствительные волокна носоресничного нерва",
                "парасимпатические волокна глазодвигательного нерва",
                "симпатические волокна сплетения внутренней сонной артерии"
            ]
        },
        {
            "qID": 552,
            "qName": "Офтальмоскопию в обратном виде проводят с помощью",
            "rA": [
                "зеркального офтальмоскопа"
            ],
            "wA": [
                "электрического офтальмоскопа",
                "лупы +40,0 D",
                "биомикроскопа"
            ]
        },
        {
            "qID": 553,
            "qName": "Метод исследования в «проходящем свете» используют",
            "rA": [
                "для исследования хрусталика и стекловидного тела"
            ],
            "wA": [
                "для диагностики отслойки внутренних оболочек",
                "для исследования глазного дна",
                "все вышеперечисленное"
            ]
        },
        {
            "qID": 554,
            "qName": "Согласно гипотезе о двойственной природе зрения имеются",
            "rA": [
                "дневное и ночное зрение"
            ],
            "wA": [
                "центральное и периферическое зрение",
                "в каждом глазу по отдельному изображению",
                "двоение объектов"
            ]
        },
        {
            "qID": 555,
            "qName": "Острота зрения измеряется",
            "rA": [
                "в относительных величинах"
            ],
            "wA": [
                "в диоптриях",
                "в градусах",
                "в метрах"
            ]
        },
        {
            "qID": 556,
            "qName": "Битемпоральная гемианопсия развивается при локализации",
            "rA": [
                "патологического очага в области средней части зрительного перекреста"
            ],
            "wA": [
                "патологического очага в шпорной борозды",
                "патологического очага в затылочной доле",
                "патологического очага в продолговатом мозге"
            ]
        },
        {
            "qID": 557,
            "qName": "К ахроматическим цветам относятся все, кроме",
            "rA": [
                "красного"
            ],
            "wA": [
                "серого",
                "белого",
                "черного"
            ]
        },
        {
            "qID": 558,
            "qName": "Очаговый дефект поля зрения называется",
            "rA": [
                "скотомой"
            ],
            "wA": [
                "гемианопсией",
                "трихромазией",
                "гетерохронией"
            ]
        },
        {
            "qID": 559,
            "qName": "Изменение световой чувствительности глаза при изменении освещенности называется",
            "rA": [
                "адаптацией"
            ],
            "wA": [
                "скотомой",
                "хемозом",
                "остротой зрения"
            ]
        },
        {
            "qID": 560,
            "qName": "Монокулярное зрение дает представление о всех свойствах предмета, кроме",
            "rA": [
                "глубины"
            ],
            "wA": [
                "высоты предмета",
                "ширины предмета",
                "формы предмета"
            ]
        },
        {
            "qID": 561,
            "qName": "Оптической осью глаза является ...",
            "rA": [
                "прямая линия, проходящая через центры кривизны всех преломляющих поверхностей"
            ],
            "wA": [
                "расстояние от главной плоскости до главного фокуса",
                "положение ближайшей точки ясного зрения",
                "прямая, проходящая через цент линзы"
            ]
        },
        {
            "qID": 562,
            "qName": "Если главный Фокус совпадает с сетчаткой, такая рефракция называется ...",
            "rA": [
                "эмметролией"
            ],
            "wA": [
                "гиперметропией",
                "миопией",
                "пресбиопией"
            ]
        },
        {
            "qID": 563,
            "qName": "Прямой астигматизм",
            "rA": [
                "преломление в вертикальном меридиане сильнее"
            ],
            "wA": [
                "преломление в горизонтальном меридиане сильнее",
                "преломление в обоих меридианах одинаковое",
                "преломление в главных меридианах отсутствует"
            ]
        },
        {
            "qID": 564,
            "qName": "В (+) линзах...",
            "rA": [
                "проходящие через них параллельные лучи, превращаются в сходящиеся и собираются в главном фокусе линзы"
            ],
            "wA": [
                "проходящие через них параллельные лучи, превращаются в расходящиеся",
                "проходящие через них параллельные лучи не меняют направления",
                "проходящие через них параллельные лучи становятся непараллельны"
            ]
        },
        {
            "qID": 565,
            "qName": "Часть гиперметропии, обнаруживаемая при медикаментозном параличе аккомодации называется",
            "rA": [
                "скрытой"
            ],
            "wA": [
                "явной",
                "ложной",
                "истиной"
            ]
        },
        {
            "qID": 566,
            "qName": "При аккомодации в глазу происходит следующее изменение:",
            "rA": [
                "изменение формы хрусталика"
            ],
            "wA": [
                "увеличение размера хрусталика",
                "изменение цвета хрусталика",
                "миоз"
            ]
        },
        {
            "qID": 567,
            "qName": "Косоглазие можно отличить от гетерофории",
            "rA": [
                "по наличию или отсутствию бинокулярного зрения"
            ],
            "wA": [
                "по изменению зрачка",
                "по наличию или отсутствию полного объема движений глаза",
                "по изменению внутриглазного давления"
            ]
        },
        {
            "qID": 568,
            "qName": "Неаккомодационное косоглазие развивается",
            "rA": [
                "с рождения"
            ],
            "wA": [
                "в возрасте 2 3 лет",
                "в школьном возрасте",
                "во взрослом состоянии"
            ]
        },
        {
            "qID": 569,
            "qName": "Система мероприятий, направленных на восстановление и укрепление бинокулярного зрения называется",
            "rA": [
                "ортоптическим лечением"
            ],
            "wA": [
                "плеоптическим лечением",
                "хирургическим лечением",
                "консервативным лечением"
            ]
        },
        {
            "qID": 570,
            "qName": "Энофтальм появляется при",
            "rA": [
                "при атрофии глазничной клетчатки"
            ],
            "wA": [
                "катаракте",
                "глаукоме",
                "при атрофии зрительного нерва"
            ]
        },
        {
            "qID": 571,
            "qName": "Основным признаком опухоли глазницы является",
            "rA": [
                "прогрессирующий экзофтальм"
            ],
            "wA": [
                "смещение глазного яблока",
                "ограничение его подвижности",
                "изменение цвета кожи"
            ]
        },
        {
            "qID": 572,
            "qName": "При отеках век невоспалительного характера можно отметить",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "двустороннее поражение",
                "более сильное проявление по утрам",
                "сочетание с отеками ног, асцитом"
            ]
        },
        {
            "qID": 573,
            "qName": "При асбцессе век при наличии флюктуации назначают",
            "rA": [
                "вскрытие"
            ],
            "wA": [
                "инстилляции 30% раствора сульфацила натрия",
                "сухое тепло, УВЧ",
                "витаминотерапию"
            ]
        },
        {
            "qID": 574,
            "qName": "Эпикантус   это ...",
            "rA": [
                "полулунная кожная складка у внутренних углов глазной щели, переходящая с верхнего века на нижнее"
            ],
            "wA": [
                "свисающая над наружным углом глазной щели складка истонченной кожи верхнего века",
                "укорочение и сужение глазной щели  опущение верхнего века"
            ]
        },
        {
            "qID": 575,
            "qName": "К дистрофическим изменениям конъюнктивы относятся",
            "rA": [
                "птеригиум"
            ],
            "wA": [
                "меланома",
                "хемоз",
                "гемангиома"
            ]
        },
        {
            "qID": 576,
            "qName": "Радикальное излечение дакриоцистита достигается",
            "rA": [
                "операцией дакриоцисториностомией"
            ],
            "wA": [
                "назначением антибиотиков",
                "промыванием слезных путей",
                "назначением массажа век"
            ]
        },
        {
            "qID": 577,
            "qName": "Врожденные аномалии роговицы с изменением величины",
            "rA": [
                "микрокорнеа и макрокорнеа"
            ],
            "wA": [
                "кератоглобус",
                "кератоконус",
                "микросферофакия"
            ]
        },
        {
            "qID": 578,
            "qName": "Кератит начинается с образования",
            "rA": [
                "инфильтрата"
            ],
            "wA": [
                "помутнения",
                "рубеоза",
                "облочка"
            ]
        },
        {
            "qID": 579,
            "qName": "Для туберкулезно аллергического кератита характерно появление",
            "rA": [
                "фликтен"
            ],
            "wA": [
                "задних синехий",
                "рубеоза",
                "помутнения хрусталика"
            ]
        },
        {
            "qID": 580,
            "qName": "Причиной авитаминозных кератитов является",
            "rA": [
                "гиповитаминоз витамина А"
            ],
            "wA": [
                "гиповитаминоз витамина Д",
                "гиповитаминоз витамина Е",
                "гиповитаминоз витамина В"
            ]
        },
        {
            "qID": 581,
            "qName": "По характеру склериты и эписклериты представляют собой",
            "rA": [
                "гранулематозные воспаления"
            ],
            "wA": [
                "нефозы",
                "фибринозно пластические воспаления",
                "экссудативные воспаления"
            ]
        },
        {
            "qID": 582,
            "qName": "При бомбированной радужке",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "передняя камера в месте выпячивания радужки бывает мелкой",
                "передняя камера в центре глубокая в связи с припаянностью к хрусталику",
                "нарушается отток внутриглазной жидкости из задней камеры в переднюю"
            ]
        },
        {
            "qID": 583,
            "qName": "Фотопсии   это ...",
            "rA": [
                "вспышки и мерцания перед глазами"
            ],
            "wA": [
                "искажения предметов",
                "все вышеперечисленное",
                "ничего из вышеперечисленного"
            ]
        },
        {
            "qID": 584,
            "qName": "При офтальмоскопии при отслойке сетчатки можно увидеть",
            "rA": [
                "вуалеподобную пленку"
            ],
            "wA": [
                "свечение зрачка зеленым цветом",
                "очаги желтоватого цвета",
                "очаги кровоизлияния"
            ]
        },
        {
            "qID": 585,
            "qName": "Независимо от этиологии при увеитах назначают",
            "rA": [
                "мидриатики"
            ],
            "wA": [
                "ингибиторы карбоангидразы",
                "бета адреноблокаторы",
                "ангиопротекторы"
            ]
        },
        {
            "qID": 586,
            "qName": "При тяжелом течении неврит зрительного нерва заканчивается",
            "rA": [
                "вторичной атрофией зрительного нерва"
            ],
            "wA": [
                "глаукомой",
                "отслойкой сетчатки",
                "помутнением хрусталика"
            ]
        },
        {
            "qID": 587,
            "qName": "Экстренная помощь в условиях стационара при неврите зрительного нерва должна включать",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "общую противовоспалительную терапию",
                "десенсибилизирующую терапию",
                "дегидратационную терапию"
            ]
        },
        {
            "qID": 588,
            "qName": "При отравлении метиловым спиртом может развиться",
            "rA": [
                "ретробульбарный неврит"
            ],
            "wA": [
                "глаукома",
                "отслойка сетчатки",
                "дакриоцистит"
            ]
        },
        {
            "qID": 589,
            "qName": "Застойный диск зрительного нерва необходимо дифференцировать",
            "rA": [
                "с невритом зрительного нерва"
            ],
            "wA": [
                "с глаукомой",
                "с отслойкой сетчатки",
                "атрофией зрительного нерва"
            ]
        },
        {
            "qID": 590,
            "qName": "При симптоме Грефе наблюдается",
            "rA": [
                "отставание верхнего века при взгляде вниз, когда между верхнего века и роговицей видна полоска склеры"
            ],
            "wA": [
                "редкое мигание",
                "пигментация кожи верхнего века",
                "разный диаметр зрачков"
            ]
        },
        {
            "qID": 591,
            "qName": "При болезни Микулича отмечается",
            "rA": [
                "медленно прогрессирующее симметричное припухание слюнных и слезных желез"
            ],
            "wA": [
                "появление диплопии",
                "образование гониосинехий",
                "интенсивная пигментация радужки"
            ]
        },
        {
            "qID": 592,
            "qName": "Неблагоприятным прогностическим признаком для жизни при заболеваниях почек является",
            "rA": [
                "появление нейроретинопатии"
            ],
            "wA": [
                "рефлекторная неподвижность зрачков",
                "отслойка сетчатки",
                "появление кровоизлияний"
            ]
        },
        {
            "qID": 593,
            "qName": "При врожденной катаракте может развиться",
            "rA": [
                "обскурационная амблиопия"
            ],
            "wA": [
                "дисбинокулярная амблиопия",
                "рефракционная амблиопия",
                "истерическая амблиопия"
            ]
        },
        {
            "qID": 594,
            "qName": "Вторичная катаракта развивается",
            "rA": [
                "после экстракапсулярной экстракции катаракты"
            ],
            "wA": [
                "после интракапсулярной экстракции катаракты",
                "после вывиха хрусталика",
                "после острого приступа глаукомы"
            ]
        },
        {
            "qID": 595,
            "qName": "К симптоматическим гипертензиям относят все, кроме",
            "rA": [
                "острый приступ глаукомы"
            ],
            "wA": [
                "глаукомоциклитические кризы",
                "увеиты с гипертензией",
                "случаи повышения офтальмотонуса, которые вызваны преходящим нарушением регуляции внутриглазного давления в результате интоксикаций, эндокринных расстройств"
            ]
        },
        {
            "qID": 596,
            "qName": "Глаукоматозная атрофия зрительного нерва проявляется",
            "rA": [
                "и тем, и другим"
            ],
            "wA": [
                "побледнением диска",
                "образованием углубления",
                "экскавации",
                "четкими границами"
            ]
        },
        {
            "qID": 597,
            "qName": "К провоцирующим Факторам возникновения острого приступа глаукомы относятся все, кроме",
            "rA": [
                "повышения артериального давления"
            ],
            "wA": [
                "нервного напряжения",
                "переутомления",
                "расширения зрачка"
            ]
        },
        {
            "qID": 598,
            "qName": "Гониотомией называется",
            "rA": [
                "операция несквозного рассечения трабекулы вместе с патологической эмбриональной тканью на ее внутренней поверхности"
            ],
            "wA": [
                "операция по созданию дополнительного оттока водянистой влаги из передней камеры в супрахориоидальное пространство",
                "операция по удалению хрусталика",
                "операция создания соустья между слезным мешком и носовым ходом"
            ]
        },
        {
            "qID": 599,
            "qName": "Ультразвуковой метод позволяет",
            "rA": [
                "и то, и другое"
            ],
            "wA": [
                "определить размеры глаза",
                "уточнить расположение инородного тела",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 600,
            "qName": "Для эндофтальмита характерны следующие симптомы",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "снижение остроты зрения до светоощущения",
                "появление хемоза конъюнктивы",
                "абсцесс стекловидного тела"
            ]
        },
        {
            "qID": 601,
            "qName": "Нарушение целости зрительного нерва сопровождается",
            "rA": [
                "полной потерей зрения"
            ],
            "wA": [
                "перикорнеальной инъекцией сосудов",
                "повышением внутриглазного давления",
                "выраженным болевым синдромом"
            ]
        },
        {
            "qID": 602,
            "qName": "Оказание первой помощи при химических ожогах включает в себя все, кроме ...",
            "rA": [
                "инстилляций мидриатиков"
            ],
            "wA": [
                "обильного промывания конъюнктивальной полости водой в течение 5 30 минут",
                "инстилляций дезинфицирующих растворов",
                "инстилляций антидота"
            ]
        },
        {
            "qID": 603,
            "qName": "Разрыв радужки у ее основания называется",
            "rA": [
                "иридодиализ"
            ],
            "wA": [
                "хемоз",
                "рубеоз",
                "мидриаз"
            ]
        },
        {
            "qID": 604,
            "qName": "Первая ветвь тройничного нерва проходит",
            "rA": [
                "через верхнюю глазничную щель"
            ],
            "wA": [
                "через нижнюю глазничную щель",
                "через зрительный канал",
                "по краю орбиты"
            ]
        },
        {
            "qID": 605,
            "qName": "Глаз новорожденного имеет массу",
            "rA": [
                "3 4 г"
            ],
            "wA": [
                "1 г",
                "5 6 г",
                "7 8 г"
            ]
        },
        {
            "qID": 606,
            "qName": "Вход в орбиту закрывает",
            "rA": [
                "глазничная перегородка"
            ],
            "wA": [
                "слезный мешок",
                "средняя черепная ямка",
                "височная ямка"
            ]
        },
        {
            "qID": 607,
            "qName": "Отводящий нерв иннервирует",
            "rA": [
                "наружную прямую мышцу"
            ],
            "wA": [
                "внутренннюю прямую мышцу",
                "нижнюю косую мышцу",
                "нижнюю прямую мышцу"
            ]
        },
        {
            "qID": 608,
            "qName": "Функцию аддукции выполняют все мышцы, кроме",
            "rA": [
                "наружная прямая мышца"
            ],
            "wA": [
                "верхняя прямая мышца",
                "нижняя прямая мышца",
                "внутренняя прямая мышца"
            ]
        },
        {
            "qID": 609,
            "qName": "При параличе симпатического нерва наблюдается",
            "rA": [
                "небольшой птоз"
            ],
            "wA": [
                "полный птоз",
                "диплопия",
                "амблиопия"
            ]
        },
        {
            "qID": 610,
            "qName": "Слезные органы состоят",
            "rA": [
                "и того, и другого"
            ],
            "wA": [
                "из слезосекреторного аппарата",
                "из слезопроводящего аппарата",
                "ни того, ни другого"
            ]
        },
        {
            "qID": 611,
            "qName": "Слезные точки находятся",
            "rA": [
                "на вершине слезных сосочков"
            ],
            "wA": [
                "в латеральной части верхнего века",
                "на склере",
                "в области ресничного тела"
            ]
        },
        {
            "qID": 612,
            "qName": "Лимб   это ...",
            "rA": [
                "зона перехода роговицы в склеру"
            ],
            "wA": [
                "зона перехода ресничного тела в собственно сосудистую оболочку",
                "зона перехода ресничного тела в сетчатку полупрозрачная",
                "зона прикрепления глазодвигательных мышц"
            ]
        },
        {
            "qID": 613,
            "qName": "Хрусталик содержит",
            "rA": [
                "волокна"
            ],
            "wA": [
                "мезодермальные клетки",
                "ветви передней ресничной артерии",
                "сосуды конъюнктивы"
            ]
        },
        {
            "qID": 614,
            "qName": "Передней стенкой задней камеры глазного яблока является",
            "rA": [
                "радужка"
            ],
            "wA": [
                "хрусталик",
                "роговица",
                "сетчатка"
            ]
        },
        {
            "qID": 615,
            "qName": "Задняя граница ресничного тела соответствует на склере",
            "rA": [
                "местам прикрепления прямых мышц глаза"
            ],
            "wA": [
                "лимбу",
                "решетчатой пластинке",
                "экватору"
            ]
        },
        {
            "qID": 616,
            "qName": "К хориоидее изнутри прилегает",
            "rA": [
                "сетчатка"
            ],
            "wA": [
                "склера",
                "радужка",
                "хрусталик"
            ]
        },
        {
            "qID": 617,
            "qName": "Ядра палочко  и колбочконесущих зрительных клеток составляют",
            "rA": [
                "наружный зернистый слой"
            ],
            "wA": [
                "внутренний зернистый слой",
                "внутренний сетчатый слой",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 618,
            "qName": "В области прохождения зрительного нерва отверстие затянуто",
            "rA": [
                "решетчатой пластинкой склеры"
            ],
            "wA": [
                "лимбом",
                "дренажной системой",
                "трабекулярной сетью"
            ]
        },
        {
            "qID": 619,
            "qName": "Область диска зрительного нерва",
            "rA": [
                "не содержит фоторецепторов"
            ],
            "wA": [
                "содержит колбочки",
                "содержит палочки",
                "все перечисленное"
            ]
        },
        {
            "qID": 620,
            "qName": "Для осмотра соединительной оболочки глаза необходимо",
            "rA": [
                "вывернуть веки"
            ],
            "wA": [
                "закапать 0,5% раствор дикаина",
                "надавить на слезные точки",
                "закапать 3% раствор колларгола"
            ]
        },
        {
            "qID": 621,
            "qName": "При исследовании проходящим светом источник света располагается",
            "rA": [
                "слева и сзади от больного"
            ],
            "wA": [
                "слева и спереди от больного",
                "справа и сзади от больного"
            ]
        },
        {
            "qID": 622,
            "qName": "Флюоресцентная ангиография позволяет",
            "rA": [
                "объективно регистрировать контрастированные флюоресцеином сосуды глазного дна"
            ],
            "wA": [
                "определить давление в центральной артерии сетчатки",
                "измерить внутриглазные дистанции",
                "определить внутриглазное давление"
            ]
        },
        {
            "qID": 623,
            "qName": "За нормальную остроту зрения равную 1,0",
            "rA": [
                "принята величина обратная углу зрения в 1 минуту"
            ],
            "wA": [
                "принята способность различения 300 оттенков",
                "принята величина обратная фокусному расстоянию в 1 метр",
                "называется пространство, которое одновременно воспринимается неподвижным глазом"
            ]
        },
        {
            "qID": 624,
            "qName": "Исследование поля зрения заключается",
            "rA": [
                "в определении его границ и выявлении дефектов зрительной функции внутри границ"
            ],
            "wA": [
                "в определении минимального угла зрения",
                "в определении способности к адаптации",
                "в определении бинокулярного зрения"
            ]
        },
        {
            "qID": 625,
            "qName": "Проекция в пространстве диска зрительного нерва называется ...",
            "rA": [
                "слепое пятно"
            ],
            "wA": [
                "гемианопсия",
                "макула",
                "экватор"
            ]
        },
        {
            "qID": 626,
            "qName": "Восприятие предметов, окрашенных в зеленый цвет называется ...",
            "rA": [
                "хлоропсия"
            ],
            "wA": [
                "эритропсия",
                "ксантопсия",
                "гемианопсия"
            ]
        },
        {
            "qID": 627,
            "qName": "При гиповитаминозе витамина А развивается",
            "rA": [
                "функциональная гемералопия"
            ],
            "wA": [
                "биназальная гемианопсия",
                "симптоматическая гемералопия",
                "битемпоральная гемианопсия"
            ]
        },
        {
            "qID": 628,
            "qName": "Одновременное зрение характеризуется тем, что",
            "rA": [
                "импульсы от одного и другого глаза воспринимаются одновременно, но нет слияния в единый зрительный образ"
            ],
            "wA": [
                "предмет видится единично, как бы одним глазом",
                "изображение передается в различные участки коры большого мозга и не происходит слияния в единый зрительный образ и возникает двоение",
                "одновременно можно видеть далеко и близко расположенные предметы"
            ]
        },
        {
            "qID": 629,
            "qName": "Для миопии характерно",
            "rA": [
                "снижение остроты зрения вдаль"
            ],
            "wA": [
                "снижение остроты зрения на близком расстоянии",
                "постоянное напряжение аккомодационного аппарата",
                "отсутствие бинокулярного зрения"
            ]
        },
        {
            "qID": 630,
            "qName": "Анизейкония   это ....",
            "rA": [
                "неодинаковая величина изображения предметов на сетчатке обоих глаз"
            ],
            "wA": [
                "неодинаковая рефракция обоих глаз",
                "сочетание двух видов аметропии в одном глазу",
                "снижение остроты зрения без органических изменений макулы"
            ]
        },
        {
            "qID": 631,
            "qName": "При оформлении рецепта на очки необходимо указать",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "вид линзы",
                "оптическую силу линзы в диоптриях",
                "расстояние между центрами зрачков в миллиметрах"
            ]
        },
        {
            "qID": 632,
            "qName": "Пресбиопия клинически проявляется",
            "rA": [
                "отдалением ближайшей точки ясного зрения"
            ],
            "wA": [
                "снижением зрения вдаль",
                "отсутствием конвергенции",
                "приближением ближайшей точки ясного зрения"
            ]
        },
        {
            "qID": 633,
            "qName": "Осложнения миопии, требующие хирургического лечения",
            "rA": [
                "отслойка сетчатки"
            ],
            "wA": [
                "задняя стафилома",
                "миопический конус",
                "грубый пигментный очаг в области макулы"
            ]
        },
        {
            "qID": 634,
            "qName": "Блефарохалазис   это ...",
            "rA": [
                "свисающая над наружным углом глазной щели складка истонченной кожи верхнего века"
            ],
            "wA": [
                "хроническое пролиферативное воспаление хряща века",
                "укорочение и сужение глазной щели",
                "опущение верхнего века"
            ]
        },
        {
            "qID": 635,
            "qName": "Факторами, способствующими возникновению и развитию блефарита являются все, кроме",
            "rA": [
                "передача по типу неправильного доминантного наследования"
            ],
            "wA": [
                "запыленность и задымленность производственных помещений",
                "длительное пребывание в атмосфере раздражающих химических соединений",
                "некорригированный астигматизм"
            ]
        },
        {
            "qID": 636,
            "qName": "Клинические симптомы гонобленнореи новорожденных все, кроме:",
            "rA": [
                "изменение цвета радужки"
            ],
            "wA": [
                "выраженный синюшно багровый отек, веки закрыты",
                "кровянистое отделяемое цвета «мясных помоев»",
                "поражения роговицы"
            ]
        },
        {
            "qID": 637,
            "qName": "Формы аденовирусной Фарингоконъюнктивальной лихорадки все, кроме",
            "rA": [
                "геморрагическая"
            ],
            "wA": [
                "катаральная",
                "пленчатая",
                "фолликулярная"
            ]
        },
        {
            "qID": 638,
            "qName": "При птеригиуме рекомендуется",
            "rA": [
                "оперативное удаление"
            ],
            "wA": [
                "назначение антибиотиков",
                "назначение ферментов",
                "назначение антикоагулянтов"
            ]
        },
        {
            "qID": 639,
            "qName": "Специфическим признаком трахомы является",
            "rA": [
                "паннус"
            ],
            "wA": [
                "мидриаз",
                "рубеоз",
                "хемоз"
            ]
        },
        {
            "qID": 640,
            "qName": "Первичный очаг инфекции при паратрахоме",
            "rA": [
                "мочеполовые пути"
            ],
            "wA": [
                "сердечно сосудистая система",
                "центральная нервная система",
                "желудочно кишечный тракт"
            ]
        },
        {
            "qID": 641,
            "qName": "Для лекарственного конъюнктивита характерно все, кроме",
            "rA": [
                "наличие пленок в нижнем своде"
            ],
            "wA": [
                "гиперемия и отек конъюнктивы",
                "сосочковая гипертрофия конъюнктивы",
                "на коже век папуллезно везикулезные высыпания"
            ]
        },
        {
            "qID": 642,
            "qName": "Лечение птеригиума",
            "rA": [
                "при прогрессирующем врастании в роговицу показано оперативное лечение"
            ],
            "wA": [
                "консервативное лечение в виде противоотечной терапии",
                "ортоптическое лечение",
                "склеропластика"
            ]
        },
        {
            "qID": 643,
            "qName": "Кардинальный признак воспаления слезного мешка",
            "rA": [
                "выделение слизи или гноя из слезных точек при надавливании на область слезных точек"
            ],
            "wA": [
                "сращение век",
                "выворот слезных точек",
                "сужение глазной щели"
            ]
        },
        {
            "qID": 644,
            "qName": "Флегмона орбиты чаще всего начинается",
            "rA": [
                "как тромбофлебит глазничных вен"
            ],
            "wA": [
                "со склерита",
                "как конъюнктивит",
                "с блефарита"
            ]
        },
        {
            "qID": 645,
            "qName": "Основные признаки опухоли орбиты все, кроме",
            "rA": [
                "опущение верхнего века"
            ],
            "wA": [
                "прогрессирующий экзофтальм",
                "нарушение подвижности глазного яблока",
                "уменьшение или полное отсутствие репозиции глаза"
            ]
        },
        {
            "qID": 646,
            "qName": "Прозрачность роговицы нарушается вследствие",
            "rA": [
                "появления помутнений в различных слоях"
            ],
            "wA": [
                "появления рубеоза",
                "блефароспазма",
                "образования задних синехий"
            ]
        },
        {
            "qID": 647,
            "qName": "Симптомы, характерные для ползучей язвы роговицы все, кроме",
            "rA": [
                "наличие складки конъюнктивы"
            ],
            "wA": [
                "специфический вид язвы и способ ее распространения",
                "наличие иридоциклита",
                "наличие гипопиона"
            ]
        },
        {
            "qID": 648,
            "qName": "Склерозирующий кератит возникает",
            "rA": [
                "при наличии склерита"
            ],
            "wA": [
                "при наличии блефарита",
                "при наличии гриппа"
            ]
        },
        {
            "qID": 649,
            "qName": "Паренхиматозному сифилитическому кератиту свойственны",
            "rA": [
                "цикличность"
            ],
            "wA": [
                "снижение внутриглазного давления",
                "односторонность поражения",
                "неблагоприятный исход"
            ]
        },
        {
            "qID": 650,
            "qName": "Лечение кератитов должно включать все, кроме",
            "rA": [
                "снижения внутриглазного давления"
            ],
            "wA": [
                "борьбы с инфекцией",
                "воздействия на роговичный синдром",
                "стимуляции эпителизации дефекта"
            ]
        },
        {
            "qID": 651,
            "qName": "В исходе метагерпетического кератита развивается",
            "rA": [
                "обширное помутнение роговицы"
            ],
            "wA": [
                "болезнь Стилла",
                "отложение пигмента в области лимба",
                "задние синехии"
            ]
        },
        {
            "qID": 652,
            "qName": "При остром иридоциклите характерны",
            "rA": [
                "локальные ломящие боли в глазу"
            ],
            "wA": [
                "гнойное отделяемое из слезной точки",
                "иррадиирующие боли",
                "боли в одной половине головы"
            ]
        },
        {
            "qID": 653,
            "qName": "Сращение и заращение зрачка ведет",
            "rA": [
                "к нарушению связи между задней и передней камерами"
            ],
            "wA": [
                "к появлению помутнений",
                "к развитию панувеита",
                "к возникновению отслойки сетчатки"
            ]
        },
        {
            "qID": 654,
            "qName": "Воспаление хориоидеи может быть",
            "rA": [
                "очаговым и диссеминированным"
            ],
            "wA": [
                "древовидным и дисковидным",
                "поверхностным и глубоким",
                "все перечисленное"
            ]
        },
        {
            "qID": 655,
            "qName": "Старые хориоидальные очаги имеют",
            "rA": [
                "четкие границы и пигментацию"
            ],
            "wA": [
                "нечеткие границы и очаги кровоизлияния",
                "нечеткие границы и экссудацию",
                "экссудацию и кровоизлияния"
            ]
        },
        {
            "qID": 656,
            "qName": "Характерной особенностью болезни Илза являются",
            "rA": [
                "частые повторные кровоизлияния"
            ],
            "wA": [
                "преципитаты на эндотелии роговицы",
                "фолликулы на конъюнктиве век",
                "отложение пигмента в области лимба"
            ]
        },
        {
            "qID": 657,
            "qName": "Аниридия   это ...",
            "rA": [
                "отсутсвие радужки"
            ],
            "wA": [
                "образование нескольких зрачков отсутствие радужки",
                "отсутствие хрусталика",
                "просвечивание склеры"
            ]
        },
        {
            "qID": 658,
            "qName": "У детей наиболее часто встречается",
            "rA": [
                "центральная дегенерация сетчатки Штаргардта"
            ],
            "wA": [
                "друзы макулярной области",
                "сенильная макулодистрофия",
                "все перечисленные"
            ]
        },
        {
            "qID": 659,
            "qName": "При сахарном диабете в стекловидном теле отмечается",
            "rA": [
                "гемофтальм"
            ],
            "wA": [
                "наличие хлопьевидных помутнений в виде тонких волокон",
                "изменений нет",
                "разжижение"
            ]
        },
        {
            "qID": 660,
            "qName": "При лечении вторичной катаракты применяются",
            "rA": [
                "лазеры"
            ],
            "wA": [
                "ультразвук",
                "ультрафиолет",
                "инфракрасное излучение"
            ]
        },
        {
            "qID": 661,
            "qName": "Интракапсулярным способом хрусталик извлекают",
            "rA": [
                "хрусталик с капсулой"
            ],
            "wA": [
                "ядро хрусталика и хрусталиковые массы без капсулы",
                "после предварительной факофрагментации",
                "хрусталик выдавливают в стекловидное тело"
            ]
        },
        {
            "qID": 662,
            "qName": "Главным звеном в патогенезе закрытоугольной глаукомы является",
            "rA": [
                "блокада угла передней камеры корнем радужки"
            ],
            "wA": [
                "образование гониосинехий",
                "повреждение трабекулы",
                "повышение давления в системе передних цилиарных или вортикозных вен"
            ]
        },
        {
            "qID": 663,
            "qName": "Для врожденной глаукомы характерно",
            "rA": [
                "увеличение размеров глазного яблока"
            ],
            "wA": [
                "увеличение размеров хрусталика",
                "отслойка сетчатки",
                "диплопия"
            ]
        },
        {
            "qID": 664,
            "qName": "Симптом «очков» может указывать",
            "rA": [
                "на перелом основания черепа"
            ],
            "wA": [
                "на перелом нижней стенки орбиты",
                "на перелом у решетчатой пазухи",
                "на разрыв конъюнктивы"
            ]
        },
        {
            "qID": 665,
            "qName": "При контузиях глаза может наступить все, кроме",
            "rA": [
                "гипертрофии фолликул конъюнктивы"
            ],
            "wA": [
                "кровоизлияние",
                "отек сетчатки",
                "нарушение целости сетчатки"
            ]
        },
        {
            "qID": 666,
            "qName": "Особенно опасны отрывы век у внутреннего угла глаза в связи с повреждением",
            "rA": [
                "слезных канальцев"
            ],
            "wA": [
                "слезной железы",
                "мейбомиевых желез",
                "всего перечисленного"
            ]
        },
        {
            "qID": 667,
            "qName": "При установлении локализации инородных тел более надежным является сочетание",
            "rA": [
                "рентгенологического и ультразвукового метода"
            ],
            "wA": [
                "тонографии и экзоофтальмометрии",
                "периметрии и тонометрии",
                "всего перечисленного"
            ]
        },
        {
            "qID": 668,
            "qName": "При симпатическом воспалении возможно развитие",
            "rA": [
                "и того, и другого"
            ],
            "wA": [
                "бомбажа радужки",
                "вторичной глаукомы",
                "ни того, ни другого"
            ]
        },
        {
            "qID": 669,
            "qName": "Колликвационный некроз развивается при попадании в глаз",
            "rA": [
                "щелочей"
            ],
            "wA": [
                "раскаленного металла",
                "кипящей жидкости",
                "кислот"
            ]
        },
        {
            "qID": 670,
            "qName": "Патогенное действие сильного инфракрасного облучения заключается",
            "rA": [
                "в образовании катаракты"
            ],
            "wA": [
                "в развитии атрофии зрительного нерва",
                "в дистрофии радужки",
                "в развитии лентовидной дистрофии роговицы"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
