var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Через верхне глазничную щель проходят следующие образования",
            "rA": [
                "глазодвигательные нервы"
            ],
            "wA": [
                "зрительный нерв",
                "верхне глазничная артерия",
                "глазная артерия"
            ]
        },
        {
            "qID": 2,
            "qName": "Веки являются",
            "rA": [
                "защитным аппаратом органа зрения"
            ],
            "wA": [
                "частью глазного яблока",
                "слезным аппаратом органа зрения",
                "частью фиброзной оболочки глаза"
            ]
        },
        {
            "qID": 3,
            "qName": "К слезопродуцирующим органам относятся",
            "rA": [
                "слезная железа и добавочные слезные железки"
            ],
            "wA": [
                "слезные точки",
                "слезные канальцы",
                "слезный мешок"
            ]
        },
        {
            "qID": 4,
            "qName": "Роговая оболочка состоит",
            "rA": [
                "из пяти слоев"
            ],
            "wA": [
                "из двух слоев",
                "из трех слоев",
                "из четырех слоев"
            ]
        },
        {
            "qID": 5,
            "qName": "Склера предназначена",
            "rA": [
                "для защиты внутренних образований глаза"
            ],
            "wA": [
                "для трофики глаза",
                "для преломления света",
                "для аккомодации"
            ]
        },
        {
            "qID": 6,
            "qName": "Сосудистая оболочка глаза состоит из всех перечисленных отделов, кроме",
            "rA": [
                "сетчатки"
            ],
            "wA": [
                "хориоидеи",
                "ресничного тела",
                "радужки"
            ]
        },
        {
            "qID": 7,
            "qName": "Внутриглазную жидкость вырабатывает",
            "rA": [
                "ресничное тело"
            ],
            "wA": [
                "радужка",
                "хориоидея",
                "хрусталик"
            ]
        },
        {
            "qID": 8,
            "qName": "Сетчатка выполняет функцию",
            "rA": [
                "восприятия света"
            ],
            "wA": [
                "преломления света",
                "трофическую",
                "питательную"
            ]
        },
        {
            "qID": 9,
            "qName": "Хориоидея питает",
            "rA": [
                "сетчатку"
            ],
            "wA": [
                "ресничное тело",
                "хрусталик",
                "радужку"
            ]
        },
        {
            "qID": 10,
            "qName": "Влага передней камеры служит для",
            "rA": [
                "всего вышеперечисленного"
            ],
            "wA": [
                "питания роговицы",
                "преломления света",
                "выведения отработанных продуктов обмена"
            ]
        },
        {
            "qID": 11,
            "qName": "Цветоощущение исследуется",
            "rA": [
                "таблицами Рабкина"
            ],
            "wA": [
                "таблицами Сивцева Головина",
                "на четырехточечном цветотесте",
                "на периметре"
            ]
        },
        {
            "qID": 12,
            "qName": "Колбочковый аппарат глаза осуществляет в первую очередь функцию",
            "rA": [
                "центрального зрения"
            ],
            "wA": [
                "светоощущения",
                "адаптации к свету",
                "периферического зрения"
            ]
        },
        {
            "qID": 13,
            "qName": "Гомонимная и гетеронимная гемианопсия наблюдается у больных",
            "rA": [
                "патологических изменениях зрительных путей и ЦНС"
            ],
            "wA": [
                "при дегенеративных изменениях сетчатки",
                "помутнениях роговицы",
                "помутнениях хрусталика"
            ]
        },
        {
            "qID": 14,
            "qName": "Световая адаптация глаз   это",
            "rA": [
                "приспособление глаза к различным уровням яркости света"
            ],
            "wA": [
                "видение предметов на различном расстоянии",
                "приспособление к яркому свету",
                "аккомодация"
            ]
        },
        {
            "qID": 15,
            "qName": "Авитаминозом, который клинически проявляется такими глазными проявлениями, как ксероз, кератомаляция и гемералопия.является дефицит",
            "rA": [
                "витамина А"
            ],
            "wA": [
                "витамина группы В",
                "витамина С",
                "витамина Д"
            ]
        },
        {
            "qID": 16,
            "qName": "Для формирования бинокулярного зрения необходимо",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "параллельное положение осей обоих глаз",
                "наличие двух глаз",
                "острота обоих глаз не менее 0,4"
            ]
        },
        {
            "qID": 17,
            "qName": "Пределами изменения физической рефракции глаза в норме являются!",
            "rA": [
                "от 52 до 71 Дптр"
            ],
            "wA": [
                "от 0 до 20 Дптр",
                "от 21 до 51 Дптр",
                "от 72 до 91 Дптр"
            ]
        },
        {
            "qID": 18,
            "qName": "Клиническая рефракция   это",
            "rA": [
                "соотношение между физической рефракцией и длиной оси глаза"
            ],
            "wA": [
                "преломляющая сила оптической системы, выраженная в диоптриях",
                "преломляющая сила хрусталика",
                "главные плоскости оптической системы"
            ]
        },
        {
            "qID": 19,
            "qName": "Дальнейшая точка ясного видения   это",
            "rA": [
                "точка, к которой установлен глаз в состоянии покоя аккомодации"
            ],
            "wA": [
                "точка, расположенная в 1 метре от глаза",
                "точка, расположенная в области передней главной плоскости",
                "точка ясного видения при максимальном напряжении аккомодации"
            ]
        },
        {
            "qID": 20,
            "qName": "Преломляющей силой линзы называется",
            "rA": [
                "величина, обратная фокусному расстоянию линзы"
            ],
            "wA": [
                "радиус кривизны передней поверхности линзы",
                "радиус кривизны задней поверхности линзы",
                "фокусное расстояние линзы"
            ]
        },
        {
            "qID": 21,
            "qName": "Отрицательная сферическая линза",
            "rA": [
                "уменьшает изображение и корригирует миопию"
            ],
            "wA": [
                "увеличивает изображение и корригирует гиперметропию",
                "увеличивает изображение и корригирует миопию",
                "уменьшает изображение и корригирует гиперметропию"
            ]
        },
        {
            "qID": 22,
            "qName": "Рефрактометр служит",
            "rA": [
                "для объективного определения рефракции глаза"
            ],
            "wA": [
                "для определения полей зрения",
                "для определения бинокулярного зрения",
                "для определения светоощущения"
            ]
        },
        {
            "qID": 23,
            "qName": "Пресбиопия развивается",
            "rA": [
                "с 40 лет"
            ],
            "wA": [
                "к 10 годам",
                "к 20 годам",
                "к 30 годам"
            ]
        },
        {
            "qID": 24,
            "qName": "Оптическую коррекцию при гиперметропии назначают",
            "rA": [
                "при постоянном или периодическом сходящемся косоглазии"
            ],
            "wA": [
                "при наличие катаракты",
                "при частых капризах ребенка",
                "перед хирургическом лечении"
            ]
        },
        {
            "qID": 25,
            "qName": "Для чтения эмметропу в возрасте 60 лет требуются очки",
            "rA": [
                "+3,0 диоптрии"
            ],
            "wA": [
                "+1,0 диоптрия",
                "+2,0 диоптрии",
                "+4,0 диоптрии"
            ]
        },
        {
            "qID": 26,
            "qName": "Противопоказанием к операции кератотомии служит все, кроме",
            "rA": [
                "неправильного астигматизма"
            ],
            "wA": [
                "воспалительных заболеваний глазного яблока",
                "халазиона",
                "прогрессирующей миопии"
            ]
        },
        {
            "qID": 27,
            "qName": "Пресбиопия   это",
            "rA": [
                "возрастная гиперметропия"
            ],
            "wA": [
                "косоглазие",
                "астигматизм",
                "возрастная миопия"
            ]
        },
        {
            "qID": 28,
            "qName": "Основными причинами паралича аккомодации являются",
            "rA": [
                "отравления атропином и при инстиляциях атропином"
            ],
            "wA": [
                "глаукома",
                "неврит",
                "катаракта"
            ]
        },
        {
            "qID": 29,
            "qName": "В связи с аккомодацией различают косоглазие",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "неаккомодационное",
                "частично аккмодационное",
                "аккомодационное"
            ]
        },
        {
            "qID": 30,
            "qName": "Амблиопия чаще встречается",
            "rA": [
                "при монолатеральном косоглазии"
            ],
            "wA": [
                "при альтернирующем косоглазии",
                "при паралитическом косоглазии",
                "при вертикальном косоглазии"
            ]
        },
        {
            "qID": 31,
            "qName": "Прямая окклюзия   это",
            "rA": [
                "выкпючение «лучше видящего глаза»"
            ],
            "wA": [
                "выключение «хуже видящего глаза»",
                "попеременное выключение глаза",
                "выключение глаза на целый день"
            ]
        },
        {
            "qID": 32,
            "qName": "Мейбомиевы железы, расположенные в хрящевой пластинке век выделяют",
            "rA": [
                "сальный секрет"
            ],
            "wA": [
                "слезу",
                "слизистый секрет",
                "внутриглазную жидкость"
            ]
        },
        {
            "qID": 33,
            "qName": "Бактерицидное действие слезы обеспечивает присутствие в ней",
            "rA": [
                "лизоцима"
            ],
            "wA": [
                "лидазы",
                "хемотрипсина",
                "фосфатазы"
            ]
        },
        {
            "qID": 34,
            "qName": "Показания к вскрытию абсцесса",
            "rA": [
                "появление флюктуации"
            ],
            "wA": [
                "выраженная гиперемия век",
                "выраженный отек",
                "болезненность при пальпации"
            ]
        },
        {
            "qID": 35,
            "qName": "Клинические признаки рожистого воспаления век включают",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "выраженную гиперемию и отек век",
                "резкую границу с нормальной тканью",
                "увеличение региональных лимфатических узлов"
            ]
        },
        {
            "qID": 36,
            "qName": "При лагофтальме возможно развитие",
            "rA": [
                "ксероза роговицы"
            ],
            "wA": [
                "эрозии роговицы из за травматизма",
                "экзофтальма",
                "эндофтальма"
            ]
        },
        {
            "qID": 37,
            "qName": "Эпикантус   это ...",
            "rA": [
                "кожная складка, соединяющая веки"
            ],
            "wA": [
                "опущение верхнего века",
                "узкая глазная щель",
                "плотное образование на верхнем веке"
            ]
        },
        {
            "qID": 38,
            "qName": "Наиболее частым осложнением со стороны органа зрения при эпидемическом паротите может быть",
            "rA": [
                "дакриоаденит"
            ],
            "wA": [
                "блефарит",
                "атрофия зрительного нерва",
                "каналикулит"
            ]
        },
        {
            "qID": 39,
            "qName": "К воспалительным заболеваниям век относятся все, кроме",
            "rA": [
                "дакриоцистит"
            ],
            "wA": [
                "блефарит",
                "ячмень",
                "меймобеит"
            ]
        },
        {
            "qID": 40,
            "qName": "При заболевании корью ранними офтальмологическими ее симптомами могут быть",
            "rA": [
                "светобоязнь"
            ],
            "wA": [
                "помутнение роговицы",
                "покраснение глаз",
                "гнойное отделяемое из конъюнктивальной полости"
            ]
        },
        {
            "qID": 41,
            "qName": "Наиболее частые изменения органа зрения при врожденной патологии соединительной ткани у детей",
            "rA": [
                "помутнение роговицы"
            ],
            "wA": [
                "косоглазие",
                "отслойка сетчатки",
                "нистагм"
            ]
        },
        {
            "qID": 42,
            "qName": "Диффузное острое воспаление ретробульбарной клетчатки   это ...",
            "rA": [
                "флегмона"
            ],
            "wA": [
                "остеопериостит",
                "фурункул",
                "ячмень"
            ]
        },
        {
            "qID": 43,
            "qName": "Наиболее характерные признаки злокачественной опухоли орбиты",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "ограничение подвижности глазного яблока",
                "относительно быстрое снижение зрительной функции",
                "экзофтальм, отек век и окружающих глаз тканей"
            ]
        },
        {
            "qID": 44,
            "qName": "Флегмону слезного мешка вскрывают через кожу при наличии",
            "rA": [
                "абсцесса в области слезного мешка"
            ],
            "wA": [
                "плотной опухоли слезного мешка",
                "гиперемии и припухлости в этой области",
                "свища в указанной зоне"
            ]
        },
        {
            "qID": 45,
            "qName": "Лечение весеннего катара включает",
            "rA": [
                "лечение кортикостероидами"
            ],
            "wA": [
                "хирургическое лечение",
                "лечение антибиотиками",
                "лечение противовиручными препаратами"
            ]
        },
        {
            "qID": 46,
            "qName": "Чувствительность роговицы страдает при поражении",
            "rA": [
                "тройничного нерва"
            ],
            "wA": [
                "лицевого нерва",
                "глазодвигательного нерва",
                "зрительного нерва"
            ]
        },
        {
            "qID": 47,
            "qName": "Наиболее информативным методом диагностики офтальмогерпеса является",
            "rA": [
                "полимеразная цепная реакция"
            ],
            "wA": [
                "цитологическая диагностика",
                "метод флюоресцирующих антител",
                "микроскопическая диагностика"
            ]
        },
        {
            "qID": 48,
            "qName": "Сочетание признаков   светобоязнь, слезотечение. блеФароспазм, чувство инородного тела под верхним веком   характерно для ...",
            "rA": [
                "кератита"
            ],
            "wA": [
                "катаракты",
                "отслойки сетчатки",
                "атрофии зрительного нерва"
            ]
        },
        {
            "qID": 49,
            "qName": "Для кератита не характерно",
            "rA": [
                "повышенное внутриглазное давление"
            ],
            "wA": [
                "снижение тактильной чувствительности роговицы",
                "наличие инфильтратов роговицы",
                "перикорнеальная или смешанная инъекция роговицы"
            ]
        },
        {
            "qID": 50,
            "qName": "Эрозия роговицы может сопровождаться",
            "rA": [
                "светобоязнью"
            ],
            "wA": [
                "сужением полей зрения",
                "повышением ВГД",
                "косоглазием"
            ]
        },
        {
            "qID": 51,
            "qName": "В этиологии склеритов и эпискперитов не имеет значения",
            "rA": [
                "гипертоническая болезнь"
            ],
            "wA": [
                "сифилис",
                "туберкулез",
                "ревматическая болезнь"
            ]
        },
        {
            "qID": 52,
            "qName": "Парез лицевого нерва может привести",
            "rA": [
                "кератопатии и кератиту"
            ],
            "wA": [
                "к повышению внутриглазного давления",
                "нистагму и косоглазию",
                "спазму аккомодации"
            ]
        },
        {
            "qID": 53,
            "qName": "Противопоказанием к назначению контактных линз является",
            "rA": [
                "нарушение целостности роговицы"
            ],
            "wA": [
                "гипертоническая болезнь",
                "глазные операции в анамнезе",
                "тромбоз центральной вены сетчатки"
            ]
        },
        {
            "qID": 54,
            "qName": "Снижение остроты зрения при заболеваниях роговицы может быть связано",
            "rA": [
                "с любым из перечисленного"
            ],
            "wA": [
                "с помутнением роговицы",
                "с васкуляризацией роговицы",
                "с нарушением нормальной сферичности роговицы"
            ]
        },
        {
            "qID": 55,
            "qName": "Какой симптом из роговичного синдрома преобладает при кератите",
            "rA": [
                "светобоязнь"
            ],
            "wA": [
                "слезотечение",
                "гнойное отделяемое",
                "чувство инородного тела под верхним веком"
            ]
        },
        {
            "qID": 56,
            "qName": "Для лечения внутриглазного герпеса используются все перечисленные средства, за исключением",
            "rA": [
                "антибиотиков"
            ],
            "wA": [
                "противовирусных средств",
                "иммунокорригирующих средств",
                "антихолинэстеразных средств"
            ]
        },
        {
            "qID": 57,
            "qName": "Лечение исходов кератитов",
            "rA": [
                "кератопластика"
            ],
            "wA": [
                "элефаропластика",
                "плеоптика",
                "диплоптика"
            ]
        },
        {
            "qID": 58,
            "qName": "Основная жалоба при иридоциклите",
            "rA": [
                "боль в глазу"
            ],
            "wA": [
                "светобоязнь",
                "покраснение глаза",
                "чувство песка в глазу"
            ]
        },
        {
            "qID": 59,
            "qName": "Основные клинические признаки иридоиикпита",
            "rA": [
                "преципитаты"
            ],
            "wA": [
                "красный рефлекс с глазного дна",
                "застойный ДЗН",
                "отек век"
            ]
        },
        {
            "qID": 60,
            "qName": "Ревматический артрите характерной триадой поражений глаз называется",
            "rA": [
                "синдром Стилла"
            ],
            "wA": [
                "синдром Марфана",
                "болезнь Тея Сакса",
                "синдром «голубых склер»"
            ]
        },
        {
            "qID": 61,
            "qName": "Экстренная помощь при иридоциклите включает инстилляции ...",
            "rA": [
                "1% р ром атропина сульфата"
            ],
            "wA": [
                "1% р ром пилокарпина",
                "2% р ром борной кислоты",
                "3% колларгола"
            ]
        },
        {
            "qID": 62,
            "qName": "Наибольшая вероятность развития диабетических ретинопатий зависит от ...",
            "rA": [
                "длительности течения диабета"
            ],
            "wA": [
                "остроты течения процесса",
                "наличия сопутствующих заболеваний у больных",
                "сахарным диабетом",
                "наличия диабетической катаракты"
            ]
        },
        {
            "qID": 63,
            "qName": "Симптом «раздавленного помидора» наблюдается ПРИ ...",
            "rA": [
                "тромбозе центральной вены сетчатки"
            ],
            "wA": [
                "неврите зрительного нерва",
                "эмболии центральной артерии сетчатки",
                "отслойке сетчатки"
            ]
        },
        {
            "qID": 64,
            "qName": "Микроаневризмы характерны",
            "rA": [
                "для диабетической ретинопатии"
            ],
            "wA": [
                "для ретинопатии почечного генеза",
                "для гипертонической ретинопатии",
                "для атеросклеротической ретинопатии"
            ]
        },
        {
            "qID": 65,
            "qName": "При заболеваниях почек, которые могут проявиться такими изменениями на глазном дне. как неравномерное сужение артерий, отек диска зрительного нерва, белесоватые очажки, сливающиеся в «фигуру звезды» в центре глазного дна:",
            "rA": [
                "гломерулонефрит"
            ],
            "wA": [
                "мочекаменная болезнь",
                "пиелонефрит",
                "пиелорэктазия"
            ]
        },
        {
            "qID": 66,
            "qName": "Ретинобластома   это ...",
            "rA": [
                "злокачественная внутриглазная опухоль, проявляющаяся к 2 3 годам"
            ],
            "wA": [
                "повышение внутриглазного давления",
                "кровоизлияние в стекловидное тело",
                "злокачественная опухоль орбиты"
            ]
        },
        {
            "qID": 67,
            "qName": "Атрофия зрительного нерва может наблюдаться в исходе",
            "rA": [
                "глаукомы"
            ],
            "wA": [
                "катаракты",
                "халазиона",
                "кератита"
            ]
        },
        {
            "qID": 68,
            "qName": "Наиболее часто застойный диск зрительного нерва встречается",
            "rA": [
                "при опухолях головного мозга"
            ],
            "wA": [
                "при гипертонической болезни",
                "при лейкозах",
                "при пансинуситах"
            ]
        },
        {
            "qID": 69,
            "qName": "Лечение диабетической катаракты у больных диабетом должно дополнительно к общей терапии включать",
            "rA": [
                "местное применение витаминных и антиоксидантных средств"
            ],
            "wA": [
                "местное (глазное) применение кортикостероидов",
                "местное применение рассасывающих средств",
                "местное применение антибиотиков"
            ]
        },
        {
            "qID": 70,
            "qName": "Степень зрелости катаракты, наиболее удобная для оперативного вмешательства",
            "rA": [
                "незрелая"
            ],
            "wA": [
                "начальная",
                "зрелая",
                "перезрелая"
            ]
        },
        {
            "qID": 71,
            "qName": "Артифакия   это ...",
            "rA": [
                "наличие в глазу искусственного хрусталика"
            ],
            "wA": [
                "отсутствие в глазу хрусталика",
                "локализция хрусталика в стекловидном теле",
                "подвывих хрусталика"
            ]
        },
        {
            "qID": 72,
            "qName": "Операция по иссечению стекловидного тела называется",
            "rA": [
                "витрэктомия"
            ],
            "wA": [
                "кератотомия",
                "ленсэктомия",
                "иридэктомия"
            ]
        },
        {
            "qID": 73,
            "qName": "Внутриглазное давление при остром приступе глаукомы",
            "rA": [
                "резко повышено"
            ],
            "wA": [
                "повышено",
                "не изменено",
                "понижено"
            ]
        },
        {
            "qID": 74,
            "qName": "Врожденная глаукома может быть глазным проявлением",
            "rA": [
                "факоматозов (ангиоматоз, нейрофиброматоз)"
            ],
            "wA": [
                "внутриклеточных липоидозов",
                "галактоземии",
                "гистиоцитоза"
            ]
        },
        {
            "qID": 75,
            "qName": "Ребенка, страдающего врожденной глаукомой. следует оперировать",
            "rA": [
                "в течение первого месяца после установления диагноза"
            ],
            "wA": [
                "при безуспешной консервативной терапии",
                "не моложе 14 лет",
                "когда ребенку надо идти в школу"
            ]
        },
        {
            "qID": 76,
            "qName": "После купирования острого приступа глаукомы необходимо",
            "rA": [
                "через 24 часа произвести операцию"
            ],
            "wA": [
                "продолжать примененение миотиков и наблюдение",
                "назначить сосудорасширяющие препараты",
                "рекомендовать курсы инъекций тауфона 2 раза в год"
            ]
        },
        {
            "qID": 77,
            "qName": "Абсолютный признак проникающего ранения роговицы",
            "rA": [
                "наличие раны, проходящей через все слои"
            ],
            "wA": [
                "боль",
                "роговицы",
                "гифема",
                "светобоязнь"
            ]
        },
        {
            "qID": 78,
            "qName": "При рваной ране тканей глазницы с птозом и экзофтальмом общий хирург приемного покоя обязан сделать все, кроме",
            "rA": [
                "срочно провести ПХО раны"
            ],
            "wA": [
                "наложить повязку и отправить больного к специалисту",
                "сделать инъекцию антибиотиков и обезболивающих средств",
                "ввести противостолбнячную сыворотку"
            ]
        },
        {
            "qID": 79,
            "qName": "Кровоизляние в стекловидное тело называется",
            "rA": [
                "гемофтальм"
            ],
            "wA": [
                "гифема",
                "симблефарон",
                "гипопион"
            ]
        },
        {
            "qID": 80,
            "qName": "Лучшим дезинтоксикационным средством в патогенетической терапии ожогов глаз является",
            "rA": [
                "плазма ожоговых реконвалесцентов"
            ],
            "wA": [
                "внутривенное введение глюкозы",
                "внутримышечное введение витаминов группы В",
                "десенсибилизирующие средства"
            ]
        },
        {
            "qID": 81,
            "qName": "Хирургическое лечение показано при следующих осложнениях ожога глаз",
            "rA": [
                "всех вышеперечисленных"
            ],
            "wA": [
                "бельмо роговицы",
                "язва роговицы",
                "фистула роговицы"
            ]
        },
        {
            "qID": 82,
            "qName": "Верхняя прямая мышца иннервируется",
            "rA": [
                "глазодвигательным нервом"
            ],
            "wA": [
                "отводящим нервом",
                "блоковым нервом",
                "лицевым нервом"
            ]
        },
        {
            "qID": 83,
            "qName": "Склеру в заднем отделе прободают",
            "rA": [
                "зрительный нерв и центральная артерия сетчатки"
            ],
            "wA": [
                "зрительный нерв и глазодвигательный нерв",
                "зрительный нерв и центральная вена сетчатки",
                "зрительный нерв"
            ]
        },
        {
            "qID": 84,
            "qName": "Питание хрусталика осуществляется за счет",
            "rA": [
                "внутриглазной жидкости"
            ],
            "wA": [
                "краевой петлистой сети",
                "слезы",
                "центральной артерии сетчатки"
            ]
        },
        {
            "qID": 85,
            "qName": "Ресничное тело состоит из ... частей",
            "rA": [
                "2"
            ],
            "wA": [
                "3",
                "4",
                "5"
            ]
        },
        {
            "qID": 86,
            "qName": "К оптическим средам глаза относятся все, кроме",
            "rA": [
                "радужки"
            ],
            "wA": [
                "роговицы",
                "хрусталика",
                "стекловидного тела"
            ]
        },
        {
            "qID": 87,
            "qName": "Особенности венозного кровообращения в коже век",
            "rA": [
                "анастомозируют с глубокими венами орбиты"
            ],
            "wA": [
                "имеют множество клапанов",
                "образуют краевую петлистую сеть",
                "ход крови в них замедлен"
            ]
        },
        {
            "qID": 88,
            "qName": "Сетчатка является",
            "rA": [
                "периферическим отделом зрительного анализатора  диафрагмой"
            ],
            "wA": [
                "преломляющей системой",
                "дренажной системой"
            ]
        },
        {
            "qID": 89,
            "qName": "Колбочки сосредоточены",
            "rA": [
                "в макуле"
            ],
            "wA": [
                "в области забчатой линии",
                "по периферии сетчатки",
                "вокруг ДЗН"
            ]
        },
        {
            "qID": 90,
            "qName": "Топографически зрительный нерв делят на ... отдела",
            "rA": [
                "4"
            ],
            "wA": [
                "1",
                "2",
                "3"
            ]
        },
        {
            "qID": 91,
            "qName": "Светоощущение может быть",
            "rA": [
                "с правильной проекцией"
            ],
            "wA": [
                "без проекции",
                "с косой проекцией",
                "с кривой проекцией"
            ]
        },
        {
            "qID": 92,
            "qName": "В черепной ямке в области турецкого седла осуществляется",
            "rA": [
                "частичный перекрест внутренних половин нервов"
            ],
            "wA": [
                "частичный перекрест наружных половин нервов",
                "полный перекрест нервных волокон",
                "частичный перекрест правой части нервных волокон"
            ]
        },
        {
            "qID": 93,
            "qName": "Острота зрения по таблицам Сивцева Головина исследуется на расстоянии ... метров",
            "rA": [
                "5"
            ],
            "wA": [
                "6",
                "7",
                "10"
            ]
        },
        {
            "qID": 94,
            "qName": "Нормальное цветоощущение называется",
            "rA": [
                "трихромазией"
            ],
            "wA": [
                "гемералопией",
                "дихромазией",
                "астенопией"
            ]
        },
        {
            "qID": 95,
            "qName": "Палочковый аппарат глаза осуществляет",
            "rA": [
                "периферическое зрение"
            ],
            "wA": [
                "бинокулярное зрение",
                "цветоощущение",
                "центральное зрение"
            ]
        },
        {
            "qID": 96,
            "qName": "Гомонимная гемианопсия характеризуется",
            "rA": [
                "выпадением височной половины в одном глазу и носовой   в другом"
            ],
            "wA": [
                "выпадением височных половин поля зрения",
                "выпадением носовых половин поля зрения",
                "выпадением поля зрения на одном глазу"
            ]
        },
        {
            "qID": 97,
            "qName": "Бинокулярное зрение призвано обеспечить",
            "rA": [
                "слияние (фузию) двойных изображений в единое"
            ],
            "wA": [
                "приспособление глаза к различным уровням освещенности",
                "цветоразличение",
                "поле зрения"
            ]
        },
        {
            "qID": 98,
            "qName": "Эмметропия   это ...",
            "rA": [
                "лучи после прохождения оптических сред концентрируются на сетчатке"
            ],
            "wA": [
                "лучи концентрируются перед сетчаткой",
                "лучи не пересекаются в центральной зоне сетчатки",
                "лучи пересекаются в разных плоскостях оптических сред"
            ]
        },
        {
            "qID": 99,
            "qName": "Аметропия",
            "rA": [
                "миопия"
            ],
            "wA": [
                "эмметропия",
                "мидриаз",
                "анизейкония"
            ]
        },
        {
            "qID": 100,
            "qName": "Для гиперметропии характерна",
            "rA": [
                "слабая преломляющая способность оптических сред глаза"
            ],
            "wA": [
                "сильная преломляющая способность оптических сред глаза",
                "отсутствие единой фокусной точки",
                "ни то, ни другое"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
