var tests = {
    "tests": [
        {
            "qID": 101,
            "qName": "По течению миопия может быть",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "стационарной",
                "быстропрогрессирующей",
                "медленнопрогрессирующей"
            ]
        },
        {
            "qID": 102,
            "qName": "Миопия корригируется",
            "rA": [
                "рассеивающими сферическими линзами"
            ],
            "wA": [
                "собирающими сферическими линзами",
                "призматическими линзами",
                "цилиндрическими линзами"
            ]
        },
        {
            "qID": 103,
            "qName": "40 летнему больному с гиперметропической рефракцией +2,0 D необходимо выписать очки для близи",
            "rA": [
                "+ 3,0 D"
            ],
            "wA": [
                "+ 1,0 D",
                "+ 2,0 D",
                "+ 4,0 D"
            ]
        },
        {
            "qID": 104,
            "qName": "При астигматизме ...",
            "rA": [
                "преломленные глазом лучи не могут собраться в одну точку"
            ],
            "wA": [
                "после преломления оптической системой могут фокусироваться только за сетчаткой",
                "параллельно идущие лучи сходятся перед сетчаткой",
                "преломленные лучи фокусируются на сетчатке"
            ]
        },
        {
            "qID": 105,
            "qName": "При спазме аккомодации в условиях цикпоплегии острота зрения вдаль",
            "rA": [
                "улучшается"
            ],
            "wA": [
                "ухудшается",
                "не изменяется",
                "улучшается частично"
            ]
        },
        {
            "qID": 106,
            "qName": "Устранение миопии возможно с помощью ... лазера",
            "rA": [
                "эксимерного"
            ],
            "wA": [
                "рубинового",
                "ксенонового",
                "аргонового"
            ]
        },
        {
            "qID": 107,
            "qName": "Основной симптом содружественного косоглазия",
            "rA": [
                "расстройство или отсутствие бинокулярного зрения"
            ],
            "wA": [
                "ограничение подвижности глаза в сторону пораженной мышцы",
                "отсутствие подвижности в сторону пораженной мышцы",
                "жалобы на двоение"
            ]
        },
        {
            "qID": 108,
            "qName": "При паралитическом косоглазии",
            "rA": [
                "первичный угол отклонения меньше вторичного"
            ],
            "wA": [
                "первичный угол отклонения равен вторичному",
                "первичный угол отклонения больше вторичного",
                "верно все перечисленное"
            ]
        },
        {
            "qID": 109,
            "qName": "Нистагм   это ...",
            "rA": [
                "самопроизвольные колебательные движения глазных яблок"
            ],
            "wA": [
                "изменение симметричного положения глаз при исключении условий для бинокулярного зрения",
                "попеременное отклонение глазных яблок",
                "отсутствие движения глазных яблок"
            ]
        },
        {
            "qID": 110,
            "qName": "Ячмень   это ...",
            "rA": [
                "острое гнойное воспаление волосяного мешочка или сальной железы края век"
            ],
            "wA": [
                "фолликулы бледно розового цвета в области нижней переходной с кладки",
                "плотное безболезненное образование в толще хряща век",
                "воспаление края век"
            ]
        },
        {
            "qID": 111,
            "qName": "Халазион представляет собой",
            "rA": [
                "хроническое пролиферативное воспаление мейбомиевой железы и хряща вокруг него"
            ],
            "wA": [
                "плоские пятна, реже узелки желтого цвета в толще кожи век, чаще у внутреннего угла глаза",
                "редкая форма рака желез хряща века",
                "складка истонченной кожи над наружным углом глазной щели"
            ]
        },
        {
            "qID": 112,
            "qName": "Лагофтальм развивается вследствие",
            "rA": [
                "расстройства иннервации лицевого нерва"
            ],
            "wA": [
                "расстройства иннервации глазодвигательного нерва",
                "расстройства инннервации блокового нерва",
                "расстройства иннервации зрительного нерва"
            ]
        },
        {
            "qID": 113,
            "qName": "Дакриоаденит   это ...",
            "rA": [
                "воспаление слезной железы"
            ],
            "wA": [
                "воспаление переходных складок конъюнктивы",
                "воспаление слезного мешка",
                "воспаление фиброзной капсулы"
            ]
        },
        {
            "qID": 114,
            "qName": "Основная жалоба при хроническом дакриоцистите",
            "rA": [
                "упорное слезотечение"
            ],
            "wA": [
                "чувство тяжести в глазу",
                "ограничение подвижности глазного яблока",
                "выпячивание глазного яблока"
            ]
        },
        {
            "qID": 115,
            "qName": "При теноните выражены следующие симптомы, кроме",
            "rA": [
                "зуда в веках"
            ],
            "wA": [
                "хемоз",
                "экзофтальм",
                "ограничение подвижности глазного яблока"
            ]
        },
        {
            "qID": 116,
            "qName": "Экзофтальм может быть двусторонним",
            "rA": [
                "при эндокринных расстройствах"
            ],
            "wA": [
                "при врожденной глаукоме",
                "при кератоконусе",
                "при катаракте"
            ]
        },
        {
            "qID": 117,
            "qName": "Доброкачественные опухоли глаза  все, кроме",
            "rA": [
                "саркома"
            ],
            "wA": [
                "нейрофиброма",
                "глиома",
                "гемангиома"
            ]
        },
        {
            "qID": 118,
            "qName": "Виды инъекций глазного яблока",
            "rA": [
                "конъюнктивальная"
            ],
            "wA": [
                "общирная",
                "внутримышечная",
                "локальная"
            ]
        },
        {
            "qID": 119,
            "qName": "Отек конъюнктивы называется",
            "rA": [
                "хемоз"
            ],
            "wA": [
                "гифема",
                "ксероз",
                "сидероз"
            ]
        },
        {
            "qID": 120,
            "qName": "Острый эпидемический кератоконъюнктивит вызывается",
            "rA": [
                "аденовирусами"
            ],
            "wA": [
                "хламидиями",
                "бактериями",
                "грибками"
            ]
        },
        {
            "qID": 121,
            "qName": "Основными клиническими признаками конъюнктивита являются",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "инъекция сосудов конъюнктивы",
                "отделяемое",
                "отек слизистой глазного яблока и переходных складок",
                "изменение поверхности конъюнктивы век и переходных складок"
            ]
        },
        {
            "qID": 122,
            "qName": "Дифтерийный конъюнктивит характеризуется",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "образованием звездчатых рубцов",
                "трудно отделяющимися серовато",
                "грязными пленками, оставляющими язвенную поверхность отделяемое мутное, жидкое с хлопьями"
            ]
        },
        {
            "qID": 123,
            "qName": "Гонобленнорея у новорожденных развивается",
            "rA": [
                "на 2 3 сутки после рождения"
            ],
            "wA": [
                "на первые сутки после рождения",
                "на первый год после рождения",
                "в первый месяц после рождения"
            ]
        },
        {
            "qID": 124,
            "qName": "Опасность гонобленнореи у новорожденных заключается",
            "rA": [
                "в поражении роговицы"
            ],
            "wA": [
                "в развитии симблефарона",
                "в повышении внутриглазного давления",
                "в возникновении отслойки сетчатки"
            ]
        },
        {
            "qID": 125,
            "qName": "К последствиям трахомы относится",
            "rA": [
                "трихиаз"
            ],
            "wA": [
                "халькоз",
                "эпикантус",
                "хемоз"
            ]
        },
        {
            "qID": 126,
            "qName": "Для хламидиозов характерно",
            "rA": [
                "обнаружение цитоплазматических включений (телец Гальберштедтера Провачека) в эпителиальных клетках соскобов конъюнктивы"
            ],
            "wA": [
                "обнаружение диплобациллы Моракса Аксенфельда в соскобе конъюнктивы",
                "обнаружение бациллы Леффлера в соскобе конъюнктивы",
                "обнаружение кокков Нейссера"
            ]
        },
        {
            "qID": 127,
            "qName": "Туберкулезно аллергический кератит характеризуется наличием ...",
            "rA": [
                "фликтены"
            ],
            "wA": [
                "язвы",
                "гипопиона",
                "гифемы"
            ]
        },
        {
            "qID": 128,
            "qName": "Снижение чувствительности роговицы характерно",
            "rA": [
                "для герпетического кератита"
            ],
            "wA": [
                "для фликтенулезного кератита",
                "для паренхиматозного кератита",
                "для поверхностного кератита"
            ]
        },
        {
            "qID": 129,
            "qName": "Клиническими признаками гнойной язвы роговицы является все, кроме",
            "rA": [
                "серого цвета ДЗН"
            ],
            "wA": [
                "отечной роговицы",
                "инфильтрата с желтоватым оттенком",
                "гипопиона"
            ]
        },
        {
            "qID": 130,
            "qName": "Кератопластика с оптической целью показана при ...",
            "rA": [
                "помутнении роговицы"
            ],
            "wA": [
                "васкуляризации роговицы",
                "помутнении хрусталика",
                "помутнении стекловидного тела"
            ]
        },
        {
            "qID": 131,
            "qName": "Ксероз роговицы развивается при всех состояниях, кроме",
            "rA": [
                "при паратрахоме  при ожогах глаз"
            ],
            "wA": [
                "при гипо  и авитаминозе витамина А",
                "при трахоме",
                "при лагофтальме различного происхождения"
            ]
        },
        {
            "qID": 132,
            "qName": "Боль при иридоциклите ...",
            "rA": [
                "локальная"
            ],
            "wA": [
                "иррадиирующая",
                "разлитая",
                "отсутствует"
            ]
        },
        {
            "qID": 133,
            "qName": "При склеивании зрачкового края радужки с передней капсулой хрусталика наступает",
            "rA": [
                "заращение (occlusio) зрачка"
            ],
            "wA": [
                "помутнение роговицы",
                "гипотония",
                "бельмо"
            ]
        },
        {
            "qID": 134,
            "qName": "При циклите определяется",
            "rA": [
                "болезненность или повышенная чувствительность глазного яблока при пальпации"
            ],
            "wA": [
                "расширение зрачка",
                "опущение верхнего века",
                "болезненность в точке выхода тройничного нерва"
            ]
        },
        {
            "qID": 135,
            "qName": "Часто в исходе иридоциклита наблюдается",
            "rA": [
                "вторичная (увеальная)глаукома"
            ],
            "wA": [
                "подвывих хрусталика",
                "тракционная отслойка сетчатки",
                "помутнение роговицы"
            ]
        },
        {
            "qID": 136,
            "qName": "Панувеит   это воспаление ...",
            "rA": [
                "всех отделов сосудистого тракта"
            ],
            "wA": [
                "радужной оболочки",
                "цилиарного тела",
                "собственно сосудистой оболочки"
            ]
        },
        {
            "qID": 137,
            "qName": "Жалобы при задних увеитах",
            "rA": [
                "отсутствуют"
            ],
            "wA": [
                "на боль в области глазного яблока",
                "на покраснение глазного яблока",
                "на косоглазие"
            ]
        },
        {
            "qID": 138,
            "qName": "Диагностика хориоидита отновывается на данных:",
            "rA": [
                "офтальмоскопии"
            ],
            "wA": [
                "гониоскопии",
                "офтальмометрии",
                "рентгенографии"
            ]
        },
        {
            "qID": 139,
            "qName": "При эмболии центральной артерии сетчатки характерно",
            "rA": [
                "резкое снижение зрения до нескольких сотых"
            ],
            "wA": [
                "сохранение зрения",
                "постепенное снижение остроты зрения",
                "появление радужных кругов при взгляде на источник света"
            ]
        },
        {
            "qID": 140,
            "qName": "Лечение при тромбозе центральной вены сетчатки должно включать",
            "rA": [
                "лазерное лечение"
            ],
            "wA": [
                "антибиотики",
                "оксигенотерапию",
                "криоэкстракцию"
            ]
        },
        {
            "qID": 141,
            "qName": "Первая врачебная помощь при эмболии центральной артерии сетчатки",
            "rA": [
                "внутривенное введение 2,4% раствора эуфиллина"
            ],
            "wA": [
                "обильное промывание проточной водой",
                "внутривенное введение антибиотика",
                "наложение повязки"
            ]
        },
        {
            "qID": 142,
            "qName": "Факоэмульсификаиия производится",
            "rA": [
                "при помощи ультразвука"
            ],
            "wA": [
                "при помощи лазера",
                "при помощи холода",
                "при помощи ультрафиолета"
            ]
        },
        {
            "qID": 143,
            "qName": "Афакия   это ...",
            "rA": [
                "отсутствие хрусталика"
            ],
            "wA": [
                "помутнение хрусталика",
                "набухание хрусталика",
                "имплантация искусственного хрусталика"
            ]
        },
        {
            "qID": 144,
            "qName": "К аномалиям развития хрусталика относятся",
            "rA": [
                "микрофакия"
            ],
            "wA": [
                "кератоконус",
                "кератоглобус",
                "катаракта"
            ]
        },
        {
            "qID": 145,
            "qName": "Офтальмоскопические изменения при неврите зрительного нерва все, кроме",
            "rA": [
                "диск зрительного нерва бледный"
            ],
            "wA": [
                "диск зрительного нерва гиперемирован",
                "границы диска зрительного нерва стушеваны",
                "вены расширены"
            ]
        },
        {
            "qID": 146,
            "qName": "При атрофии зрительного нерва цвет диска зрительного нерва",
            "rA": [
                "бледный"
            ],
            "wA": [
                "не изменен",
                "гиперемирован",
                "синюшный"
            ]
        },
        {
            "qID": 147,
            "qName": "Резкое снижение остроты зрения на обоих глазах отмечается при",
            "rA": [
                "поражении зрительного нерва метиловым спиртом"
            ],
            "wA": [
                "неврите зрительного нерва",
                "диабетической ретинопатии",
                "глаукоме"
            ]
        },
        {
            "qID": 148,
            "qName": "При ретинобластоме отмечается",
            "rA": [
                "желто белый рефлекс в области зрачка"
            ],
            "wA": [
                "увеличение диаметра роговицы",
                "красный рефлекс в области зрачка",
                "покраснение глаза"
            ]
        },
        {
            "qID": 149,
            "qName": "Мидриаз развивается",
            "rA": [
                "при остром приступе глаукомы"
            ],
            "wA": [
                "при остром хориоретините",
                "при остром иридоциклите",
                "при остром конъюнктивите"
            ]
        },
        {
            "qID": 150,
            "qName": "По степени компенсации глаукома подразделяется на ...",
            "rA": [
                "все перечисленные"
            ],
            "wA": [
                "компенсированную",
                "субкомпенсированную",
                "некомпенсированную"
            ]
        },
        {
            "qID": 151,
            "qName": "Глаукоматозные изменения на глазном дне",
            "rA": [
                "экскавация диска зрительного нерва"
            ],
            "wA": [
                "симптом «раздавленного помидора»",
                "симптом «вишневой косточки»",
                "микроаневризмы сосудов"
            ]
        },
        {
            "qID": 152,
            "qName": "При остром приступе глаукомы при пальпаторном исследовании глазное яблоко",
            "rA": [
                "плотное"
            ],
            "wA": [
                "'нормальное",
                "мягкое",
                "'эластичное"
            ]
        },
        {
            "qID": 153,
            "qName": "При остром приступе глаукомы зрачок",
            "rA": [
                "расширен"
            ],
            "wA": [
                "не изменен",
                "сужен",
                "'неправильной формы"
            ]
        },
        {
            "qID": 154,
            "qName": "Экстренная помощь при остром приступе глаукомы включает все, кроме",
            "rA": [
                "кератопротекторов"
            ],
            "wA": [
                "'анальгетиков",
                "диуретиков",
                "местных гипотензивных средств"
            ]
        },
        {
            "qID": 155,
            "qName": "К бета адреноблокаторам относятся",
            "rA": [
                "тимолол"
            ],
            "wA": [
                "фосфакол",
                "пилокарпин",
                "трусопт"
            ]
        },
        {
            "qID": 156,
            "qName": "Для врожденной глаукомы характерно",
            "rA": [
                "буфтальм"
            ],
            "wA": [
                "экзофтальм",
                "анофтальм",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 157,
            "qName": "Рентгенлокализация инородного тела проводится с помощью",
            "rA": [
                "протеза Комберга Балтина"
            ],
            "wA": [
                "диафаноскопа",
                "офтальмоскопа",
                "стеклянной палочки"
            ]
        },
        {
            "qID": 158,
            "qName": "Кровоизлияние в переднюю камеру называется",
            "rA": [
                "гифема"
            ],
            "wA": [
                "гемофтальм",
                "рубеоз",
                "сидероз"
            ]
        },
        {
            "qID": 159,
            "qName": "Халькоз глаза   это ...",
            "rA": [
                "отложение в тканях глазного яблока солей меди"
            ],
            "wA": [
                "отложение в тканях и средах глазного яблока солей железа",
                "кровоизлияние в стекловидное тело",
                "выпадение хрусталика в переднюю камеру"
            ]
        },
        {
            "qID": 160,
            "qName": "Клинические признаки эндофтамита",
            "rA": [
                "при исследовании в проходящем свете желтое"
            ],
            "wA": [
                "гной в передней камере",
                "отложение гноя на радужке",
                "свечение зрачка",
                "отек века"
            ]
        },
        {
            "qID": 161,
            "qName": "Симпатическая офтальмия развивается",
            "rA": [
                "как воспалительный процесс во втором глазу вследствие хронического иридоциклита в травмированном глазу"
            ],
            "wA": [
                "вследствие несмыкания век",
                "за счет образования в стекловидном теле соединительнотканных тяжей",
                "как исход кровоизлияния в стекловидное тело"
            ]
        },
        {
            "qID": 162,
            "qName": "При вывихе хрусталика в стекловидное тело отмечается",
            "rA": [
                "дрожание радужки"
            ],
            "wA": [
                "гифема",
                "гемофтальм",
                "гиперемия диска зрительного нерва"
            ]
        },
        {
            "qID": 163,
            "qName": "Ожог кислотой может вызвать развитие",
            "rA": [
                "коагуляционного некроза"
            ],
            "wA": [
                "колликвационного некроза",
                "и того, и другого",
                "ни того, ни другого"
            ]
        },
        {
            "qID": 164,
            "qName": "При ожоге щелочью с целью оказания экстренной помощи необходимо закапать",
            "rA": [
                "2% р р борной кислоты"
            ],
            "wA": [
                "3% р р бикарбоната натрия",
                "1% р р пилокарпина гидрохлорида",
                "0,9% р р хлорида натрия"
            ]
        },
        {
            "qID": 165,
            "qName": "При ожоге Ill ей степени роговица",
            "rA": [
                "приобретает вид «матового стекла»"
            ],
            "wA": [
                "остается прозрачной",
                "становится гиперемированной",
                "становится васкуляризированной"
            ]
        },
        {
            "qID": 166,
            "qName": "Симблефарон   это ...",
            "rA": [
                "сращение конъюнктивы век с конъюнктивой глазного яблока"
            ],
            "wA": [
                "наличие крови в передней камере",
                "наличие инородного тела в хурсталике",
                "наличие крови в стекловидном теле"
            ]
        },
        {
            "qID": 167,
            "qName": "Электроофтальмия развивается ПРИ воздействии ...",
            "rA": [
                "УФО облучения"
            ],
            "wA": [
                "электрического разряда",
                "инфракрасного излучения",
                "СВЧ излучения"
            ]
        },
        {
            "qID": 168,
            "qName": "Верхняя стенка орбиты граничит ...",
            "rA": [
                "лобной пазухи"
            ],
            "wA": [
                "решетчатой пазухи",
                "гайморовой пазухи",
                "полостью носа"
            ]
        },
        {
            "qID": 169,
            "qName": "Слезный мешок книзу лежит",
            "rA": [
                "кпереди от фасции"
            ],
            "wA": [
                "во внутреннем углу орбиты",
                "в средней черепной ямке",
                "сзади фасции"
            ]
        },
        {
            "qID": 170,
            "qName": "Нижняя косая мышца берет начало",
            "rA": [
                "от надкостницы нижне внутреннего края орбиты"
            ],
            "wA": [
                "от сухожильного кольца",
                "от фасции",
                "от нижней прямой мышцы"
            ]
        },
        {
            "qID": 171,
            "qName": "Блоковый нерв иннервирует",
            "rA": [
                "верхнюю косую мышцу"
            ],
            "wA": [
                "наружную прямую мышцу",
                "верхнюю прямую мышцу",
                "'внутреннюю прямую мышцу"
            ]
        },
        {
            "qID": 172,
            "qName": "Мышца, поднимающая верхнее веко, иннервируется",
            "rA": [
                "глазодвигательным нервом"
            ],
            "wA": [
                "'блоковым нервом",
                "'лицевым нервом",
                "зрительным нервом"
            ]
        },
        {
            "qID": 173,
            "qName": "Под кожей век расположена",
            "rA": [
                "круговая мышца век"
            ],
            "wA": [
                "плотная соединительная пластинка",
                "конъюнктива",
                "жировая клетчатка"
            ]
        },
        {
            "qID": 174,
            "qName": "Конъюнктива выполняет... функцию",
            "rA": [
                "защитную"
            ],
            "wA": [
                "слезопродуцирующую",
                "светопроводящую",
                "формообразующую"
            ]
        },
        {
            "qID": 175,
            "qName": "Задняя пограничная пластинка роговицы ближе к лимбу принимает участие в образовании",
            "rA": [
                "корнеосклеральной трабекулы"
            ],
            "wA": [
                "зрачка",
                "ресничного тела",
                "радужки"
            ]
        },
        {
            "qID": 176,
            "qName": "Мышечные артерии после прикрепления прямых мышц к склере называются ...",
            "rA": [
                "передними ресничными артериями"
            ],
            "wA": [
                "задними длинными ресничными артериями",
                "задними короткими артериями",
                "боковыми ресничными артериями"
            ]
        },
        {
            "qID": 177,
            "qName": "Чувствительную иннервацию роговицы осуществляет",
            "rA": [
                "тройничный нерв"
            ],
            "wA": [
                "блоковый нерв",
                "отводящий нерв",
                "зрительный нерв"
            ]
        },
        {
            "qID": 178,
            "qName": "Сквозь отверстия решетчатой пластинки склеры проходят",
            "rA": [
                "пучки волокон зрительного нерва"
            ],
            "wA": [
                "пучки волокон блокового нерва",
                "пучки волокон глазодвигательного нерва",
                "пучки волокон отводящего нерва"
            ]
        },
        {
            "qID": 179,
            "qName": "В центре радужки находится",
            "rA": [
                "зрачок"
            ],
            "wA": [
                "трабекула",
                "лимб",
                "крипта"
            ]
        },
        {
            "qID": 180,
            "qName": "Самой обширной частью сосудистой оболочки является",
            "rA": [
                "хориоидея"
            ],
            "wA": [
                "радужка",
                "ресничное тело",
                "сетчатка"
            ]
        },
        {
            "qID": 181,
            "qName": "Важную роль в поддержании тургора глаза играет",
            "rA": [
                "гиалуроновая кислота"
            ],
            "wA": [
                "плазма крови",
                "аскорбиновая кислота",
                "борная кислота"
            ]
        },
        {
            "qID": 182,
            "qName": "Зрительный нерв проходит вблизи",
            "rA": [
                "и того, и другого"
            ],
            "wA": [
                "решетчатой пазухи",
                "'основной пазухи",
                "ни того, ни другого"
            ]
        },
        {
            "qID": 183,
            "qName": "Методом Гиршберга можно определить",
            "rA": [
                "угол отклонения глазного яблока"
            ],
            "wA": [
                "'размеры глазного яблока",
                "'параметры внутриглазного давления",
                "'границы внутриглазной опухоли"
            ]
        },
        {
            "qID": 184,
            "qName": "ЭхоофтальмограФия используется для всего, кроме",
            "rA": [
                "для определения внутриглазного давления"
            ],
            "wA": [
                "для диагностики новообразований",
                "для диагностики отслойки сетчатки",
                "при подозрении на внедрение инородных тел"
            ]
        },
        {
            "qID": 185,
            "qName": "Острота зрения",
            "rA": [
                "обратно пропорциональна углу зрения"
            ],
            "wA": [
                "прямо пропорциональна углу зрения",
                "'непропорциональна углу зрения",
                "равна углу зрения"
            ]
        },
        {
            "qID": 186,
            "qName": "Дихромазия наблюдается во всех Формах, кроме",
            "rA": [
                "гемералопия"
            ],
            "wA": [
                "протанопия",
                "дейтеранопия",
                "тританопия"
            ]
        },
        {
            "qID": 187,
            "qName": "Гомонимная гемианопсия характеризуется",
            "rA": [
                "выпадением височных половин поля зрения в обоих глазах"
            ],
            "wA": [
                "выпадением носовой половины в одном глазу и височной половины поля зрения в другом глазу",
                "'сужением поля зрения в одном глазу",
                "'наличием скотомы в другом глазу"
            ]
        },
        {
            "qID": 188,
            "qName": "Адаптацией называется ...",
            "rA": [
                "изменение световой чувствительности глаза при изменении освещенности"
            ],
            "wA": [
                "'способность глаза фокусировать изображение рассматриваемых предметов на сетчатке независимо от расстояния, на котором находится предмет",
                "'преломление света в оптической системе",
                "разная рефракция в главных мередианах глаза"
            ]
        },
        {
            "qID": 189,
            "qName": "Зрение одним глазом дает представление о всех свойствах предмета, кроме",
            "rA": [
                "глубине"
            ],
            "wA": [
                "'высоте",
                "'ширине",
                "форме"
            ]
        },
        {
            "qID": 190,
            "qName": "Клиническую рефракцию характеризует",
            "rA": [
                "положение главного фокуса оптической системы глаза по отношению к сетчатке"
            ],
            "wA": [
                "преломляющую способность оптической системы глаза",
                "способность глаза фокусировать изображение рассматриваемых предметов независимо от расстояния, на котором находится предмет",
                "максимальная острота зрения"
            ]
        },
        {
            "qID": 191,
            "qName": "Эмметропия   это ...",
            "rA": [
                "соразмерная рефракция"
            ],
            "wA": [
                "несоразмерная рефракция",
                "сочетание в одном глазу разных видов рефракций",
                "разная рефракция в разных глазах"
            ]
        },
        {
            "qID": 192,
            "qName": "Для миопии характерно расположение главного фокуса оптической системы",
            "rA": [
                "перед глазом"
            ],
            "wA": [
                "за глазом",
                "на сетчатке",
                "нет единого фокуса"
            ]
        },
        {
            "qID": 193,
            "qName": "Прогрессирующая миопия является",
            "rA": [
                "миопической болезнью"
            ],
            "wA": [
                "аномалией рефракции",
                "соразмерной рефракцией",
                "показанием к кератотомии"
            ]
        },
        {
            "qID": 194,
            "qName": "Парез аккомодации возникает",
            "rA": [
                "при поражении парасимпатической части глазодвигательного нерва"
            ],
            "wA": [
                "при поражении лицевого нерва",
                "при поражении симпатического нерва",
                "при поражении зрительного нерва"
            ]
        },
        {
            "qID": 195,
            "qName": "Альтернирующее косоглазие",
            "rA": [
                "попеременное отклонение то одного, то другого глаза"
            ],
            "wA": [
                "отклонение одного глаза в период отсутствия фиксации какого либо объекта",
                "постоянное отклонение одного и того же глаза",
                "периодически возникающее отклонение глазного яблока"
            ]
        },
        {
            "qID": 196,
            "qName": "Расходящееся косоглазие чаще наблюдается",
            "rA": [
                "при миопии"
            ],
            "wA": [
                "при эмметропии",
                "при гиперметропии",
                "при пресбиопии"
            ]
        },
        {
            "qID": 197,
            "qName": "Метод прямой окклюзии заключается",
            "rA": [
                "в выключении лучше видящего глаза наложением монокулярной повязки в выключении глазного яблока на 12 часов"
            ],
            "wA": [
                "в создании близорукости с помощью положительных стекол",
                "в выключении аккомодации фиксирующего глаза путем атропинизации"
            ]
        },
        {
            "qID": 198,
            "qName": "Скрытое косоглазие связано",
            "rA": [
                "с отсутствием полной гармонии в тонусе и деятельности глазодвигательных мышц"
            ],
            "wA": [
                "парезом одной или нескольких глазодвигательных мышц",
                "с нерегулярным ношением очков",
                "с ношением окклюзии"
            ]
        },
        {
            "qID": 199,
            "qName": "Ячмень может сочетаться со всеми заболеваниями, кроме",
            "rA": [
                "с дакриоаденитом"
            ],
            "wA": [
                "с конъюнктивитом",
                "с фурункулезом",
                "с дакриоциститом"
            ]
        },
        {
            "qID": 200,
            "qName": "Лечение вирусных конъюнктивитов заключается",
            "rA": [
                "в местном применении противовирусных средств"
            ],
            "wA": [
                "в назначении антибиотиков",
                "в назначении витаминов",
                "всего вышеперечисленного"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
