var tests = {
    "tests": [
        {
            "qID": 201,
            "qName": "Для исследования функциональной проходимости слезоотводящих путей проводят",
            "rA": [
                "окрашивание слезы 3% раствором колларгола"
            ],
            "wA": [
                "окрашивание слезы 1% р ром флюоресцеина",
                "диафаноскопию",
                "офтальмоскопию"
            ]
        },
        {
            "qID": 202,
            "qName": "Эпителиально эндотелиальная дегенерация может развиться",
            "rA": [
                "после экстракции катаракты"
            ],
            "wA": [
                "после травм",
                "после вирусной инфекции",
                "после глаукомы"
            ]
        },
        {
            "qID": 203,
            "qName": "Эктазии склеры характеризуются",
            "rA": [
                "появлением бугристых выпячиваний аспидно¬черного цвета"
            ],
            "wA": [
                "резким покраснением глаза",
                "припуханием темно красного цвета",
                "эффектом «голубых склер»"
            ]
        },
        {
            "qID": 204,
            "qName": "Сужение зрачка называется",
            "rA": [
                "миоз"
            ],
            "wA": [
                "мидриаз",
                "анизейкония",
                "рубеоз"
            ]
        },
        {
            "qID": 205,
            "qName": "Вторичные увеиты могут развиться",
            "rA": [
                "при кератите"
            ],
            "wA": [
                "халазионе",
                "при блефарите",
                "при неврите"
            ]
        },
        {
            "qID": 206,
            "qName": "Бомбаж радужки может наблюдаться при",
            "rA": [
                "иридоциклите"
            ],
            "wA": [
                "хориоретините",
                "отслойке сетчатки",
                "вывихе хрусталика"
            ]
        },
        {
            "qID": 207,
            "qName": "Для диагностики хориоидита применяют",
            "rA": [
                "офтальмоскопию"
            ],
            "wA": [
                "гониоскопию",
                "тонографию",
                "эхобиометрию"
            ]
        },
        {
            "qID": 208,
            "qName": "Симптомом переднего увеита является",
            "rA": [
                "стушеванность рисунка радужки"
            ],
            "wA": [
                "отек век",
                "изменение цвета ДЗН",
                "мидриаз"
            ]
        },
        {
            "qID": 209,
            "qName": "В случаях поздней диагностики меланомы хориоидеи может развиваться",
            "rA": [
                "прорастание опухоли в глазницу £"
            ],
            "wA": [
                "блефарит",
                "катаракта",
                "иридоциклит"
            ]
        },
        {
            "qID": 210,
            "qName": "Острая непроходимость центральной артерии сетчатки может встречаться у больных, страдающих",
            "rA": [
                "гипертонической болезнью"
            ],
            "wA": [
                "панкреатитом",
                "алкоголизмом",
                "бронхитом"
            ]
        },
        {
            "qID": 211,
            "qName": "Патогенетическим лечением центрального серозного хориоретинита является",
            "rA": [
                "блокада дефектов базальной пластинки методом лазеркоагуляции"
            ],
            "wA": [
                "снижение внутриглазного давления методом иридэктомии",
                "все перечисленное",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 212,
            "qName": "Для неврита зрительного нерва характерно",
            "rA": [
                "появление плазморрагий на диске зрительного нерва"
            ],
            "wA": [
                "образование экскавации диска зрительного нерва",
                "появление отслойки сетчатки",
                "все вышеперечисленное"
            ]
        },
        {
            "qID": 213,
            "qName": "При первичной атрофии диска зрительного нерва границы",
            "rA": [
                "отчетливые"
            ],
            "wA": [
                "размыты",
                "не определяются",
                "состояние границ не имеет значения"
            ]
        },
        {
            "qID": 214,
            "qName": "Для диагностики врожденной глаукомы важно обнаружение",
            "rA": [
                "ассиметрии в размерах роговицы и глазного яблока на двух глазах"
            ],
            "wA": [
                "отсутствия отклонения глазного яблока",
                "полного объема движений глазного яблока",
                "ассиметрии в размерах глазных щелей"
            ]
        },
        {
            "qID": 215,
            "qName": "ПРИСТУП ВТОРИЧНОЙ факогенной глаукомы развивается",
            "rA": [
                "в результате патологического увеличения размеров хрусталика при незрелой катаракте"
            ],
            "wA": [
                "при остром приступе глаукомы",
                "при помутнении хрусталика",
                "после удаления хрусталика"
            ]
        },
        {
            "qID": 216,
            "qName": "С целью купирования острого приступа глаукомы назначают",
            "rA": [
                "миотики"
            ],
            "wA": [
                "анестетики",
                "мидриатики",
                "антибиотики"
            ]
        },
        {
            "qID": 217,
            "qName": "Выраженным гипотензивным действием обладают",
            "rA": [
                "ганглиоблокаторы"
            ],
            "wA": [
                "анальгетики",
                "анестетики",
                "кортикостероиды"
            ]
        },
        {
            "qID": 218,
            "qName": "Механизм действия ингибиторов карбоангидразы",
            "rA": [
                "уменьшение скорости образования водянистой влаги"
            ],
            "wA": [
                "улучшение оттока из глаза 'деблокирующее действие на угол передней камеры и шлеммов канал",
                "'Стимуляция доплнительных путей оттока водянистой влаги"
            ]
        },
        {
            "qID": 219,
            "qName": "Операции на цилиарном теле направлены",
            "rA": [
                "на уменьшение продукции внутриглазной жидкости"
            ],
            "wA": [
                "на устранение последствий зрачкового блока",
                "на создание нового пути оттока из передней камеры в подконъюнктивальное пространство",
                "на увеличение продукции внутриглазной жидкости"
            ]
        },
        {
            "qID": 220,
            "qName": "Катаракта   это ...",
            "rA": [
                "помутнение хрусталика"
            ],
            "wA": [
                "'воспаление хрусталика",
                "помутнение роговицы",
                "'Смещение хрусталика"
            ]
        },
        {
            "qID": 221,
            "qName": "Вторичная катаракта развивается",
            "rA": [
                "после экстракапсулярной экстракции катаракты"
            ],
            "wA": [
                "после перенесенного увеита",
                "после перенесенного кератита",
                "после перенесенного склерита"
            ]
        },
        {
            "qID": 222,
            "qName": "Хрусталик можно исследовать",
            "rA": [
                "при биомикроскопии"
            ],
            "wA": [
                "при офтальмоскопии",
                "при диафаноскопии",
                "при тонометрии"
            ]
        },
        {
            "qID": 223,
            "qName": "Передняя полярная катаракта представляет собой",
            "rA": [
                "ограниченное помутнение белого цвета, расположенное у переднего полюса хрусталика"
            ],
            "wA": [
                "ограниченное помутнение белого цвета, расположенное у заднего полюса хрусталика",
                "ограниченное помутнение белого цвета, расположенное в коре хрусталика",
                "ни одно из перечисленного"
            ]
        },
        {
            "qID": 224,
            "qName": "Консервативная терапия при катаракте назначается с целью",
            "rA": [
                "предупреждения прогрессирования начальных стадий катаракты"
            ],
            "wA": [
                "снижения внутриглазного давления",
                "рассасывания помутнения",
                "как альтернатива хирургическому лечению"
            ]
        },
        {
            "qID": 225,
            "qName": "Основной метод лечения катаракты",
            "rA": [
                "факоэмульсификация"
            ],
            "wA": [
                "энуклеация",
                "пластика",
                "витрэктомия"
            ]
        },
        {
            "qID": 226,
            "qName": "При афакии передняя камера",
            "rA": [
                "глубокая"
            ],
            "wA": [
                "мелкая",
                "неравномерной глубины",
                "отсутствует"
            ]
        },
        {
            "qID": 227,
            "qName": "Изменения глаз при гипертонической болезни могут протекать в виде",
            "rA": [
                "ретинопатии"
            ],
            "wA": [
                "хориопатии",
                "неврита зрительного нерва",
                "атрофии зрительного нерва"
            ]
        },
        {
            "qID": 228,
            "qName": "Одним из основных симптомов при базедовой болезни является",
            "rA": [
                "экзофтальм"
            ],
            "wA": [
                "кровоизлияния",
                "отслойка сетчатки",
                "эписклерит"
            ]
        },
        {
            "qID": 229,
            "qName": "При заражении токсоплазмой в более поздние сроки беременности у ребенка может обнаружиться",
            "rA": [
                "врожденная глаукома"
            ],
            "wA": [
                "блефароптоз",
                "анофтальм",
                "косоглазие"
            ]
        },
        {
            "qID": 230,
            "qName": "Все глазные инородные тела подлежат",
            "rA": [
                "удалению в ранние сроки"
            ],
            "wA": [
                "сохранению",
                "удалению черз 14 дней",
                "удалению через месяц"
            ]
        },
        {
            "qID": 231,
            "qName": "При экстренной помощи при проникающем ранении необходимо закапать",
            "rA": [
                "0,25% раствор левомецитин"
            ],
            "wA": [
                "0,25% раствор тимолола",
                "1% раствор пилокарпина",
                "1% раствор атропина сульфат"
            ]
        },
        {
            "qID": 232,
            "qName": "При эндофтальмите при исследовании в проходящем свете отмечается",
            "rA": [
                "желтовато зеленый рефлекс"
            ],
            "wA": [
                "красный рефлекс",
                "серый рефлекс",
                "белый рефлекс"
            ]
        },
        {
            "qID": 233,
            "qName": "При симпатическом воспалении показано применение",
            "rA": [
                "кортикостероидов"
            ],
            "wA": [
                "нейролептиков",
                "диуретиков",
                "ганглиоблокаторов"
            ]
        },
        {
            "qID": 234,
            "qName": "Подкожная эмфизема век развивается вследствие",
            "rA": [
                "проникновения воздуха из соседних полостей носа"
            ],
            "wA": [
                "проникновения влаги передней камеры через поврежденную капсулу хрусталика",
                "понижения внутриглазного давления",
                "повышения внутриглазного давления"
            ]
        },
        {
            "qID": 235,
            "qName": "При переломах костей глазницы возможно развитие",
            "rA": [
                "энофтальма"
            ],
            "wA": [
                "повышения внутриглазного давления",
                "вывиха хрусталика",
                "анофтальма"
            ]
        },
        {
            "qID": 236,
            "qName": "В лечение гемофтальма включается все, кроме",
            "rA": [
                "антибиотикотерапия"
            ],
            "wA": [
                "кровоостанавливающая терапия",
                "рассасывающая терапия",
                "витрэктомия"
            ]
        },
        {
            "qID": 237,
            "qName": "Вывихнутый хрусталик",
            "rA": [
                "блокирует угол передней камеры"
            ],
            "wA": [
                "блокирует ресничное тело",
                "блокирует сетчатку",
                "блокирует стекловидное тело"
            ]
        },
        {
            "qID": 238,
            "qName": "При посттравматических дырчатых разрывах сетчатки показана",
            "rA": [
                "лазеркоагуляция сетчатки"
            ],
            "wA": [
                "криоаппликация цилиарного тела",
                "термокоагуляция роговицы",
                "трабекулоэктомия"
            ]
        },
        {
            "qID": 239,
            "qName": "Под действием щелочей развивается",
            "rA": [
                "колликвационный некроз"
            ],
            "wA": [
                "коагуляционный некроз",
                "все перечисленное",
                "ничего из перечисленного"
            ]
        },
        {
            "qID": 240,
            "qName": "Лечение при ожогах глаз включает в себя все, кроме:",
            "rA": [
                "гипотензивных препаратов"
            ],
            "wA": [
                "антибиотиков",
                "антикоагулянтов",
                "аутосыворотки"
            ]
        },
        {
            "qID": 241,
            "qName": "В результате ультрафиолетового облучения может развиться",
            "rA": [
                "электроофтальмия"
            ],
            "wA": [
                "огневая катаракта",
                "морская болезнь",
                "глаукома"
            ]
        },
        {
            "qID": 242,
            "qName": "Допризывник жалуется офтальмологу на отсутствие ориентации в темноте в течение 2 3 месяцев. Каков предварительный диагноз?",
            "rA": [
                "гемералопия"
            ],
            "wA": [
                "глаукома",
                "иридоциклит",
                "отслойка сетчатки"
            ]
        },
        {
            "qID": 243,
            "qName": "Нижняя глазничная щель соединяет орбиту",
            "rA": [
                "с крылонебной ямкой"
            ],
            "wA": [
                "с задней черепной ямкой",
                "со средней черепной ямкой",
                "с гайморовой пазухой"
            ]
        },
        {
            "qID": 244,
            "qName": "Верхняя прямая мышца обеспечивает ПОВОРОТ глаза",
            "rA": [
                "кверху и кнутри"
            ],
            "wA": [
                "книзу и кнутри",
                "кнаружи",
                "кверху и кнаружи"
            ]
        },
        {
            "qID": 245,
            "qName": "Блоковый нерв иннервирует",
            "rA": [
                "верхнюю косую мышцу"
            ],
            "wA": [
                "наружную прямую мышцу",
                "нижнюю прямую мышцу",
                "внутреннюю прямую мышцу"
            ]
        },
        {
            "qID": 246,
            "qName": "Хрящ века находится",
            "rA": [
                "позади вековой части круговой мышцы"
            ],
            "wA": [
                "позади слезного мясца",
                "позади слезной железы",
                "позади орбитальной фасции"
            ]
        },
        {
            "qID": 247,
            "qName": "Склера состоит",
            "rA": [
                "из эписклеры"
            ],
            "wA": [
                "из роговицы",
                "из эпителиоцитов",
                "из внутриглазной жидкости"
            ]
        },
        {
            "qID": 248,
            "qName": "Дилятатор зрачка обусловливает",
            "rA": [
                "расширение зрачка"
            ],
            "wA": [
                "сужение зрачка",
                "понижение внутриглазного давления",
                "изменение цвета глаз"
            ]
        },
        {
            "qID": 249,
            "qName": "Чувствительную иннервацию радужки осуществляет",
            "rA": [
                "тройничный нерв"
            ],
            "wA": [
                "парасимпатический нерв",
                "симпатический нерв",
                "зрительный нерв"
            ]
        },
        {
            "qID": 250,
            "qName": "Самым наружным слоем сетчатки является",
            "rA": [
                "пигментный слой"
            ],
            "wA": [
                "наружная пограничная мембрана",
                "наружный зернистый слой",
                "наружный ядерный слой"
            ]
        },
        {
            "qID": 251,
            "qName": "Диск зрительного нерва   это",
            "rA": [
                "место выхода зрительного нерва из сетчатки"
            ],
            "wA": [
                "скопление палочек",
                "скопление колбочек",
                "^центральная ямка сетчатки"
            ]
        },
        {
            "qID": 252,
            "qName": "Первый нейрон зрительного анализатора",
            "rA": [
                "кпетки нейроэпителия"
            ],
            "wA": [
                "ганглиозные клетки",
                "биполярные клетки",
                "пигментные клетки"
            ]
        },
        {
            "qID": 253,
            "qName": "Задняя камера расположена",
            "rA": [
                "позади радужки"
            ],
            "wA": [
                "позади стекловидного тела",
                "позади хрусталика",
                "позади роговицы"
            ]
        },
        {
            "qID": 254,
            "qName": "Стекловидное тело сходно по составу",
            "rA": [
                "с цереброспинальной жидкостью"
            ],
            "wA": [
                "со слезой",
                "с лимфой",
                "с внутриглазной жидкостью"
            ]
        },
        {
            "qID": 255,
            "qName": "Задние и передние ресничные артерии участвуют в кровоснабжении",
            "rA": [
                "сосудистого тракта и склеры"
            ],
            "wA": [
                "склеры и сетчатки",
                "хрусталика",
                "стекловидного тела"
            ]
        },
        {
            "qID": 256,
            "qName": "В состав ресничного узла входят",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "чувствительные волокна носоресничного нерва",
                "парасимпатические волокна глазодвигательного нерва",
                "симпатические волокна сплетения внутренней сонной артерии"
            ]
        },
        {
            "qID": 257,
            "qName": "Зрительный тракт заканчивается у",
            "rA": [
                "коленчатых тел"
            ],
            "wA": [
                "шпорной борозды",
                "подушки зрительных бугров",
                "заднего полюса глазного яблока"
            ]
        },
        {
            "qID": 258,
            "qName": "При поверхностной инъекции",
            "rA": [
                "краснота глаза уменьшается по мере приближения к роговице"
            ],
            "wA": [
                "краснота выражена в области ресничных краев век",
                "краснота глаза выражена вокруг роговицы",
                "краснота одинаковой интенсивности по всем секторам"
            ]
        },
        {
            "qID": 259,
            "qName": "С целью выявления функции слезной железы проводят",
            "rA": [
                "пробу с полоской фильтровальной бумаги шириной 0,5 см"
            ],
            "wA": [
                "пробу с флюоресцеином",
                "слезно носовую пробу с колларголом",
                "тонометрию"
            ]
        },
        {
            "qID": 260,
            "qName": "Гониоскопия   метод, предназначенный для осмотра...",
            "rA": [
                "угла передней камеры"
            ],
            "wA": [
                "конъюнктивы",
                "глазного дна",
                "хрусталика"
            ]
        },
        {
            "qID": 261,
            "qName": "С целью определения передне заднего размера глазного яблока применяется",
            "rA": [
                "эхобиометрия"
            ],
            "wA": [
                "окулография",
                "пахиметрия",
                "периметрия"
            ]
        },
        {
            "qID": 262,
            "qName": "Светоощущение с неправильной проекцией расценивается в случае, когда больной",
            "rA": [
                "неправильно определяет проекцию света хотя бы с одной стороны"
            ],
            "wA": [
                "не ощущает света",
                "правильно определяет проекцию света",
                "не может прочитать 1 строчку по таблице Сивцева  Головина"
            ]
        },
        {
            "qID": 263,
            "qName": "Восприятие глазом того или иного цветового тона зависит",
            "rA": [
                "от длины волны излучения"
            ],
            "wA": [
                "от степени освещенности",
                "от остроты зрения",
                "ничего из вышеперечисленного"
            ]
        },
        {
            "qID": 264,
            "qName": "Абсолютная световая чувствительность характеризуется",
            "rA": [
                "порогом восприятия света"
            ],
            "wA": [
                "порогом различения",
                "длиной волны излучения",
                "границами поля зрения"
            ]
        },
        {
            "qID": 265,
            "qName": "Симптоматическая гемералопия связана",
            "rA": [
                "с поражением фоторецепторов сетчатки"
            ],
            "wA": [
                "с гиповитаминозом витамина А",
                "с гиповитаминозом витамина С",
                "с поражением симпатической системы"
            ]
        },
        {
            "qID": 266,
            "qName": "Рефракцией называется ...",
            "rA": [
                "преломление света в оптической системе"
            ],
            "wA": [
                "способность глаза видеть при минимальном освещении",
                "восприятие длины волны излучения",
                "способность определять размеры и глубину предмета"
            ]
        },
        {
            "qID": 267,
            "qName": "Для коррекции астигматизма применяют",
            "rA": [
                "собирающие цилиндрические линзы"
            ],
            "wA": [
                "рассеивающие сферические линзы",
                "собирающие сферические линзы",
                "бифокальные линзы"
            ]
        },
        {
            "qID": 268,
            "qName": "Преломляющая сила оптической системы по мере роста глаза",
            "rA": [
                "уменьшается"
            ],
            "wA": [
                "увеличивается",
                "не изменяется",
                "может изменяться по разному"
            ]
        },
        {
            "qID": 269,
            "qName": "Пресбиопия развивается в связи с",
            "rA": [
                "уменьшением аккомодативной способности хрусталика"
            ],
            "wA": [
                "углублением передней камеры",
                "дистрофическими изменениями в радужке",
                "ростом глазного яблока"
            ]
        },
        {
            "qID": 270,
            "qName": "Для укрепления склеры при миопии применяется",
            "rA": [
                "введение в тенноново пространство взвеси измельченного гомохряща"
            ],
            "wA": [
                "плеоптика",
                "пломбирование склеры",
                "лазерное лечение"
            ]
        },
        {
            "qID": 271,
            "qName": "Птоз верхнего века может быть",
            "rA": [
                "при параличе мышцы, поднимающей верхнее веко"
            ],
            "wA": [
                "при параличе зрительного нерва",
                "при параличе блокового нерва",
                "при параличе отводящего нерва"
            ]
        },
        {
            "qID": 272,
            "qName": "Колобома века   это",
            "rA": [
                "дефект края века в виде треугольной или полукруглой выемки"
            ],
            "wA": [
                "укорочение и сужение глазной щели",
                "полулунная кожная складка у внутренних углов глазной щели",
                "опущение верхнего века"
            ]
        },
        {
            "qID": 273,
            "qName": "Среди заболеваний конъюнктивы выделяют все группы, кроме:",
            "rA": [
                "помутнения"
            ],
            "wA": [
                "воспаления",
                "дистрофии",
                "новообразования"
            ]
        },
        {
            "qID": 274,
            "qName": "С целью диагностики конъюнктивита необходимо определить",
            "rA": [
                "флору и чувствительность к антибиотикам"
            ],
            "wA": [
                "угол передней камеры",
                "измерить внутриглазное давление",
                "размеры глазного яблока"
            ]
        },
        {
            "qID": 275,
            "qName": "Возбудителем острого эпидемического кератоконъюнктивита являются",
            "rA": [
                "аденовирусы"
            ],
            "wA": [
                "бактерии",
                "хламидии",
                "риновирусы"
            ]
        },
        {
            "qID": 276,
            "qName": "Гонобленнорея у новорожденных развивается",
            "rA": [
                "на 2 3 день жизни"
            ],
            "wA": [
                "в первые часы жизни",
                "в 1 ый день жизни",
                "в первые две недели жизни"
            ]
        },
        {
            "qID": 277,
            "qName": "Клинический признак дифтерийного конъюнктивита",
            "rA": [
                "наличие серых налетов пленок, спаянных с подлежащей тканью"
            ],
            "wA": [
                "боль при движении глазного яблока",
                "ухудшения зрения вблизь",
                "диплопия"
            ]
        },
        {
            "qID": 278,
            "qName": "Врожденные аномалии развития сосудистой оболочки чаще всего проявляются",
            "rA": [
                "колобомами"
            ],
            "wA": [
                "птозом",
                "иритами",
                "циклитами"
            ]
        },
        {
            "qID": 279,
            "qName": "При вовлечении в воспалительный процесс ресничного тела появляются",
            "rA": [
                "преципитаты на задней поверхности роговицы"
            ],
            "wA": [
                "геморрагии",
                "фолликулы",
                "хемоз"
            ]
        },
        {
            "qID": 280,
            "qName": "При периферическом увейте отмечается воспаление",
            "rA": [
                "плоской части ресничного тела и прилежащей части хориоидеи"
            ],
            "wA": [
                "зрачковой зоны радужки",
                "периферии радужной оболочки",
                "зрачка"
            ]
        },
        {
            "qID": 281,
            "qName": "Помутнение стекловидного тела при иридоциклитах может отмечаться вследствие",
            "rA": [
                "обильной серозной экссудации"
            ],
            "wA": [
                "развития заращения зрачка",
                "образования преципитатов",
                "вовлечения в воспалительный процесс хрусталика"
            ]
        },
        {
            "qID": 282,
            "qName": "При генерализации токсоплазмозного процесса в последние месяцы беременности отмечаются следующие изменения:",
            "rA": [
                "хориоретиниты"
            ],
            "wA": [
                "отслойки сетчатки",
                "анофтальм",
                "эмболия центральной артерии сетчатки"
            ]
        },
        {
            "qID": 283,
            "qName": "Жалобы больных при отслойке сетчатки на ...",
            "rA": [
                "выпадение поля зрения"
            ],
            "wA": [
                "гемералопию",
                "боль в глазу",
                "радужные круги при взгляде на источник света"
            ]
        },
        {
            "qID": 284,
            "qName": "В случае поздней диагностики меланомы хориоидеи может развиваться все, кроме",
            "rA": [
                "периферического увеита"
            ],
            "wA": [
                "вторичной глаукомы",
                "прорастания опухоли в глазницу",
                "отслойки сетчатки"
            ]
        },
        {
            "qID": 285,
            "qName": "Диагностика отслойки сетчатки производится с помощью",
            "rA": [
                "ультразвукового метода"
            ],
            "wA": [
                "рентгенологического метода",
                "тонометрии",
                "гониоскопа"
            ]
        },
        {
            "qID": 286,
            "qName": "Для неврита зрительного нерва характерно",
            "rA": [
                "сужение поля зрения, особенно на красный цвет"
            ],
            "wA": [
                "резкая боль",
                "ощущение песка в глазах",
                "выпадение ресниц"
            ]
        },
        {
            "qID": 287,
            "qName": "Глубина передней камеры при остром приступе глаукомы",
            "rA": [
                "мелкая"
            ],
            "wA": [
                "нормальная",
                "глубокая",
                "неравномерная"
            ]
        },
        {
            "qID": 288,
            "qName": "Глаукоматозная атрофия зрительного нерва проявляется",
            "rA": [
                "побледнением диска зрительного нерва с экскавацией"
            ],
            "wA": [
                "гиперемией диска зрительного нерва с проминенцией",
                "стушеванностью границ диска зрительного нерва",
                "явлениями застойного диска зрительного нерва"
            ]
        },
        {
            "qID": 289,
            "qName": "Методы лечения глаукомы",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "консервативное",
                "хирургическое",
                "лазерное"
            ]
        },
        {
            "qID": 290,
            "qName": "Факогенная глаукома может возникнуть в случаях, кроме",
            "rA": [
                "зрелой возрастной катаракты"
            ],
            "wA": [
                "патологического увеличения хрусталика при незрелой старческой катаракте",
                "перезрелой старческой катаракте",
                "смещения хрусталика (вывихе в переднюю камеру)"
            ]
        },
        {
            "qID": 291,
            "qName": "С целью купирования острого приступа глаукомы назначают",
            "rA": [
                "1% раствор пилокарпина по схеме"
            ],
            "wA": [
                "1% раствор атропина",
                "0,25% раствор левомецитина",
                "2,5% раствор ирифрина"
            ]
        },
        {
            "qID": 292,
            "qName": "Для усиления гипотензивного действия тимолола его можно сочетать",
            "rA": [
                "с миотиками"
            ],
            "wA": [
                "с мидриатиками",
                "с антибиотиками",
                "с кератопротекторами"
            ]
        },
        {
            "qID": 293,
            "qName": "Под влиянием миотиков происходит все, кроме",
            "rA": [
                "уменьшения содержания воды в тканях"
            ],
            "wA": [
                "миоза",
                "оттягивания радужной оболочки от угла передней камеры",
                "открытия закрытых отделов угла передней камеры"
            ]
        },
        {
            "qID": 294,
            "qName": "Фистулизирующие операции применяются при",
            "rA": [
                "первичной глаукоме"
            ],
            "wA": [
                "катаракте",
                "отслойке сетчатки"
            ]
        },
        {
            "qID": 295,
            "qName": "Цель иридэктомии",
            "rA": [
                "устранение последствий зрачкового блока"
            ],
            "wA": [
                "устранение функционального блока венозного синуса склеры",
                "создание нового пути оттока из передней камеры глаза в подконъюнктивальное пространство",
                "активация увеасклерального оттока"
            ]
        },
        {
            "qID": 296,
            "qName": "При катаракте возможно появление жалоб на",
            "rA": [
                "снижение зрения"
            ],
            "wA": [
                "локальную боль",
                "боль при движении глазного яблока",
                "появление центральной скотомы"
            ]
        },
        {
            "qID": 297,
            "qName": "При зрелой стадии катаракты при боковом освещении хрусталик имеет",
            "rA": [
                "серо белый цвет с перламутровым оттенком"
            ],
            "wA": [
                "вид жидкой массы молочного цвета",
                "гомогенный вид грязно серого цвета",
                "неравномерное помутнение"
            ]
        },
        {
            "qID": 298,
            "qName": "Осложненная катаракта возникает при",
            "rA": [
                "всех перечисленных случаях"
            ],
            "wA": [
                "хроническом вялотекущем увейте",
                "глаукоме",
                "увеопатиях"
            ]
        },
        {
            "qID": 299,
            "qName": "Консервативная терапия при катаракте назначается с целью",
            "rA": [
                "предупреждения прогрессирования начальных стадий помутнения хрусталика"
            ],
            "wA": [
                "снижения внутриглазного давления",
                "рассасывания помутнения",
                "как альтернатива хирургического лечения"
            ]
        },
        {
            "qID": 300,
            "qName": "Методы лечения катаракты",
            "rA": [
                "факоэмульсификация"
            ],
            "wA": [
                "энуклеация",
                "пластика",
                "витрэктомия"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
