var tests = {
    "tests": [
        {
            "qID": 301,
            "qName": "При афакии передняя камера",
            "rA": [
                "глубокая"
            ],
            "wA": [
                "мелкая",
                "неравномерной глубины",
                "нормальная"
            ]
        },
        {
            "qID": 302,
            "qName": "К врожденным патологическим состояниям стекловидного тела относят",
            "rA": [
                "гиперплазию стекловидного тела"
            ],
            "wA": [
                "гемофтальм",
                "колобому",
                "гифему"
            ]
        },
        {
            "qID": 303,
            "qName": "Для диабетической катаракты характерно",
            "rA": [
                "быстрое прогрессирование"
            ],
            "wA": [
                "медленное прогрессирование",
                "отсутствие прогрессирования",
                "очень медленное прогрессирование"
            ]
        },
        {
            "qID": 304,
            "qName": "Изменения на глазном дне при заболеваниях почек следующие",
            "rA": [
                "фигура «звезды» в макулярной области"
            ],
            "wA": [
                "экскавация ДЗН",
                "симптом Салюса Гунна",
                "микроаневризмы"
            ]
        },
        {
            "qID": 305,
            "qName": "При синдроме Горнера отмечается",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "энофтальм",
                "птоз",
                "миоз"
            ]
        },
        {
            "qID": 306,
            "qName": "К злокачественным опухолям органа зрения относятся все, кроме",
            "rA": [
                "гемангиомы"
            ],
            "wA": [
                "карциномы",
                "саркомы",
                "меланомы"
            ]
        },
        {
            "qID": 307,
            "qName": "Для диагностики мелких инородных тел в переднем отделе глаза применяют",
            "rA": [
                "бесскелетную рентгенографию по Фогту"
            ],
            "wA": [
                "диафаноскопию",
                "офтальмоскопию",
                "пахиметрию"
            ]
        },
        {
            "qID": 308,
            "qName": "С целью анестезии роговицы необходимо закапать",
            "rA": [
                "0,25% раствор дикаина"
            ],
            "wA": [
                "0,25% раствор тимолола",
                "0,25% раствор левомецитина",
                "0,25% раствор атропина"
            ]
        },
        {
            "qID": 309,
            "qName": "Травматическая катаракта развивается вследствие",
            "rA": [
                "проникновения влаги передней камеры через поврежденную капсулу хрусталика"
            ],
            "wA": [
                "развития аутоаллергических процессов",
                "понижения внутриглазного давления",
                "повышения внутриглазного давления"
            ]
        },
        {
            "qID": 310,
            "qName": "Явления халькоза и сидероза чаще проявляются",
            "rA": [
                "через несколько месяцев"
            ],
            "wA": [
                "через 1 сутки",
                "через несколько лет",
                "через 14 суток"
            ]
        },
        {
            "qID": 311,
            "qName": "Симпатическое воспаление представляет собой",
            "rA": [
                "вялотекущий фибринозно пластический увеит"
            ],
            "wA": [
                "склерозирующий кератит",
                "эписклерит",
                "отслойку сетчатки"
            ]
        },
        {
            "qID": 312,
            "qName": "При воздействии сильного инфракрасного облучения может развиться",
            "rA": [
                "электроофтальмия"
            ],
            "wA": [
                "огневая катаракта",
                "отек сетчатки",
                "глаукома"
            ]
        },
        {
            "qID": 313,
            "qName": "Нижняя прямая мышца иннервируется ... нервом",
            "rA": [
                "глазодвигательным"
            ],
            "wA": [
                "отводящим",
                "блоковым",
                "зрительным"
            ]
        },
        {
            "qID": 314,
            "qName": "Слезное озеро ограничивается",
            "rA": [
                "внутренним углом глазной щелш"
            ],
            "wA": [
                "наружным углом глазной щели",
                "и тем, и другим",
                "ни тем, ни другим"
            ]
        },
        {
            "qID": 315,
            "qName": "Верхняя орбитопальпебральная складка втягивается вглубь прикрепляющимися к ней волокнами",
            "rA": [
                "мышцы, поднимающей верхнее веко"
            ],
            "wA": [
                "мышцы, суживающей зрачок",
                "мышцы, расширяющей зрачок",
                "круговой мышцы"
            ]
        },
        {
            "qID": 316,
            "qName": "Длина слезного мешка составляет ... мм",
            "rA": [
                "10 12"
            ],
            "wA": [
                "1 3",
                "6  8",
                "21 26"
            ]
        },
        {
            "qID": 317,
            "qName": "Слезная артерия кровоснабжает все, кроме",
            "rA": [
                "внутренние отделы верхнего века"
            ],
            "wA": [
                "слезную железу",
                "наружные отделы верхнего века",
                "наружные отделы нижнего века"
            ]
        },
        {
            "qID": 318,
            "qName": "К двигательным нервам относятся все, кроме",
            "rA": [
                "зрительного нерва"
            ],
            "wA": [
                "глазодвигательного нерва",
                "блокового нерва",
                "отводящнго нерва"
            ]
        },
        {
            "qID": 319,
            "qName": "Передняя и задняя камеры глазного яблока разделяются",
            "rA": [
                "радужкой"
            ],
            "wA": [
                "хрусталиком",
                "стекловидным телом",
                "лимбом"
            ]
        },
        {
            "qID": 320,
            "qName": "Связки, поддерживающие хрусталик прикрепляются к ...",
            "rA": [
                "ресничному телу"
            ],
            "wA": [
                "склере",
                "лимбу",
                "радужке"
            ]
        },
        {
            "qID": 321,
            "qName": "Сосудистая система хориоидеи представлена ... артериями",
            "rA": [
                "задними короткими ресничными"
            ],
            "wA": [
                "задними длинными ресничными",
                "передними ресничными",
                "центральной артерией сетчатки"
            ]
        },
        {
            "qID": 322,
            "qName": "По химическому составу стекловидное тело сходно с ...",
            "rA": [
                "цереброспинальной жидкостью"
            ],
            "wA": [
                "камерной влагой",
                "слезой",
                "ни тем, ни другим"
            ]
        },
        {
            "qID": 323,
            "qName": "Изнутри к пигментному эпителию сетчатки прилегают... клетки",
            "rA": [
                "нейроэпителия"
            ],
            "wA": [
                "ганглиозные",
                "биполярные",
                "ни одни из перечисленных"
            ]
        },
        {
            "qID": 324,
            "qName": "Светоощущение осуществляется",
            "rA": [
                "палочками"
            ],
            "wA": [
                ">колбочками",
                "и теми, и другими",
                "ни теми, ни другими"
            ]
        },
        {
            "qID": 325,
            "qName": "Гетеронимная гемианопсия характеризуется выпадением",
            "rA": [
                "височных половин поля зрения"
            ],
            "wA": [
                "височной половины в одном глазу и носовой",
                "в другом",
                "участков поля зрения различной формы",
                "поля зрения на одном глазу"
            ]
        },
        {
            "qID": 326,
            "qName": "Определение у больного светощущения проводят с помощью ...",
            "rA": [
                "офтальмоскопа"
            ],
            "wA": [
                "рефрактометра",
                "кератометра",
                "кампиметра"
            ]
        },
        {
            "qID": 327,
            "qName": "Слияние (фузия) двойных изображений в единое является функцией ... зрения",
            "rA": [
                "бинокулярного"
            ],
            "wA": [
                "центрального",
                "периферического",
                "монокулярного"
            ]
        },
        {
            "qID": 328,
            "qName": "Лучи после прохождения оптических сред концентрируются на сетчатке при ....",
            "rA": [
                "эмметропии"
            ],
            "wA": [
                "миопии",
                "гиперметропии",
                "анизометропии"
            ]
        },
        {
            "qID": 329,
            "qName": "Слабая преломляющая способность оптических сред глаза характерна",
            "rA": [
                "для гиперметропии"
            ],
            "wA": [
                "для миопии",
                "для астигматизма",
                "для эмметропии"
            ]
        },
        {
            "qID": 330,
            "qName": "Гиперметропия корригируется",
            "rA": [
                "собирающими сферическими линзами"
            ],
            "wA": [
                "рассеивающими сферическими линзами",
                "призматическими линзами",
                "цилиндрическими линзами"
            ]
        },
        {
            "qID": 331,
            "qName": "50 летнему больному с гиперметропической рефракцией +2,0D необходимо выписать очки для близи",
            "rA": [
                "+ 4,0 D"
            ],
            "wA": [
                "+ 1,0 D",
                "+ 2,0 D",
                "+ 3,0 D"
            ]
        },
        {
            "qID": 332,
            "qName": "При астигматизме ....",
            "rA": [
                "преломленные глазом лучи не могут собраться в одну точку"
            ],
            "wA": [
                "после преломления оптической системой могут фокусироваться только за сетчаткой",
                "параллельно идущие лучи сходятся перед сетчаткой",
                "преломленные лучи фокусируются на сетчатке"
            ]
        },
        {
            "qID": 333,
            "qName": "При миопии в условиях циклоплегии острота зрения",
            "rA": [
                "не изменяется"
            ],
            "wA": [
                "улучшается",
                "ухудшается",
                "становится больше нормы"
            ]
        },
        {
            "qID": 334,
            "qName": "При прогрессирующей миопии проводят",
            "rA": [
                "укрепление склеры"
            ],
            "wA": [
                "циклодиатермокоагуляцию",
                "фистулизирующие операции",
                "теномиопластику"
            ]
        },
        {
            "qID": 335,
            "qName": "При паралитическом косоглазии больные жалуются на ...",
            "rA": [
                "двоение"
            ],
            "wA": [
                "боль при движениях глаз",
                "чувство инородного тела",
                "покраснение глаза"
            ]
        },
        {
            "qID": 336,
            "qName": "Содружественное косоглазие характеризуется ...",
            "rA": [
                "первичный угол отклонения равен вторичному"
            ],
            "wA": [
                "ограничением или отсутствием подвижности глаза в сторону пораженной мышцы",
                "первичный угол отклонения меньше вторичного",
                "наличием двоения"
            ]
        },
        {
            "qID": 337,
            "qName": "К заболеваниям нервно мышечного аппарата век относятся все, кроме",
            "rA": [
                "блефарохалазиса"
            ],
            "wA": [
                "паралича круговой мышцы век",
                "птоза",
                "выворота век"
            ]
        },
        {
            "qID": 338,
            "qName": "Лечение ячменя должно включать",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "сульфаниламиды",
                "сухое тепло",
                "УВЧ терапия"
            ]
        },
        {
            "qID": 339,
            "qName": "Характерный признак острого эпидемического конъюнктивита",
            "rA": [
                "вовлечение в процесс конъюнктивы глазного яблока"
            ],
            "wA": [
                "наличие пленок, плотно спаянных с подлежащей тканью",
                "пролиферативное воспаление мейбомиевой железы и хряща вокруг него",
                "складка истонченной кожи над наружным углом глазной щели"
            ]
        },
        {
            "qID": 340,
            "qName": "Гемангиома может быть",
            "rA": [
                "всеми перечисленными"
            ],
            "wA": [
                "капиллярной",
                "ветвистой",
                "кавернозной"
            ]
        },
        {
            "qID": 341,
            "qName": "В сканирование является",
            "rA": [
                "двухмерным акустическим исследованием"
            ],
            "wA": [
                "одномерной эхографией",
                "графической записью потенциалов",
                "методом осмотра глазного дна"
            ]
        },
        {
            "qID": 342,
            "qName": "При поверхностной инъекции конъюнктива глазного яблока имеет",
            "rA": [
                "ярко красный цвет"
            ],
            "wA": [
                "сиренево фиолетовый оттенок",
                "желтоватый оттенок",
                "темно бордовый цвет"
            ]
        },
        {
            "qID": 343,
            "qName": "Дакриоаденит является осложнением общих инфекций",
            "rA": [
                "всех перечисленных"
            ],
            "wA": [
                "гриппа",
                "ангины",
                "эпидемического паротита"
            ]
        },
        {
            "qID": 344,
            "qName": "Положительная канальцевая проба свидетельствует",
            "rA": [
                "о сохранении присасывающей функции канальцев"
            ],
            "wA": [
                "о достаточном объеме слезы",
                "об отсутствии проходимости слезной жидкости",
                "о нормальной функции слезного мешка"
            ]
        },
        {
            "qID": 345,
            "qName": "При эпискперитах в процесс вовлекаются",
            "rA": [
                "преимущественно поверхностные слои склеры"
            ],
            "wA": [
                "глубокие слои склеры",
                "роговица",
                "конъюнктива в этом секторе склеры"
            ]
        },
        {
            "qID": 346,
            "qName": "Для гематогенных кератитов туберкулезной этиологии характерно все, кроме",
            "rA": [
                "нарушения чувствительности роговицы"
            ],
            "wA": [
                "более вялого течения",
                "поражения, как правило, одного глаза",
                "формирования в исходе грубого бельма"
            ]
        },
        {
            "qID": 347,
            "qName": "При лечении кератомикозов необходимо исключить применение",
            "rA": [
                "кортикостероидов"
            ],
            "wA": [
                "антимикотических средств",
                "криоаппликаций",
                "витаминов"
            ]
        },
        {
            "qID": 348,
            "qName": "К глубоким Формам послепервичного герпетического кератита относятся все, кроме",
            "rA": [
                "древовидного кератита"
            ],
            "wA": [
                "метагерпетического кератита",
                "дисковидного кератита",
                "глубокого диффузного кератита"
            ]
        },
        {
            "qID": 349,
            "qName": "Лентовидная дегенерация роговицы чаще развивается",
            "rA": [
                "при болезни Стилла"
            ],
            "wA": [
                "при эписклерите",
                "при катаракте",
                "при пузырьковом кератите"
            ]
        },
        {
            "qID": 350,
            "qName": "С целью купирования приступа при синдроме глаукомоциклитических кризов необходимы",
            "rA": [
                "кортикостероиды и мидриатики"
            ],
            "wA": [
                "ангиопротекторы",
                "кортикостероиды и миотики",
                "миотики"
            ]
        },
        {
            "qID": 351,
            "qName": "Для диагностики новообразований сосудистой оболочки применяют",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "эхоофтальмографию",
                "радиоизотопную диагностику",
                "флюоресцентную ангиографию"
            ]
        },
        {
            "qID": 352,
            "qName": "При слабовыраженной симптоматике для диагностики центрального серозного хориоретинита целесообразно применение",
            "rA": [
                "флюоресцентной ангиографии"
            ],
            "wA": [
                "биомикроскопии",
                "ретгендиагностика по Комбергу Балтину",
                "диафаноскопии"
            ]
        },
        {
            "qID": 353,
            "qName": "Симптом «раздавленного помидора» наблюдается",
            "rA": [
                "при тромбозе центральной вены сетчатки"
            ],
            "wA": [
                "при неврите зрительного нерва",
                "при эмболии центральной артерии сетчатки",
                "при застойном диске зрительного нерва"
            ]
        },
        {
            "qID": 354,
            "qName": "Для ретинальных кровоизлияний характерен",
            "rA": [
                "ярко красный цвет"
            ],
            "wA": [
                "красновато серый",
                "желто красный цвет",
                "желтовато зеленоватый цвет"
            ]
        },
        {
            "qID": 355,
            "qName": "Для ретиноваскулитов ревматической этиологии характерно",
            "rA": [
                "наличие муфт"
            ],
            "wA": [
                "цианотичность сетчатки",
                "бледность диска зрительного нерва",
                "обширные кровоизлияния"
            ]
        },
        {
            "qID": 356,
            "qName": "Для лечения отслойки сетчатки применяются",
            "rA": [
                "вдавление склеры силикиновой губкой"
            ],
            "wA": [
                "факоэмульсификацию",
                "склеро пластику",
                "гониотомию"
            ]
        },
        {
            "qID": 357,
            "qName": "Ишемия диска зрительного нерва является",
            "rA": [
                "следствием нарушения кровообращения в системе артерий, питающих нерв"
            ],
            "wA": [
                "в результате заполнения сосудистой воронки экссудатом",
                "результатом повышения внутричерепного давления",
                "осложнением отслойки сетчатки"
            ]
        },
        {
            "qID": 358,
            "qName": "Больные с застойным диском предъявляют жалобы",
            "rA": [
                "зрительные функции долго остаются в норме"
            ],
            "wA": [
                "на резкое снижение зрения",
                "на кратковременное затуманивание зрения",
                "на снижение зрения на отдельные цвета"
            ]
        },
        {
            "qID": 359,
            "qName": "Офтальмоскопическая картина неврита зрительного нерва характеризуется",
            "rA": [
                "всем перечисленным"
            ],
            "wA": [
                "гиперемией диска зрительного нерва",
                "стушеванностью границ диска зрительного нерва",
                "умеренным расширением артерий и вен"
            ]
        },
        {
            "qID": 360,
            "qName": "Ретинобластома берет начало",
            "rA": [
                "в зернистых слоях сетчатки"
            ],
            "wA": [
                "в колбочках",
                "в палочках",
                "в области диска зрительного нерва"
            ]
        },
        {
            "qID": 361,
            "qName": "При симптоме Штельвага отмечается",
            "rA": [
                "редкое мигание"
            ],
            "wA": [
                "широкое раскрытие глазных щелей, при котором над роговицей видна часть склеры",
                "ослабление конвергенции",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 362,
            "qName": "Риногенные заболевания лежат в основе",
            "rA": [
                "хронических дакриоциститов"
            ],
            "wA": [
                "конъюнктивитов",
                "отслойки сетчатки",
                "помутнения хрусталика"
            ]
        },
        {
            "qID": 363,
            "qName": "Заболевания тройничного нерва часто сопровождаются",
            "rA": [
                "нейропаралитическим кератитом"
            ],
            "wA": [
                "отслойкой сетчатки",
                "глаукомой",
                "иридоциклитом"
            ]
        },
        {
            "qID": 364,
            "qName": "Для опухолей мозга типичны",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "застойные диски",
                "гемианопсии",
                "зрительные расстройства коркового происхождения"
            ]
        },
        {
            "qID": 365,
            "qName": "Синдром верхней глазничной щели включает все, кроме",
            "rA": [
                "изменения цвета радужки"
            ],
            "wA": [
                "экзофтальма",
                "полной неподвижности глазного яблока",
                "резкого снижения чувствительности роговицы и кожи век"
            ]
        },
        {
            "qID": 366,
            "qName": "Методом в «проходящим свете» исследуют",
            "rA": [
                "хрусталик"
            ],
            "wA": [
                "радужку",
                "ДЗН",
                "сетчатку"
            ]
        },
        {
            "qID": 367,
            "qName": "В начальной стадии корковой катаракты отмечаются следующие изменения",
            "rA": [
                "субкапсулярные вакуоли и расслоение хрусталиковых волокон"
            ],
            "wA": [
                "пигмент на передней капсуле и расслоение хрусталиковых волокон",
                "«оводнение» хрусталика",
                "все перечисленное"
            ]
        },
        {
            "qID": 368,
            "qName": "При экстракапсулярном способе экстракции катаракты извлекаются",
            "rA": [
                "ядро и хрусталиковые массы"
            ],
            "wA": [
                "задняя капсула хрусталика",
                "хрусталик в капсуле",
                "стекловидное тело"
            ]
        },
        {
            "qID": 369,
            "qName": "Отсутствие хрусталика называется ...",
            "rA": [
                "афакия"
            ],
            "wA": [
                "артифакия",
                "хемоз",
                "гифема"
            ]
        },
        {
            "qID": 370,
            "qName": "Водянистая влага образуется в",
            "rA": [
                "цилиарном теле"
            ],
            "wA": [
                "трабекулах",
                "склеральном синусе",
                "лимбе"
            ]
        },
        {
            "qID": 371,
            "qName": "При повышении внутриглазного давления",
            "rA": [
                "ухудшаются условия для циркуляции крови по сосудам глаза"
            ],
            "wA": [
                "появляются округлые утолщения по ходу нервных волокон",
                "диск пропитывается экссудатом",
                "подвергается раздражению один и тот же участок сетчатки"
            ]
        },
        {
            "qID": 372,
            "qName": "В классификации глаукомы выделены следующие стадии, кроме",
            "rA": [
                "незрелая"
            ],
            "wA": [
                "начальная",
                "далекозашедшая",
                "терминальная"
            ]
        },
        {
            "qID": 373,
            "qName": "Главным звеном в патогенезе закрытоугольной формы первичной глаукомы",
            "rA": [
                "блокада угла передней камеры корнем радужки"
            ],
            "wA": [
                "нарушение нормальной функции дренажной системы глаза",
                "патологическая проницаемость капилляров сетчатой и сосудистой оболочек глазного яблока",
                "помутнение хрусталика"
            ]
        },
        {
            "qID": 374,
            "qName": "Болевой синдром при начальной стадии открытоугольной глаукомы",
            "rA": [
                "отсутствует"
            ],
            "wA": [
                "локальная боль",
                "головная боль",
                "иррадиирующая боль"
            ]
        },
        {
            "qID": 375,
            "qName": "Для ранней диагностики закрытоугольной глаукомы используют",
            "rA": [
                "нагрузочную пробу"
            ],
            "wA": [
                "пробу Ширмера",
                "пробу Веста",
                "пробу Норна"
            ]
        },
        {
            "qID": 376,
            "qName": "К инстилляционным Формам ингибиторов карбоангидразы относится",
            "rA": [
                "азопт"
            ],
            "wA": [
                "пилокарпин",
                "глицерол",
                "ксалатан"
            ]
        },
        {
            "qID": 377,
            "qName": "Вторичная увеальная глаукома развивается в результате",
            "rA": [
                "перенесенного иридоциклита"
            ],
            "wA": [
                "набухающей катаракты",
                "тромбоза центральной вены сетчатки",
                "внутриглазного новообразования"
            ]
        },
        {
            "qID": 378,
            "qName": "Основной частью Фистулизирующей операции является",
            "rA": [
                "формирование лимбального отверстия"
            ],
            "wA": [
                "выкраивание бельма",
                "замена стекловидного тела",
                "удаление мутного хрусталика"
            ]
        },
        {
            "qID": 379,
            "qName": "При СИНУСОТОМИИ производится",
            "rA": [
                "вскрытие наружной стенки синуса"
            ],
            "wA": [
                "разрез внутренней стенки синуса",
                "рассечение угла передней камеры",
                "удаление мутного хрусталика"
            ]
        },
        {
            "qID": 380,
            "qName": "Для уточнения локализации амагнитного осколка применяют",
            "rA": [
                "ультразвук"
            ],
            "wA": [
                "экзоофтальмометр",
                "синоптофор",
                "диафаноскопию с применением волоконной оптики"
            ]
        },
        {
            "qID": 381,
            "qName": "Гемофтальм развивается вследствие",
            "rA": [
                "проникновения крови в стекловидное тело из сосудов цилиарного тела и сетчатки"
            ],
            "wA": [
                "блокады зрачка хрусталиком",
                "проникновение крови в переднюю камеру",
                "проникновение крови под конъюнктиву"
            ]
        },
        {
            "qID": 382,
            "qName": "При посттравматических дырчатых разрывах сетчатки показана",
            "rA": [
                "лазеркоагуляция"
            ],
            "wA": [
                "синусотомия",
                "кератотомия",
                "иридэктомия"
            ]
        },
        {
            "qID": 383,
            "qName": "При ожоге 1 ой степени наблюдаются",
            "rA": [
                "поверхностные эрозии роговицы"
            ],
            "wA": [
                "некроз конъюнктивы",
                "бельмо роговица",
                "неврит"
            ]
        },
        {
            "qID": 384,
            "qName": "При ожогах I1 IV степени следует вводить",
            "rA": [
                "противостолбнячную сыворотку по Безредке"
            ],
            "wA": [
                "атропин",
                "эуфиллин",
                "адреналин"
            ]
        },
        {
            "qID": 385,
            "qName": "Профилактика профессиональных поражений органа зрения заключается",
            "rA": [
                "и то, и другое"
            ],
            "wA": [
                "в строжайшем соблюдении правил техники безопасности",
                "неукоснительном соблюдении нормативов предельно допустимых концентраций ядовитых газов, паров и пыли в воздухе рабочих помещений",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 386,
            "qName": "Внутренняя стенка орбиты отделяет глазницу",
            "rA": [
                "от решетчатой пазухи"
            ],
            "wA": [
                "от лобной пазухи",
                "от гайморовой пазухи",
                "от средней черепной ямки"
            ]
        },
        {
            "qID": 387,
            "qName": "Канал зрительного нерва открывается",
            "rA": [
                "в среднюю черепную ямку"
            ],
            "wA": [
                "в ресничный узел",
                "в слезный мешок",
                "в височную ямку"
            ]
        },
        {
            "qID": 388,
            "qName": "Круговая мышца век иннервируется",
            "rA": [
                "лицевым нервом"
            ],
            "wA": [
                "блоковым нервом",
                "отводящим нервом",
                "зрительным нервом"
            ]
        },
        {
            "qID": 389,
            "qName": "Конъюнктива выстилает",
            "rA": [
                "заднюю поверхность век и склеру",
                "склеру и роговицу"
            ],
            "wA": [
                "роговицу",
                "ресничное тело"
            ]
        },
        {
            "qID": 390,
            "qName": "Слезная железа располагается",
            "rA": [
                "под верхне наружным краем глазницы"
            ],
            "wA": [
                "в височной ямке",
                "в орбите",
                "у медиального края орбиты"
            ]
        },
        {
            "qID": 391,
            "qName": "ФУНКЦИИ роговицы",
            "rA": [
                "светопроведение и светопреломление"
            ],
            "wA": [
                "образование внутриглазной жидкости",
                "светопроведение и световосприятие",
                "светорегуляция"
            ]
        },
        {
            "qID": 392,
            "qName": "Краевая петлистая сеть образуется за счет",
            "rA": [
                "лимбальных сосудов"
            ],
            "wA": [
                "слезной артерии",
                "ветвей задних коротких ресничных артерий",
                "центральной артерией сетчатки"
            ]
        },
        {
            "qID": 393,
            "qName": "Образование ядра в хрусталике приводит",
            "rA": [
                "к уменьшению объема аккомодации"
            ],
            "wA": [
                "к увеличению объема аккомодации",
                "объем аккомодации не изменяется",
                "ни к одному из перечисленных"
            ]
        },
        {
            "qID": 394,
            "qName": "Ресничное тело участвует",
            "rA": [
                "в аккомодации"
            ],
            "wA": [
                "в светопроведении",
                "в светорегуляции",
                "в световосприятии"
            ]
        },
        {
            "qID": 395,
            "qName": "Сетчатка микроскопически представляет собой цепь нейронов",
            "rA": [
                "всех перечисленных"
            ],
            "wA": [
                "фоторецепторного",
                "ассоциативного",
                "ганглионарного"
            ]
        },
        {
            "qID": 396,
            "qName": "Зрительный нерв относится",
            "rA": [
                "ко II  ой паре черепно мозговых нервов"
            ],
            "wA": [
                "к 1 ой паре черепно мозговых нервов",
                "к III  ой паре черепно мозговых нервов",
                "к IV   ой паре черепно мозговых нервов"
            ]
        },
        {
            "qID": 397,
            "qName": "Задние короткие ресничные артерии питают",
            "rA": [
                "хориоидею"
            ],
            "wA": [
                "радужку",
                "ресничное тело",
                "роговицу"
            ]
        },
        {
            "qID": 398,
            "qName": "Чувствительную иннервацию радужки осуществляет",
            "rA": [
                "тройничный нерв"
            ],
            "wA": [
                "блоковый нерв",
                "отводящий нерв",
                "зрительный нерв"
            ]
        },
        {
            "qID": 399,
            "qName": "Методом в «проходящем свете» исследуют",
            "rA": [
                "прозрачные среды глаза"
            ],
            "wA": [
                "защитный аппарат глаза",
                "глазное дно",
                "подвижность глазного яблока"
            ]
        },
        {
            "qID": 400,
            "qName": "Электроретинография используется как метод диагностики",
            "rA": [
                "при различных заболеваниях сетчатки"
            ],
            "wA": [
                "при различных заболеваниях роговицы",
                "при различных заболеваниях склеры",
                "при различных заболеваниях склеры"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
