var tests = {
    "tests": [
        {
            "qID": 401,
            "qName": "В зрительном анализаторе имеются",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "рецепторный отдел",
                "проводниковый отдел",
                "корковый отдел"
            ]
        },
        {
            "qID": 402,
            "qName": "Центральное зрение осуществляется",
            "rA": [
                "колбочками"
            ],
            "wA": [
                "палочками",
                "роговицей",
                "радужкой"
            ]
        },
        {
            "qID": 403,
            "qName": "Объективные методы исследования остроты зрения основаны",
            "rA": [
                "на появлении оптокинетического нистагма"
            ],
            "wA": [
                "на способности раздражения колбочек при воздействии света",
                "на способности отражения лучей света от рассматриваемых предметов",
                "на способности преломления лучей света"
            ]
        },
        {
            "qID": 404,
            "qName": "Правильная проекция света свидетельствует",
            "rA": [
                "о нормальной функции периферических отделов сетчатки"
            ],
            "wA": [
                "о нормальном цветоощущении",
                "о нормальных границах диска зрительного нерва",
                "о нормальных границах поля зрения"
            ]
        },
        {
            "qID": 405,
            "qName": "Восприятие предметов, окрашенных в красный цвет называется",
            "rA": [
                "эритропсия"
            ],
            "wA": [
                "ксантопсия",
                "хлоропсия",
                "фотопсия"
            ]
        },
        {
            "qID": 406,
            "qName": "Проекция в пространстве диска зрительного нерва называется",
            "rA": [
                "слепое пятно"
            ],
            "wA": [
                "гемианопсия",
                "макула",
                "друза"
            ]
        },
        {
            "qID": 407,
            "qName": "Гемералопия может быть",
            "rA": [
                "симптоматической"
            ],
            "wA": [
                "биназальной",
                "гомонимной",
                "битемпоральной"
            ]
        },
        {
            "qID": 408,
            "qName": "Основной рефлекторный механизм бинокулярного зрения",
            "rA": [
                "фузионный рефлекс"
            ],
            "wA": [
                "мигательный рефлекс",
                "зрачковый рефлекс",
                "световой рефлекс"
            ]
        },
        {
            "qID": 409,
            "qName": "Физическая рефракция характеризует",
            "rA": [
                "преломляющую способность оптической системы глаза"
            ],
            "wA": [
                "положение главного фокуса оптической системы глаза по отношению к сетчатке",
                "способность глаза фокусировать изображение, рассматриваемых предметов независимо от расстояния, на котором находится предмет",
                "расположение главных меридианов глаза"
            ]
        },
        {
            "qID": 410,
            "qName": "Аметропия   это ...",
            "rA": [
                "несоразмерная рефракция"
            ],
            "wA": [
                "соразмерная рефракция",
                "разная рефракция в разных глазах",
                "разновеликое изображение на сетчатках"
            ]
        },
        {
            "qID": 411,
            "qName": "Аккомодация каждого глаза в отдельности называется",
            "rA": [
                "абсолютной"
            ],
            "wA": [
                "относительной",
                "ложной",
                "истинной"
            ]
        },
        {
            "qID": 412,
            "qName": "Непрогрессирующая миопия является",
            "rA": [
                "аномалией рефракции"
            ],
            "wA": [
                "миопической болезнью",
                "соразмерной рефракцией",
                "анизометропией"
            ]
        },
        {
            "qID": 413,
            "qName": "Анизометропией называется ...",
            "rA": [
                "неодинаковая рефракция обоих глаз"
            ],
            "wA": [
                "способность глаза фокусировать изображения рассматриваемых предметов независимо от расстояния, на котором находится предмет",
                "сочетание в одном глазу разных видов рефракций",
                "разные размеры изображения"
            ]
        },
        {
            "qID": 414,
            "qName": "Монолатеральное косоглазие бывает, когда от общей точки фиксации",
            "rA": [
                "постоянно отклоняется один и тот же глаз"
            ],
            "wA": [
                "отклоняется то один, то другой глаз",
                "глаз отклоняется только кнутри",
                "все перечисленное"
            ]
        },
        {
            "qID": 415,
            "qName": "Аккомодационное косоглазие устраняется при ...",
            "rA": [
                "полной коррекции аметропии"
            ],
            "wA": [
                "назначении прямой окклюзии",
                "назначении лазерстимуляции",
                "медикаментозном лечении"
            ]
        },
        {
            "qID": 416,
            "qName": "Основная цель лечения содружественного косоглазия",
            "rA": [
                "восстановление или формирование (отсутствовавших) бинокулярных связей"
            ],
            "wA": [
                "восстановление сумеречного зрения",
                "снижение внутриглазного давления",
                "повышение остроты зрения"
            ]
        },
        {
            "qID": 417,
            "qName": "Энофтальм проявляется",
            "rA": [
                "при переломах стенок глазницы с расхождением костных отломков"
            ],
            "wA": [
                "при параличах и парезах симпатического нерва",
                "при повышении внутриглазного давления",
                "при всех перечисленных"
            ]
        },
        {
            "qID": 418,
            "qName": "Тенонит  это ...",
            "rA": [
                "воспаление влагалища глазного яблока"
            ],
            "wA": [
                "диффузное гнойное во спаление орбитальной клетчатки",
                "воспалительный процесс, захватывающий костную стенку",
                "воспаление наружной оболочки глазного яблока"
            ]
        },
        {
            "qID": 419,
            "qName": "Синдром Горнера   это симптомокомплекс, включающий все, кроме",
            "rA": [
                "мидриаза"
            ],
            "wA": [
                "миоза",
                "птоза",
                "энофтальма"
            ]
        },
        {
            "qID": 420,
            "qName": "Блефарофимоз   это",
            "rA": [
                "укорочение и сужение глазной щели"
            ],
            "wA": [
                "хроническое пролиферативное воспаление хряща века",
                "неполное смыкание глазной щели",
                "опущение верхнего века"
            ]
        },
        {
            "qID": 421,
            "qName": "Первичный очаг инфекции при паратрахоме",
            "rA": [
                "мочеполовые пути"
            ],
            "wA": [
                "глаза",
                "легкие",
                "мелкие суставы"
            ]
        },
        {
            "qID": 422,
            "qName": "Эпидемический кератоконъюнктивит вызывается",
            "rA": [
                "8 ым серотипом аденовирусов"
            ],
            "wA": [
                "хламидиями",
                "палочкой Леффлера",
                "стрептококком"
            ]
        },
        {
            "qID": 423,
            "qName": "При птеригиуме рекомендуется",
            "rA": [
                "оперативное удаление"
            ],
            "wA": [
                "назначение антибиотиков",
                "назначение ферментов",
                "лазерное лечение"
            ]
        },
        {
            "qID": 424,
            "qName": "Хламидии высокочувствительны",
            "rA": [
                "к антибиотикам фторхинолового ряда"
            ],
            "wA": [
                "к кортикостероидам",
                "к цефалоспоринам",
                "к [3 блокаторам"
            ]
        },
        {
            "qID": 425,
            "qName": "Функциональную проходимость слезоотводящих путей проверяют",
            "rA": [
                "окрашиванием слезы 3% раствором колларгола"
            ],
            "wA": [
                "экзоофтальмометром",
                "алгизиметром",
                "диафаноскопом"
            ]
        },
        {
            "qID": 426,
            "qName": "Структуры слезных путей развиваются",
            "rA": [
                "при хроническом конъюнктивите"
            ],
            "wA": [
                "при хроническом увейте",
                "при дакриоадените",
                "при повышении внутриглазного давления"
            ]
        },
        {
            "qID": 427,
            "qName": "Основной признак воспаления слезного мешка",
            "rA": [
                "слизисто гнойное отделяемое из слезных точек при надавливании на область слезного мешка"
            ],
            "wA": [
                "сращение век",
                "некротизация эпителия",
                "болезненность и уплотнение в верхне латеральном секторе орбиты"
            ]
        },
        {
            "qID": 428,
            "qName": "Роговичный синдром включаетвсе перечисленное, кроме",
            "rA": [
                "чувство инородного тела под верхним веком",
                "слезотечение",
                "светобоязнь"
            ],
            "wA": [
                "изменение глубины передней камеры"
            ]
        },
        {
            "qID": 429,
            "qName": "Эрозия роговицы характеризуется",
            "rA": [
                "отторжением эпителия"
            ],
            "wA": [
                "образованием «фасетки»",
                "инфильтрацией роговицы",
                "углублением передней камеры"
            ]
        },
        {
            "qID": 430,
            "qName": "Лечение герпетических кератитов",
            "rA": [
                "ацикловир"
            ],
            "wA": [
                "ПАСК",
                "левомицетин",
                "арутимол"
            ]
        },
        {
            "qID": 431,
            "qName": "Первичные опухоли склеры",
            "rA": [
                "фиброма"
            ],
            "wA": [
                "гемангиома",
                "меланома",
                "ретинобластома"
            ]
        },
        {
            "qID": 432,
            "qName": "При вовлечении в воспалительный процесс ресничного тела появляются",
            "rA": [
                "преципитаты на задней поверхности роговицы"
            ],
            "wA": [
                "геморрагии",
                "фолликулы",
                "хемоз"
            ]
        },
        {
            "qID": 433,
            "qName": "Для синдрома Фукса характерно",
            "rA": [
                "наличие преципитатов и отсутствие признаков воспаления глаза"
            ],
            "wA": [
                "наличие преципитатов и признаков воспаления глаза",
                "наличие признаков востамения",
                "воспаление мелких суставов"
            ]
        },
        {
            "qID": 434,
            "qName": "При периферическом увейте отмечается воспаление",
            "rA": [
                "плоской части ресничного тела и прилежащей части хориоидеи"
            ],
            "wA": [
                "зрачковой зоны радужки",
                "макулярной зоны",
                "всех перечисленных"
            ]
        },
        {
            "qID": 435,
            "qName": "Свежие хориоидальные очаги имеют",
            "rA": [
                "нечеткие границы"
            ],
            "wA": [
                "четкие границы",
                "пигментацию",
                "очаги некроза"
            ]
        },
        {
            "qID": 436,
            "qName": "Жалобы больных при пигментной дистрофии сетчатки",
            "rA": [
                "на гемералопию"
            ],
            "wA": [
                "на искажение предметов",
                "на двоение",
                "на появление скотомы"
            ]
        },
        {
            "qID": 437,
            "qName": "Диагностика отслойки сетчатки производится с помощью",
            "rA": [
                "ультразвукового метода"
            ],
            "wA": [
                "рентгенологического метода",
                "и того, и другого",
                "ни того, ни другого"
            ]
        },
        {
            "qID": 438,
            "qName": "Для ретинобластомы характерно",
            "rA": [
                "желтое свечение зрачка"
            ],
            "wA": [
                "ограничение подвижности глазного яблока",
                "развитие иридоциклита",
                "развитие острого приступа глаукомы"
            ]
        },
        {
            "qID": 439,
            "qName": "Гипертонический ангиосклероз сосудов сетчатки соответствует",
            "rA": [
                "гипертонической болезни ll ой стадии"
            ],
            "wA": [
                "гипертонической болезни 1 ой стадии",
                "гипертонической болезни Ill ей стадии",
                "гипертонической болезни IV ой стадии"
            ]
        },
        {
            "qID": 440,
            "qName": "Острая непроходимости центральной артерии сетчатки встречается привсех состояниях, кроме",
            "rA": [
                "цирроза печени"
            ],
            "wA": [
                "порока сердца",
                "гипертонической болезни",
                "эндокардита"
            ]
        },
        {
            "qID": 441,
            "qName": "Фотокоагуляция при диабетической ретинопатии позволяет",
            "rA": [
                "выключать новообразованные сосуды"
            ],
            "wA": [
                "сохранить колбочки и палочки",
                "устранить тромбоз центральной вены сетчатки",
                "расширить границы поля зрения"
            ]
        },
        {
            "qID": 442,
            "qName": "Для опухолей мозга типичны",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "гемианопсии",
                "застойные диски зрительных нервов",
                "зрительные расстройства коркового происхождения"
            ]
        },
        {
            "qID": 443,
            "qName": "Вторичная атрофия зрительного нерва является следствием всех состояний, кроме",
            "rA": [
                "катаракты"
            ],
            "wA": [
                "сосудистых ишемий",
                "неврита",
                "застоя"
            ]
        },
        {
            "qID": 444,
            "qName": "Общие заболевания, приводящие к развитию катаракты все, кроме",
            "rA": [
                "тиреотоксикоза"
            ],
            "wA": [
                "сахарного диабета",
                "миотонической дистрофии",
                "тетании"
            ]
        },
        {
            "qID": 445,
            "qName": "В незрелой стадии катаракты отмечается",
            "rA": [
                "усиление процессов оводнения"
            ],
            "wA": [
                "потеря хрусталиком воды",
                "гомогенизация хрусталиковых волокон",
                "лизис хрусталикового вещества"
            ]
        },
        {
            "qID": 446,
            "qName": "При афакии можно наблюдать",
            "rA": [
                "дрожание радужки (иридоденез)"
            ],
            "wA": [
                "перикорнеальную инъекцию",
                "преципитаты",
                "иридодиализ"
            ]
        },
        {
            "qID": 447,
            "qName": "Интракапсулярным способом извлекают",
            "rA": [
                "хрусталик в капсуле"
            ],
            "wA": [
                "стекловидное тело при гемофтальме",
                "ядро хрусталика и хрусталиковые массы",
                "хрусталик с помощью ультразвука"
            ]
        },
        {
            "qID": 448,
            "qName": "Дифференциальный диагноз острого приступа глаукомы следует проводить",
            "rA": [
                "с острым иридоциклитом"
            ],
            "wA": [
                "с острым дакриоаденитом",
                "с острым дакриоциститом",
                "с острым конъюнктивитом"
            ]
        },
        {
            "qID": 449,
            "qName": "Глаукоматозная атрофия зрительного нерва проявляется",
            "rA": [
                "побледнением диска зрительного нерва с экскавацией"
            ],
            "wA": [
                "гиперемией диска зрительного нерва с проминенцией",
                "гиперемией с кровоизлияниями",
                "стушеванностью границ диска зрительного нерва"
            ]
        },
        {
            "qID": 450,
            "qName": "При врожденной глаукоме применяются",
            "rA": [
                "гониотомия"
            ],
            "wA": [
                "склеропластика",
                "кератотомия",
                "кератомилез"
            ]
        },
        {
            "qID": 451,
            "qName": "Механизм действия бета адреноблокаторов",
            "rA": [
                "подавление продукции водянистой влаги"
            ],
            "wA": [
                "улучшение оттока из глаза",
                "увеличение диуреза",
                "деблокирующее действие на угол передней камеры и шлеммов канал"
            ]
        },
        {
            "qID": 452,
            "qName": "К осмотическим средствам длительного действия относится",
            "rA": [
                "маннитол"
            ],
            "wA": [
                "трентал",
                "корвалол",
                "кавинтон"
            ]
        },
        {
            "qID": 453,
            "qName": "С целью устранения последствий зрачкового блока применяется",
            "rA": [
                "иридэктомия"
            ],
            "wA": [
                "циклодиализ",
                "фистулизирующая операция",
                "кератотомия"
            ]
        },
        {
            "qID": 454,
            "qName": "При тупых травмах носа (при нарушении целостности пластинки решетчатой кости) возможно развитие",
            "rA": [
                "орбитальной эмфиземы"
            ],
            "wA": [
                "острого приступа глаукомы",
                "гипотонии глазного яблока",
                "отслойки сетчатки"
            ]
        },
        {
            "qID": 455,
            "qName": "При контузиях глазного яблока могут наступить расстройства аккомодации вследствие",
            "rA": [
                "пареза ресничной мышцы"
            ],
            "wA": [
                "помутнения хрусталика",
                "изменений в углу передней камеры",
                "изменения кривизны роговицы"
            ]
        },
        {
            "qID": 456,
            "qName": "Достоверными признаками прободного ранения глазного яблока являются",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "сквозная рана роговицы",
                "выпадение внутренних оболочек",
                "наличие инородного тела внутри глаза"
            ]
        },
        {
            "qID": 457,
            "qName": "На рентгенограмме с протезом Комберга Балтина в прямой проекции можно определить",
            "rA": [
                "меридиан, по которому располагается инородное тело"
            ],
            "wA": [
                "расстояние от инородного тела от лимба",
                "расстояние от инородного тела до сетчатки",
                "меридиан с более сильным преломлением"
            ]
        },
        {
            "qID": 458,
            "qName": "Признаки сидероза глаза следующие:",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "пятна ржавого цвета в передних слоях хрусталика",
                "токсическая ретинопатия",
                "нейроретинопатия"
            ]
        },
        {
            "qID": 459,
            "qName": "Для эндофтальмита характерен",
            "rA": [
                "серо желтый рефлекс с глазного дна"
            ],
            "wA": [
                "розовый рефлекс с глазного дна",
                "красный рефлекс с глазного дна",
                "желто зеленый рефлекс с глазного дна"
            ]
        },
        {
            "qID": 460,
            "qName": "При симпатической офтальмии целесообразно назначение",
            "rA": [
                "кортикостероидов"
            ],
            "wA": [
                "ферментов",
                "ангиопротекторов",
                "витаминов"
            ]
        },
        {
            "qID": 461,
            "qName": "Ожог IV степени характеризуется",
            "rA": [
                "всем перечисленным"
            ],
            "wA": [
                "глубоким некрозом конъюнктивы",
                "глубоким некрозом роговицы в виде «фарфорового стекла»",
                "ни одним из перечисленных"
            ]
        },
        {
            "qID": 462,
            "qName": "При ожоге известью необходимо",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "удалить частицы извести",
                "промыть конъюнктивальную полость водой",
                "закапать 2% раствор борной кислоты"
            ]
        },
        {
            "qID": 463,
            "qName": "Симптомы электроофтальмии включают все, кроме",
            "rA": [
                "мелкая передняя камера"
            ],
            "wA": [
                "светобоязнь",
                "слезотечение",
                "гиперемия конъюнктивы"
            ]
        },
        {
            "qID": 464,
            "qName": "В результате отравления соединениями свинца могут развиться",
            "rA": [
                "поражение сетчатки и зрительного нерва"
            ],
            "wA": [
                "поражение радужки",
                "поражение угла передней камеры",
                "поражение ресничного тела"
            ]
        },
        {
            "qID": 465,
            "qName": "Орбита имеет ФОРМУ",
            "rA": [
                "четырехгранной пирамиды"
            ],
            "wA": [
                "квадрата",
                "шара",
                "параллелепипеда"
            ]
        },
        {
            "qID": 466,
            "qName": "Нижняя глазничная щель соединяет орбиту",
            "rA": [
                "с крылонебной ямкой"
            ],
            "wA": [
                "со средней черепной ямкой",
                "с решетчатой пазухой",
                "со всеми вышеперечисленными"
            ]
        },
        {
            "qID": 467,
            "qName": "Наружная прямая мышца иннервируется",
            "rA": [
                "отводящим нервом"
            ],
            "wA": [
                "глазодвигательным нервом",
                "блоковым нервом",
                "зрительным нервом"
            ]
        },
        {
            "qID": 468,
            "qName": "В круговой мышце век различают",
            "rA": [
                "и ту, и другую"
            ],
            "wA": [
                "глазничную часть",
                "вековую часть"
            ]
        },
        {
            "qID": 469,
            "qName": "Слезные сосочки располагаются",
            "rA": [
                "у внутреннего угла глазной щели"
            ],
            "wA": [
                "у наружного угла глазной щели",
                "в слезном мешке",
                "на слезной железе"
            ]
        },
        {
            "qID": 470,
            "qName": "Конъюнктива выстилает",
            "rA": [
                "роговицу"
            ],
            "wA": [
                "заднюю поверхность век",
                "глазное яблоко до роговицы",
                "хрусталик"
            ]
        },
        {
            "qID": 471,
            "qName": "Полупрозрачная зона перехода роговицы в склеру называется",
            "rA": [
                "лимб"
            ],
            "wA": [
                "трабекула",
                "склеральный синус",
                "экватор"
            ]
        },
        {
            "qID": 472,
            "qName": "Передняя поверхность радужки имеет",
            "rA": [
                "радиарную исчерченность"
            ],
            "wA": [
                "гладкую поверхность",
                "отросчатую поверхность",
                "секторальное строение"
            ]
        },
        {
            "qID": 473,
            "qName": "Внутриглазная жидкость из задней камеры переходит",
            "rA": [
                "в переднюю камеру"
            ],
            "wA": [
                "в трабекулярную сеть",
                "в венозную систему крови",
                "в спинно мозговую жидкость"
            ]
        },
        {
            "qID": 474,
            "qName": "Хрусталик имеет вид",
            "rA": [
                "двояковыпуклой линзы"
            ],
            "wA": [
                "диска",
                "полусферы",
                "двояковогнутой линзы"
            ]
        },
        {
            "qID": 475,
            "qName": "Светочувствительный слой сетчатки составляют",
            "rA": [
                "палочки и колбочки"
            ],
            "wA": [
                "клетки пигментного эпителия",
                "биполярные клетки",
                "ганглиозные клетки"
            ]
        },
        {
            "qID": 476,
            "qName": "Место выхода зрительного нерва из сетчатки называется",
            "rA": [
                "диск"
            ],
            "wA": [
                "макула",
                "зубчатая линия",
                "лимб"
            ]
        },
        {
            "qID": 477,
            "qName": "Глазной нерв (1 я ветвь тройничного нерва) делится в орбите на следующие ветви",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "слезный нерв",
                "носоресничный нерв",
                "лобный нерв"
            ]
        },
        {
            "qID": 478,
            "qName": "Гиперемия глазного яблока может быть поверхностной или",
            "rA": [
                "конъюнктивальной"
            ],
            "wA": [
                "перикорнеальной",
                "застойной",
                "смешанной"
            ]
        },
        {
            "qID": 479,
            "qName": "Щелевая лампа представляет собой комбинацию интенсивного источника света и ...",
            "rA": [
                "бинокулярного микроскопа"
            ],
            "wA": [
                "лупы +20,0 D",
                "лупы+13,0 D",
                "вогнутого зеркала"
            ]
        },
        {
            "qID": 480,
            "qName": "У грудных детей остроту зрения определяют",
            "rA": [
                "ориентировочно путем определения фиксации глазом ребенка ярких предметов"
            ],
            "wA": [
                "по таблице Орловой",
                "по таблице Сивцева Головина",
                "по таблице Рабкина"
            ]
        },
        {
            "qID": 481,
            "qName": "К приобретенным расстройствам цветоощущения относятся все, кроме",
            "rA": [
                "гемералопии"
            ],
            "wA": [
                "эритропсии",
                "ксантопсии",
                "хлоропсии"
            ]
        },
        {
            "qID": 482,
            "qName": "Биназальная гемианопсия развивается при поражении",
            "rA": [
                "неперекрещенных волокон зрительного пути в области зрительного перекреста"
            ],
            "wA": [
                "перекрещенных волокон зрительного пути в области зрительного перекреста",
                "и то, и другое",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 483,
            "qName": "При полном выпадении зрительной функции в области скотомы она обозначается как",
            "rA": [
                "абсолютная"
            ],
            "wA": [
                "относительная",
                "положительная",
                "отрицательная"
            ]
        },
        {
            "qID": 484,
            "qName": "Световая чувствительность глаза зависит",
            "rA": [
                "от степени освещенности"
            ],
            "wA": [
                "от преломляющей системы глаза",
                "от того, и другого",
                "ни от того, ни от другого"
            ]
        },
        {
            "qID": 485,
            "qName": "Фузионный рефлекс   это ...",
            "rA": [
                "способность к слиянию в коре большого мозга двух изображений от обеих сетчаток в единую стереоскопическую картину"
            ],
            "wA": [
                "способность преломления света в оптической системе глаза",
                "способность глаза фокусировать изображения предметов независимо от расстояния, на котором находится предмет",
                "способность восприятия волн различной длины"
            ]
        },
        {
            "qID": 486,
            "qName": "Объективные методы определения рефракции",
            "rA": [
                "и то, и другое"
            ],
            "wA": [
                "скиаскопия",
                "рефрактометрия",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 487,
            "qName": "При астигматизме при исследовании в двух взаимно перпендикулярных меридианах отмечаются",
            "rA": [
                "разная преломляющая сила"
            ],
            "wA": [
                "разные фокусные расстояния4",
                "и то, и другое",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 488,
            "qName": "В ( ) линзах",
            "rA": [
                "проходящие через них параллельные лучи, превращаются в расходящиеся"
            ],
            "wA": [
                "проходящие через них параллельные лучи, превращаются в сходящиеся и собираются в главном фокусе линзы",
                "проходящие через них параллельные лучи не меняют своего направления",
                "ничего из перечисленного"
            ]
        },
        {
            "qID": 489,
            "qName": "Аккомодация глаз при определенной конвергенции зрительных осей называется",
            "rA": [
                "относительной"
            ],
            "wA": [
                "абсолютной",
                "положительной",
                "отрицательной"
            ]
        },
        {
            "qID": 490,
            "qName": "Нарушение аккомодации...",
            "rA": [
                "парез аккомодации"
            ],
            "wA": [
                "диплопия",
                "гемианопсия",
                "фузия"
            ]
        },
        {
            "qID": 491,
            "qName": "Содружественное косоглазие характеризуется",
            "rA": [
                "нарушением бинокулярного зрения"
            ],
            "wA": [
                "расширением зрачка",
                "помутнением хрусталика",
                "повышением внутриглазного давления"
            ]
        },
        {
            "qID": 492,
            "qName": "Система мероприятий, направленных на ликвидацию амблиопии и восстановление остроты зрения называется",
            "rA": [
                "плеоптическим лечением"
            ],
            "wA": [
                "ортоптическим лечением",
                "хирургическим лечением",
                "консервативным лечением"
            ]
        },
        {
            "qID": 493,
            "qName": "Тенонит   это",
            "rA": [
                "воспаление влагалища глазного яблока"
            ],
            "wA": [
                "диффузное воспаление орбитальной клетчатки",
                "воспаление краев век",
                "воспаление наружной оболочки глазного яблока"
            ]
        },
        {
            "qID": 494,
            "qName": "Саркома развивается из",
            "rA": [
                "из влагалища глазного яблока"
            ],
            "wA": [
                "надкостницы",
                "жировой клетчатки",
                "мышц"
            ]
        },
        {
            "qID": 495,
            "qName": "Воспалительный отек век характеризуется всем, кроме",
            "rA": [
                "снижением ВГД"
            ],
            "wA": [
                "выраженным покраснением кожи",
                "повышением местной температуры",
                "болезненностью при пальпации"
            ]
        },
        {
            "qID": 496,
            "qName": "Лечение халазиона",
            "rA": [
                "удаление с капсулой"
            ],
            "wA": [
                "факоэмульсификация",
                "гониотомия",
                "лазерное лечение"
            ]
        },
        {
            "qID": 497,
            "qName": "Эпидемический геморрагический конъюнктивит вызывается",
            "rA": [
                "пикорновирусами"
            ],
            "wA": [
                "вирусом простого герпеса",
                "хламидиями",
                "стафилококками"
            ]
        },
        {
            "qID": 498,
            "qName": "Трахома характеризуется",
            "rA": [
                "всем вышеперечисленным"
            ],
            "wA": [
                "диффузной воспалительной инфильтрацией слизистой оболочки и аденоидного слоя",
                "образованием фолликулов",
                "гиперплазией сосочков, замещающихся рубцовой тканью"
            ]
        },
        {
            "qID": 499,
            "qName": "Дакриоцистит новорожденных развивается вследствие",
            "rA": [
                "атрезии нижнего конца носослезного протока"
            ],
            "wA": [
                "анизейконии",
                "анизометропии",
                "амблиопии"
            ]
        },
        {
            "qID": 500,
            "qName": "Выворот слезной точки часто встречается при следующих состояниях, кроме",
            "rA": [
                "хронических дакриоцистинах"
            ],
            "wA": [
                "хронических блефароконъюнктивитах",
                "рубцовых изменениях век",
                "старческой атонии века"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
