var tests = {
    "tests": [
        {
            "qID": 501,
            "qName": "Наиболее часто кератит проявляется",
            "rA": [
                "образованием инфильтрата"
            ],
            "wA": [
                "свечением зрачка желто зеленого цвета",
                "изменением формы роговицы",
                "помутнением хрусталика"
            ]
        },
        {
            "qID": 502,
            "qName": "При паренхиматозном кератите выделяют следующие периоды",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "инфильтрации",
                "васкуляризации",
                "рассасывания"
            ]
        },
        {
            "qID": 503,
            "qName": "Поверхностные Формы послепервичного герпетического кератита все, кроме",
            "rA": [
                "дисковидного"
            ],
            "wA": [
                "эпителиального",
                "пузырькового",
                "древовидного"
            ]
        },
        {
            "qID": 504,
            "qName": "Глубокий диффузный герпетический кератит протекает на Фоне",
            "rA": [
                "иридоциклита"
            ],
            "wA": [
                "хориоидита",
                "отслойки сетчатки",
                "дакриоцистита"
            ]
        },
        {
            "qID": 505,
            "qName": "Дифференциально диагностический признак между кератитами и первичными дистрофиями роговицы",
            "rA": [
                "наличие или отсутствие васкуляризации"
            ],
            "wA": [
                "передние синехии",
                "задние синехии",
                "наличие или отсутствие кератоконуса"
            ]
        },
        {
            "qID": 506,
            "qName": "Основным методом устранения стойкого помутнения роговицы является",
            "rA": [
                "кератопластика"
            ],
            "wA": [
                "криотерапия",
                "кератомилез",
                "кератотомия"
            ]
        },
        {
            "qID": 507,
            "qName": "Аниридия  это",
            "rA": [
                "отсутствие радужки"
            ],
            "wA": [
                "отсутствие хрусталика",
                "смещение зрачка",
                "отсутствие зрачка"
            ]
        },
        {
            "qID": 508,
            "qName": "Объективный признак вовлечения в воспалительный процесс цилиарного тела",
            "rA": [
                "появление преципитатов на задней поверхности роговицы"
            ],
            "wA": [
                "гифема",
                "иридодонез",
                "гемофтальм"
            ]
        },
        {
            "qID": 509,
            "qName": "Для диагностики хориоидита применяют",
            "rA": [
                "метод прямой офтальмоскопии"
            ],
            "wA": [
                "биомикроскопию",
                "пробу Ширмера",
                "гониоскопию"
            ]
        },
        {
            "qID": 510,
            "qName": "При панувеите происходит поражение радужки, ресничного тела и ...",
            "rA": [
                "собственно сосудистой оболочки"
            ],
            "wA": [
                "роговицы",
                "хрусталика",
                "сетчатки"
            ]
        },
        {
            "qID": 511,
            "qName": "Причиной внутриглазной гипотензии считают",
            "rA": [
                "глубокие дистрофические процессы в ресничном теле"
            ],
            "wA": [
                "сужение калибра сосудов",
                "нарушение оттока внутриглазной жидкости",
                "наличие опухоли головного мозга"
            ]
        },
        {
            "qID": 512,
            "qName": "Наиболее часто разрывы сетчатки появляются",
            "rA": [
                "соответственно месту прикрепления верхней косой мышцы"
            ],
            "wA": [
                "в области макулы",
                "в области зубчатой линии",
                "в области диска зрительного нерва"
            ]
        },
        {
            "qID": 513,
            "qName": "Для ангиоматозов сетчатки характерно",
            "rA": [
                "образование на периферии сетчатки сосудистых клубочков и узлов"
            ],
            "wA": [
                "образование в центре сетчатки сосудистых клубочков и узлов",
                "появление вуалеподобной пленки серого цвета",
                "побледнение сетчатки"
            ]
        },
        {
            "qID": 514,
            "qName": "Ретиношизисом называется ...",
            "rA": [
                "расщепление сетчатки на две пластинки по наружному плексиформному слою"
            ],
            "wA": [
                "побледнение сетчатки",
                "появление вуалеподобной пленки серого цвета",
                "появление очагов кровоизлияний"
            ]
        },
        {
            "qID": 515,
            "qName": "В возникновении ретинобластомы большое значение имеет",
            "rA": [
                "передача по типу неправильного доминантного наследования"
            ],
            "wA": [
                "внутриутробное заражение токсоплазмозом",
                "перенесенная травма глаза",
                "внутриутробная гипертермия"
            ]
        },
        {
            "qID": 516,
            "qName": "После тромбоза центральной вены сетчатки может развиться",
            "rA": [
                "вторичная глаукома"
            ],
            "wA": [
                "атрофия зрительного нерва",
                "панувеит",
                "отслойка сетчатки"
            ]
        },
        {
            "qID": 517,
            "qName": "При воспалительных заболеваниях мозга и его оболочек неврит зрительного нерва имеет",
            "rA": [
                "нисходящий характер"
            ],
            "wA": [
                "восходящий характер",
                "и то, и другое",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 518,
            "qName": "При тяжелом течении неврит зрительного нерва заканчивается",
            "rA": [
                "вторичной атрофией зрительного нерва"
            ],
            "wA": [
                "глаукомой",
                "отслойкой сетчатки",
                "хориоретинитом"
            ]
        },
        {
            "qID": 519,
            "qName": "Метиловый спирт обладает избирательным свойством поражать",
            "rA": [
                "зрительный нерв"
            ],
            "wA": [
                "тройничный нерв",
                "стекловидное тело",
                "хрусталик"
            ]
        },
        {
            "qID": 520,
            "qName": "Застойный диск зрительного нерва развивается",
            "rA": [
                "при аневризмах головного мозга"
            ],
            "wA": [
                "при тиреотоксикозе",
                "при сахарном диабете",
                "при всех вышеперечисленных"
            ]
        },
        {
            "qID": 521,
            "qName": "Самый характерный симптом отечного экзофтальма",
            "rA": [
                "отек орбитальных и периорбитальных тканей"
            ],
            "wA": [
                "нарушение репозиции глазного яблока",
                "застойный диск зрительного нерва",
                "косоглазие"
            ]
        },
        {
            "qID": 522,
            "qName": "При симптоме Мебиуса наблюдается",
            "rA": [
                "затруднение конвергенции"
            ],
            "wA": [
                "редкое мигание",
                "пигментация кожи верхнего века",
                "отставание верхнего века при взгляде вниз"
            ]
        },
        {
            "qID": 523,
            "qName": "Галактоземия в первые 2 3 месяца жизни к быстрому развитию приводит к развитию",
            "rA": [
                "катаракты"
            ],
            "wA": [
                "глаукомы",
                "кератоконуса",
                "отслойке сетчатки"
            ]
        },
        {
            "qID": 524,
            "qName": "При прогрессирующем параличе отмечаются",
            "rA": [
                "рефлекторная неподвижность зрачков"
            ],
            "wA": [
                "изменение формы зрачков",
                "простая атрофия зрительных нервов"
            ]
        },
        {
            "qID": 525,
            "qName": "При врожденной катаракте может развиться",
            "rA": [
                "амблиопия"
            ],
            "wA": [
                "кератоконус",
                "заращение зрачка",
                "отслойка сетчатки"
            ]
        },
        {
            "qID": 526,
            "qName": "При перезрелой катаракте происходит все кроме,",
            "rA": [
                "помутнение капсулы хрусталика"
            ],
            "wA": [
                "распад белковых молекул",
                "превращение коры хрусталика в жидкую массу",
                "вторичное набухание"
            ]
        },
        {
            "qID": 527,
            "qName": "Факолитическая глаукома развивается",
            "rA": [
                "при резорбционной морганиевой катаракте"
            ],
            "wA": [
                "при внутриглазных опухолях",
                "при алкоголизме",
                "при ожирении"
            ]
        },
        {
            "qID": 528,
            "qName": "Недостатком пилокарпина является",
            "rA": [
                "кратковременность гипотензивного действия"
            ],
            "wA": [
                "токсичность",
                "плохая переносимость",
                "все вышеперечисленное"
            ]
        },
        {
            "qID": 529,
            "qName": "Тимолол относится",
            "rA": [
                "к бета адреноблокаторам"
            ],
            "wA": [
                "к ингибиторам карбоангидразы",
                "к осмотическим средствам",
                "к миотикам"
            ]
        },
        {
            "qID": 530,
            "qName": "Для подкожной эмфиземы характерным является",
            "rA": [
                "крепитация"
            ],
            "wA": [
                "экзофтальм",
                "появление «лимонной корочки»",
                "симптом «вишневой косточки»"
            ]
        },
        {
            "qID": 531,
            "qName": "При методе рентгенлокализации по Комбергу  Балтину используется",
            "rA": [
                "протез индикатор"
            ],
            "wA": [
                "зонд",
                "1% раствор флюоресцеина",
                "раствор йодпипола"
            ]
        },
        {
            "qID": 532,
            "qName": "Первая помощь при проникающих ранениях глаза заключается",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "в инстилляции в конъюнктивальный мешок дезинфицирующего средства",
                "в наложении бинокулярной повязки",
                "во введении противостолбнячной сыворотки"
            ]
        },
        {
            "qID": 533,
            "qName": "Осложнения проникающих ранений глаза",
            "rA": [
                "все вышеперечисленные"
            ],
            "wA": [
                "травматическая катаракта",
                "травматические иридоцикпиты",
                "симпатическое воспаление"
            ]
        },
        {
            "qID": 534,
            "qName": "При контузиях век возникают",
            "rA": [
                "подкожные кровоизлияния"
            ],
            "wA": [
                "сосочки",
                "фолликулы",
                "гифема"
            ]
        },
        {
            "qID": 535,
            "qName": "При свежих особо тяжелых ожогах (III IV степени) необходимо произвести",
            "rA": [
                "экстренную послойную кератопластику"
            ],
            "wA": [
                "иридэктомию",
                "скперопластику",
                "миопистику"
            ]
        },
        {
            "qID": 536,
            "qName": "Зрачок расширен",
            "rA": [
                "при остром приступе глаукомы"
            ],
            "wA": [
                "при конъюнктивите",
                "при остром иридоциклите",
                "при отслойке сетчатки"
            ]
        },
        {
            "qID": 537,
            "qName": "Верхняя глазничная щель расположена между",
            "rA": [
                "большим и малым крылом клиновидной кости"
            ],
            "wA": [
                "малым крылом клиновидной кости и решетчатой костью",
                "решетчатой костью и лобной костью",
                "лобной костью и слезной костью"
            ]
        },
        {
            "qID": 538,
            "qName": "Нижняя прямая мышца иннервируется",
            "rA": [
                "глазодвигательным нервом"
            ],
            "wA": [
                "отводящим нервом",
                "блоковым нервом",
                "зрительным нервом"
            ]
        },
        {
            "qID": 539,
            "qName": "Внутренняя прямая мышца начинается",
            "rA": [
                "от сухожильного кольца"
            ],
            "wA": [
                "от надкостницы нижнее внутреннего края орбиты",
                "от внутреннего края орбиты",
                "все вышеперечисленное"
            ]
        },
        {
            "qID": 540,
            "qName": "Задняя поверхность век выстилается",
            "rA": [
                "конъюнктивой"
            ],
            "wA": [
                "кожей",
                "и тем, и другим",
                "ни тем, ни другим"
            ]
        },
        {
            "qID": 541,
            "qName": "Около корня каждой ресницы располагаются",
            "rA": [
                "сальные железы"
            ],
            "wA": [
                "слезные сосочки",
                "слезные точки",
                "слезные железы"
            ]
        },
        {
            "qID": 542,
            "qName": "Слезная железа имеет",
            "rA": [
                "вековую и глазничную части"
            ],
            "wA": [
                "гладкую и радиарную части",
                "правую и левую части",
                "верхнюю и нижнюю части"
            ]
        },
        {
            "qID": 543,
            "qName": "Геометрическая ось глаза соединяет",
            "rA": [
                "пер.едний и задний полюс"
            ],
            "wA": [
                "передний и задний экватор",
                "правое и левое глазное яблоко",
                "наружнюю и внутренние оболочки"
            ]
        },
        {
            "qID": 544,
            "qName": "Фиброзная оболочка глазного яблока состоит",
            "rA": [
                "из роговицы и склеры"
            ],
            "wA": [
                "из радужки и ресничного тела",
                "из тенноновой капсулы",
                "из сосудистой и сетчатой оболочек"
            ]
        },
        {
            "qID": 545,
            "qName": "Внутриглазная жидкость из задней в переднюю камеру попадает",
            "rA": [
                "через зрачок"
            ],
            "wA": [
                "через трабекулярную сеть",
                "через шлеммов канал",
                "через фистулу"
            ]
        },
        {
            "qID": 546,
            "qName": "Периферия ресничного края радужки прикрыта",
            "rA": [
                "полупрозрачным лимбом"
            ],
            "wA": [
                "роговицей",
                "трабекулярной сетью",
                "склерой"
            ]
        },
        {
            "qID": 547,
            "qName": "Хориоидея",
            "rA": [
                "не имеет чувствительную иннервацию"
            ],
            "wA": [
                "имеет чувствительную иннервацию",
                "имеет двигательную иннервацию",
                "имеет два типа иннервации"
            ]
        },
        {
            "qID": 548,
            "qName": "Внутренний зернистый слой сетчатки представлен",
            "rA": [
                "телами и ядрами биполярных нейроцитов"
            ],
            "wA": [
                "палочками",
                "ганглионарными нейроцитами",
                "колбочками"
            ]
        },
        {
            "qID": 549,
            "qName": "Вдоль зрительного нерва направляется",
            "rA": [
                "центральная артерия сетчатки"
            ],
            "wA": [
                "задняя короткая ресничная",
                "задняя длинная ресничная артерия",
                "мышечная артерия"
            ]
        },
        {
            "qID": 550,
            "qName": "Центральный нейрон берет начало",
            "rA": [
                "в области шпорной борозды"
            ],
            "wA": [
                "в области четверохолмия",
                "в латеральном коленчатом теле",
                "в нейроэпителии сетчатки"
            ]
        },
        {
            "qID": 551,
            "qName": "В состав ресничного узла входят",
            "rA": [
                "все перечисленное"
            ],
            "wA": [
                "чувствительные волокна носоресничного нерва",
                "парасимпатические волокна глазодвигательного нерва",
                "симпатические волокна сплетения внутренней сонной артерии"
            ]
        },
        {
            "qID": 552,
            "qName": "Офтальмоскопию в обратном виде проводят с помощью",
            "rA": [
                "зеркального офтальмоскопа"
            ],
            "wA": [
                "электрического офтальмоскопа",
                "лупы +40,0 D",
                "биомикроскопа"
            ]
        },
        {
            "qID": 553,
            "qName": "Метод исследования в «проходящем свете» используют",
            "rA": [
                "для исследования хрусталика и стекловидного тела"
            ],
            "wA": [
                "для диагностики отслойки внутренних оболочек",
                "для исследования глазного дна",
                "все вышеперечисленное"
            ]
        },
        {
            "qID": 554,
            "qName": "Согласно гипотезе о двойственной природе зрения имеются",
            "rA": [
                "дневное и ночное зрение"
            ],
            "wA": [
                "центральное и периферическое зрение",
                "в каждом глазу по отдельному изображению",
                "двоение объектов"
            ]
        },
        {
            "qID": 555,
            "qName": "Острота зрения измеряется",
            "rA": [
                "в относительных величинах"
            ],
            "wA": [
                "в диоптриях",
                "в градусах",
                "в метрах"
            ]
        },
        {
            "qID": 556,
            "qName": "Битемпоральная гемианопсия развивается при локализации",
            "rA": [
                "патологического очага в области средней части зрительного перекреста"
            ],
            "wA": [
                "патологического очага в шпорной борозды",
                "патологического очага в затылочной доле",
                "патологического очага в продолговатом мозге"
            ]
        },
        {
            "qID": 557,
            "qName": "К ахроматическим цветам относятся все, кроме",
            "rA": [
                "красного"
            ],
            "wA": [
                "серого",
                "белого",
                "черного"
            ]
        },
        {
            "qID": 558,
            "qName": "Очаговый дефект поля зрения называется",
            "rA": [
                "скотомой"
            ],
            "wA": [
                "гемианопсией",
                "трихромазией",
                "гетерохронией"
            ]
        },
        {
            "qID": 559,
            "qName": "Изменение световой чувствительности глаза при изменении освещенности называется",
            "rA": [
                "адаптацией"
            ],
            "wA": [
                "скотомой",
                "хемозом",
                "остротой зрения"
            ]
        },
        {
            "qID": 560,
            "qName": "Монокулярное зрение дает представление о всех свойствах предмета, кроме",
            "rA": [
                "глубины"
            ],
            "wA": [
                "высоты предмета",
                "ширины предмета",
                "формы предмета"
            ]
        },
        {
            "qID": 561,
            "qName": "Оптической осью глаза является ...",
            "rA": [
                "прямая линия, проходящая через центры кривизны всех преломляющих поверхностей"
            ],
            "wA": [
                "расстояние от главной плоскости до главного фокуса",
                "положение ближайшей точки ясного зрения",
                "прямая, проходящая через цент линзы"
            ]
        },
        {
            "qID": 562,
            "qName": "Если главный Фокус совпадает с сетчаткой, такая рефракция называется ...",
            "rA": [
                "эмметролией"
            ],
            "wA": [
                "гиперметропией",
                "миопией",
                "пресбиопией"
            ]
        },
        {
            "qID": 563,
            "qName": "Прямой астигматизм",
            "rA": [
                "преломление в вертикальном меридиане сильнее"
            ],
            "wA": [
                "преломление в горизонтальном меридиане сильнее",
                "преломление в обоих меридианах одинаковое",
                "преломление в главных меридианах отсутствует"
            ]
        },
        {
            "qID": 564,
            "qName": "В (+) линзах...",
            "rA": [
                "проходящие через них параллельные лучи, превращаются в сходящиеся и собираются в главном фокусе линзы"
            ],
            "wA": [
                "проходящие через них параллельные лучи, превращаются в расходящиеся",
                "проходящие через них параллельные лучи не меняют направления",
                "проходящие через них параллельные лучи становятся непараллельны"
            ]
        },
        {
            "qID": 565,
            "qName": "Часть гиперметропии, обнаруживаемая при медикаментозном параличе аккомодации называется",
            "rA": [
                "скрытой"
            ],
            "wA": [
                "явной",
                "ложной",
                "истиной"
            ]
        },
        {
            "qID": 566,
            "qName": "При аккомодации в глазу происходит следующее изменение:",
            "rA": [
                "изменение формы хрусталика"
            ],
            "wA": [
                "увеличение размера хрусталика",
                "изменение цвета хрусталика",
                "миоз"
            ]
        },
        {
            "qID": 567,
            "qName": "Косоглазие можно отличить от гетерофории",
            "rA": [
                "по наличию или отсутствию бинокулярного зрения"
            ],
            "wA": [
                "по изменению зрачка",
                "по наличию или отсутствию полного объема движений глаза",
                "по изменению внутриглазного давления"
            ]
        },
        {
            "qID": 568,
            "qName": "Неаккомодационное косоглазие развивается",
            "rA": [
                "с рождения"
            ],
            "wA": [
                "в возрасте 2 3 лет",
                "в школьном возрасте",
                "во взрослом состоянии"
            ]
        },
        {
            "qID": 569,
            "qName": "Система мероприятий, направленных на восстановление и укрепление бинокулярного зрения называется",
            "rA": [
                "ортоптическим лечением"
            ],
            "wA": [
                "плеоптическим лечением",
                "хирургическим лечением",
                "консервативным лечением"
            ]
        },
        {
            "qID": 570,
            "qName": "Энофтальм появляется при",
            "rA": [
                "при атрофии глазничной клетчатки"
            ],
            "wA": [
                "катаракте",
                "глаукоме",
                "при атрофии зрительного нерва"
            ]
        },
        {
            "qID": 571,
            "qName": "Основным признаком опухоли глазницы является",
            "rA": [
                "прогрессирующий экзофтальм"
            ],
            "wA": [
                "смещение глазного яблока",
                "ограничение его подвижности",
                "изменение цвета кожи"
            ]
        },
        {
            "qID": 572,
            "qName": "При отеках век невоспалительного характера можно отметить",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "двустороннее поражение",
                "более сильное проявление по утрам",
                "сочетание с отеками ног, асцитом"
            ]
        },
        {
            "qID": 573,
            "qName": "При асбцессе век при наличии флюктуации назначают",
            "rA": [
                "вскрытие"
            ],
            "wA": [
                "инстилляции 30% раствора сульфацила натрия",
                "сухое тепло, УВЧ",
                "витаминотерапию"
            ]
        },
        {
            "qID": 574,
            "qName": "Эпикантус   это ...",
            "rA": [
                "полулунная кожная складка у внутренних углов глазной щели, переходящая с верхнего века на нижнее"
            ],
            "wA": [
                "свисающая над наружным углом глазной щели складка истонченной кожи верхнего века",
                "укорочение и сужение глазной щели  опущение верхнего века"
            ]
        },
        {
            "qID": 575,
            "qName": "К дистрофическим изменениям конъюнктивы относятся",
            "rA": [
                "птеригиум"
            ],
            "wA": [
                "меланома",
                "хемоз",
                "гемангиома"
            ]
        },
        {
            "qID": 576,
            "qName": "Радикальное излечение дакриоцистита достигается",
            "rA": [
                "операцией дакриоцисториностомией"
            ],
            "wA": [
                "назначением антибиотиков",
                "промыванием слезных путей",
                "назначением массажа век"
            ]
        },
        {
            "qID": 577,
            "qName": "Врожденные аномалии роговицы с изменением величины",
            "rA": [
                "микрокорнеа и макрокорнеа"
            ],
            "wA": [
                "кератоглобус",
                "кератоконус",
                "микросферофакия"
            ]
        },
        {
            "qID": 578,
            "qName": "Кератит начинается с образования",
            "rA": [
                "инфильтрата"
            ],
            "wA": [
                "помутнения",
                "рубеоза",
                "облочка"
            ]
        },
        {
            "qID": 579,
            "qName": "Для туберкулезно аллергического кератита характерно появление",
            "rA": [
                "фликтен"
            ],
            "wA": [
                "задних синехий",
                "рубеоза",
                "помутнения хрусталика"
            ]
        },
        {
            "qID": 580,
            "qName": "Причиной авитаминозных кератитов является",
            "rA": [
                "гиповитаминоз витамина А"
            ],
            "wA": [
                "гиповитаминоз витамина Д",
                "гиповитаминоз витамина Е",
                "гиповитаминоз витамина В"
            ]
        },
        {
            "qID": 581,
            "qName": "По характеру склериты и эписклериты представляют собой",
            "rA": [
                "гранулематозные воспаления"
            ],
            "wA": [
                "нефозы",
                "фибринозно пластические воспаления",
                "экссудативные воспаления"
            ]
        },
        {
            "qID": 582,
            "qName": "При бомбированной радужке",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "передняя камера в месте выпячивания радужки бывает мелкой",
                "передняя камера в центре глубокая в связи с припаянностью к хрусталику",
                "нарушается отток внутриглазной жидкости из задней камеры в переднюю"
            ]
        },
        {
            "qID": 583,
            "qName": "Фотопсии   это ...",
            "rA": [
                "вспышки и мерцания перед глазами"
            ],
            "wA": [
                "искажения предметов",
                "все вышеперечисленное",
                "ничего из вышеперечисленного"
            ]
        },
        {
            "qID": 584,
            "qName": "При офтальмоскопии при отслойке сетчатки можно увидеть",
            "rA": [
                "вуалеподобную пленку"
            ],
            "wA": [
                "свечение зрачка зеленым цветом",
                "очаги желтоватого цвета",
                "очаги кровоизлияния"
            ]
        },
        {
            "qID": 585,
            "qName": "Независимо от этиологии при увеитах назначают",
            "rA": [
                "мидриатики"
            ],
            "wA": [
                "ингибиторы карбоангидразы",
                "бета адреноблокаторы",
                "ангиопротекторы"
            ]
        },
        {
            "qID": 586,
            "qName": "При тяжелом течении неврит зрительного нерва заканчивается",
            "rA": [
                "вторичной атрофией зрительного нерва"
            ],
            "wA": [
                "глаукомой",
                "отслойкой сетчатки",
                "помутнением хрусталика"
            ]
        },
        {
            "qID": 587,
            "qName": "Экстренная помощь в условиях стационара при неврите зрительного нерва должна включать",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "общую противовоспалительную терапию",
                "десенсибилизирующую терапию",
                "дегидратационную терапию"
            ]
        },
        {
            "qID": 588,
            "qName": "При отравлении метиловым спиртом может развиться",
            "rA": [
                "ретробульбарный неврит"
            ],
            "wA": [
                "глаукома",
                "отслойка сетчатки",
                "дакриоцистит"
            ]
        },
        {
            "qID": 589,
            "qName": "Застойный диск зрительного нерва необходимо дифференцировать",
            "rA": [
                "с невритом зрительного нерва"
            ],
            "wA": [
                "с глаукомой",
                "с отслойкой сетчатки",
                "атрофией зрительного нерва"
            ]
        },
        {
            "qID": 590,
            "qName": "При симптоме Грефе наблюдается",
            "rA": [
                "отставание верхнего века при взгляде вниз, когда между верхнего века и роговицей видна полоска склеры"
            ],
            "wA": [
                "редкое мигание",
                "пигментация кожи верхнего века",
                "разный диаметр зрачков"
            ]
        },
        {
            "qID": 591,
            "qName": "При болезни Микулича отмечается",
            "rA": [
                "медленно прогрессирующее симметричное припухание слюнных и слезных желез"
            ],
            "wA": [
                "появление диплопии",
                "образование гониосинехий",
                "интенсивная пигментация радужки"
            ]
        },
        {
            "qID": 592,
            "qName": "Неблагоприятным прогностическим признаком для жизни при заболеваниях почек является",
            "rA": [
                "появление нейроретинопатии"
            ],
            "wA": [
                "рефлекторная неподвижность зрачков",
                "отслойка сетчатки",
                "появление кровоизлияний"
            ]
        },
        {
            "qID": 593,
            "qName": "При врожденной катаракте может развиться",
            "rA": [
                "обскурационная амблиопия"
            ],
            "wA": [
                "дисбинокулярная амблиопия",
                "рефракционная амблиопия",
                "истерическая амблиопия"
            ]
        },
        {
            "qID": 594,
            "qName": "Вторичная катаракта развивается",
            "rA": [
                "после экстракапсулярной экстракции катаракты"
            ],
            "wA": [
                "после интракапсулярной экстракции катаракты",
                "после вывиха хрусталика",
                "после острого приступа глаукомы"
            ]
        },
        {
            "qID": 595,
            "qName": "К симптоматическим гипертензиям относят все, кроме",
            "rA": [
                "острый приступ глаукомы"
            ],
            "wA": [
                "глаукомоциклитические кризы",
                "увеиты с гипертензией",
                "случаи повышения офтальмотонуса, которые вызваны преходящим нарушением регуляции внутриглазного давления в результате интоксикаций, эндокринных расстройств"
            ]
        },
        {
            "qID": 596,
            "qName": "Глаукоматозная атрофия зрительного нерва проявляется",
            "rA": [
                "и тем, и другим"
            ],
            "wA": [
                "побледнением диска",
                "образованием углубления",
                "экскавации",
                "четкими границами"
            ]
        },
        {
            "qID": 597,
            "qName": "К провоцирующим Факторам возникновения острого приступа глаукомы относятся все, кроме",
            "rA": [
                "повышения артериального давления"
            ],
            "wA": [
                "нервного напряжения",
                "переутомления",
                "расширения зрачка"
            ]
        },
        {
            "qID": 598,
            "qName": "Гониотомией называется",
            "rA": [
                "операция несквозного рассечения трабекулы вместе с патологической эмбриональной тканью на ее внутренней поверхности"
            ],
            "wA": [
                "операция по созданию дополнительного оттока водянистой влаги из передней камеры в супрахориоидальное пространство",
                "операция по удалению хрусталика",
                "операция создания соустья между слезным мешком и носовым ходом"
            ]
        },
        {
            "qID": 599,
            "qName": "Ультразвуковой метод позволяет",
            "rA": [
                "и то, и другое"
            ],
            "wA": [
                "определить размеры глаза",
                "уточнить расположение инородного тела",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 600,
            "qName": "Для эндофтальмита характерны следующие симптомы",
            "rA": [
                "все вышеперечисленное"
            ],
            "wA": [
                "снижение остроты зрения до светоощущения",
                "появление хемоза конъюнктивы",
                "абсцесс стекловидного тела"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
