var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Биодоступность:",
            "rA": [
                "Количество вещества в крови в процентном отношении к введенной дозе"
            ],
            "wA": [
                "Количество вещества, которое всасывается в кишечнике"
            ]
        },
        {
            "qID": 2,
            "qName": "Вещества попадают в кровь, минуя печень, при введении:",
            "rA": [
                "Сублингвально"
            ],
            "wA": [
                "Внутрь",
                "В двенадцатиперстную кишку"
            ]
        },
        {
            "qID": 3,
            "qName": "Биотрансформация\tлекарственных\tвеществ основном происходит:",
            "rA": [
                "Печени"
            ],
            "wA": [
                "В жировой ткани",
                "В почках",
                "Кишечнике",
                "Крови"
            ]
        },
        {
            "qID": 4,
            "qName": "В Накопление вещества при повторных введениях:",
            "rA": [
                "Кумуляция"
            ],
            "wA": [
                "Потенцирование",
                "Тахифилаксия",
                "Идиосинкразия"
            ]
        },
        {
            "qID": 5,
            "qName": "Необычная\tреакция\tна\tпервое\tвведение лекарственного вещества:",
            "rA": [
                "Идиосинкразия"
            ],
            "wA": [
                "Сенсибилизация",
                "Привыкание",
                "Потенцирование",
                "Тахифилаксия"
            ]
        },
        {
            "qID": 6,
            "qName": "Основной\tспособ\tвсасывания\tлекарственных веществ в кишечнике:",
            "rA": [
                "Пассивная диффузия"
            ],
            "wA": [
                "Активный транспорт",
                "Фильтрация",
                "Пиноцитоз"
            ]
        },
        {
            "qID": 7,
            "qName": "Потенцирование:",
            "rA": [
                "Совместный эффект двух веществ превышает сумму их эффектов"
            ],
            "wA": [
                "совместный эффект двух веществ равен сумме их эффектов"
            ]
        },
        {
            "qID": 8,
            "qName": "Усиление\tэффекта\tпри\tсовместном\tдействии лекарственных препаратов называется:",
            "rA": [
                "Потенцирование"
            ],
            "wA": [
                "Антагонизм",
                "Идиосинкразия",
                "Тератогенность",
                "Мутагенность"
            ]
        },
        {
            "qID": 9,
            "qName": "Через гисто-гематические барьеры легко проникают:",
            "rA": [
                "Неполярные липофильные соединения"
            ],
            "wA": [
                "Полярные гидрофильные соединения"
            ]
        },
        {
            "qID": 10,
            "qName": "Аддитивное действие:",
            "rA": [
                "Совместный эффект двух веществ равен сумме их эффектов"
            ],
            "wA": [
                "Совместный эффект двух веществ превышает сумму их эффектов"
            ]
        },
        {
            "qID": 11,
            "qName": "Вещества, которые обладают аффинитетом, не имеют внутренней активности и препятствуют действию агонистов, называют:",
            "rA": [
                "Антагонистами"
            ],
            "wA": [
                "Частичными агонистами"
            ]
        },
        {
            "qID": 12,
            "qName": "Путем сравнения доз двух веществ определяют их относительную:",
            "rA": [
                "Активность"
            ],
            "wA": [
                "Эффективность"
            ]
        },
        {
            "qID": 13,
            "qName": "Снижение эффекта при повторных введениях:",
            "rA": [
                "Привыкание"
            ],
            "wA": [
                "Лекарственная зависимость",
                "Идиосинкразия"
            ]
        },
        {
            "qID": 14,
            "qName": "Способность лекарственных веществ стимулировать специфические рецепторы называют:",
            "rA": [
                "Внутренней активностью"
            ],
            "wA": [
                "Аффинитетом"
            ]
        },
        {
            "qID": 15,
            "qName": "Тахифилаксия:",
            "rA": [
                "Быстрое привыкание"
            ],
            "wA": [
                "Необычная реакция на введение вещества",
                "Накопление вещества в организме",
                "Повышение чувствительности к веществу при повторных введениях"
            ]
        },
        {
            "qID": 16,
            "qName": "Тератогенное действие:",
            "rA": [
                "Действие\tна\tэмбрион,\tприводящее\tк врожденным уродствам"
            ],
            "wA": [
                "Нежелательное\tдействие\tна\tэмбрион,\tбез развития врожденных уродств"
            ]
        },
        {
            "qID": 17,
            "qName": "Меры\tпомощи,\tнаправленные\tна\tинактивацию всосавшегося яда:",
            "rA": [
                "Применение антидотов"
            ],
            "wA": [
                "Форсированный диурез",
                "Применение сорбентов (угля активированного)",
                "Применение слабительных средств",
                "Промывание желудка"
            ]
        },
        {
            "qID": 18,
            "qName": "При передозировке метилового спирта применяют:",
            "rA": [
                "Спирт этиловый"
            ],
            "wA": [
                "Феназепам",
                "Кофеин",
                "Налоксон",
                "Бупренорфин"
            ]
        },
        {
            "qID": 19,
            "qName": "При\tпередозировке\tснотворных\tсредств\t- производных бензодиазепина применяют:",
            "rA": [
                "Флумазенил"
            ],
            "wA": [
                "Флуоксетин",
                "Налорфин",
                "Налоксон"
            ]
        },
        {
            "qID": 20,
            "qName": "Местный анестетик, применяемый при всех видах анестезии:",
            "rA": [
                "Лидокаин"
            ],
            "wA": [
                "Кокаин",
                "Артикаин (ультракаин)",
                "Прокаин (новокаин)",
                "Пиромекаин"
            ]
        },
        {
            "qID": 21,
            "qName": "Механизм действия вяжущих средств:",
            "rA": [
                "Денатурация\tбелков\tслизистых\tи\tраневого экссудата, образование плотного альбумината"
            ],
            "wA": [
                "Стимуляция нервных рецепторов",
                "Непосредственная блокада нервных окончаний",
                "Образование коллоидного слоя, покрывающего нервные окончания",
                "Активация калиевых каналов"
            ]
        },
        {
            "qID": 22,
            "qName": "Препарат вяжущего типа действия, применяемый для лечения отравлений тяжелыми металлами:",
            "rA": [
                "Танин"
            ],
            "wA": [
                "Бензокаин (анестезин)",
                "Активированный уголь",
                "Крахмал",
                "Квасцы"
            ]
        },
        {
            "qID": 23,
            "qName": "Антихолинэстеразные средства:",
            "rA": [
                "Повышают тонус и перистальтику кишечника"
            ],
            "wA": [
                "Повышают внутриглазное давление",
                "Снижают секрецию желез желудка",
                "Понижают тонус мочевого пузыря",
                "Расширяют бронхи"
            ]
        },
        {
            "qID": 24,
            "qName": "Механизм действия армина:",
            "rA": [
                "Блокирует ацетилхолинэстеразу"
            ],
            "wA": [
                "Прямо стимулирует М-холинорецепторы",
                "Прямо стимулирует Н-холинорецепторы",
                "Стимулирует ацетилхолинэстеразу"
            ]
        },
        {
            "qID": 25,
            "qName": "Механизм действия физостигмина:",
            "rA": [
                "Блокирует ацетилхолинэстеразу"
            ],
            "wA": [
                "Блокирует М-холинорецепторы",
                "Блокирует Н-холинорецепторы",
                "Блокирует МАО-В",
                "Блокирует КОМТ",
                "Блокирует фосфодиэстеразу"
            ]
        },
        {
            "qID": 26,
            "qName": "Пилокарпин снижает:",
            "rA": [
                "Внутриглазное давление"
            ],
            "wA": [
                "Тонус мышцы, суживающей зрачок",
                "Тонус цилиарной мышцы"
            ]
        },
        {
            "qID": 27,
            "qName": "Антагонисты\tкурареподобных\tсредств антидеполяризующего действия:",
            "rA": [
                "Антихолинэстеразные средства +"
            ],
            "wA": [
                "М-холиномиметики"
            ]
        },
        {
            "qID": 28,
            "qName": "Атропин\tснижает  моторику  и\tтонус\tжелудочно-кишечного тракта за счет:",
            "rA": [
                "Блокады М-холинорецепторов"
            ],
            "wA": [
                "Блокады Н-холинорецепторов",
                "Миотропного спазмолитического действия",
                "Блокады альфа-адренорецепторов",
                "Блокады бета-адренорецепторов"
            ]
        },
        {
            "qID": 29,
            "qName": "Какая\tгруппа\tпрепаратов\tблокирует\tнервно- мышечную передачу:",
            "rA": [
                "Курареподобные средства +"
            ],
            "wA": [
                "М-холиноблокаторы",
                "Ганглиоблокаторы",
                "Антихолинэстеразные средства",
                "Реактиваторы ацетилхолинэстеразы"
            ]
        },
        {
            "qID": 30,
            "qName": "М-холиноблокаторы могут повышать внутриглазное давление, так как:",
            "rA": [
                "Затрудняют отток внутриглазной жидкости"
            ],
            "wA": [
                "Увеличивают\tпродукцию\tвнутриглазной жидкости",
                "Вызывают миоз",
                "Вызывают спазм аккомодации",
                "Снижают проницаемость сосудистой стенки"
            ]
        },
        {
            "qID": 31,
            "qName": "Бета2-адреномиметики:",
            "rA": [
                "Ослабляют\tсократительную\tактивность миометрия"
            ],
            "wA": [
                "Усиливают\tсократительную\tактивность миометрия",
                "Повышают преимущественно тонус миометрия"
            ]
        },
        {
            "qID": 32,
            "qName": "Изопреналин (изадрин) расширяет бронхи, так как:",
            "rA": [
                "Стимулирует бета2-адренорецепторы +"
            ],
            "wA": [
                "Стимулирует альфа2-адренорецепторы",
                "Блокирует бета2-адренорецепторы",
                "Обладает\tмиотропными\tспазмолитическими свойствами"
            ]
        },
        {
            "qID": 33,
            "qName": "Оказывает прямое возбуждающее действие на все типы адренорецепторов, повышает артериальное давление:",
            "rA": [
                "Эпинефрин (адреналин) +"
            ],
            "wA": [
                "Изопреналин (изадрин)",
                "Норэпинефрин (норадреналин)",
                "Фенилэфрин (мезатон)",
                "Сальбутамол"
            ]
        },
        {
            "qID": 34,
            "qName": "Сальбутамол преимущественно стимулирует:",
            "rA": [
                "Бета2-адренорецепторы"
            ],
            "wA": [
                "Альфа1-адренорецепторы",
                "Альфа2-адренорецепторы",
                "Бета1-адренорецепторы"
            ]
        },
        {
            "qID": 35,
            "qName": "Стимулирует высвобождение норэпинефрина (норадреналин) из окончаний адренергических нервов:",
            "rA": [
                "Эфедрин"
            ],
            "wA": [
                "Клонидин (клофелин)",
                "Резерпин",
                "Фенилэфрин (мезатон)"
            ]
        },
        {
            "qID": 36,
            "qName": "Альфа-адреноблокаторы\tснижают\tартериальное давление, так как:",
            "rA": [
                "Расширяют артериальные сосуды"
            ],
            "wA": [
                "Уменьшают работу сердца",
                "Уменьшают объем плазмы крови"
            ]
        },
        {
            "qID": 37,
            "qName": "Празозин расширяет сосуды за счет:",
            "rA": [
                "Блокады альфа1-адренорецепторов"
            ],
            "wA": [
                "Блокады ангиотензиновых рецепторов"
            ]
        },
        {
            "qID": 38,
            "qName": "Газообразное вещество для ингаляционного наркоза:",
            "rA": [
                "Азота закись"
            ],
            "wA": [
                "Галотан (фторотан)",
                "Кетамин",
                "Пропофол"
            ]
        },
        {
            "qID": 39,
            "qName": "Дисульфирам (тетурам) при лечении алкоголизма:",
            "rA": [
                "Блокирует\tокисление\tспирта\tэтилового\tна стадии образования ацетальдегида"
            ],
            "wA": [
                "Ускоряет окисление спирта этилового",
                "Стимулирует пусковую зону рвотного центра"
            ]
        },
        {
            "qID": 40,
            "qName": "Спирт этиловый при отеке легких:",
            "rA": [
                "Оказывает противовспенивающее действие"
            ],
            "wA": [
                "Стимулирует центр дыхания",
                "Оказывает дегидратирующее действие",
                "Снижает тонус бронхов",
                "Уменьшает\tдавление\tв\tмалом\tкруге кровообращения"
            ]
        },
        {
            "qID": 41,
            "qName": "Барбитураты:",
            "rA": [
                "Вызывают\tиндукцию\tмикросомальных ферментов печени"
            ],
            "wA": [
                "Угнетают\tактивность\tмикросомальных ферментов печени",
                "Не\tвлияют\tна\tмикросомальные\tферменты печени"
            ]
        },
        {
            "qID": 42,
            "qName": "Как влияют барбитураты на фазу быстрого сна:",
            "rA": [
                "Укорачивают"
            ],
            "wA": [
                "Удлиняют",
                "Не изменяют"
            ]
        },
        {
            "qID": 43,
            "qName": "Какой побочный эффект связан со способностью снотворных средств нарушать структуру сна:",
            "rA": [
                "Феномен \"отдачи\""
            ],
            "wA": [
                "Последействие",
                "Привыкание",
                "Лекарственная зависимость"
            ]
        },
        {
            "qID": 44,
            "qName": "Какой препарат может вызвать гиперплазию десен:",
            "rA": [
                "фенитоин (дифенин)"
            ],
            "wA": [
                "фенобарбитал",
                "натрия вальпроат",
                "ламотриджин",
                "этосуксимид"
            ]
        },
        {
            "qID": 45,
            "qName": "Назовите\tпрепарат,\tобладающий\tодновременно снотворным и противоэпилептическим действием:",
            "rA": [
                "фенобарбитал"
            ],
            "wA": [
                "карбамазепин",
                "ламотриджин",
                "фенитоин (дифенин)",
                "феназепам"
            ]
        },
        {
            "qID": 46,
            "qName": "При\tнарколепсии\t(патологической\tсонливости) применяют:",
            "rA": [
                "мезокарб"
            ],
            "wA": [
                "валокордин",
                "медазепам (мезапам)",
                "пиритинол",
                "пирацетам"
            ]
        },
        {
            "qID": 47,
            "qName": "Фазу быстрого сна барбитураты:",
            "rA": [
                "укорачивают"
            ],
            "wA": [
                "удлиняют",
                "не изменяют"
            ]
        },
        {
            "qID": 48,
            "qName": "Амантадин (мидантан) используют в качестве:",
            "rA": [
                "противопаркинсонического средства"
            ],
            "wA": [
                "противоэпилептического средства",
                "анальгетического средства",
                "снотворного средства"
            ]
        },
        {
            "qID": 49,
            "qName": "Для\tкупирования\tэпилептического\tстатуса применяют:",
            "rA": [
                "диазепам"
            ],
            "wA": [
                "этосуксимид",
                "тиопентал натрия"
            ]
        },
        {
            "qID": 50,
            "qName": "Карбидопа:",
            "rA": [
                "ингибитор\tпериферической\tдофа- декарбоксилазы"
            ],
            "wA": [
                "предшественник дофамина",
                "ингибитор МАО-В",
                "ингибитор катехол-о-метилтрансферазы",
                "нарушает нейрональный захват дофамина",
                "прямо стимулирует дофаминовые рецепторы"
            ]
        },
        {
            "qID": 51,
            "qName": "Механизм\tпротивоэпилептического\tдействия фенобарбитала:",
            "rA": [
                "повышение\tчувствительности\tГАМК- рецепторов к медиатору"
            ],
            "wA": [
                "стимуляция синтеза ГАМК",
                "прямая стимуляция рецепторов ГАМК"
            ]
        },
        {
            "qID": 52,
            "qName": "Тригексифенидил (циклодол):",
            "rA": [
                "М-холиноблокатор"
            ],
            "wA": [
                "ингибитор МАО-В",
                "дофаминомиметик",
                "блокатор NMDA - рецепторов",
                "предшественник дофамина"
            ]
        },
        {
            "qID": 53,
            "qName": "Анальгетик, применяемый для нейролептанальгезии:",
            "rA": [
                "фентанил"
            ],
            "wA": [
                "тримеперидин (промедол)",
                "морфин"
            ]
        },
        {
            "qID": 54,
            "qName": "Анальгетический\tэффект\tморфина\tпод\tвлиянием налоксона:",
            "rA": [
                "ослабляется"
            ],
            "wA": [
                "усиливается",
                "не изменяется"
            ]
        },
        {
            "qID": 55,
            "qName": "Антагонист опиоидных анальгетиков:",
            "rA": [
                "налоксон"
            ],
            "wA": [
                "трамадол",
                "парацетамол",
                "метамизол натрия (анальгин)"
            ]
        },
        {
            "qID": 56,
            "qName": "Механизм действия налоксона:",
            "rA": [
                "блокирует опиатные рецепторы"
            ],
            "wA": [
                "стимулирует опиатные рецепторы",
                "ингибирует липоксигеназу",
                "ингибирует циклооксигеназу"
            ]
        },
        {
            "qID": 57,
            "qName": "Морфин при отеке легких:",
            "rA": [
                "предположительно снижает давление в малом круге кровообращения"
            ],
            "wA": [
                "оказывает кардиотоническое действие",
                "оказывает противовспенивающее действие",
                "возбуждает центр дыхания"
            ]
        },
        {
            "qID": 58,
            "qName": "Налоксон применяют:",
            "rA": [
                "при угнетении дыхания агонистами опиоидных рецепторов"
            ],
            "wA": [
                "при рефлекторных остановках дыхания",
                "при\tтяжелых\tотравлениях\tснотворными наркотического типа действия"
            ]
        },
        {
            "qID": 59,
            "qName": "Налоксон устраняет:",
            "rA": [
                "оба эффекта"
            ],
            "wA": [
                "только\tанальгетический\tэффект\tопиоидных анальгетиков",
                "только угнетающее действие этих веществ на дыхание"
            ]
        },
        {
            "qID": 60,
            "qName": "Тримеперидин (промедол):",
            "rA": [
                "опиоидный анальгетик"
            ],
            "wA": [
                "алкалоид опия",
                "антагонист опиоидных рецепторов",
                "по эффективности превосходит морфин",
                "действует продолжительнее морфина"
            ]
        },
        {
            "qID": 61,
            "qName": "Фентанил:",
            "rA": [
                "опиоидный анальгетик"
            ],
            "wA": [
                "ненаркотический анальгетик",
                "антагонист опиоидных анальгетиков"
            ]
        },
        {
            "qID": 62,
            "qName": "Болеутоляющий эффект парацетамола обусловлен:",
            "rA": [
                "влиянием на ЦНС"
            ],
            "wA": [
                "противовоспалительным действием",
                "угнетением\tпроведения\tвозбуждения\tпо афферентным нервам"
            ]
        },
        {
            "qID": 63,
            "qName": "Анальгетический, противовоспалительный и жаропонижающий эффекты салицилатов и производных пиразолона связаны с угнетением образования:",
            "rA": [
                "простагландинов"
            ],
            "wA": [
                "эндорфинов",
                "энкефалинов"
            ]
        },
        {
            "qID": 64,
            "qName": "В качестве жаропонижающих средств при лихорадке применяют:",
            "rA": [
                "ненаркотические анальгетики"
            ],
            "wA": [
                "наркотические анальгетики",
                "антагонисты наркотических анальгетиков"
            ]
        },
        {
            "qID": 65,
            "qName": "Кислота ацетилсалициловая может вызывать:",
            "rA": [
                "изъязвление\tслизистой\tоболочки\tжелудочно- кишечного тракта"
            ],
            "wA": [
                "снотворный эффект",
                "физическую лекарственную зависимость"
            ]
        },
        {
            "qID": 66,
            "qName": "Кислота ацетилсалициловая:",
            "rA": [
                "антиагрегант"
            ],
            "wA": [
                "фибринолитическое средство",
                "антифибринолитическое средство",
                "антианемическое средство"
            ]
        },
        {
            "qID": 67,
            "qName": "Салицилаты:",
            "rA": [
                "ингибируют циклооксигеназу"
            ],
            "wA": [
                "взаимодействуют с опиоидными рецепторами",
                "ингибируют фосфолипазу А2"
            ]
        },
        {
            "qID": 68,
            "qName": "Диазепам:",
            "rA": [
                "анксиолитик"
            ],
            "wA": [
                "антипсихотическое средство",
                "психостимулирующее средство",
                "антидепрессант",
                "ноотропное средство"
            ]
        },
        {
            "qID": 69,
            "qName": "Механизм\tтранквилизаторов,\tпроизводных бензодиазепина:",
            "rA": [
                "взаимодействие\tс\tбензодиазепиновыми рецепторами"
            ],
            "wA": [
                "блокада ГАМК- рецепторов",
                "блокада Са-каналов",
                "угнетение полисинаптических рефлексов",
                "активация К-каналов"
            ]
        },
        {
            "qID": 70,
            "qName": "Транквилизатор,\tкупирующий\tсудороги\tлюбой этиологии:",
            "rA": [
                "диазепам"
            ],
            "wA": [
                "флумазенил",
                "триоксазин",
                "медазепам (мезапам)",
                "феназепам"
            ]
        },
        {
            "qID": 71,
            "qName": "Эффекты феназепама связывают с его действием на:",
            "rA": [
                "ГАМК\t-бензодиазепиновый\tрецепторный комплекс"
            ],
            "wA": [
                "дофаминовые рецепторы",
                "адренорецепторы",
                "опиатные рецепторы"
            ]
        },
        {
            "qID": 72,
            "qName": "Механизм действия седативных средств:",
            "rA": [
                "усиление и концентрация тормозных процессов в коре мозга"
            ],
            "wA": [
                "блокада серотониновых рецепторов",
                "блокада дофаминовых рецепторов",
                "блокада альфа-АРС",
                "блокада М-ХРС"
            ]
        },
        {
            "qID": 73,
            "qName": "Атипичный\tнейролептик\t-\tпроизводное дибензодиазепина:",
            "rA": [
                "клозапин"
            ],
            "wA": [
                "резерпин",
                "сульпирид (эглонил)",
                "дроперидол",
                "диазепам"
            ]
        },
        {
            "qID": 74,
            "qName": "Антипсихотические средства вызывают явления паркинсонизма потому, что блокируют дофаминовые рецепторы:",
            "rA": [
                "базальных ганглиев"
            ],
            "wA": [
                "мезолибической системы",
                "гипоталамуса"
            ]
        },
        {
            "qID": 75,
            "qName": "Антипсихотический\tэффект\tгалоперидола объясняют:",
            "rA": [
                "угнетением\tдофаминергических\tпроцессов\tв ЦНС"
            ],
            "wA": [
                "стимуляцией дофаминергических процессов в ЦНС",
                "угнетением адренергических процессов в ЦНС",
                "стимуляцией адренергических процессов в ЦНС",
                "М-холинолитической активностью"
            ]
        },
        {
            "qID": 76,
            "qName": "Галоперидол\tповышает\tвыделение\tпролактина потому, что блокирует дофаминовые рецепторы:",
            "rA": [
                "гипоталамуса"
            ],
            "wA": [
                "мезолимбической системы",
                "экстрапирамидной системы"
            ]
        },
        {
            "qID": 77,
            "qName": "Гипотермический\tэффект\tантипсихотических средств связан с блокадой дофаминовых рецепторов:",
            "rA": [
                "гипоталамуса"
            ],
            "wA": [
                "мезолимбической системы",
                "экстрапирамидной системы",
                "коры головного мозга",
                "боковых желудочков мозга"
            ]
        },
        {
            "qID": 78,
            "qName": "Гипотермический\tэффект\tхлорпромазина (аминазина) связан с блокадой дофаминовых рецепторов:",
            "rA": [
                "гипоталамуса"
            ],
            "wA": [
                "мезолимбической системы",
                "экстрапирамидной системы"
            ]
        },
        {
            "qID": 79,
            "qName": "Для коррекции экстрапирамидных расстройств, вызванных антипсихотическими средствами, применяют:",
            "rA": [
                "центральные холиноблокаторы"
            ],
            "wA": [
                "дофаминомиметики",
                "ни одно из перечисленного"
            ]
        },
        {
            "qID": 80,
            "qName": "Нейролептик, применяемый\tдля нейролептанальгезии:",
            "rA": [
                "дроперидол"
            ],
            "wA": [
                "клозапин",
                "диазепам",
                "сульпирид",
                "резерпин"
            ]
        },
        {
            "qID": 81,
            "qName": "Определить препарат: устраняет продуктивную симптоматику психозов (бред, галлюцинации), обладает седативным свойством, вызывает экстрапирамидные нарушения.",
            "rA": [
                "Хлорпромазин (аминазин)"
            ],
            "wA": [
                "Амитриптилин",
                "Сульпирид",
                "Лития карбонат",
                "Мебикар"
            ]
        },
        {
            "qID": 82,
            "qName": "При\tэкстрапирамидных\tнарушениях,\tвызванных антипсихотическими средствами, применяют:",
            "rA": [
                "центральные холиноблокаторы"
            ],
            "wA": [
                "стимуляторы дофаминергических процессов в ЦНС",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 83,
            "qName": "Противорвотное действие галоперидола связано с блокадой дофаминовых рецепторов:",
            "rA": [
                "пусковой зоны рвотного центра"
            ],
            "wA": [
                "базальных ганглиев",
                "гипоталамуса",
                "мезолимбической системы",
                "с блокадой МХРС"
            ]
        },
        {
            "qID": 84,
            "qName": "Антидепрессант - ингибитор моноаминоксидазы:",
            "rA": [
                "моклобемид"
            ],
            "wA": [
                "амитриптилин",
                "имипрамин (имизин)",
                "сульпирид"
            ]
        },
        {
            "qID": 85,
            "qName": "Для лечения маний применяют:",
            "rA": [
                "лития карбонат"
            ],
            "wA": [
                "пирацетам",
                "флуоксетин",
                "ниаламид",
                "амитриптилин"
            ]
        },
        {
            "qID": 86,
            "qName": "При ажитированной депрессии применяют:",
            "rA": [
                "амитриптилин"
            ],
            "wA": [
                "флуоксетин",
                "ниаламид",
                "пирацетам",
                "сертралин"
            ]
        },
        {
            "qID": 87,
            "qName": "Тианептин (коаксил):",
            "rA": [
                "усиливает нейрональный захват серотонина"
            ],
            "wA": [
                "селективно ингибирует МАО-А",
                "неселективно ингибирует МАО",
                "ингибирует нейрональный захват серотонина",
                "ингибирует\tнейрональный\tзахват норэпинефрина (норадреналин) и серотонина"
            ]
        },
        {
            "qID": 88,
            "qName": "Антидепрессант - ингибитор моноаминоксидазы:",
            "rA": [
                "моклобемид"
            ],
            "wA": [
                "амитриптилин",
                "имипрамин (имизин)",
                "сульпирид"
            ]
        },
        {
            "qID": 89,
            "qName": "Бемегрид:",
            "rA": [
                "стимулятор дыхания"
            ],
            "wA": [
                "отхаркивающее средство",
                "противокашлевое средство",
                "бронхолитическое средство"
            ]
        },
        {
            "qID": 90,
            "qName": "Дыхательный центр угнетают:",
            "rA": [
                "наркотические анальгетики"
            ],
            "wA": [
                "аналептики",
                "ненаркотические анальгетики",
                "психостимуляторы"
            ]
        },
        {
            "qID": 91,
            "qName": "Для ноотропных средств характерно:",
            "rA": [
                "антигипоксический эффект"
            ],
            "wA": [
                "быстрое начало эффекта",
                "синдром последействия",
                "привыкание",
                "зависимость"
            ]
        },
        {
            "qID": 92,
            "qName": "Ноотропное действие пирацетама связывают:",
            "rA": [
                "с\tвлиянием\tна\tэнергетические\tпроцессы\tв нейронах головного мозга"
            ],
            "wA": [
                "со\tстимуляцией\tдофаминовых\tрецепторов головного мозга",
                "со\tстимуляцией\tадренорецепторов\tголовного мозга"
            ]
        },
        {
            "qID": 93,
            "qName": "Пирацетам:",
            "rA": [
                "ноотропное средство"
            ],
            "wA": [
                "анксиолитик",
                "седативное средство",
                "психостимулирующее средство"
            ]
        },
        {
            "qID": 94,
            "qName": "Фенотропил:",
            "rA": [
                "ноотропный препарат"
            ],
            "wA": [
                "дыхательный аналептик",
                "адаптоген",
                "антидепрессант",
                "анксиолитик"
            ]
        },
        {
            "qID": 95,
            "qName": "Дигоксин:",
            "rA": [
                "применяется\tпри\tострой\tи\tхронической сердечной недостаточности"
            ],
            "wA": [
                "применяется\tтолько\tпри\tострой\tсердечной недостаточности",
                "применяется только при хронической сердечной недостаточности"
            ]
        },
        {
            "qID": 96,
            "qName": "Кардиотоническое действие сердечных гликозидов обусловлено:",
            "rA": [
                "блокадой натрий-калиевой АТФ-азы"
            ],
            "wA": [
                "стимуляцией аденилатциклазы",
                "ингибированием фосфодиэстеразы",
                "блокадой блуждающего нерва"
            ]
        },
        {
            "qID": 97,
            "qName": "На фоне действия сердечных гликозидов:",
            "rA": [
                "ослабляется тормозящее влияние тропонина на сократительные белки миокарда"
            ],
            "wA": [
                "увеличивается\tингибирующее\tвлияние тропонина на сократительные белки",
                "ничего из перечисленного"
            ]
        },
        {
            "qID": 98,
            "qName": "При применении сердечных гликозидов с тропониновым комплексом непосредственно связываются:",
            "rA": [
                "ионы Ca2"
            ],
            "wA": [
                "ионы K",
                "ионы Na"
            ]
        },
        {
            "qID": 99,
            "qName": "Содержание\tионов\tК\tв\tкардиомиоцитах\tпри действии сердечных гликозидов:",
            "rA": [
                "снижается"
            ],
            "wA": [
                "повышается",
                "не изменяется"
            ]
        },
        {
            "qID": 100,
            "qName": "Выберите сердечный гликозид:",
            "rA": [
                "строфантин"
            ],
            "wA": [
                "нифедипин",
                "исрадипин",
                "нисолдипин",
                "дилтиазем"
            ]
        },
        {
            "qID": 101,
            "qName": "Механизм действия добутамина:",
            "rA": [
                "стимуляция бета1-рецепторов"
            ],
            "wA": [
                "стимуляция бета2-рецепторов",
                "блокада М-холинорецепторов",
                "блокада альфа-рецепторов",
                "стимуляция дофаминовых рецепторов"
            ]
        },
        {
            "qID": 102,
            "qName": "Какой из нижеперечисленных препаратов относится к антиаритмикам II класса (бета-адреноблокаторам):",
            "rA": [
                "метопролол"
            ],
            "wA": [
                "хинидин",
                "прокаинамид",
                "амиодарон",
                "дилтиазем"
            ]
        },
        {
            "qID": 103,
            "qName": "Все нижесказанное о нитроглицерине верно, кроме:",
            "rA": [
                "является эффективным гиполипидемическим средством"
            ],
            "wA": [
                "является\tпрототипом\tвсех\tорганических нитратов",
                "хорошо\tабсорбируется\tпри\tсублингвальном применении",
                "терапевтическая концентрация препарата в плазме крови достигается в течение нескольких минут",
                "его общая продолжительность действия составляет около 2-х часов"
            ]
        },
        {
            "qID": 104,
            "qName": "Для купирования приступа стенокардии применяют:",
            "rA": [
                "нитроглицерин"
            ],
            "wA": [
                "прокаинамид (новокаинамид)",
                "гликозид ландыша (коргликон)",
                "клонидин"
            ]
        },
        {
            "qID": 105,
            "qName": "Какой\tэффект\tнитроглицерина\tприводит\tк уменьшению преднагрузки на сердце:",
            "rA": [
                "расширение\tвен\tи\tуменьшение\tвенозного давления"
            ],
            "wA": [
                "расширение\tартерий\tи\tуменьшение артериального давления",
                "расширение коронарных сосудов и улучшение кровоснабжения миокарда"
            ]
        },
        {
            "qID": 106,
            "qName": "Продолжительность\tтерапевтического\tдействия нитроглицерина:",
            "rA": [
                "до 30 минут"
            ],
            "wA": [
                "7-8 часов",
                "3-4 часа"
            ]
        },
        {
            "qID": 107,
            "qName": "Бета-адреноблокаторы\tэффективны\tпри стенокардии, так как они:",
            "rA": [
                "снижают потребность сердца в кислороде"
            ],
            "wA": [
                "выраженно расширяют коронарные сосуды"
            ]
        },
        {
            "qID": 108,
            "qName": "Вазодилятирующие\tсвойства\tкарведилола обусловлены:",
            "rA": [
                "блокадой альфа1 – адренорецепторов"
            ],
            "wA": [
                "повышением уровня NО",
                "повышением уровня брадикинина",
                "повышением уровня простациклина",
                "стимуляцией бета2- адренорецепторов"
            ]
        },
        {
            "qID": 109,
            "qName": "Какой  из  нижеперечисленных  неселективных бета-адреноблокаторов\tобладает\tспособностьюблокировать альфа1-адренорецепторы:",
            "rA": [
                "карведилол"
            ],
            "wA": [
                "метопролол",
                "пропранолол",
                "окспренолол",
                "пиндолол"
            ]
        },
        {
            "qID": 110,
            "qName": "Повышение тонуса бронхов - побочный эффект:",
            "rA": [
                "пропранолола (анаприлина)"
            ],
            "wA": [
                "нифедипина",
                "гидрохлоротиазида (дихлотиазида)",
                "лозартана",
                "празозина"
            ]
        },
        {
            "qID": 111,
            "qName": "Азаметония бромид (пентамин) понижает гидростатическое давление в малом круге кровообращения за счет:",
            "rA": [
                "депонирования крови в сосудах большого круга кровообращения"
            ],
            "wA": [
                "прямого стимулирующего действия на миокард",
                "увеличения диуреза"
            ]
        },
        {
            "qID": 112,
            "qName": "Какой из нижеперечисленных препаратов используется для лечения артериальной гипертензиии у беременных:",
            "rA": [
                "метилдофа"
            ],
            "wA": [
                "гуанфацин",
                "клонидин",
                "рилменидин",
                "моксонидин"
            ]
        },
        {
            "qID": 113,
            "qName": "Каптоприл:",
            "rA": [
                "средство, влияющее на ренин-ангиотензиновую систему"
            ],
            "wA": [
                "гипотензивное средство центрального действия",
                "гипотензивное средство миотропного действия",
                "блокатор кальциевых каналов",
                "диуретик"
            ]
        },
        {
            "qID": 114,
            "qName": "Механизм действия лозартана:",
            "rA": [
                "блокирует ангиотензиновые рецепторы подтипа АТ1"
            ],
            "wA": [
                "угнетает секрецию ренина",
                "блокирует ангиотензиновые рецепторы подтипа АТ2",
                "ингибирует\tангиотензинпревращающий фермент",
                "отщепляет окись азота (NО)"
            ]
        },
        {
            "qID": 115,
            "qName": "Верапамил блокирует:",
            "rA": [
                "транспорт\tионов\tкальция\tчерез цитоплазматическую мембрану"
            ],
            "wA": [
                "транспорт\tионов\tнатрия\tчерез цитоплазматическую мембрану",
                "бета-адренорецепторы"
            ]
        },
        {
            "qID": 116,
            "qName": "Какой из нижеперечисленных антагонистов кальция является производным фенилалкиламинов:",
            "rA": [
                "верапамил"
            ],
            "wA": [
                "дилтиазем",
                "фелодипин",
                "нифедипин",
                "амлодипин"
            ]
        },
        {
            "qID": 117,
            "qName": "Нифедипин блокирует:",
            "rA": [
                "транспорт\tионов\tкальция\tчерез цитоплазматическую мембрану"
            ],
            "wA": [
                "транспорт\tионов\tнатрия\tчерез цитоплазматическую мембрану",
                "бета-адренорецепторы"
            ]
        },
        {
            "qID": 118,
            "qName": "Диазоксид относится к:",
            "rA": [
                "активаторам калиевых каналов"
            ],
            "wA": [
                "блокаторам ангиотензиновых рецепторов",
                "ингибиторам\tангиотензинпревращающего фермента",
                "донаторам окиси азота (NО)"
            ]
        },
        {
            "qID": 119,
            "qName": "Дипиридамол\tэффективен\tпри\tкоронарной недостаточности, так как:",
            "rA": [
                "расширяет\tкоронарные\tсосуды\tза\tсчет миотропного действия"
            ],
            "wA": [
                "уменьшает работу сердца",
                "блокирует\tцентральные\tзвенья коронаросуживающих рефлексов"
            ]
        },
        {
            "qID": 120,
            "qName": "В качестве противоаритмического средства лидокаин применяют при:",
            "rA": [
                "желудочковых\tаритмиях,\tвозникающих\tпри инфаркте миокарда"
            ],
            "wA": [
                "атриовентрикулярном блоке",
                "мерцательной аритмии предсердий"
            ]
        },
        {
            "qID": 121,
            "qName": "Прокаинамид (новокаинамид) применяют в качестве:",
            "rA": [
                "антиаритмического средства"
            ],
            "wA": [
                "гипотензивного средства",
                "антиангинального средства",
                "кардиотонического средства"
            ]
        },
        {
            "qID": 122,
            "qName": "Диуретик - антагонист альдостерона:",
            "rA": [
                "спиронолактон"
            ],
            "wA": [
                "гидрохлоротиазид (дихлотиазид)",
                "фуросемид",
                "триамтерен",
                "маннитол (маннит)"
            ]
        },
        {
            "qID": 123,
            "qName": "Диуретик, задерживающий кальций в организме:",
            "rA": [
                "гидрохлоротиазид (дихлотиазид)"
            ],
            "wA": [
                "триамтерен",
                "фуросемид",
                "кислота этакриновая"
            ]
        },
        {
            "qID": 124,
            "qName": "Для лечения несахарного диабета применяют:",
            "rA": [
                "гидрохлоротиазид (дихлотиазид)"
            ],
            "wA": [
                "триамтерен",
                "спиронолактон",
                "фуросемид",
                "амилорид"
            ]
        },
        {
            "qID": 125,
            "qName": "Маннитол (маннит):",
            "rA": [
                "осмотический диуретик"
            ],
            "wA": [
                "калий-, магнийсберегающий диуретик",
                "петлевой диуретик",
                "антагонист альдостерона"
            ]
        },
        {
            "qID": 126,
            "qName": "Механизм диуретического действия фуросемида:",
            "rA": [
                "блокирует\tNa\t\\2Cl-\\K\tкотранспортер\tв дистальной части петли Генле"
            ],
            "wA": [
                "блокирует рецепторы альдостерона",
                "повышает осмотическое давление в канальцах",
                "блокирует карбоангидразу",
                "усиливает\tсекрецию\tNa\tв\tпроксимальных канальцах"
            ]
        },
        {
            "qID": 127,
            "qName": "Наиболее эффективный диуретик:",
            "rA": [
                "фуросемид"
            ],
            "wA": [
                "спиронолактон",
                "триамтерен",
                "гидрохлоротиазид (дихлотиазид)"
            ]
        },
        {
            "qID": 128,
            "qName": "Осмотический диуретик:",
            "rA": [
                "маннитол (маннит)"
            ],
            "wA": [
                "гидрохлоротиазид (дихлотиазид)",
                "спиронолактон",
                "фуросемид",
                "триамтерен"
            ]
        },
        {
            "qID": 129,
            "qName": "Правильное утверждение:",
            "rA": [
                "при\tдлительном\tприменении\tфуросемида возможны нарушения слуха"
            ],
            "wA": [
                "хлорталидон\t(оксодолин)\t-\tосмотически активный диуретик",
                "спиронолактон действует кратковременно",
                "гидрохлоротиазид\t(дихлотиазид)\tприменяют при отеке легких"
            ]
        },
        {
            "qID": 130,
            "qName": "Указать\tкалийсберегающий\tдиуретик\t-антагонист альдостерона:",
            "rA": [
                "спиронолактон"
            ],
            "wA": [
                "триамтерен",
                "амилорид",
                "фуросемид",
                "гидрохлоротиазид (дихлотиазид)"
            ]
        },
        {
            "qID": 131,
            "qName": "Что\tхарактерно\tдля\tгидрохлоротиазида (дихлотиазид):",
            "rA": [
                "повышает эффект вазопрессина"
            ],
            "wA": [
                "действует на восходящую часть петли Генле",
                "вызывает гиперкалиемию",
                "снижает эффект вазопрессина"
            ]
        },
        {
            "qID": 132,
            "qName": "Бронхолитическое\tдействие\tсальбутамола обусловлено:",
            "rA": [
                "возбуждением бета2-адренорецепторов гладких мышц бронхов"
            ],
            "wA": [
                "блокадой М-холинорецепторов гладких мышц бронхов",
                "прямым расслабляющим влиянием на гладкие мышцы бронхов"
            ]
        },
        {
            "qID": 133,
            "qName": "Бронхолитическое действие сальбутамола связано:",
            "rA": [
                "с\tвозбуждением\tбета2-адренорецепторов бронхов"
            ],
            "wA": [
                "с блокадой М-холинорецепторов бронхов",
                "с прямым расслабляющим влиянием на гладкие мышцы бронхов"
            ]
        },
        {
            "qID": 134,
            "qName": "Гладкие\tмышцы\tбронхов\tрасслабляются\tпри стимуляции:",
            "rA": [
                "бета2 – адренорецепторов"
            ],
            "wA": [
                "М- холинорецепторов",
                "альфа - адренорецепторов"
            ]
        },
        {
            "qID": 135,
            "qName": "Ипратропия бромид (тровентол) расширяет бронхи за счет:",
            "rA": [
                "М- холиноблокирующего действия"
            ],
            "wA": [
                "бета2 - адреномиметического действия",
                "миотропного спазмолитического действия"
            ]
        },
        {
            "qID": 136,
            "qName": "Расширяет\tбронхи\tза\tсчет\tмиотропного спазмолитического действия:",
            "rA": [
                "аминофиллин (эуфиллин)"
            ],
            "wA": [
                "эпинефрин (адреналин)",
                "сальбутамол",
                "эфедрин",
                "метоциния йодид (метацин)"
            ]
        },
        {
            "qID": 137,
            "qName": "Салметерол применяют:",
            "rA": [
                "для предупреждения приступов бронхиальной астмы"
            ],
            "wA": [
                "при отеке легких в качестве дегидратирующего средства",
                "для подавления кашля",
                "для облегчения отхождения мокроты"
            ]
        },
        {
            "qID": 138,
            "qName": "Сальбутамол отличается от изопреналина (изадрина) тем, что:",
            "rA": [
                "в меньшей\tстепени\tувеличивает\tчастоту сердечных сокращений"
            ],
            "wA": [
                "снижает тонус бронхов",
                "снижает тонус сосудов"
            ]
        },
        {
            "qID": 139,
            "qName": "Теофиллин:",
            "rA": [
                "расширяет бронхи"
            ],
            "wA": [
                "угнетает возбудимость кашлевого центра",
                "обладает отхаркивающим действием"
            ]
        },
        {
            "qID": 140,
            "qName": "Кодеин\tоказывает\tпротивокашлевое\tдействие, потому что:",
            "rA": [
                "оказывает\tпрямое\tугнетающее\tдействие\tна кашлевой центр"
            ],
            "wA": [
                "разжижает бронхиальный секрет и облегчает отхождение мокроты",
                "угнетает\tкашлевой\tрефлекс\tза\tсчет периферического действия"
            ]
        },
        {
            "qID": 141,
            "qName": "Преноксдиазин (либексин) применяют:",
            "rA": [
                "для подавления кашля"
            ],
            "wA": [
                "при угнетении дыхания",
                "при отеке легких",
                "при бронхиальной астме",
                "для облегчения отхождения мокроты"
            ]
        },
        {
            "qID": 142,
            "qName": "Ацетилцистеин:",
            "rA": [
                "отхаркивающее средство"
            ],
            "wA": [
                "противокашлевое средство",
                "бронхолитическое средство",
                "стимулятор дыхания"
            ]
        },
        {
            "qID": 143,
            "qName": "Бромгексин:",
            "rA": [
                "отхаркивающее средство"
            ],
            "wA": [
                "бронхолитическое средство",
                "противокашлевое средство"
            ]
        },
        {
            "qID": 144,
            "qName": "Механизм\tотхаркивающего\tдействия\tтермопсиса обусловлен:",
            "rA": [
                "стимуляцией рецепторов желудка и кишечника"
            ],
            "wA": [
                "рефлексом с рецепторов бронхов",
                "прямым действием на рвотный центр",
                "стимуляцией холинорецепторов"
            ]
        },
        {
            "qID": 145,
            "qName": "Препараты термопсиса используют:",
            "rA": [
                "в качестве отхаркивающих средств"
            ],
            "wA": [
                "для стимуляции дыхания",
                "для предупреждения и купирования приступов бронхиальной астмы",
                "при отеке легких"
            ]
        },
        {
            "qID": 146,
            "qName": "Трипсин оказывает отхаркивающее действие, потому что:",
            "rA": [
                "снижает\tвязкость\tсекрета\tбронхов\tза\tсчет протеолитического действия"
            ],
            "wA": [
                "рефлекторно усиливает секрецию бронхиальных желез",
                "оказывает прямое стимулирующее действие на бронхиальные железы"
            ]
        },
        {
            "qID": 147,
            "qName": "При рефлекторной остановке дыхания эффективны:",
            "rA": [
                "стимуляторы дыхания любой группы"
            ],
            "wA": [
                "только\tстимуляторы\tдыхания\tрефлекторного действия",
                "только\tстимуляторы\tдыхания,\tпрямо активирующие центр дыхания",
                "только стимуляторы дыхания смешанного типа действия"
            ]
        },
        {
            "qID": 148,
            "qName": "Пеногаситель, применяющийся при отеке легких:",
            "rA": [
                "спирт этиловый"
            ],
            "wA": [
                "маннитол (маннит)",
                "фуросемид",
                "морфин",
                "строфантин",
                "гексаметония бензосульфонат (бензогексоний)"
            ]
        },
        {
            "qID": 149,
            "qName": "При отеке легких применяют:",
            "rA": [
                "фуросемид"
            ],
            "wA": [
                "триамтерен",
                "гидрохлоротиазид (дихлотиазид)",
                "спиронолактон"
            ]
        },
        {
            "qID": 150,
            "qName": "Для повышения аппетита используют:",
            "rA": [
                "горечи"
            ],
            "wA": [
                "М-холиноблокаторы",
                "Н2-гистаминоблокаторы",
                "антациды",
                "гастропротекторы"
            ]
        },
        {
            "qID": 151,
            "qName": "Гастропротектор, аналог ПГЕ1:",
            "rA": [
                "мизопростол"
            ],
            "wA": [
                "висмута нитрат основной",
                "сукральфат",
                "динопрост",
                "апротинин (контрикал)"
            ]
        },
        {
            "qID": 152,
            "qName": "Механизм\tснижения\tжелудочной\tсекреции\tпод влиянием омепразола:",
            "rA": [
                "ингибирует Н,К-АТФ-азу (протоновый насосос)"
            ],
            "wA": [
                "блокирует гистаминовые Н2-рецепторы",
                "блокирует М-холинорецепторы"
            ]
        },
        {
            "qID": 153,
            "qName": "Механизм\tснижения\tжелудочной\tсекреции\tпод влиянием ранитидина:",
            "rA": [
                "блокирует гистаминовые Н2-рецепторы"
            ],
            "wA": [
                "блокирует М-холинорецепторы",
                "ингибирует Н,К-АТФ-азу (протоновый насосос)"
            ]
        },
        {
            "qID": 154,
            "qName": "Омепразол применяют:",
            "rA": [
                "для\tлечения\tязвенной\tболезни\tжелудка\tи двенадцатиперстной кишки"
            ],
            "wA": [
                "в качестве рвотного средства",
                "в качестве слабительного средства",
                "в качестве желчегонного средства"
            ]
        },
        {
            "qID": 155,
            "qName": "Фамотидин снижает секрецию желудочного сока, потому что блокирует:",
            "rA": [
                "гистаминовые Н2-рецепторы"
            ],
            "wA": [
                "М-холинорецепторы",
                "гистаминовые Н1-рецепторы"
            ]
        },
        {
            "qID": 156,
            "qName": "Наиболее\tэффективно\tпредупреждают\tрвоту\tпри химиотерапии опухолей:",
            "rA": [
                "блокаторы серотониновых рецепторов"
            ],
            "wA": [
                "блокаторы адренорецепторов",
                "блокаторы М-холинорецепторов",
                "блокаторы - ГАМК рецепторов"
            ]
        },
        {
            "qID": 157,
            "qName": "Механизм желчегонного действия холосаса:",
            "rA": [
                "увеличивает продукцию желчи гепатоцитами"
            ],
            "wA": [
                "способствует расслаблению сфинктера Одди",
                "прямо стимулируюет гладкие мышцы желчного пузыря"
            ]
        },
        {
            "qID": 158,
            "qName": "При отравлении бледной поганкой назначают:",
            "rA": [
                "силибинин (легалон)"
            ],
            "wA": [
                "адеметионин (гептрал)",
                "мизопростол (сайтотек)",
                "метоклопрамид",
                "эссенциале"
            ]
        },
        {
            "qID": 159,
            "qName": "Для лечения диареи применяют:",
            "rA": [
                "лоперамид (имодиум)"
            ],
            "wA": [
                "атропин",
                "неостигмина метилсульфат (прозерин)",
                "дротаверин",
                "натрия гидрокарбонат"
            ]
        },
        {
            "qID": 160,
            "qName": "Антибиотик, обладает широким спектром антимикробного действия. Кислотоустойчив, не устойчив к действию пенициллиназы:",
            "rA": [
                "ампициллин"
            ],
            "wA": [
                "оксациллин",
                "бензилпенициллина натриевая соль",
                "бензатин бензилпенициллин бензилпенициллин прокаина (бициллин-5)"
            ]
        },
        {
            "qID": 161,
            "qName": "Гепатотоксическое действие характерно для:",
            "rA": [
                "биосинтетических"
            ],
            "wA": [
                "аминогликозидов",
                "цефалоспоринов",
                "тетрациклинов",
                "пенициллинов"
            ]
        },
        {
            "qID": 162,
            "qName": "Группа антибиотиков, обладающая ототоксическими свойствами:",
            "rA": [
                "аминогликозиды"
            ],
            "wA": [
                "тетрациклины",
                "макролиды",
                "цефалоспорины"
            ]
        },
        {
            "qID": 163,
            "qName": "Какой препарат устойчив к пенициллиназе:",
            "rA": [
                "оксациллин"
            ],
            "wA": [
                "бензилпенициллин",
                "феноксиметилпенициллин",
                "ампициллин"
            ]
        },
        {
            "qID": 164,
            "qName": "Механизм антимикробного действия пенициллинов заключается в том, что они нарушают в микробной клетке:",
            "rA": [
                "синтез клеточной стенки"
            ],
            "wA": [
                "проницаемость цитоплазматической мембраны",
                "внутриклеточный синтез белка",
                "синтез РНК"
            ]
        },
        {
            "qID": 165,
            "qName": "Ототоксическими свойствами обладают:",
            "rA": [
                "аминогликозиды"
            ],
            "wA": [
                "тетрациклины",
                "макролиды",
                "хлорамфеникол (левомицетин)"
            ]
        },
        {
            "qID": 166,
            "qName": "Пенициллины\tи\tцефалоспорины\tнарушают\tу бактерий:",
            "rA": [
                "синтез клеточной стенки"
            ],
            "wA": [
                "проницаемость цитоплазматической мембраны",
                "внутриклеточный синтез белка",
                "синтез РНК"
            ]
        },
        {
            "qID": 167,
            "qName": "Побочное действие пенициллинов проявляется:",
            "rA": [
                "аллергическими реакциями"
            ],
            "wA": [
                "угнетением кроветворения",
                "угнетением функции почек",
                "нарушениями\tслуха\tи\tвестибулярными расстройствами"
            ]
        },
        {
            "qID": 168,
            "qName": "Полимиксины нарушают:",
            "rA": [
                "проницаемость цитоплазматической мембраны бактерий"
            ],
            "wA": [
                "синтез клеточной стенки бактерий",
                "синтез РНК",
                "синтез белка на рибосомах"
            ]
        },
        {
            "qID": 169,
            "qName": "При сифилисе применяют:",
            "rA": [
                "препараты бензилпенициллина"
            ],
            "wA": [
                "стрептомицин",
                "канамицин"
            ]
        },
        {
            "qID": 170,
            "qName": "Рациональная комбинация антибиотиков:",
            "rA": [
                "ампициллиноксациллин"
            ],
            "wA": [
                "стрептомицинамикацин",
                "пенициллинытетрациклин"
            ]
        },
        {
            "qID": 171,
            "qName": "Тетрациклины могут оказывать:",
            "rA": [
                "гепатотоксическое действие"
            ],
            "wA": [
                "нефротоксическое действие",
                "ототоксическое действие"
            ]
        },
        {
            "qID": 172,
            "qName": "Эритромицин:",
            "rA": [
                "макролид"
            ],
            "wA": [
                "аминогликозид",
                "полимиксин",
                "цефалоспорин"
            ]
        },
        {
            "qID": 173,
            "qName": "Кислота налидиксовая действует преимущественно на:",
            "rA": [
                "грамотрицательные бактерии"
            ],
            "wA": [
                "грамположительные бактерии",
                "имеет широкий спектр действия"
            ]
        },
        {
            "qID": 174,
            "qName": "Офлоксацин относится к:",
            "rA": [
                "фторхинолонам"
            ],
            "wA": [
                "сульфаниламидам",
                "нитрофуранам"
            ]
        },
        {
            "qID": 175,
            "qName": "Ципрофлоксацин относится к производным:",
            "rA": [
                "фторхинолона"
            ],
            "wA": [
                "нитрофурана",
                "8-оксихинолина"
            ]
        },
        {
            "qID": 176,
            "qName": "Изониазид является производным:",
            "rA": [
                "ГИНК"
            ],
            "wA": [
                "сульфаниламида",
                "нитрофурана"
            ]
        },
        {
            "qID": 177,
            "qName": "Какой препарат может вызывать невриты:",
            "rA": [
                "изониазид"
            ],
            "wA": [
                "рифампицин"
            ]
        },
        {
            "qID": 178,
            "qName": "Какой препарат эффективен в отношении как внутриклеточно, так и внеклеточно расположенных микобактерий туберкулеза:",
            "rA": [
                "изониазид"
            ],
            "wA": [
                "стрептомицин"
            ]
        },
        {
            "qID": 179,
            "qName": "Механизм действия препаратов ГИНК обусловлен:",
            "rA": [
                "подавлением синтеза миколевых кислот"
            ],
            "wA": [
                "изменением\tпроницаемости цитоплазматической мембраны",
                "подавлением синтеза белка",
                "нарушением использования пабк"
            ]
        },
        {
            "qID": 180,
            "qName": "Механизм действия стрептомицина на микобактерии туберкулеза обусловлен:",
            "rA": [
                "угнетением внутриклеточного синтеза белка"
            ],
            "wA": [
                "угнетением синтеза РНК",
                "антагонизмом с пара-аминобензойном кислотой",
                "нарушением\tсинтеза\tклеточной\tоболочки микобактерий"
            ]
        },
        {
            "qID": 181,
            "qName": "Рифампицин нарушает:",
            "rA": [
                "синтез РНК"
            ],
            "wA": [
                "синтез клеточной стенки бактерий",
                "проницаемость цитоплазматической мембраны бактерий",
                "синтез белка на рибосомах"
            ]
        },
        {
            "qID": 182,
            "qName": "Угнетение\tвнутриклеточного\tсинтеза\tбелка\tу микобактерий туберкулеза вызывает:",
            "rA": [
                "стрептомицин"
            ],
            "wA": [
                "рифампицин",
                "этамбутол"
            ]
        },
        {
            "qID": 183,
            "qName": "Угнетение функции почек может вызывать:",
            "rA": [
                "стрептомицин"
            ],
            "wA": [
                "рифампицин"
            ]
        },
        {
            "qID": 184,
            "qName": "Выберите противогрибковый препарат из группы аллиламинов:",
            "rA": [
                "тербинафин"
            ],
            "wA": [
                "нистатин",
                "леворин",
                "амфотерицин В",
                "кетоконазол"
            ]
        },
        {
            "qID": 185,
            "qName": "К нистатину чувствительны:",
            "rA": [
                "возбудитель кандидозов"
            ],
            "wA": [
                "возбудители системных микозов (гистоплазмоза и др.)",
                "возбудители дерматомикозов"
            ]
        },
        {
            "qID": 186,
            "qName": "Кетоконазол вызывает:",
            "rA": [
                "нарушение проницаемости цитоплазматических мембран грибов"
            ],
            "wA": [
                "нарушение синтеза клеточной оболочки грибов",
                "угнетение синтеза нуклеиновых кислот"
            ]
        },
        {
            "qID": 187,
            "qName": "Механизм фунгицидного действия гризеофульвина возможно обусловлен:",
            "rA": [
                "угнетением синтеза нуклеиновых кислот"
            ],
            "wA": [
                "нарушением синтеза клеточной оболочки грибов",
                "нарушением\tпроницаемости цитоплазматических мембран"
            ]
        },
        {
            "qID": 188,
            "qName": "Нистатин вызывает:",
            "rA": [
                "нарушение проницаемости цитоплазматических мембран грибов"
            ],
            "wA": [
                "нарушение синтеза клеточной оболочки грибов",
                "угнетение синтеза нуклеиновых кислот"
            ]
        },
        {
            "qID": 189,
            "qName": "Ацикловир эффективен при:",
            "rA": [
                "герпетической инфекции"
            ],
            "wA": [
                "гриппе",
                "ВИЧ-инфекции (СПИД)"
            ]
        },
        {
            "qID": 190,
            "qName": "Каков механизм действия римантадина:",
            "rA": [
                "блокада ионных М2-каналов вируса"
            ],
            "wA": [
                "ингибирование нейраминидазы",
                "подавление синтеза ДНК",
                "подавление синтеза РНК",
                "подавление синтеза ГМФ"
            ]
        },
        {
            "qID": 191,
            "qName": "Отметить показание к применению римантадина:",
            "rA": [
                "профилактика гриппа А2"
            ],
            "wA": [
                "лечение гриппа",
                "лечение\tгерпетических\tинфекций\tкожи\tи слизистых оболочек",
                "профилактика оспы"
            ]
        },
        {
            "qID": 192,
            "qName": "Проникновение\tвируса\tв\tклетку\tи\tпроцесс высвобождения вирусного генома нарушают:",
            "rA": [
                "римантадин (ремантадин)"
            ],
            "wA": [
                "ацикловир"
            ]
        },
        {
            "qID": 193,
            "qName": "Синтез нуклеиновых кислот нарушает:",
            "rA": [
                "ацикловир"
            ],
            "wA": [
                "римантадин (ремантадин)"
            ]
        },
        {
            "qID": 194,
            "qName": "Как\tпротивоамебное\tсредство\tметронидазол применяют:",
            "rA": [
                "при любых формах амебиаза"
            ],
            "wA": [
                "только при кишечном амебиазе",
                "только при внекишечном амебиазе"
            ]
        },
        {
            "qID": 195,
            "qName": "При лямблиозе применяют:",
            "rA": [
                "фуразолидон"
            ],
            "wA": [
                "празиквантель",
                "нитроксолин"
            ]
        },
        {
            "qID": 196,
            "qName": "Эффективен при амебиазе любой локализации:",
            "rA": [
                "метронидазол"
            ],
            "wA": [
                "тетрациклин",
                "хиниофон",
                "эметин"
            ]
        },
        {
            "qID": 197,
            "qName": "Малый иммунодепрессант, противоаритмический препарат\tприменяемый\tв\tкачестве гематошизотропного средства при всех формах малярии:",
            "rA": [
                "хлорохин (хингамин)"
            ],
            "wA": [
                "мономицин",
                "фуразолидон",
                "хинин",
                "мепакрин (акрихин)"
            ]
        },
        {
            "qID": 198,
            "qName": "Противоглистный препарат, обладающий высокой активностью в отношении всех кишечных тениидозов, но противопоказанный при тениозе во избежание развития цистицеркоза:",
            "rA": [
                "никлозамид (фенасал)"
            ],
            "wA": [
                "албендазол",
                "празиквантел",
                "инвермектин",
                "ивермектин"
            ]
        },
        {
            "qID": 199,
            "qName": "Средство для лечения трихомонадоза из группы нитроимидозолов:",
            "rA": [
                "метронидазол"
            ],
            "wA": [
                "трихомонацид",
                "аминитразол (нитазол)",
                "фуразолидон",
                "аминохинол"
            ]
        },
        {
            "qID": 200,
            "qName": "Анаболический стероид:",
            "rA": [
                "нандролон (ретаболил)"
            ],
            "wA": [
                "преднизолон",
                "дексаметазон",
                "гидрокортизон"
            ]
        },
        {
            "qID": 201,
            "qName": "Антитиреоидное средство:",
            "rA": [
                "тиамазол (мерказолил)"
            ],
            "wA": [
                "левотироксин натрия (L-тироксин)",
                "лиотиронин (трииодтиронин)"
            ]
        },
        {
            "qID": 202,
            "qName": "Антиэстрогенное средство:",
            "rA": [
                "кломифен"
            ],
            "wA": [
                "финастерид",
                "нандролон (ретаболил)",
                "беклометазон"
            ]
        },
        {
            "qID": 203,
            "qName": "Для купирования диабетической комы применяют:",
            "rA": [
                "препараты\tинсулина\tбыстрого\tи непродолжительного действия"
            ],
            "wA": [
                "препараты\tинсулина\tпролонгированного действия",
                "метформин",
                "глибенкламид",
                "акарбозу"
            ]
        },
        {
            "qID": 204,
            "qName": "Для\tстимуляции\tрегенераторных\tпроцессов применяют:",
            "rA": [
                "анаболические стероиды"
            ],
            "wA": [
                "глюкокортикоиды",
                "минералокортикоиды",
                "эстрогены"
            ]
        },
        {
            "qID": 205,
            "qName": "Как\tможно\tвводить\tпрепараты\tинсулина пролонгированного действия:",
            "rA": [
                "подкожно"
            ],
            "wA": [
                "внутрь",
                "внутривенно"
            ]
        },
        {
            "qID": 206,
            "qName": "Какой гормональный препарат повышает тонус и сократительную активность миометрия:",
            "rA": [
                "none (ответ 3, но такого нет)"
            ],
            "wA": [
                "гонадотропин хорионический",
                "гонадотропин менопаузный"
            ]
        },
        {
            "qID": 207,
            "qName": "Комбинированные\tэстроген-гестагенные контрацептивы:",
            "rA": [
                "подавляют овуляцию"
            ],
            "wA": [
                "способствуют овуляции",
                "не влияют на овуляцию",
                "стимулирует развитие молочных желез"
            ]
        },
        {
            "qID": 208,
            "qName": "Нандролон (ретаболил):",
            "rA": [
                "анаболический стероид"
            ],
            "wA": [
                "глюкокортикоид",
                "эстроген",
                "гестаген"
            ]
        },
        {
            "qID": 209,
            "qName": "Овуляции способствует:",
            "rA": [
                "гонадотропин"
            ],
            "wA": [
                "прогестерон",
                "преднизолон",
                "левотироксин",
                "бромокриптин"
            ]
        },
        {
            "qID": 210,
            "qName": "Определить препарат: обладает гипогликемическим действием; эффективен при приеме внутрь; является производным бигуанида",
            "rA": [
                "метформин"
            ],
            "wA": [
                "глибенкламид",
                "акарбоза"
            ]
        },
        {
            "qID": 211,
            "qName": "По\tсравнению\tс\tандрогенными\tпрепаратами анаболические стероиды:",
            "rA": [
                "обладают\tзначительно\tменьшей\tандрогенной активностью"
            ],
            "wA": [
                "обладают такой же андрогенной активностью"
            ]
        },
        {
            "qID": 212,
            "qName": "Препарат с минералокортикоидной активностью:",
            "rA": [
                "дезоксикортон (дезоксикортикостерон)"
            ],
            "wA": [
                "дексаметазон",
                "флуметазон",
                "тестостерон",
                "беклометазон"
            ]
        },
        {
            "qID": 213,
            "qName": "Препараты инсулина пролонгированного действия:",
            "rA": [
                "эффективны при сахарном диабете 1 типа"
            ],
            "wA": [
                "используются для купирования диабетической комы",
                "используются только для лечения несахарного диабета"
            ]
        },
        {
            "qID": 214,
            "qName": "При гипертиреозе применяют:",
            "rA": [
                "тиамазол (мерказолил)"
            ],
            "wA": [
                "лиотиронин (трийодтиронин)"
            ]
        },
        {
            "qID": 215,
            "qName": "При\tнедостаточной\tфункции\tжелтого\tтела применяют:",
            "rA": [
                "прогестерон"
            ],
            "wA": [
                "эстриол",
                "тестостерон",
                "эстрадиол"
            ]
        },
        {
            "qID": 216,
            "qName": "При остеопорозе назначают:",
            "rA": [
                "кальцитриол"
            ],
            "wA": [
                "паратиреоидин",
                "октреотид",
                "кортикотропин"
            ]
        },
        {
            "qID": 217,
            "qName": "Прогестерон:",
            "rA": [
                "гестагенный препарат"
            ],
            "wA": [
                "анаболический стероид",
                "эстрогенный препарат"
            ]
        },
        {
            "qID": 218,
            "qName": "Противовоспалительный,\tпротивоаллергический\tи иммунодепрессивный эффекты вызывают:",
            "rA": [
                "глюкокортикоиды"
            ],
            "wA": [
                "анаболические стероиды",
                "эстрогены",
                "гестагены"
            ]
        },
        {
            "qID": 219,
            "qName": "Правильно:",
            "rA": [
                "десмопрессин\tприменяют\tдля\tлечения несахарного диабета"
            ],
            "wA": [
                "октреотид применяют при карликовом росте",
                "кальцитонин\t(кальцитрин)\tприменяют\tпри спазмофилии",
                "правильных утверждений нет"
            ]
        },
        {
            "qID": 220,
            "qName": "Правильно:",
            "rA": [
                "глибенкламид\t-\tпроизводное сульфонилмочевины"
            ],
            "wA": [
                "кальцитонин\t(кальцитрин)\tповышает\tуровень кальция в крови",
                "кортикотропин применяют при микседеме"
            ]
        },
        {
            "qID": 221,
            "qName": "Антиоксидантными свойствами обладает:",
            "rA": [
                "альфа-токоферол (витамин Е)"
            ],
            "wA": [
                "ретинол",
                "эргокальциферол",
                "рутозид (рутин)",
                "кислота никотиновая"
            ]
        },
        {
            "qID": 222,
            "qName": "Витамин\tД\tв\tорганизме\tрегулирует\tглавным образом:",
            "rA": [
                "обмен кальция и фосфора"
            ],
            "wA": [
                "углеводный обмен",
                "обмен белков",
                "обмен жиров",
                "Рh крови"
            ]
        },
        {
            "qID": 223,
            "qName": "Витамин, повышающий синтез ацетилхолина и угнетающий\tактивность\tхолинэстеразы, устраняющий ацидоз:",
            "rA": [
                "витамин В1"
            ],
            "wA": [
                "витамин В6",
                "витамин В12",
                "витамин С",
                "витамин В3"
            ]
        },
        {
            "qID": 224,
            "qName": "Витамин, принимающий участие в усвоении, транспортировке превращениях (переаминировании, декарбоксилировании и др.) образовании незаменимых аминокислот:",
            "rA": [
                "пиридоксин"
            ],
            "wA": [
                "рибофлавин",
                "тиамин",
                "липоевая кислота",
                "тиамин"
            ]
        },
        {
            "qID": 225,
            "qName": "Витамин, участвующий в синтезе ГАМК и других тормозных медиаторов:",
            "rA": [
                "Пиридоксин"
            ],
            "wA": [
                "Тиамин",
                "Рутозид (рутин)",
                "Никотиновая кислота",
                "Рибоксин"
            ]
        },
        {
            "qID": 226,
            "qName": "Для\tкакого\tпрепарата\tхарактерно\tвыраженное влияние на проницаемость сосудов:",
            "rA": [
                "кислота аскорбиновая"
            ],
            "wA": [
                "кислота пангамовая",
                "кислота фолиевая",
                "кислота пантотеновая",
                "кокарбоксилаза"
            ]
        },
        {
            "qID": 227,
            "qName": "Какой витаминный препарат улучшает всасывание железа из желудочно-кишечного тракта:",
            "rA": [
                "кислота аскорбиновая"
            ],
            "wA": [
                "ретинол",
                "эргокальциферол",
                "альфа-токоферол (витамин Е)",
                "филлохинон"
            ]
        },
        {
            "qID": 228,
            "qName": "Кислота аскорбиновая:",
            "rA": [
                "восстанавливает\tв\tкишечнике\tтрехвалентное железо в двухвалентное"
            ],
            "wA": [
                "окисляет в кишечнике двухвалентное железо в трехвалентное"
            ]
        },
        {
            "qID": 229,
            "qName": "Основное средство профилактики и лечения рахита:",
            "rA": [
                "эргокальциферол"
            ],
            "wA": [
                "кислота аскорбиновая",
                "кальция пангамат",
                "цианокобаламин",
                "рутозид (рутин)"
            ]
        },
        {
            "qID": 230,
            "qName": "Рибофлавин - препарат:",
            "rA": [
                "витамина В2"
            ],
            "wA": [
                "витамина В1",
                "витамина В6",
                "витамина В12",
                "витамина В3"
            ]
        },
        {
            "qID": 231,
            "qName": "Цианокобаламин\tи\tкислота\tфолиевая\t-\tэто препараты:",
            "rA": [
                "водорастворимых витаминов"
            ],
            "wA": [
                "жирорастворимых витаминов",
                "коферментная форма витамина",
                "витаминоподобное вещество",
                "ферментный препарат"
            ]
        },
        {
            "qID": 232,
            "qName": "Статины рационально комбинировать с:",
            "rA": [
                "секвестрантами желчных кислот"
            ],
            "wA": [
                "фибратами",
                "никотиновой кислотой",
                "наркозными средствами",
                "сердечными гликозидами"
            ]
        },
        {
            "qID": 233,
            "qName": "Антиагрегантным действием обладает:",
            "rA": [
                "кислота ацетилсалициловая"
            ],
            "wA": [
                "кислота аминокапроновая",
                "варфарин",
                "урокиназа",
                "аценокумарол (синкумар)"
            ]
        },
        {
            "qID": 234,
            "qName": "Антикоагулянт,\tтормозящий\tпревращение протромбина в тромбин:",
            "rA": [
                "гепарин натрий"
            ],
            "wA": [
                "алтеплаза",
                "фениндион (фенилин)",
                "варфарин",
                "коамид"
            ]
        },
        {
            "qID": 235,
            "qName": "Активность тромбина снижает: аценокумарол (синкумар)",
            "rA": [
                "варфарин"
            ],
            "wA": [
                "стрептокиназа",
                "гепарин натрий (гепарин)",
                "фениндион (фенилин)"
            ]
        },
        {
            "qID": 236,
            "qName": "Антикоагулянты непрямого действия:",
            "rA": [
                "угнетают образование в печени протромбина и проконвертина"
            ],
            "wA": [
                "образуют\tкомплекс\tс\tантитромбином\tIII, инактивируя тромбин",
                "угнетают\tфакторы,\tактивирующие\tпереход протромбина в тромбин"
            ]
        },
        {
            "qID": 237,
            "qName": "Варфарин непосредственно влияет на:",
            "rA": [
                "синтез протромбина в печени"
            ],
            "wA": [
                "переход протромбина в тромбин",
                "превращение фибриногена в фибрин",
                "тормозит превращение плазминогена в плазмин",
                "агрегацию тромбоцитов"
            ]
        },
        {
            "qID": 238,
            "qName": "Варфарин:",
            "rA": [
                "антикоагулянт"
            ],
            "wA": [
                "антиагрегант",
                "антифибринолитическое средство",
                "антианемическое средство",
                "фибринолитическое средство"
            ]
        },
        {
            "qID": 239,
            "qName": "Укажите антагонист непрямых антикоагулянтов:",
            "rA": [
                "менадиона натрия бисульфит (викасол)"
            ],
            "wA": [
                "дипиридамол",
                "аминокапроновая кислота",
                "амбен",
                "ацетилсалициловая кислота"
            ]
        },
        {
            "qID": 240,
            "qName": "Стрептокиназа и урокиназа действуют:",
            "rA": [
                "как в тромбе, так и в плазме крови"
            ],
            "wA": [
                "только в тромбе",
                "только в плазме крови"
            ]
        },
        {
            "qID": 241,
            "qName": "Менадион натрия бисульфит (витамин К1):",
            "rA": [
                "средство, повышающее свертывание крови"
            ],
            "wA": [
                "средство, снижающее свертывание крови",
                "средство, угнетающее фибринолиз"
            ]
        },
        {
            "qID": 242,
            "qName": "Применяется\tпри\tкровотечениях,\tсвязанных\tс повышенным фибринолизом:",
            "rA": [
                "кислота аминокапроновая"
            ],
            "wA": [
                "кислота ацетилсалициловая",
                "алтеплаза"
            ]
        },
        {
            "qID": 243,
            "qName": "Способствует образованию фибрина, применяется местно при кровотечениях:",
            "rA": [
                "тромбин"
            ],
            "wA": [
                "фитоменадион",
                "кислота аминокапроновая"
            ]
        },
        {
            "qID": 244,
            "qName": "Препараты железа применяют:",
            "rA": [
                "для лечения гипохромных анемий"
            ],
            "wA": [
                "для лечения гиперхромных анемий",
                "для профилактики тромбозов"
            ]
        },
        {
            "qID": 245,
            "qName": "Феррум-лек:",
            "rA": [
                "стимулятор эритропоэза"
            ],
            "wA": [
                "стимулятор лейкопоэза",
                "стимулятор свертывания крови",
                "антикоагулянт",
                "антиагрегант"
            ]
        },
        {
            "qID": 246,
            "qName": "Молграмостим:",
            "rA": [
                "стимулятор лейкопоэза"
            ],
            "wA": [
                "стимулятор эритропоэза",
                "антикоагулянт",
                "антифибринолитическое средство"
            ]
        },
        {
            "qID": 247,
            "qName": "Гестагенный препарат, применяемый при бесплодии, угрожающем аборте, функциональном маточном кровотечение:",
            "rA": [
                "дюфастон (дидрогестерон)"
            ],
            "wA": [
                "индометацин",
                "окситоцин",
                "натрия оксибутират",
                "питуитрин"
            ]
        },
        {
            "qID": 248,
            "qName": "Динопрост и динопростон стимулируют сокращения:",
            "rA": [
                "беременной матки в любые сроки беременности"
            ],
            "wA": [
                "беременной\tматки\tтолько\tв\tпоследнем триместре"
            ]
        },
        {
            "qID": 249,
            "qName": "Основной эффект окситоцина:",
            "rA": [
                "повышает тонус и сократительную активность миометрия"
            ],
            "wA": [
                "способствует овуляции",
                "стимулирует\tпродукцию глюкокортикостероидов",
                "регулирует\tреабсорбцию\tводы\tв\tдистальной части нефрона"
            ]
        },
        {
            "qID": 250,
            "qName": "Сократительную активность миометрия понижают:",
            "rA": [
                "бета2-адреномиметики"
            ],
            "wA": [
                "окситоцин",
                "алкалоиды спорыньи",
                "динопрост",
                "динопростон"
            ]
        },
        {
            "qID": 251,
            "qName": "При\tповышении\tдиссоциации\tвеществ\tих всасывание в кишечнике:",
            "rA": [
                "затрудняется"
            ],
            "wA": [
                "облегчается"
            ]
        },
        {
            "qID": 252,
            "qName": "Механизм действия угля активированного:",
            "rA": [
                "образование слабых вандерваальсовых связей с ядом"
            ],
            "wA": [
                "нейтрализация яда",
                "фармакологический антагонизм с ядом",
                "образование хелатных комплексов",
                "иммунологический антагонизм с ядом"
            ]
        },
        {
            "qID": 253,
            "qName": "Только для поверхностной анестезии применяют:",
            "rA": [
                "бензокаин (анестезин)"
            ],
            "wA": [
                "прокаин (новокаин)",
                "лидокаин"
            ]
        },
        {
            "qID": 254,
            "qName": "Пилокарпин применяют:",
            "rA": [
                "при глаукоме"
            ],
            "wA": [
                "для паралича аккомодации при подборе очков",
                "для анестезии роговицы"
            ]
        },
        {
            "qID": 255,
            "qName": "Показание к применению пилокарпина:",
            "rA": [
                "глаукома"
            ],
            "wA": [
                "бронхиальная астма",
                "артериальная гипотензия",
                "атония кишечника",
                "исследование глазного дна"
            ]
        },
        {
            "qID": 256,
            "qName": "Ганглиоблокатор короткого действия:",
            "rA": [
                "трепирия йодид (гигроний)"
            ],
            "wA": [
                "азаметония бромид (пентамин)",
                "суксаметония хлорид (дитилин)",
                "гексаметония бензосульфонат (бензогексоний)",
                "тубокурарин"
            ]
        },
        {
            "qID": 257,
            "qName": "Миорелаксант деполяризующего действия:",
            "rA": [
                "суксаметония бромид (дитилин)"
            ],
            "wA": [
                "панкуроний",
                "платифиллин",
                "азаметония бромид (пентамин)",
                "тубокурарин"
            ]
        },
        {
            "qID": 258,
            "qName": "Паралич аккомодации вызывают:",
            "rA": [
                "М-холиноблокаторы"
            ],
            "wA": [
                "М-холиномиметики",
                "антихолинэстеразные вещества"
            ]
        },
        {
            "qID": 259,
            "qName": "Снижение\tтонуса\tшейки\tматки\tпод\tвлиянием атропина связано с блокадой:",
            "rA": [
                "М-холинорецепторов"
            ],
            "wA": [
                "альфа-адренорецепторов",
                "бета2-адренорецепторов"
            ]
        },
        {
            "qID": 260,
            "qName": "Трепирия йодид (гигроний) применяют:",
            "rA": [
                "для управляемой гипотензии"
            ],
            "wA": [
                "при глаукоме",
                "при атонии мочевого пузыря"
            ]
        },
        {
            "qID": 261,
            "qName": "Бета2-адреномиметики:",
            "rA": [
                "ослабляют\tсократительную\tактивность миометрия"
            ],
            "wA": [
                "усиливают\tсократительную\tактивность миометрия",
                "повышают преимущественно тонус миометрия",
                "суживают бронхи"
            ]
        },
        {
            "qID": 262,
            "qName": "Какой\tадреномиметик\tиспользуют\tпри атриовентрикулярном блоке:",
            "rA": [
                "изопреналин (изадрин)"
            ],
            "wA": [
                "сальбутамол",
                "фенотерол"
            ]
        },
        {
            "qID": 263,
            "qName": "Кардиостимулирующее\tдействие\tэпинефрина (адреналина) связано с:",
            "rA": [
                "возбуждением бета-1-адренорецепторов"
            ],
            "wA": [
                "угнетением МАО",
                "блокадой фосфодиэстеразы",
                "активацией КОМТ",
                "снижением в клетке содержания АТФ",
                "активацией МАО"
            ]
        },
        {
            "qID": 264,
            "qName": "Симпатомиметик:",
            "rA": [
                "эфедрин"
            ],
            "wA": [
                "эпинефрин (адреналин)",
                "сальбутамол",
                "ксилометазолин (галазолин)",
                "норэпинефрин (норадреналин)"
            ]
        },
        {
            "qID": 265,
            "qName": "Стимулирует высвобождение норэпинефрина (норадреналин) из окончаний адренергических нервов:",
            "rA": [
                "эфедрин"
            ],
            "wA": [
                "клонидин (клофелин)",
                "резерпин",
                "фенилэфрин (мезатон)"
            ]
        },
        {
            "qID": 266,
            "qName": "Эпинефрин (адреналин) снижает:",
            "rA": [
                "тонус бронхов"
            ],
            "wA": [
                "силу сокращений сердца",
                "частоту сокращений сердца",
                "автоматизм сердца",
                "атриовентрикулярную проводимость"
            ]
        },
        {
            "qID": 267,
            "qName": "Метопролол блокирует преимущественно:",
            "rA": [
                "бета1-адренорецепторы"
            ],
            "wA": [
                "альфа1-адренорецепторы",
                "альфа2-адренорецепторы",
                "бета2-адренорецепторы"
            ]
        },
        {
            "qID": 268,
            "qName": "Пропранолол (анаприлин) повышает:",
            "rA": [
                "тонус бронхов"
            ],
            "wA": [
                "силу сокращений сердца",
                "частоту сокращений сердца",
                "атриовентрикулярную проводимость",
                "автоматизм сердца"
            ]
        },
        {
            "qID": 269,
            "qName": "Спирт\tэтиловый\tспособствует\tпереохлаждению, потому что:",
            "rA": [
                "увеличивает теплоотдачу в большей степени, чем теплопродукцию"
            ],
            "wA": [
                "уменьшает теплопродукцию",
                "ни одно из перечисленного"
            ]
        },
        {
            "qID": 270,
            "qName": "Определите препарат: обладает антидепрессивными и седативными свойствами. Неизбирательно угнетает нейрональный захват моноаминов (норадреналина и серотонина). Может применяться в качестве анальгетика.",
            "rA": [
                "Амитриптилин"
            ],
            "wA": [
                "Мапротилин",
                "Флуоксетин",
                "Миртазапин"
            ]
        },
        {
            "qID": 271,
            "qName": "Применяется\tкак\tснотворное\tи противоэпилептическое средство, вызывает индукцию микросомальных ферментов печени:",
            "rA": [
                "фенобарбитал"
            ],
            "wA": [
                "фенитоин (дифенин)",
                "натрия вальпроат",
                "этосуксимид",
                "триметин"
            ]
        },
        {
            "qID": 272,
            "qName": "Снотворные средства из группы барбитуратов не применяют в качестве средств для наркоза, потому что они:",
            "rA": [
                "обладают малой широтой наркотического действия"
            ],
            "wA": [
                "вызывают длительную стадию возбуждения",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 273,
            "qName": "Способность уменьшать количество быстрого сна убывает в ряду:",
            "rA": [
                "этаминал-натрий - нитразепам – золпидем"
            ],
            "wA": [
                "золпидем - нитразепам - этаминал-натрий",
                "этаминал-натрий - золпидем - нитразепам",
                "все неправильно"
            ]
        },
        {
            "qID": 274,
            "qName": "Амантадин (мидантан):",
            "rA": [
                "антагонист\tглутаматергических\tпроцессов\tв мозге"
            ],
            "wA": [
                "активирует NMDA - рецепторы",
                "ингибирует МАО-В",
                "блокирует холинорецепторы в головном мозге",
                "ничего из перечисленного"
            ]
        },
        {
            "qID": 275,
            "qName": "Какой\tпротивопаркинсонический\tпрепарат применяют совместно с карбидопой:",
            "rA": [
                "леводопу"
            ],
            "wA": [
                "тригексифенидил (циклодол)",
                "амантадин (мидантан)",
                "бромокриптин"
            ]
        },
        {
            "qID": 276,
            "qName": "Карбидопа:",
            "rA": [
                "ингибитор\tпериферической\tдофа- декарбоксилазы"
            ],
            "wA": [
                "предшественник дофамина",
                "ингибитор МАО-В",
                "ингибитор катехол-о-метилтрансферазы",
                "нарушает нейрональный захват дофамина",
                "прямо стимулирует дофаминовые рецепторы"
            ]
        },
        {
            "qID": 277,
            "qName": "Блокирует опиоидные рецепторы:",
            "rA": [
                "налоксон"
            ],
            "wA": [
                "фентанил",
                "тримеперидин (промедол)",
                "метамизол натрия (анальгин)"
            ]
        },
        {
            "qID": 278,
            "qName": "Бупренорфин по сравнению с морфином:",
            "rA": [
                "может применяться сублингвально"
            ],
            "wA": [
                "менее активный",
                "обладает большей наркогенностью",
                "не угнетает дыхательный и кашлевой центры"
            ]
        },
        {
            "qID": 279,
            "qName": "Возбудимость центра кашлевого рефлекса морфин:",
            "rA": [
                "угнетает"
            ],
            "wA": [
                "стимулирует",
                "не изменяет"
            ]
        },
        {
            "qID": 280,
            "qName": "Для нейролептанальгезии фентанил применяют в комбинации:",
            "rA": [
                "с дроперидолом"
            ],
            "wA": [
                "с морфином",
                "с налорфином",
                "с метамизолом натрия (анальгином)"
            ]
        },
        {
            "qID": 281,
            "qName": "Механизм действия налоксона:",
            "rA": [
                "блокирует опиатные рецепторы"
            ],
            "wA": [
                "стимулирует опиатные рецепторы",
                "ингибирует липоксигеназу",
                "ингибирует циклооксигеназу"
            ]
        },
        {
            "qID": 282,
            "qName": "Наименьшей способностью вызывать лекарственную зависимость обладает:",
            "rA": [
                "трамадол"
            ],
            "wA": [
                "морфин",
                "фентанил",
                "тримеперидин (промедол)"
            ]
        },
        {
            "qID": 283,
            "qName": "По способности угнетать дыхание фентанил:",
            "rA": [
                "превосходит морфин"
            ],
            "wA": [
                "соответствует морфину",
                "уступает морфину"
            ]
        },
        {
            "qID": 284,
            "qName": "При\tдлительном\tприменении\tопиоидных анальгетиков их эффективность:",
            "rA": [
                "понижается"
            ],
            "wA": [
                "повышается",
                "практически не изменяется"
            ]
        },
        {
            "qID": 285,
            "qName": "Аналептики применяют:",
            "rA": [
                "для\tстимуляции\tдыхательного\tи сосудодвигательного центров"
            ],
            "wA": [
                "при бессоннице",
                "при эпилепсии"
            ]
        },
        {
            "qID": 286,
            "qName": "Кофеин:",
            "rA": [
                "психостимулирующее средство"
            ],
            "wA": [
                "ноотропное средство",
                "седативное средство",
                "анксиолитик"
            ]
        },
        {
            "qID": 287,
            "qName": "Средство, возбуждающее центры продолговатого мозга, а также стимулирующее умственную и физическую работоспособность:",
            "rA": [
                "кофеин"
            ],
            "wA": [
                "нитразепам",
                "галотан (фторотан)",
                "зопиклон (имован)",
                "фенитоин (дифенин)"
            ]
        },
        {
            "qID": 288,
            "qName": "Вводится только внутривенно, кардиотонический эффект развивается через 5-10 минут, применяется главным образом при острой сердечной недостаточности:",
            "rA": [
                "гликозид ландыша (коргликон)"
            ],
            "wA": [
                "дигитоксин",
                "адонизид"
            ]
        },
        {
            "qID": 289,
            "qName": "Нитроглицерин\tвызывает\tрасширение\tсосудов различной локализации, так как:",
            "rA": [
                "действует\tподобно\tэндотелиальному релаксирующему фактору"
            ],
            "wA": [
                "блокирует альфа-адренорецепторы",
                "возбуждает бета2-адренорецепторы"
            ]
        },
        {
            "qID": 290,
            "qName": "Нитроглицерин раздражает рецепторы подъязычной области и рефлекторно устраняет коронароспазмы:",
            "rA": [
                "нет"
            ],
            "wA": [
                "да"
            ]
        },
        {
            "qID": 291,
            "qName": "Все\tнижеперечисленные\tпрепараты\tвызывают брадикардию, кроме:",
            "rA": [
                "эналаприла"
            ],
            "wA": [
                "верапамила",
                "дилтиазема",
                "метопролола",
                "бисопролола"
            ]
        },
        {
            "qID": 292,
            "qName": "Определить препарат: Используется для предупреждения\t\tприступов\tстенокардии. Антиангинальный эффект обусловлен уменьшением потребности сердца в кислороде. Побочные эффекты:\tбрадикардия,\t\tнарушение атриовентрикулярной проводимости, повышение тонуса бронхов.",
            "rA": [
                "пропранолол (анаприлин)"
            ],
            "wA": [
                "верапамил",
                "изосорбида динитрат (нитросорбид)",
                "нифедипин"
            ]
        },
        {
            "qID": 293,
            "qName": "Чем\tотличается\tатенолол\tот\tпропранолола (анаприлина):",
            "rA": [
                "атенолол практически не вызывает повышения тонуса бронхов"
            ],
            "wA": [
                "атенолол не вызывает выраженной брадикардии",
                "атенолол\tне\tвызывает\tнарушений атриовентрикулярной проводимости",
                "атенолол не угнетает сократимость миокарда"
            ]
        },
        {
            "qID": 294,
            "qName": "Выберите антагонист рецепторов ангиотензина II:",
            "rA": [
                "лозартан"
            ],
            "wA": [
                "каптоприл",
                "рамиприл",
                "спиронолактон",
                "индапамид"
            ]
        },
        {
            "qID": 295,
            "qName": "Сухой кашель - характерный побочный эффект:",
            "rA": [
                "ингибиторов\tангиотензинпревращающего фермента"
            ],
            "wA": [
                "альфа-адреноблокаторов",
                "симпатолитиков",
                "миотропных гипотензивных средств",
                "диуретиков"
            ]
        },
        {
            "qID": 296,
            "qName": "Как влияет нифедипин на тонус коронарных сосудов сердца:",
            "rA": [
                "уменьшает"
            ],
            "wA": [
                "увеличивает",
                "не изменяет"
            ]
        },
        {
            "qID": 297,
            "qName": "Чем\tотличается\tнифедипин\t(фенигидин)\tот верапамила:",
            "rA": [
                "не обладает противоаритмическим эффектом"
            ],
            "wA": [
                "не обладает антиангинальным эффектом",
                "не обладает гипотензивным эффектом"
            ]
        },
        {
            "qID": 298,
            "qName": "Механизм\tантиангинального\tдействия дипиридамола:",
            "rA": [
                "расширяет\tкоронарные\tсосуды\tза\tсчет миотропного действия"
            ],
            "wA": [
                "уменьшает работу сердца",
                "блокирует\tцентральные\tзвенья коронаросуживающих рефлексов"
            ]
        },
        {
            "qID": 299,
            "qName": "Устраняет коронароспазмы, действуя рефлекторно:",
            "rA": [
                "ментола раствор в ментил изовалерате (валидол)"
            ],
            "wA": [
                "папаверин",
                "амиодарон",
                "верапамил",
                "нифедипин"
            ]
        },
        {
            "qID": 300,
            "qName": "Механизм\tдиуретического\tдействия гидрохлоротиазида",
            "rA": [
                "нарушает реабсорбцию ионов натрия и хлора в почечных канальцах"
            ],
            "wA": [
                "увеличивает фильтрацию в почечных клубочках",
                "повышает осмотическое давление в почечных канальцах",
                "блокирует альдостероновые рецепторы"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
