var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Биодоступность:",
            "rA": [
                "Количество вещества в крови в процентном отношении к введенной дозе"
            ],
            "wA": [
                "Количество вещества, которое всасывается в кишечнике"
            ]
        },
        {
            "qID": 2,
            "qName": "Вещества попадают в кровь, минуя печень, при введении:",
            "rA": [
                "Сублингвально"
            ],
            "wA": [
                "Внутрь",
                "В двенадцатиперстную кишку"
            ]
        },
        {
            "qID": 3,
            "qName": "Биотрансформация лекарственных веществ основном происходит:",
            "rA": [
                "Печени"
            ],
            "wA": [
                "В жировой ткани",
                "В почках",
                "Кишечнике",
                "Крови"
            ]
        },
        {
            "qID": 4,
            "qName": "В Накопление вещества при повторных введениях:",
            "rA": [
                "Кумуляция"
            ],
            "wA": [
                "Потенцирование",
                "Тахифилаксия",
                "Идиосинкразия"
            ]
        },
        {
            "qID": 5,
            "qName": "Необычная реакция на первое введение лекарственного вещества:",
            "rA": [
                "Идиосинкразия"
            ],
            "wA": [
                "Сенсибилизация",
                "Привыкание",
                "Потенцирование",
                "Тахифилаксия"
            ]
        },
        {
            "qID": 6,
            "qName": "Основной способ всасывания лекарственных веществ в кишечнике:",
            "rA": [
                "Пассивная диффузия"
            ],
            "wA": [
                "Активный транспорт",
                "Фильтрация",
                "Пиноцитоз"
            ]
        },
        {
            "qID": 7,
            "qName": "Потенцирование:",
            "rA": [
                "Совместный эффект двух веществ превышает сумму их эффектов"
            ],
            "wA": [
                "совместный эффект двух веществ равен сумме их эффектов"
            ]
        },
        {
            "qID": 8,
            "qName": "Усиление эффекта при совместном действии лекарственных препаратов называется:",
            "rA": [
                "Потенцирование"
            ],
            "wA": [
                "Антагонизм",
                "Идиосинкразия",
                "Тератогенность",
                "Мутагенность"
            ]
        },
        {
            "qID": 9,
            "qName": "Через гисто-гематические барьеры легко проникают:",
            "rA": [
                "Неполярные липофильные соединения"
            ],
            "wA": [
                "Полярные гидрофильные соединения"
            ]
        },
        {
            "qID": 10,
            "qName": "Аддитивное действие:",
            "rA": [
                "Совместный эффект двух веществ равен сумме их эффектов"
            ],
            "wA": [
                "Совместный эффект двух веществ превышает сумму их эффектов"
            ]
        },
        {
            "qID": 11,
            "qName": "Вещества, которые обладают аффинитетом, не имеют внутренней активности и препятствуют действию агонистов, называют:",
            "rA": [
                "Антагонистами"
            ],
            "wA": [
                "Частичными агонистами"
            ]
        },
        {
            "qID": 12,
            "qName": "Путем сравнения доз двух веществ определяют их относительную:",
            "rA": [
                "Активность"
            ],
            "wA": [
                "Эффективность"
            ]
        },
        {
            "qID": 13,
            "qName": "Снижение эффекта при повторных введениях:",
            "rA": [
                "Привыкание"
            ],
            "wA": [
                "Лекарственная зависимость",
                "Идиосинкразия"
            ]
        },
        {
            "qID": 14,
            "qName": "Способность лекарственных веществ стимулировать специфические рецепторы называют:",
            "rA": [
                "Внутренней активностью"
            ],
            "wA": [
                "Аффинитетом"
            ]
        },
        {
            "qID": 15,
            "qName": "Тахифилаксия:",
            "rA": [
                "Быстрое привыкание"
            ],
            "wA": [
                "Необычная реакция на введение вещества",
                "Накопление вещества в организме",
                "Повышение чувствительности к веществу при повторных введениях"
            ]
        },
        {
            "qID": 16,
            "qName": "Тератогенное действие:",
            "rA": [
                "Действие на эмбрион, приводящее к врожденным уродствам"
            ],
            "wA": [
                "Нежелательное действие на эмбрион, без развития врожденных уродств"
            ]
        },
        {
            "qID": 17,
            "qName": "Меры помощи, направленные на инактивацию всосавшегося яда:",
            "rA": [
                "Применение антидотов"
            ],
            "wA": [
                "Форсированный диурез",
                "Применение сорбентов (угля активированного)",
                "Применение слабительных средств",
                "Промывание желудка"
            ]
        },
        {
            "qID": 18,
            "qName": "При передозировке метилового спирта применяют:",
            "rA": [
                "Спирт этиловый"
            ],
            "wA": [
                "Феназепам",
                "Кофеин",
                "Налоксон",
                "Бупренорфин"
            ]
        },
        {
            "qID": 19,
            "qName": "При передозировке снотворных средств - производных бензодиазепина применяют:",
            "rA": [
                "Флумазенил"
            ],
            "wA": [
                "Флуоксетин",
                "Налорфин",
                "Налоксон"
            ]
        },
        {
            "qID": 20,
            "qName": "Местный анестетик, применяемый при всех видах анестезии:",
            "rA": [
                "Лидокаин"
            ],
            "wA": [
                "Кокаин",
                "Артикаин (ультракаин)",
                "Прокаин (новокаин)",
                "Пиромекаин"
            ]
        },
        {
            "qID": 21,
            "qName": "Механизм действия вяжущих средств:",
            "rA": [
                "Денатурация белков слизистых и раневого экссудата, образование плотного альбумината"
            ],
            "wA": [
                "Стимуляция нервных рецепторов",
                "Непосредственная блокада нервных окончаний",
                "Образование коллоидного слоя, покрывающего нервные окончания",
                "Активация калиевых каналов"
            ]
        },
        {
            "qID": 22,
            "qName": "Препарат вяжущего типа действия, применяемый для лечения отравлений тяжелыми металлами:",
            "rA": [
                "Танин"
            ],
            "wA": [
                "Бензокаин (анестезин)",
                "Активированный уголь",
                "Крахмал",
                "Квасцы"
            ]
        },
        {
            "qID": 23,
            "qName": "Антихолинэстеразные средства:",
            "rA": [
                "Повышают тонус и перистальтику кишечника"
            ],
            "wA": [
                "Повышают внутриглазное давление",
                "Снижают секрецию желез желудка",
                "Понижают тонус мочевого пузыря",
                "Расширяют бронхи"
            ]
        },
        {
            "qID": 24,
            "qName": "Механизм действия армина:",
            "rA": [
                "Блокирует ацетилхолинэстеразу"
            ],
            "wA": [
                "Прямо стимулирует М-холинорецепторы",
                "Прямо стимулирует Н-холинорецепторы",
                "Стимулирует ацетилхолинэстеразу"
            ]
        },
        {
            "qID": 25,
            "qName": "Механизм действия физостигмина:",
            "rA": [
                "Блокирует ацетилхолинэстеразу"
            ],
            "wA": [
                "Блокирует М-холинорецепторы",
                "Блокирует Н-холинорецепторы",
                "Блокирует МАО-В",
                "Блокирует КОМТ",
                "Блокирует фосфодиэстеразу"
            ]
        },
        {
            "qID": 26,
            "qName": "Пилокарпин снижает:",
            "rA": [
                "Внутриглазное давление"
            ],
            "wA": [
                "Тонус мышцы, суживающей зрачок",
                "Тонус цилиарной мышцы"
            ]
        },
        {
            "qID": 27,
            "qName": "Антагонисты курареподобных средств антидеполяризующего действия:",
            "rA": [
                "Антихолинэстеразные средства +"
            ],
            "wA": [
                "М-холиномиметики"
            ]
        },
        {
            "qID": 28,
            "qName": "Атропин снижает  моторику  и тонус желудочно-кишечного тракта за счет:",
            "rA": [
                "Блокады М-холинорецепторов"
            ],
            "wA": [
                "Блокады Н-холинорецепторов",
                "Миотропного спазмолитического действия",
                "Блокады альфа-адренорецепторов",
                "Блокады бета-адренорецепторов"
            ]
        },
        {
            "qID": 29,
            "qName": "Какая группа препаратов блокирует нервно- мышечную передачу:",
            "rA": [
                "Курареподобные средства +"
            ],
            "wA": [
                "М-холиноблокаторы",
                "Ганглиоблокаторы",
                "Антихолинэстеразные средства",
                "Реактиваторы ацетилхолинэстеразы"
            ]
        },
        {
            "qID": 30,
            "qName": "М-холиноблокаторы могут повышать внутриглазное давление, так как:",
            "rA": [
                "Затрудняют отток внутриглазной жидкости"
            ],
            "wA": [
                "Увеличивают продукцию внутриглазной жидкости",
                "Вызывают миоз",
                "Вызывают спазм аккомодации",
                "Снижают проницаемость сосудистой стенки"
            ]
        },
        {
            "qID": 31,
            "qName": "Бета2-адреномиметики:",
            "rA": [
                "Ослабляют сократительную активность миометрия"
            ],
            "wA": [
                "Усиливают сократительную активность миометрия",
                "Повышают преимущественно тонус миометрия"
            ]
        },
        {
            "qID": 32,
            "qName": "Изопреналин (изадрин) расширяет бронхи, так как:",
            "rA": [
                "Стимулирует бета2-адренорецепторы +"
            ],
            "wA": [
                "Стимулирует альфа2-адренорецепторы",
                "Блокирует бета2-адренорецепторы",
                "Обладает миотропными спазмолитическими свойствами"
            ]
        },
        {
            "qID": 33,
            "qName": "Оказывает прямое возбуждающее действие на все типы адренорецепторов, повышает артериальное давление:",
            "rA": [
                "Эпинефрин (адреналин) +"
            ],
            "wA": [
                "Изопреналин (изадрин)",
                "Норэпинефрин (норадреналин)",
                "Фенилэфрин (мезатон)",
                "Сальбутамол"
            ]
        },
        {
            "qID": 34,
            "qName": "Сальбутамол преимущественно стимулирует:",
            "rA": [
                "Бета2-адренорецепторы"
            ],
            "wA": [
                "Альфа1-адренорецепторы",
                "Альфа2-адренорецепторы",
                "Бета1-адренорецепторы"
            ]
        },
        {
            "qID": 35,
            "qName": "Стимулирует высвобождение норэпинефрина (норадреналин) из окончаний адренергических нервов:",
            "rA": [
                "Эфедрин"
            ],
            "wA": [
                "Клонидин (клофелин)",
                "Резерпин",
                "Фенилэфрин (мезатон)"
            ]
        },
        {
            "qID": 36,
            "qName": "Альфа-адреноблокаторы снижают артериальное давление, так как:",
            "rA": [
                "Расширяют артериальные сосуды"
            ],
            "wA": [
                "Уменьшают работу сердца",
                "Уменьшают объем плазмы крови"
            ]
        },
        {
            "qID": 37,
            "qName": "Празозин расширяет сосуды за счет:",
            "rA": [
                "Блокады альфа1-адренорецепторов"
            ],
            "wA": [
                "Блокады ангиотензиновых рецепторов"
            ]
        },
        {
            "qID": 38,
            "qName": "Газообразное вещество для ингаляционного наркоза:",
            "rA": [
                "Азота закись"
            ],
            "wA": [
                "Галотан (фторотан)",
                "Кетамин",
                "Пропофол"
            ]
        },
        {
            "qID": 39,
            "qName": "Дисульфирам (тетурам) при лечении алкоголизма:",
            "rA": [
                "Блокирует окисление спирта этилового на стадии образования ацетальдегида"
            ],
            "wA": [
                "Ускоряет окисление спирта этилового",
                "Стимулирует пусковую зону рвотного центра"
            ]
        },
        {
            "qID": 40,
            "qName": "Спирт этиловый при отеке легких:",
            "rA": [
                "Оказывает противовспенивающее действие"
            ],
            "wA": [
                "Стимулирует центр дыхания",
                "Оказывает дегидратирующее действие",
                "Снижает тонус бронхов",
                "Уменьшает давление в малом круге кровообращения"
            ]
        },
        {
            "qID": 41,
            "qName": "Барбитураты:",
            "rA": [
                "Вызывают индукцию микросомальных ферментов печени"
            ],
            "wA": [
                "Угнетают активность микросомальных ферментов печени",
                "Не влияют на микросомальные ферменты печени"
            ]
        },
        {
            "qID": 42,
            "qName": "Как влияют барбитураты на фазу быстрого сна:",
            "rA": [
                "Укорачивают"
            ],
            "wA": [
                "Удлиняют",
                "Не изменяют"
            ]
        },
        {
            "qID": 43,
            "qName": "Какой побочный эффект связан со способностью снотворных средств нарушать структуру сна:",
            "rA": [
                "Феномен \"отдачи\""
            ],
            "wA": [
                "Последействие",
                "Привыкание",
                "Лекарственная зависимость"
            ]
        },
        {
            "qID": 44,
            "qName": "Какой препарат может вызвать гиперплазию десен:",
            "rA": [
                "фенитоин (дифенин)"
            ],
            "wA": [
                "фенобарбитал",
                "натрия вальпроат",
                "ламотриджин",
                "этосуксимид"
            ]
        },
        {
            "qID": 45,
            "qName": "Назовите препарат, обладающий одновременно снотворным и противоэпилептическим действием:",
            "rA": [
                "фенобарбитал"
            ],
            "wA": [
                "карбамазепин",
                "ламотриджин",
                "фенитоин (дифенин)",
                "феназепам"
            ]
        },
        {
            "qID": 46,
            "qName": "При нарколепсии (патологической сонливости) применяют:",
            "rA": [
                "мезокарб"
            ],
            "wA": [
                "валокордин",
                "медазепам (мезапам)",
                "пиритинол",
                "пирацетам"
            ]
        },
        {
            "qID": 47,
            "qName": "Фазу быстрого сна барбитураты:",
            "rA": [
                "укорачивают"
            ],
            "wA": [
                "удлиняют",
                "не изменяют"
            ]
        },
        {
            "qID": 48,
            "qName": "Амантадин (мидантан) используют в качестве:",
            "rA": [
                "противопаркинсонического средства"
            ],
            "wA": [
                "противоэпилептического средства",
                "анальгетического средства",
                "снотворного средства"
            ]
        },
        {
            "qID": 49,
            "qName": "Для купирования эпилептического статуса применяют:",
            "rA": [
                "диазепам"
            ],
            "wA": [
                "этосуксимид",
                "тиопентал натрия"
            ]
        },
        {
            "qID": 50,
            "qName": "Карбидопа:",
            "rA": [
                "ингибитор периферической дофа- декарбоксилазы"
            ],
            "wA": [
                "предшественник дофамина",
                "ингибитор МАО-В",
                "ингибитор катехол-о-метилтрансферазы",
                "нарушает нейрональный захват дофамина",
                "прямо стимулирует дофаминовые рецепторы"
            ]
        },
        {
            "qID": 51,
            "qName": "Механизм противоэпилептического действия фенобарбитала:",
            "rA": [
                "повышение чувствительности ГАМК- рецепторов к медиатору"
            ],
            "wA": [
                "стимуляция синтеза ГАМК",
                "прямая стимуляция рецепторов ГАМК"
            ]
        },
        {
            "qID": 52,
            "qName": "Тригексифенидил (циклодол):",
            "rA": [
                "М-холиноблокатор"
            ],
            "wA": [
                "ингибитор МАО-В",
                "дофаминомиметик",
                "блокатор NMDA - рецепторов",
                "предшественник дофамина"
            ]
        },
        {
            "qID": 53,
            "qName": "Анальгетик, применяемый для нейролептанальгезии:",
            "rA": [
                "фентанил"
            ],
            "wA": [
                "тримеперидин (промедол)",
                "морфин"
            ]
        },
        {
            "qID": 54,
            "qName": "Анальгетический эффект морфина под влиянием налоксона:",
            "rA": [
                "ослабляется"
            ],
            "wA": [
                "усиливается",
                "не изменяется"
            ]
        },
        {
            "qID": 55,
            "qName": "Антагонист опиоидных анальгетиков:",
            "rA": [
                "налоксон"
            ],
            "wA": [
                "трамадол",
                "парацетамол",
                "метамизол натрия (анальгин)"
            ]
        },
        {
            "qID": 56,
            "qName": "Механизм действия налоксона:",
            "rA": [
                "блокирует опиатные рецепторы"
            ],
            "wA": [
                "стимулирует опиатные рецепторы",
                "ингибирует липоксигеназу",
                "ингибирует циклооксигеназу"
            ]
        },
        {
            "qID": 57,
            "qName": "Морфин при отеке легких:",
            "rA": [
                "предположительно снижает давление в малом круге кровообращения"
            ],
            "wA": [
                "оказывает кардиотоническое действие",
                "оказывает противовспенивающее действие",
                "возбуждает центр дыхания"
            ]
        },
        {
            "qID": 58,
            "qName": "Налоксон применяют:",
            "rA": [
                "при угнетении дыхания агонистами опиоидных рецепторов"
            ],
            "wA": [
                "при рефлекторных остановках дыхания",
                "при тяжелых отравлениях снотворными наркотического типа действия"
            ]
        },
        {
            "qID": 59,
            "qName": "Налоксон устраняет:",
            "rA": [
                "оба эффекта"
            ],
            "wA": [
                "только анальгетический эффект опиоидных анальгетиков",
                "только угнетающее действие этих веществ на дыхание"
            ]
        },
        {
            "qID": 60,
            "qName": "Тримеперидин (промедол):",
            "rA": [
                "опиоидный анальгетик"
            ],
            "wA": [
                "алкалоид опия",
                "антагонист опиоидных рецепторов",
                "по эффективности превосходит морфин",
                "действует продолжительнее морфина"
            ]
        },
        {
            "qID": 61,
            "qName": "Фентанил:",
            "rA": [
                "опиоидный анальгетик"
            ],
            "wA": [
                "ненаркотический анальгетик",
                "антагонист опиоидных анальгетиков"
            ]
        },
        {
            "qID": 62,
            "qName": "Болеутоляющий эффект парацетамола обусловлен:",
            "rA": [
                "влиянием на ЦНС"
            ],
            "wA": [
                "противовоспалительным действием",
                "угнетением проведения возбуждения по афферентным нервам"
            ]
        },
        {
            "qID": 63,
            "qName": "Анальгетический, противовоспалительный и жаропонижающий эффекты салицилатов и производных пиразолона связаны с угнетением образования:",
            "rA": [
                "простагландинов"
            ],
            "wA": [
                "эндорфинов",
                "энкефалинов"
            ]
        },
        {
            "qID": 64,
            "qName": "В качестве жаропонижающих средств при лихорадке применяют:",
            "rA": [
                "ненаркотические анальгетики"
            ],
            "wA": [
                "наркотические анальгетики",
                "антагонисты наркотических анальгетиков"
            ]
        },
        {
            "qID": 65,
            "qName": "Кислота ацетилсалициловая может вызывать:",
            "rA": [
                "изъязвление слизистой оболочки желудочно- кишечного тракта"
            ],
            "wA": [
                "снотворный эффект",
                "физическую лекарственную зависимость"
            ]
        },
        {
            "qID": 66,
            "qName": "Кислота ацетилсалициловая:",
            "rA": [
                "антиагрегант"
            ],
            "wA": [
                "фибринолитическое средство",
                "антифибринолитическое средство",
                "антианемическое средство"
            ]
        },
        {
            "qID": 67,
            "qName": "Салицилаты:",
            "rA": [
                "ингибируют циклооксигеназу"
            ],
            "wA": [
                "взаимодействуют с опиоидными рецепторами",
                "ингибируют фосфолипазу А2"
            ]
        },
        {
            "qID": 68,
            "qName": "Диазепам:",
            "rA": [
                "анксиолитик"
            ],
            "wA": [
                "антипсихотическое средство",
                "психостимулирующее средство",
                "антидепрессант",
                "ноотропное средство"
            ]
        },
        {
            "qID": 69,
            "qName": "Механизм транквилизаторов, производных бензодиазепина:",
            "rA": [
                "взаимодействие с бензодиазепиновыми рецепторами"
            ],
            "wA": [
                "блокада ГАМК- рецепторов",
                "блокада Са-каналов",
                "угнетение полисинаптических рефлексов",
                "активация К-каналов"
            ]
        },
        {
            "qID": 70,
            "qName": "Транквилизатор, купирующий судороги любой этиологии:",
            "rA": [
                "диазепам"
            ],
            "wA": [
                "флумазенил",
                "триоксазин",
                "медазепам (мезапам)",
                "феназепам"
            ]
        },
        {
            "qID": 71,
            "qName": "Эффекты феназепама связывают с его действием на:",
            "rA": [
                "ГАМК -бензодиазепиновый рецепторный комплекс"
            ],
            "wA": [
                "дофаминовые рецепторы",
                "адренорецепторы",
                "опиатные рецепторы"
            ]
        },
        {
            "qID": 72,
            "qName": "Механизм действия седативных средств:",
            "rA": [
                "усиление и концентрация тормозных процессов в коре мозга"
            ],
            "wA": [
                "блокада серотониновых рецепторов",
                "блокада дофаминовых рецепторов",
                "блокада альфа-АРС",
                "блокада М-ХРС"
            ]
        },
        {
            "qID": 73,
            "qName": "Атипичный нейролептик - производное дибензодиазепина:",
            "rA": [
                "клозапин"
            ],
            "wA": [
                "резерпин",
                "сульпирид (эглонил)",
                "дроперидол",
                "диазепам"
            ]
        },
        {
            "qID": 74,
            "qName": "Антипсихотические средства вызывают явления паркинсонизма потому, что блокируют дофаминовые рецепторы:",
            "rA": [
                "базальных ганглиев"
            ],
            "wA": [
                "мезолибической системы",
                "гипоталамуса"
            ]
        },
        {
            "qID": 75,
            "qName": "Антипсихотический эффект галоперидола объясняют:",
            "rA": [
                "угнетением дофаминергических процессов в ЦНС"
            ],
            "wA": [
                "стимуляцией дофаминергических процессов в ЦНС",
                "угнетением адренергических процессов в ЦНС",
                "стимуляцией адренергических процессов в ЦНС",
                "М-холинолитической активностью"
            ]
        },
        {
            "qID": 76,
            "qName": "Галоперидол повышает выделение пролактина потому, что блокирует дофаминовые рецепторы:",
            "rA": [
                "гипоталамуса"
            ],
            "wA": [
                "мезолимбической системы",
                "экстрапирамидной системы"
            ]
        },
        {
            "qID": 77,
            "qName": "Гипотермический эффект антипсихотических средств связан с блокадой дофаминовых рецепторов:",
            "rA": [
                "гипоталамуса"
            ],
            "wA": [
                "мезолимбической системы",
                "экстрапирамидной системы",
                "коры головного мозга",
                "боковых желудочков мозга"
            ]
        },
        {
            "qID": 78,
            "qName": "Гипотермический эффект хлорпромазина (аминазина) связан с блокадой дофаминовых рецепторов:",
            "rA": [
                "гипоталамуса"
            ],
            "wA": [
                "мезолимбической системы",
                "экстрапирамидной системы"
            ]
        },
        {
            "qID": 79,
            "qName": "Для коррекции экстрапирамидных расстройств, вызванных антипсихотическими средствами, применяют:",
            "rA": [
                "центральные холиноблокаторы"
            ],
            "wA": [
                "дофаминомиметики",
                "ни одно из перечисленного"
            ]
        },
        {
            "qID": 80,
            "qName": "Нейролептик, применяемый для нейролептанальгезии:",
            "rA": [
                "дроперидол"
            ],
            "wA": [
                "клозапин",
                "диазепам",
                "сульпирид",
                "резерпин"
            ]
        },
        {
            "qID": 81,
            "qName": "Определить препарат: устраняет продуктивную симптоматику психозов (бред, галлюцинации), обладает седативным свойством, вызывает экстрапирамидные нарушения.",
            "rA": [
                "Хлорпромазин (аминазин)"
            ],
            "wA": [
                "Амитриптилин",
                "Сульпирид",
                "Лития карбонат",
                "Мебикар"
            ]
        },
        {
            "qID": 82,
            "qName": "При экстрапирамидных нарушениях, вызванных антипсихотическими средствами, применяют:",
            "rA": [
                "центральные холиноблокаторы"
            ],
            "wA": [
                "стимуляторы дофаминергических процессов в ЦНС",
                "ни одно из перечисленных"
            ]
        },
        {
            "qID": 83,
            "qName": "Противорвотное действие галоперидола связано с блокадой дофаминовых рецепторов:",
            "rA": [
                "пусковой зоны рвотного центра"
            ],
            "wA": [
                "базальных ганглиев",
                "гипоталамуса",
                "мезолимбической системы",
                "с блокадой МХРС"
            ]
        },
        {
            "qID": 84,
            "qName": "Антидепрессант - ингибитор моноаминоксидазы:",
            "rA": [
                "моклобемид"
            ],
            "wA": [
                "амитриптилин",
                "имипрамин (имизин)",
                "сульпирид"
            ]
        },
        {
            "qID": 85,
            "qName": "Для лечения маний применяют:",
            "rA": [
                "лития карбонат"
            ],
            "wA": [
                "пирацетам",
                "флуоксетин",
                "ниаламид",
                "амитриптилин"
            ]
        },
        {
            "qID": 86,
            "qName": "При ажитированной депрессии применяют:",
            "rA": [
                "амитриптилин"
            ],
            "wA": [
                "флуоксетин",
                "ниаламид",
                "пирацетам",
                "сертралин"
            ]
        },
        {
            "qID": 87,
            "qName": "Тианептин (коаксил):",
            "rA": [
                "усиливает нейрональный захват серотонина"
            ],
            "wA": [
                "селективно ингибирует МАО-А",
                "неселективно ингибирует МАО",
                "ингибирует нейрональный захват серотонина",
                "ингибирует нейрональный захват норэпинефрина (норадреналин) и серотонина"
            ]
        },
        {
            "qID": 88,
            "qName": "Антидепрессант - ингибитор моноаминоксидазы:",
            "rA": [
                "моклобемид"
            ],
            "wA": [
                "амитриптилин",
                "имипрамин (имизин)",
                "сульпирид"
            ]
        },
        {
            "qID": 89,
            "qName": "Бемегрид:",
            "rA": [
                "стимулятор дыхания"
            ],
            "wA": [
                "отхаркивающее средство",
                "противокашлевое средство",
                "бронхолитическое средство"
            ]
        },
        {
            "qID": 90,
            "qName": "Дыхательный центр угнетают:",
            "rA": [
                "наркотические анальгетики"
            ],
            "wA": [
                "аналептики",
                "ненаркотические анальгетики",
                "психостимуляторы"
            ]
        },
        {
            "qID": 91,
            "qName": "Для ноотропных средств характерно:",
            "rA": [
                "антигипоксический эффект"
            ],
            "wA": [
                "быстрое начало эффекта",
                "синдром последействия",
                "привыкание",
                "зависимость"
            ]
        },
        {
            "qID": 92,
            "qName": "Ноотропное действие пирацетама связывают:",
            "rA": [
                "с влиянием на энергетические процессы в нейронах головного мозга"
            ],
            "wA": [
                "со стимуляцией дофаминовых рецепторов головного мозга",
                "со стимуляцией адренорецепторов головного мозга"
            ]
        },
        {
            "qID": 93,
            "qName": "Пирацетам:",
            "rA": [
                "ноотропное средство"
            ],
            "wA": [
                "анксиолитик",
                "седативное средство",
                "психостимулирующее средство"
            ]
        },
        {
            "qID": 94,
            "qName": "Фенотропил:",
            "rA": [
                "ноотропный препарат"
            ],
            "wA": [
                "дыхательный аналептик",
                "адаптоген",
                "антидепрессант",
                "анксиолитик"
            ]
        },
        {
            "qID": 95,
            "qName": "Дигоксин:",
            "rA": [
                "применяется при острой и хронической сердечной недостаточности"
            ],
            "wA": [
                "применяется только при острой сердечной недостаточности",
                "применяется только при хронической сердечной недостаточности"
            ]
        },
        {
            "qID": 96,
            "qName": "Кардиотоническое действие сердечных гликозидов обусловлено:",
            "rA": [
                "блокадой натрий-калиевой АТФ-азы"
            ],
            "wA": [
                "стимуляцией аденилатциклазы",
                "ингибированием фосфодиэстеразы",
                "блокадой блуждающего нерва"
            ]
        },
        {
            "qID": 97,
            "qName": "На фоне действия сердечных гликозидов:",
            "rA": [
                "ослабляется тормозящее влияние тропонина на сократительные белки миокарда"
            ],
            "wA": [
                "увеличивается ингибирующее влияние тропонина на сократительные белки",
                "ничего из перечисленного"
            ]
        },
        {
            "qID": 98,
            "qName": "При применении сердечных гликозидов с тропониновым комплексом непосредственно связываются:",
            "rA": [
                "ионы Ca2"
            ],
            "wA": [
                "ионы K",
                "ионы Na"
            ]
        },
        {
            "qID": 99,
            "qName": "Содержание ионов К в кардиомиоцитах при действии сердечных гликозидов:",
            "rA": [
                "снижается"
            ],
            "wA": [
                "повышается",
                "не изменяется"
            ]
        },
        {
            "qID": 100,
            "qName": "Выберите сердечный гликозид:",
            "rA": [
                "строфантин"
            ],
            "wA": [
                "нифедипин",
                "исрадипин",
                "нисолдипин",
                "дилтиазем"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
