var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Антитиреоидное средство:",
            "rA": [
                "тиамазол (мерказолил)"
            ],
            "wA": [
                "левотироксин натрия (L-тироксин)",
                "лиотиронин (трииодтиронин)"
            ]
        },
        {
            "qID": 2,
            "qName": "Антиэстрогенное средство:",
            "rA": [
                "кломифен"
            ],
            "wA": [
                "финастерид",
                "нандролон (ретаболил)",
                "беклометазон"
            ]
        },
        {
            "qID": 3,
            "qName": "Для купирования диабетической комы применяют:",
            "rA": [
                "препараты инсулина быстрого и непродолжительного действия"
            ],
            "wA": [
                "препараты инсулина пролонгированного действия",
                "метформин",
                "глибенкламид",
                "акарбозу"
            ]
        },
        {
            "qID": 4,
            "qName": "Для стимуляции регенераторных процессов применяют:",
            "rA": [
                "анаболические стероиды"
            ],
            "wA": [
                "глюкокортикоиды",
                "минералокортикоиды",
                "эстрогены"
            ]
        },
        {
            "qID": 5,
            "qName": "Как можно вводить препараты инсулина пролонгированного действия:",
            "rA": [
                "подкожно"
            ],
            "wA": [
                "внутрь",
                "внутривенно"
            ]
        },
        {
            "qID": 6,
            "qName": "Какой гормональный препарат повышает тонус и сократительную активность миометрия:",
            "rA": [
                "none (ответ 3, но такого нет)"
            ],
            "wA": [
                "гонадотропин хорионический",
                "гонадотропин менопаузный"
            ]
        },
        {
            "qID": 7,
            "qName": "Комбинированные эстроген-гестагенные контрацептивы:",
            "rA": [
                "подавляют овуляцию"
            ],
            "wA": [
                "способствуют овуляции",
                "не влияют на овуляцию",
                "стимулирует развитие молочных желез"
            ]
        },
        {
            "qID": 8,
            "qName": "Нандролон (ретаболил):",
            "rA": [
                "анаболический стероид"
            ],
            "wA": [
                "глюкокортикоид",
                "эстроген",
                "гестаген"
            ]
        },
        {
            "qID": 9,
            "qName": "Овуляции способствует:",
            "rA": [
                "гонадотропин"
            ],
            "wA": [
                "прогестерон",
                "преднизолон",
                "левотироксин",
                "бромокриптин"
            ]
        },
        {
            "qID": 10,
            "qName": "Определить препарат: обладает гипогликемическим действием; эффективен при приеме внутрь; является производным бигуанида",
            "rA": [
                "метформин"
            ],
            "wA": [
                "глибенкламид",
                "акарбоза"
            ]
        },
        {
            "qID": 11,
            "qName": "По сравнению с андрогенными препаратами анаболические стероиды:",
            "rA": [
                "обладают значительно меньшей андрогенной активностью"
            ],
            "wA": [
                "обладают такой же андрогенной активностью"
            ]
        },
        {
            "qID": 12,
            "qName": "Препарат с минералокортикоидной активностью:",
            "rA": [
                "дезоксикортон (дезоксикортикостерон)"
            ],
            "wA": [
                "дексаметазон",
                "флуметазон",
                "тестостерон",
                "беклометазон"
            ]
        },
        {
            "qID": 13,
            "qName": "Препараты инсулина пролонгированного действия:",
            "rA": [
                "эффективны при сахарном диабете 1 типа"
            ],
            "wA": [
                "используются для купирования диабетической комы",
                "используются только для лечения несахарного диабета"
            ]
        },
        {
            "qID": 14,
            "qName": "При гипертиреозе применяют:",
            "rA": [
                "тиамазол (мерказолил)"
            ],
            "wA": [
                "лиотиронин (трийодтиронин)"
            ]
        },
        {
            "qID": 15,
            "qName": "При недостаточной функции желтого тела применяют:",
            "rA": [
                "прогестерон"
            ],
            "wA": [
                "эстриол",
                "тестостерон",
                "эстрадиол"
            ]
        },
        {
            "qID": 16,
            "qName": "При остеопорозе назначают:",
            "rA": [
                "кальцитриол"
            ],
            "wA": [
                "паратиреоидин",
                "октреотид",
                "кортикотропин"
            ]
        },
        {
            "qID": 17,
            "qName": "Прогестерон:",
            "rA": [
                "гестагенный препарат"
            ],
            "wA": [
                "анаболический стероид",
                "эстрогенный препарат"
            ]
        },
        {
            "qID": 18,
            "qName": "Противовоспалительный, противоаллергический и иммунодепрессивный эффекты вызывают:",
            "rA": [
                "глюкокортикоиды"
            ],
            "wA": [
                "анаболические стероиды",
                "эстрогены",
                "гестагены"
            ]
        },
        {
            "qID": 19,
            "qName": "Правильно:",
            "rA": [
                "десмопрессин применяют для лечения несахарного диабета"
            ],
            "wA": [
                "октреотид применяют при карликовом росте",
                "кальцитонин (кальцитрин) применяют при спазмофилии",
                "правильных утверждений нет"              ]
        },
        {
            "qID": 20,
            "qName": "Правильно:",
            "rA": [
                "глибенкламид - производное сульфонилмочевины"
            ],
            "wA": [
                "кальцитонин (кальцитрин) повышает уровень кальция в крови",
                "кортикотропин применяют при микседеме"
            ]
        },
        {
            "qID": 21,
            "qName": "Антиоксидантными свойствами обладает:",
            "rA": [
                "альфа-токоферол (витамин Е)"
            ],
            "wA": [
                "ретинол",
                "эргокальциферол",
                "рутозид (рутин)",
                "кислота никотиновая"
            ]
        },
        {
            "qID": 22,
            "qName": "Витамин Д в организме регулирует главным образом:",
            "rA": [
                "обмен кальция и фосфора"
            ],
            "wA": [
                "углеводный обмен",
                "обмен белков",
                "обмен жиров",
                "Рh крови"
            ]
        },
        {
            "qID": 23,
            "qName": "Витамин, повышающий синтез ацетилхолина и угнетающий активность холинэстеразы, устраняющий ацидоз:",
            "rA": [
                "витамин В1"
            ],
            "wA": [
                "витамин В6",
                "витамин В12",
                "витамин С",
                "витамин В3"
            ]
        },
        {
            "qID": 24,
            "qName": "Витамин, принимающий участие в усвоении, транспортировке превращениях (переаминировании, декарбоксилировании и др.) образовании незаменимых аминокислот:",
            "rA": [
                "пиридоксин"
            ],
            "wA": [
                "рибофлавин",
                "тиамин",
                "липоевая кислота",
                "тиамин"
            ]
        },
        {
            "qID": 25,
            "qName": "Витамин, участвующий в синтезе ГАМК и других тормозных медиаторов:",
            "rA": [
                "Пиридоксин"
            ],
            "wA": [
                "Тиамин",
                "Рутозид (рутин)",
                "Никотиновая кислота",
                "Рибоксин"
            ]
        },
        {
            "qID": 26,
            "qName": "Для какого препарата характерно выраженное влияние на проницаемость сосудов:",
            "rA": [
                "кислота аскорбиновая"
            ],
            "wA": [
                "кислота пангамовая",
                "кислота фолиевая",
                "кислота пантотеновая",
                "кокарбоксилаза"
            ]
        },
        {
            "qID": 27,
            "qName": "Какой витаминный препарат улучшает всасывание железа из желудочно-кишечного тракта:",
            "rA": [
                "кислота аскорбиновая"
            ],
            "wA": [
                "ретинол",
                "эргокальциферол",
                "альфа-токоферол (витамин Е)",
                "филлохинон"
            ]
        },
        {
            "qID": 28,
            "qName": "Кислота аскорбиновая:",
            "rA": [
                "восстанавливает в кишечнике трехвалентное железо в двухвалентное"
            ],
            "wA": [
                "окисляет в кишечнике двухвалентное железо в трехвалентное"
            ]
        },
        {
            "qID": 29,
            "qName": "Основное средство профилактики и лечения рахита:",
            "rA": [
                "эргокальциферол"
            ],
            "wA": [
                "кислота аскорбиновая",
                "кальция пангамат",
                "цианокобаламин",
                "рутозид (рутин)"
            ]
        },
        {
            "qID": 30,
            "qName": "Рибофлавин - препарат:",
            "rA": [
                "витамина В2"
            ],
            "wA": [
                "витамина В1",
                "витамина В6",
                "витамина В12",
                "витамина В3"
            ]
        },
        {
            "qID": 31,
            "qName": "Цианокобаламин и кислота фолиевая - это препараты:",
            "rA": [
                "водорастворимых витаминов"
            ],
            "wA": [
                "жирорастворимых витаминов",
                "коферментная форма витамина",
                "витаминоподобное вещество",
                "ферментный препарат"
            ]
        },
        {
            "qID": 32,
            "qName": "Статины рационально комбинировать с:",
            "rA": [
                "секвестрантами желчных кислот"
            ],
            "wA": [
                "фибратами",
                "никотиновой кислотой",
                "наркозными средствами",
                "сердечными гликозидами"
            ]
        },
        {
            "qID": 33,
            "qName": "Антиагрегантным действием обладает:",
            "rA": [
                "кислота ацетилсалициловая"
            ],
            "wA": [
                "кислота аминокапроновая",
                "варфарин",
                "урокиназа",
                "аценокумарол (синкумар)"
            ]
        },
        {
            "qID": 34,
            "qName": "Антикоагулянт, тормозящий превращение протромбина в тромбин:",
            "rA": [
                "гепарин натрий"
            ],
            "wA": [
                "алтеплаза",
                "фениндион (фенилин)",
                "варфарин",
                "коамид"
            ]
        },
        {
            "qID": 35,
            "qName": "Активность тромбина снижает: аценокумарол (синкумар)",
            "rA": [
                "варфарин"
            ],
            "wA": [
                "стрептокиназа",
                "гепарин натрий (гепарин)",
                "фениндион (фенилин)"
            ]
        },
        {
            "qID": 36,
            "qName": "Антикоагулянты непрямого действия:",
            "rA": [
                "угнетают образование в печени протромбина и проконвертина"
            ],
            "wA": [
                "образуют комплекс с антитромбином III, инактивируя тромбин",
                "угнетают факторы, активирующие переход протромбина в тромбин"
            ]
        },
        {
            "qID": 37,
            "qName": "Варфарин непосредственно влияет на:",
            "rA": [
                "синтез протромбина в печени"
            ],
            "wA": [
                "переход протромбина в тромбин",
                "превращение фибриногена в фибрин",
                "тормозит превращение плазминогена в плазмин",
                "агрегацию тромбоцитов"
            ]
        },
        {
            "qID": 38,
            "qName": "Варфарин:",
            "rA": [
                "антикоагулянт"
            ],
            "wA": [
                "антиагрегант",
                "антифибринолитическое средство",
                "антианемическое средство",
                "фибринолитическое средство"
            ]
        },
        {
            "qID": 39,
            "qName": "Укажите антагонист непрямых антикоагулянтов:",
            "rA": [
                "менадиона натрия бисульфит (викасол)"
            ],
            "wA": [
                "дипиридамол",
                "аминокапроновая кислота",
                "амбен",
                "ацетилсалициловая кислота"
            ]
        },
        {
            "qID": 40,
            "qName": "Стрептокиназа и урокиназа действуют:",
            "rA": [
                "как в тромбе, так и в плазме крови"
            ],
            "wA": [
                "только в тромбе",
                "только в плазме крови"
            ]
        },
        {
            "qID": 41,
            "qName": "Менадион натрия бисульфит (витамин К1):",
            "rA": [
                "средство, повышающее свертывание крови"
            ],
            "wA": [
                "средство, снижающее свертывание крови",
                "средство, угнетающее фибринолиз"
            ]
        },
        {
            "qID": 42,
            "qName": "Применяется при кровотечениях, связанных с повышенным фибринолизом:",
            "rA": [
                "кислота аминокапроновая"
            ],
            "wA": [
                "кислота ацетилсалициловая",
                "алтеплаза"
            ]
        },
        {
            "qID": 43,
            "qName": "Способствует образованию фибрина, применяется местно при кровотечениях:",
            "rA": [
                "тромбин"
            ],
            "wA": [
                "фитоменадион",
                "кислота аминокапроновая"
            ]
        },
        {
            "qID": 44,
            "qName": "Препараты железа применяют:",
            "rA": [
                "для лечения гипохромных анемий"
            ],
            "wA": [
                "для лечения гиперхромных анемий",
                "для профилактики тромбозов"
            ]
        },
        {
            "qID": 45,
            "qName": "Феррум-лек:",
            "rA": [
                "стимулятор эритропоэза"
            ],
            "wA": [
                "стимулятор лейкопоэза",
                "стимулятор свертывания крови",
                "антикоагулянт",
                "антиагрегант"
            ]
        },
        {
            "qID": 46,
            "qName": "Молграмостим:",
            "rA": [
                "стимулятор лейкопоэза"
            ],
            "wA": [
                "стимулятор эритропоэза",
                "антикоагулянт",
                "антифибринолитическое средство"
            ]
        },
        {
            "qID": 47,
            "qName": "Гестагенный препарат, применяемый при бесплодии, угрожающем аборте, функциональном маточном кровотечение:",
            "rA": [
                "дюфастон (дидрогестерон)"
            ],
            "wA": [
                "индометацин",
                "окситоцин",
                "натрия оксибутират",
                "питуитрин"
            ]
        },
        {
            "qID": 48,
            "qName": "Динопрост и динопростон стимулируют сокращения:",
            "rA": [
                "беременной матки в любые сроки беременности"
            ],
            "wA": [
                "беременной матки только в последнем триместре"
            ]
        },
        {
            "qID": 49,
            "qName": "Основной эффект окситоцина:",
            "rA": [
                "повышает тонус и сократительную активность миометрия"
            ],
            "wA": [
                "способствует овуляции",
                "стимулирует продукцию глюкокортикостероидов",
                "регулирует реабсорбцию воды в дистальной части нефрона"
            ]
        },
        {
            "qID": 50,
            "qName": "Сократительную активность миометрия понижают:",
            "rA": [
                "бета2-адреномиметики"
            ],
            "wA": [
                "окситоцин",
                "алкалоиды спорыньи",
                "динопрост",
                "динопростон"
            ]
        },
        {
            "qID": 51,
            "qName": "При повышении диссоциации веществ их всасывание в кишечнике:",
            "rA": [
                "затрудняется"
            ],
            "wA": [
                "облегчается"
            ]
        },
        {
            "qID": 52,
            "qName": "Механизм действия угля активированного:",
            "rA": [
                "образование слабых вандерваальсовых связей с ядом"
            ],
            "wA": [
                "нейтрализация яда",
                "фармакологический антагонизм с ядом",
                "образование хелатных комплексов",
                "иммунологический антагонизм с ядом"
            ]
        },
        {
            "qID": 53,
            "qName": "Только для поверхностной анестезии применяют:",
            "rA": [
                "бензокаин (анестезин)"
            ],
            "wA": [
                "прокаин (новокаин)",
                "лидокаин"
            ]
        },
        {
            "qID": 54,
            "qName": "Пилокарпин применяют:",
            "rA": [
                "при глаукоме"
            ],
            "wA": [
                "для паралича аккомодации при подборе очков",
                "для анестезии роговицы"
            ]
        },
        {
            "qID": 55,
            "qName": "Показание к применению пилокарпина:",
            "rA": [
                "глаукома"
            ],
            "wA": [
                "бронхиальная астма",
                "артериальная гипотензия",
                "атония кишечника",
                "исследование глазного дна"
            ]
        },
        {
            "qID": 56,
            "qName": "Ганглиоблокатор короткого действия:",
            "rA": [
                "трепирия йодид (гигроний)"
            ],
            "wA": [
                "азаметония бромид (пентамин)",
                "суксаметония хлорид (дитилин)",
                "гексаметония бензосульфонат (бензогексоний)",
                "тубокурарин"
            ]
        },
        {
            "qID": 57,
            "qName": "Миорелаксант деполяризующего действия:",
            "rA": [
                "суксаметония бромид (дитилин)"
            ],
            "wA": [
                "панкуроний",
                "платифиллин",
                "азаметония бромид (пентамин)",
                "тубокурарин"
            ]
        },
        {
            "qID": 58,
            "qName": "Паралич аккомодации вызывают:",
            "rA": [
                "М-холиноблокаторы"
            ],
            "wA": [
                "М-холиномиметики",
                "антихолинэстеразные вещества"
            ]
        },
        {
            "qID": 59,
            "qName": "Снижение тонуса шейки матки под влиянием атропина связано с блокадой:",
            "rA": [
                "М-холинорецепторов"
            ],
            "wA": [
                "альфа-адренорецепторов",
                "бета2-адренорецепторов"
            ]
        },
        {
            "qID": 60,
            "qName": "Трепирия йодид (гигроний) применяют:",
            "rA": [
                "для управляемой гипотензии"
            ],
            "wA": [
                "при глаукоме",
                "при атонии мочевого пузыря"
            ]
        },
        {
            "qID": 61,
            "qName": "Бета2-адреномиметики:",
            "rA": [
                "ослабляют сократительную активность миометрия"
            ],
            "wA": [
                "усиливают сократительную активность миометрия",
                "повышают преимущественно тонус миометрия",
                "суживают бронхи"
            ]
        },
        {
            "qID": 62,
            "qName": "Какой адреномиметик используют при атриовентрикулярном блоке:",
            "rA": [
                "изопреналин (изадрин)"
            ],
            "wA": [
                "сальбутамол",
                "фенотерол"
            ]
        },
        {
            "qID": 63,
            "qName": "Кардиостимулирующее действие эпинефрина (адреналина) связано с:",
            "rA": [
                "возбуждением бета-1-адренорецепторов"
            ],
            "wA": [
                "угнетением МАО",
                "блокадой фосфодиэстеразы",
                "активацией КОМТ",
                "снижением в клетке содержания АТФ",
                "активацией МАО"
            ]
        },
        {
            "qID": 64,
            "qName": "Симпатомиметик:",
            "rA": [
                "эфедрин"
            ],
            "wA": [
                "эпинефрин (адреналин)",
                "сальбутамол",
                "ксилометазолин (галазолин)",
                "норэпинефрин (норадреналин)"
            ]
        },
        {
            "qID": 65,
            "qName": "Стимулирует высвобождение норэпинефрина (норадреналин) из окончаний адренергических нервов:",
            "rA": [
                "эфедрин"
            ],
            "wA": [
                "клонидин (клофелин)",
                "резерпин",
                "фенилэфрин (мезатон)"
            ]
        },
        {
            "qID": 66,
            "qName": "Эпинефрин (адреналин) снижает:",
            "rA": [
                "тонус бронхов"
            ],
            "wA": [
                "силу сокращений сердца",
                "частоту сокращений сердца",
                "автоматизм сердца",
                "атриовентрикулярную проводимость"
            ]
        },
        {
            "qID": 67,
            "qName": "Метопролол блокирует преимущественно:",
            "rA": [
                "бета1-адренорецепторы"
            ],
            "wA": [
                "альфа1-адренорецепторы",
                "альфа2-адренорецепторы",
                "бета2-адренорецепторы"
            ]
        },
        {
            "qID": 68,
            "qName": "Пропранолол (анаприлин) повышает:",
            "rA": [
                "тонус бронхов"
            ],
            "wA": [
                "силу сокращений сердца",
                "частоту сокращений сердца",
                "атриовентрикулярную проводимость",
                "автоматизм сердца"
            ]
        },
        {
            "qID": 69,
            "qName": "Спирт этиловый способствует переохлаждению, потому что:",
            "rA": [
                "увеличивает теплоотдачу в большей степени, чем теплопродукцию"
            ],
            "wA": [
                "уменьшает теплопродукцию",
                "ни одно из перечисленного"
            ]
        },
        {
            "qID": 70,
            "qName": "Определите препарат: обладает антидепрессивными и седативными свойствами. Неизбирательно угнетает нейрональный захват моноаминов (норадреналина и серотонина). Может применяться в качестве анальгетика.",
            "rA": [
                "Амитриптилин"
            ],
            "wA": [
                "Мапротилин",
                "Флуоксетин",
                "Миртазапин"
            ]
        },
        {
            "qID": 71,
            "qName": "Применяется как снотворное и противоэпилептическое средство, вызывает индукцию микросомальных ферментов печени:",
            "rA": [
                "фенобарбитал"
            ],
            "wA": [
                "фенитоин (дифенин)",
                "натрия вальпроат",
                "этосуксимид",
                "триметин"
            ]
        },
        {
            "qID": 72,
            "qName": "Снотворные средства из группы барбитуратов не применяют в качестве средств для наркоза, потому что они:",
            "rA": [
                "обладают малой широтой наркотического действия"
            ],
            "wA": [
                "вызывают длительную стадию возбуждения",
                "ни то, ни другое"
            ]
        },
        {
            "qID": 73,
            "qName": "Способность уменьшать количество быстрого сна убывает в ряду:",
            "rA": [
                "этаминал-натрий - нитразепам – золпидем"
            ],
            "wA": [
                "золпидем - нитразепам - этаминал-натрий",
                "этаминал-натрий - золпидем - нитразепам",
                "все неправильно"
            ]
        },
        {
            "qID": 74,
            "qName": "Амантадин (мидантан):",
            "rA": [
                "антагонист глутаматергических процессов в мозге"
            ],
            "wA": [
                "активирует NMDA - рецепторы",
                "ингибирует МАО-В",
                "блокирует холинорецепторы в головном мозге",
                "ничего из перечисленного"
            ]
        },
        {
            "qID": 75,
            "qName": "Какой противопаркинсонический препарат применяют совместно с карбидопой:",
            "rA": [
                "леводопу"
            ],
            "wA": [
                "тригексифенидил (циклодол)",
                "амантадин (мидантан)",
                "бромокриптин"
            ]
        },
        {
            "qID": 76,
            "qName": "Карбидопа:",
            "rA": [
                "ингибитор периферической дофа- декарбоксилазы"
            ],
            "wA": [
                "предшественник дофамина",
                "ингибитор МАО-В",
                "ингибитор катехол-о-метилтрансферазы",
                "нарушает нейрональный захват дофамина",
                "прямо стимулирует дофаминовые рецепторы"
            ]
        },
        {
            "qID": 77,
            "qName": "Блокирует опиоидные рецепторы:",
            "rA": [
                "налоксон"
            ],
            "wA": [
                "фентанил",
                "тримеперидин (промедол)",
                "метамизол натрия (анальгин)"
            ]
        },
        {
            "qID": 78,
            "qName": "Бупренорфин по сравнению с морфином:",
            "rA": [
                "может применяться сублингвально"
            ],
            "wA": [
                "менее активный",
                "обладает большей наркогенностью",
                "не угнетает дыхательный и кашлевой центры"
            ]
        },
        {
            "qID": 79,
            "qName": "Возбудимость центра кашлевого рефлекса морфин:",
            "rA": [
                "угнетает"
            ],
            "wA": [
                "стимулирует",
                "не изменяет"
            ]
        },
        {
            "qID": 80,
            "qName": "Для нейролептанальгезии фентанил применяют в комбинации:",
            "rA": [
                "с дроперидолом"
            ],
            "wA": [
                "с морфином",
                "с налорфином",
                "с метамизолом натрия (анальгином)"
            ]
        },
        {
            "qID": 81,
            "qName": "Механизм действия налоксона:",
            "rA": [
                "блокирует опиатные рецепторы"
            ],
            "wA": [
                "стимулирует опиатные рецепторы",
                "ингибирует липоксигеназу",
                "ингибирует циклооксигеназу"
            ]
        },
        {
            "qID": 82,
            "qName": "Наименьшей способностью вызывать лекарственную зависимость обладает:",
            "rA": [
                "трамадол"
            ],
            "wA": [
                "морфин",
                "фентанил",
                "тримеперидин (промедол)"
            ]
        },
        {
            "qID": 83,
            "qName": "По способности угнетать дыхание фентанил:",
            "rA": [
                "превосходит морфин"
            ],
            "wA": [
                "соответствует морфину",
                "уступает морфину"
            ]
        },
        {
            "qID": 84,
            "qName": "При длительном применении опиоидных анальгетиков их эффективность:",
            "rA": [
                "понижается"
            ],
            "wA": [
                "повышается",
                "практически не изменяется"
            ]
        },
        {
            "qID": 85,
            "qName": "Аналептики применяют:",
            "rA": [
                "для стимуляции дыхательного и сосудодвигательного центров"
            ],
            "wA": [
                "при бессоннице",
                "при эпилепсии"
            ]
        },
        {
            "qID": 86,
            "qName": "Кофеин:",
            "rA": [
                "психостимулирующее средство"
            ],
            "wA": [
                "ноотропное средство",
                "седативное средство",
                "анксиолитик"
            ]
        },
        {
            "qID": 87,
            "qName": "Средство, возбуждающее центры продолговатого мозга, а также стимулирующее умственную и физическую работоспособность:",
            "rA": [
                "кофеин"
            ],
            "wA": [
                "нитразепам",
                "галотан (фторотан)",
                "зопиклон (имован)",
                "фенитоин (дифенин)"
            ]
        },
        {
            "qID": 88,
            "qName": "Вводится только внутривенно, кардиотонический эффект развивается через 5-10 минут, применяется главным образом при острой сердечной недостаточности:",
            "rA": [
                "гликозид ландыша (коргликон)"
            ],
            "wA": [
                "дигитоксин",
                "адонизид"
            ]
        },
        {
            "qID": 89,
            "qName": "Нитроглицерин вызывает расширение сосудов различной локализации, так как:",
            "rA": [
                "действует подобно эндотелиальному релаксирующему фактору"
            ],
            "wA": [
                "блокирует альфа-адренорецепторы",
                "возбуждает бета2-адренорецепторы"
            ]
        },
        {
            "qID": 90,
            "qName": "Нитроглицерин раздражает рецепторы подъязычной области и рефлекторно устраняет коронароспазмы:",
            "rA": [
                "нет"
            ],
            "wA": [
                "да"
            ]
        },
        {
            "qID": 91,
            "qName": "Все нижеперечисленные препараты вызывают брадикардию, кроме:",
            "rA": [
                "эналаприла"
            ],
            "wA": [
                "верапамила",
                "дилтиазема",
                "метопролола",
                "бисопролола"
            ]
        },
        {
            "qID": 92,
            "qName": "Определить препарат: Используется для предупреждения  приступов стенокардии. Антиангинальный эффект обусловлен уменьшением потребности сердца в кислороде. Побочные эффекты: брадикардия,  нарушение атриовентрикулярной проводимости, повышение тонуса бронхов.",
            "rA": [
                "пропранолол (анаприлин)"
            ],
            "wA": [
                "верапамил",
                "изосорбида динитрат (нитросорбид)",
                "нифедипин"
            ]
        },
        {
            "qID": 93,
            "qName": "Чем отличается атенолол от пропранолола (анаприлина):",
            "rA": [
                "атенолол практически не вызывает повышения тонуса бронхов"
            ],
            "wA": [
                "атенолол не вызывает выраженной брадикардии",
                "атенолол не вызывает нарушений атриовентрикулярной проводимости",
                "атенолол не угнетает сократимость миокарда"
            ]
        },
        {
            "qID": 94,
            "qName": "Выберите антагонист рецепторов ангиотензина II:",
            "rA": [
                "лозартан"
            ],
            "wA": [
                "каптоприл",
                "рамиприл",
                "спиронолактон",
                "индапамид"
            ]
        },
        {
            "qID": 95,
            "qName": "Сухой кашель - характерный побочный эффект:",
            "rA": [
                "ингибиторов ангиотензинпревращающего фермента"
            ],
            "wA": [
                "альфа-адреноблокаторов",
                "симпатолитиков",
                "миотропных гипотензивных средств",
                "диуретиков"
            ]
        },
        {
            "qID": 96,
            "qName": "Как влияет нифедипин на тонус коронарных сосудов сердца:",
            "rA": [
                "уменьшает"
            ],
            "wA": [
                "увеличивает",
                "не изменяет"
            ]
        },
        {
            "qID": 97,
            "qName": "Чем отличается нифедипин (фенигидин) от верапамила:",
            "rA": [
                "не обладает противоаритмическим эффектом"
            ],
            "wA": [
                "не обладает антиангинальным эффектом",
                "не обладает гипотензивным эффектом"
            ]
        },
        {
            "qID": 98,
            "qName": "Механизм антиангинального действия дипиридамола:",
            "rA": [
                "расширяет коронарные сосуды за счет миотропного действия"
            ],
            "wA": [
                "уменьшает работу сердца",
                "блокирует центральные звенья коронаросуживающих рефлексов"
            ]
        },
        {
            "qID": 99,
            "qName": "Устраняет коронароспазмы, действуя рефлекторно:",
            "rA": [
                "ментола раствор в ментил изовалерате (валидол)"
            ],
            "wA": [
                "папаверин",
                "амиодарон",
                "верапамил",
                "нифедипин"
            ]
        },
        {
            "qID": 100,
            "qName": "Механизм диуретического действия гидрохлоротиазида",
            "rA": [
                "нарушает реабсорбцию ионов натрия и хлора в почечных канальцах"
            ],
            "wA": [
                "увеличивает фильтрацию в почечных клубочках",
                "повышает осмотическое давление в почечных канальцах",
                "блокирует альдостероновые рецепторы"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
