var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Механизм действия добутамина:",
            "rA": [
                "стимуляция бета1-рецепторов"
            ],
            "wA": [
                "стимуляция бета2-рецепторов",
                "блокада М-холинорецепторов",
                "блокада альфа-рецепторов",
                "стимуляция дофаминовых рецепторов"
            ]
        },
        {
            "qID": 2,
            "qName": "Какой из нижеперечисленных препаратов относится к антиаритмикам II класса (бета-адреноблокаторам):",
            "rA": [
                "метопролол"
            ],
            "wA": [
                "хинидин",
                "прокаинамид",
                "амиодарон",
                "дилтиазем"
            ]
        },
        {
            "qID": 3,
            "qName": "Все нижесказанное о нитроглицерине верно, кроме:",
            "rA": [
                "является эффективным гиполипидемическим средством"
            ],
            "wA": [
                "является прототипом всех органических нитратов",
                "хорошо абсорбируется при сублингвальном применении",
                "терапевтическая концентрация препарата в плазме крови достигается в течение нескольких минут",
                "его общая продолжительность действия составляет около 2-х часов"
            ]
        },
        {
            "qID": 4,
            "qName": "Для купирования приступа стенокардии применяют:",
            "rA": [
                "нитроглицерин"
            ],
            "wA": [
                "прокаинамид (новокаинамид)",
                "гликозид ландыша (коргликон)",
                "клонидин"
            ]
        },
        {
            "qID": 5,
            "qName": "Какой эффект нитроглицерина приводит к уменьшению преднагрузки на сердце:",
            "rA": [
                "расширение вен и уменьшение венозного давления"
            ],
            "wA": [
                "расширение артерий и уменьшение артериального давления",
                "расширение коронарных сосудов и улучшение кровоснабжения миокарда"
            ]
        },
        {
            "qID": 6,
            "qName": "Продолжительность терапевтического действия нитроглицерина:",
            "rA": [
                "до 30 минут"
            ],
            "wA": [
                "7-8 часов",
                "3-4 часа"
            ]
        },
        {
            "qID": 7,
            "qName": "Бета-адреноблокаторы эффективны при стенокардии, так как они:",
            "rA": [
                "снижают потребность сердца в кислороде"
            ],
            "wA": [
                "выраженно расширяют коронарные сосуды"
            ]
        },
        {
            "qID": 8,
            "qName": "Вазодилятирующие свойства карведилола обусловлены:",
            "rA": [
                "блокадой альфа1 – адренорецепторов"
            ],
            "wA": [
                "повышением уровня NО",
                "повышением уровня брадикинина",
                "повышением уровня простациклина",
                "стимуляцией бета2- адренорецепторов"
            ]
        },
        {
            "qID": 9,
            "qName": "Какой  из  нижеперечисленных  неселективных бета-адреноблокаторов обладает способностьюблокировать альфа1-адренорецепторы:",
            "rA": [
                "карведилол"
            ],
            "wA": [
                "метопролол",
                "пропранолол",
                "окспренолол",
                "пиндолол"
            ]
        },
        {
            "qID": 10,
            "qName": "Повышение тонуса бронхов - побочный эффект:",
            "rA": [
                "пропранолола (анаприлина)"
            ],
            "wA": [
                "нифедипина",
                "гидрохлоротиазида (дихлотиазида)",
                "лозартана",
                "празозина"
            ]
        },
        {
            "qID": 11,
            "qName": "Азаметония бромид (пентамин) понижает гидростатическое давление в малом круге кровообращения за счет:",
            "rA": [
                "депонирования крови в сосудах большого круга кровообращения"
            ],
            "wA": [
                "прямого стимулирующего действия на миокард",
                "увеличения диуреза"
            ]
        },
        {
            "qID": 12,
            "qName": "Какой из нижеперечисленных препаратов используется для лечения артериальной гипертензиии у беременных:",
            "rA": [
                "метилдофа"
            ],
            "wA": [
                "гуанфацин",
                "клонидин",
                "рилменидин",
                "моксонидин"
            ]
        },
        {
            "qID": 13,
            "qName": "Каптоприл:",
            "rA": [
                "средство, влияющее на ренин-ангиотензиновую систему"
            ],
            "wA": [
                "гипотензивное средство центрального действия",
                "гипотензивное средство миотропного действия",
                "блокатор кальциевых каналов",
                "диуретик"
            ]
        },
        {
            "qID": 14,
            "qName": "Механизм действия лозартана:",
            "rA": [
                "блокирует ангиотензиновые рецепторы подтипа АТ1"
            ],
            "wA": [
                "угнетает секрецию ренина",
                "блокирует ангиотензиновые рецепторы подтипа АТ2",
                "ингибирует ангиотензинпревращающий фермент",
                "отщепляет окись азота (NО)"
            ]
        },
        {
            "qID": 15,
            "qName": "Верапамил блокирует:",
            "rA": [
                "транспорт ионов кальция через цитоплазматическую мембрану"
            ],
            "wA": [
                "транспорт ионов натрия через цитоплазматическую мембрану",
                "бета-адренорецепторы"
            ]
        },
        {
            "qID": 16,
            "qName": "Какой из нижеперечисленных антагонистов кальция является производным фенилалкиламинов:",
            "rA": [
                "верапамил"
            ],
            "wA": [
                "дилтиазем",
                "фелодипин",
                "нифедипин",
                "амлодипин"
            ]
        },
        {
            "qID": 17,
            "qName": "Нифедипин блокирует:",
            "rA": [
                "транспорт ионов кальция через цитоплазматическую мембрану"
            ],
            "wA": [
                "транспорт ионов натрия через цитоплазматическую мембрану",
                "бета-адренорецепторы"
            ]
        },
        {
            "qID": 18,
            "qName": "Диазоксид относится к:",
            "rA": [
                "активаторам калиевых каналов"
            ],
            "wA": [
                "блокаторам ангиотензиновых рецепторов",
                "ингибиторам ангиотензинпревращающего фермента",
                "донаторам окиси азота (NО)"
            ]
        },
        {
            "qID": 19,
            "qName": "Дипиридамол эффективен при коронарной недостаточности, так как:",
            "rA": [
                "расширяет коронарные сосуды за счет миотропного действия"
            ],
            "wA": [
                "уменьшает работу сердца",
                "блокирует центральные звенья коронаросуживающих рефлексов"
            ]
        },
        {
            "qID": 20,
            "qName": "В качестве противоаритмического средства лидокаин применяют при:",
            "rA": [
                "желудочковых аритмиях, возникающих при инфаркте миокарда"
            ],
            "wA": [
                "атриовентрикулярном блоке",
                "мерцательной аритмии предсердий"
            ]
        },
        {
            "qID": 21,
            "qName": "Прокаинамид (новокаинамид) применяют в качестве:",
            "rA": [
                "антиаритмического средства"
            ],
            "wA": [
                "гипотензивного средства",
                "антиангинального средства",
                "кардиотонического средства"
            ]
        },
        {
            "qID": 22,
            "qName": "Диуретик - антагонист альдостерона:",
            "rA": [
                "спиронолактон"
            ],
            "wA": [
                "гидрохлоротиазид (дихлотиазид)",
                "фуросемид",
                "триамтерен",
                "маннитол (маннит)"
            ]
        },
        {
            "qID": 23,
            "qName": "Диуретик, задерживающий кальций в организме:",
            "rA": [
                "гидрохлоротиазид (дихлотиазид)"
            ],
            "wA": [
                "триамтерен",
                "фуросемид",
                "кислота этакриновая"
            ]
        },
        {
            "qID": 24,
            "qName": "Для лечения несахарного диабета применяют:",
            "rA": [
                "гидрохлоротиазид (дихлотиазид)"
            ],
            "wA": [
                "триамтерен",
                "спиронолактон",
                "фуросемид",
                "амилорид"
            ]
        },
        {
            "qID": 25,
            "qName": "Маннитол (маннит):",
            "rA": [
                "осмотический диуретик"
            ],
            "wA": [
                "калий-, магнийсберегающий диуретик",
                "петлевой диуретик",
                "антагонист альдостерона"
            ]
        },
        {
            "qID": 26,
            "qName": "Механизм диуретического действия фуросемида:",
            "rA": [
                "блокирует Na \\2Cl-\\K котранспортер в дистальной части петли Генле"
            ],
            "wA": [
                "блокирует рецепторы альдостерона",
                "повышает осмотическое давление в канальцах",
                "блокирует карбоангидразу",
                "усиливает секрецию Na в проксимальных канальцах"
            ]
        },
        {
            "qID": 27,
            "qName": "Наиболее эффективный диуретик:",
            "rA": [
                "фуросемид"
            ],
            "wA": [
                "спиронолактон",
                "триамтерен",
                "гидрохлоротиазид (дихлотиазид)"
            ]
        },
        {
            "qID": 28,
            "qName": "Осмотический диуретик:",
            "rA": [
                "маннитол (маннит)"
            ],
            "wA": [
                "гидрохлоротиазид (дихлотиазид)",
                "спиронолактон",
                "фуросемид",
                "триамтерен"
            ]
        },
        {
            "qID": 29,
            "qName": "Правильное утверждение:",
            "rA": [
                "при длительном применении фуросемида возможны нарушения слуха"
            ],
            "wA": [
                "хлорталидон (оксодолин) - осмотически активный диуретик",
                "спиронолактон действует кратковременно",
                "гидрохлоротиазид (дихлотиазид) применяют при отеке легких"
            ]
        },
        {
            "qID": 30,
            "qName": "Указать калийсберегающий диуретик -антагонист альдостерона:",
            "rA": [
                "спиронолактон"
            ],
            "wA": [
                "триамтерен",
                "амилорид",
                "фуросемид",
                "гидрохлоротиазид (дихлотиазид)"
            ]
        },
        {
            "qID": 31,
            "qName": "Что характерно для гидрохлоротиазида (дихлотиазид):",
            "rA": [
                "повышает эффект вазопрессина"
            ],
            "wA": [
                "действует на восходящую часть петли Генле",
                "вызывает гиперкалиемию",
                "снижает эффект вазопрессина"
            ]
        },
        {
            "qID": 32,
            "qName": "Бронхолитическое действие сальбутамола обусловлено:",
            "rA": [
                "возбуждением бета2-адренорецепторов гладких мышц бронхов"
            ],
            "wA": [
                "блокадой М-холинорецепторов гладких мышц бронхов",
                "прямым расслабляющим влиянием на гладкие мышцы бронхов"
            ]
        },
        {
            "qID": 33,
            "qName": "Бронхолитическое действие сальбутамола связано:",
            "rA": [
                "с возбуждением бета2-адренорецепторов бронхов"
            ],
            "wA": [
                "с блокадой М-холинорецепторов бронхов",
                "с прямым расслабляющим влиянием на гладкие мышцы бронхов"
            ]
        },
        {
            "qID": 34,
            "qName": "Гладкие мышцы бронхов расслабляются при стимуляции:",
            "rA": [
                "бета2 – адренорецепторов"
            ],
            "wA": [
                "М- холинорецепторов",
                "альфа - адренорецепторов"
            ]
        },
        {
            "qID": 35,
            "qName": "Ипратропия бромид (тровентол) расширяет бронхи за счет:",
            "rA": [
                "М- холиноблокирующего действия"
            ],
            "wA": [
                "бета2 - адреномиметического действия",
                "миотропного спазмолитического действия"
            ]
        },
        {
            "qID": 36,
            "qName": "Расширяет бронхи за счет миотропного спазмолитического действия:",
            "rA": [
                "аминофиллин (эуфиллин)"
            ],
            "wA": [
                "эпинефрин (адреналин)",
                "сальбутамол",
                "эфедрин",
                "метоциния йодид (метацин)"
            ]
        },
        {
            "qID": 37,
            "qName": "Салметерол применяют:",
            "rA": [
                "для предупреждения приступов бронхиальной астмы"
            ],
            "wA": [
                "при отеке легких в качестве дегидратирующего средства",
                "для подавления кашля",
                "для облегчения отхождения мокроты"
            ]
        },
        {
            "qID": 38,
            "qName": "Сальбутамол отличается от изопреналина (изадрина) тем, что:",
            "rA": [
                "в меньшей степени увеличивает частоту сердечных сокращений"
            ],
            "wA": [
                "снижает тонус бронхов",
                "снижает тонус сосудов"
            ]
        },
        {
            "qID": 39,
            "qName": "Теофиллин:",
            "rA": [
                "расширяет бронхи"
            ],
            "wA": [
                "угнетает возбудимость кашлевого центра",
                "обладает отхаркивающим действием"
            ]
        },
        {
            "qID": 40,
            "qName": "Кодеин оказывает противокашлевое действие, потому что:",
            "rA": [
                "оказывает прямое угнетающее действие на кашлевой центр"
            ],
            "wA": [
                "разжижает бронхиальный секрет и облегчает отхождение мокроты",
                "угнетает кашлевой рефлекс за счет периферического действия"
            ]
        },
        {
            "qID": 41,
            "qName": "Преноксдиазин (либексин) применяют:",
            "rA": [
                "для подавления кашля"
            ],
            "wA": [
                "при угнетении дыхания",
                "при отеке легких",
                "при бронхиальной астме",
                "для облегчения отхождения мокроты"
            ]
        },
        {
            "qID": 42,
            "qName": "Ацетилцистеин:",
            "rA": [
                "отхаркивающее средство"
            ],
            "wA": [
                "противокашлевое средство",
                "бронхолитическое средство",
                "стимулятор дыхания"
            ]
        },
        {
            "qID": 43,
            "qName": "Бромгексин:",
            "rA": [
                "отхаркивающее средство"
            ],
            "wA": [
                "бронхолитическое средство",
                "противокашлевое средство"
            ]
        },
        {
            "qID": 44,
            "qName": "Механизм отхаркивающего действия термопсиса обусловлен:",
            "rA": [
                "стимуляцией рецепторов желудка и кишечника"
            ],
            "wA": [
                "рефлексом с рецепторов бронхов",
                "прямым действием на рвотный центр",
                "стимуляцией холинорецепторов"
            ]
        },
        {
            "qID": 45,
            "qName": "Препараты термопсиса используют:",
            "rA": [
                "в качестве отхаркивающих средств"
            ],
            "wA": [
                "для стимуляции дыхания",
                "для предупреждения и купирования приступов бронхиальной астмы",
                "при отеке легких"
            ]
        },
        {
            "qID": 46,
            "qName": "Трипсин оказывает отхаркивающее действие, потому что:",
            "rA": [
                "снижает вязкость секрета бронхов за счет протеолитического действия"
            ],
            "wA": [
                "рефлекторно усиливает секрецию бронхиальных желез",
                "оказывает прямое стимулирующее действие на бронхиальные железы"
            ]
        },
        {
            "qID": 47,
            "qName": "При рефлекторной остановке дыхания эффективны:",
            "rA": [
                "стимуляторы дыхания любой группы"
            ],
            "wA": [
                "только стимуляторы дыхания рефлекторного действия",
                "только стимуляторы дыхания, прямо активирующие центр дыхания",
                "только стимуляторы дыхания смешанного типа действия"
            ]
        },
        {
            "qID": 48,
            "qName": "Пеногаситель, применяющийся при отеке легких:",
            "rA": [
                "спирт этиловый"
            ],
            "wA": [
                "маннитол (маннит)",
                "фуросемид",
                "морфин",
                "строфантин",
                "гексаметония бензосульфонат (бензогексоний)"
            ]
        },
        {
            "qID": 49,
            "qName": "При отеке легких применяют:",
            "rA": [
                "фуросемид"
            ],
            "wA": [
                "триамтерен",
                "гидрохлоротиазид (дихлотиазид)",
                "спиронолактон"
            ]
        },
        {
            "qID": 50,
            "qName": "Для повышения аппетита используют:",
            "rA": [
                "горечи"
            ],
            "wA": [
                "М-холиноблокаторы",
                "Н2-гистаминоблокаторы",
                "антациды",
                "гастропротекторы"
            ]
        },
        {
            "qID": 51,
            "qName": "Гастропротектор, аналог ПГЕ1:",
            "rA": [
                "мизопростол"
            ],
            "wA": [
                "висмута нитрат основной",
                "сукральфат",
                "динопрост",
                "апротинин (контрикал)"
            ]
        },
        {
            "qID": 52,
            "qName": "Механизм снижения желудочной секреции под влиянием омепразола:",
            "rA": [
                "ингибирует Н,К-АТФ-азу (протоновый насосос)"
            ],
            "wA": [
                "блокирует гистаминовые Н2-рецепторы",
                "блокирует М-холинорецепторы"
            ]
        },
        {
            "qID": 53,
            "qName": "Механизм снижения желудочной секреции под влиянием ранитидина:",
            "rA": [
                "блокирует гистаминовые Н2-рецепторы"
            ],
            "wA": [
                "блокирует М-холинорецепторы",
                "ингибирует Н,К-АТФ-азу (протоновый насосос)"
            ]
        },
        {
            "qID": 54,
            "qName": "Омепразол применяют:",
            "rA": [
                "для лечения язвенной болезни желудка и двенадцатиперстной кишки"
            ],
            "wA": [
                "в качестве рвотного средства",
                "в качестве слабительного средства",
                "в качестве желчегонного средства"
            ]
        },
        {
            "qID": 55,
            "qName": "Фамотидин снижает секрецию желудочного сока, потому что блокирует:",
            "rA": [
                "гистаминовые Н2-рецепторы"
            ],
            "wA": [
                "М-холинорецепторы",
                "гистаминовые Н1-рецепторы"
            ]
        },
        {
            "qID": 56,
            "qName": "Наиболее эффективно предупреждают рвоту при химиотерапии опухолей:",
            "rA": [
                "блокаторы серотониновых рецепторов"
            ],
            "wA": [
                "блокаторы адренорецепторов",
                "блокаторы М-холинорецепторов",
                "блокаторы - ГАМК рецепторов"
            ]
        },
        {
            "qID": 57,
            "qName": "Механизм желчегонного действия холосаса:",
            "rA": [
                "увеличивает продукцию желчи гепатоцитами"
            ],
            "wA": [
                "способствует расслаблению сфинктера Одди",
                "прямо стимулируюет гладкие мышцы желчного пузыря"
            ]
        },
        {
            "qID": 58,
            "qName": "При отравлении бледной поганкой назначают:",
            "rA": [
                "силибинин (легалон)"
            ],
            "wA": [
                "адеметионин (гептрал)",
                "мизопростол (сайтотек)",
                "метоклопрамид",
                "эссенциале"
            ]
        },
        {
            "qID": 59,
            "qName": "Для лечения диареи применяют:",
            "rA": [
                "лоперамид (имодиум)"
            ],
            "wA": [
                "атропин",
                "неостигмина метилсульфат (прозерин)",
                "дротаверин",
                "натрия гидрокарбонат"
            ]
        },
        {
            "qID": 60,
            "qName": "Антибиотик, обладает широким спектром антимикробного действия. Кислотоустойчив, не устойчив к действию пенициллиназы:",
            "rA": [
                "ампициллин"
            ],
            "wA": [
                "оксациллин",
                "бензилпенициллина натриевая соль",
                "бензатин бензилпенициллин бензилпенициллин прокаина (бициллин-5)"
            ]
        },
        {
            "qID": 61,
            "qName": "Гепатотоксическое действие характерно для:",
            "rA": [
                "биосинтетических"
            ],
            "wA": [
                "аминогликозидов",
                "цефалоспоринов",
                "тетрациклинов",
                "пенициллинов"
            ]
        },
        {
            "qID": 62,
            "qName": "Группа антибиотиков, обладающая ототоксическими свойствами:",
            "rA": [
                "аминогликозиды"
            ],
            "wA": [
                "тетрациклины",
                "макролиды",
                "цефалоспорины"
            ]
        },
        {
            "qID": 63,
            "qName": "Какой препарат устойчив к пенициллиназе:",
            "rA": [
                "оксациллин"
            ],
            "wA": [
                "бензилпенициллин",
                "феноксиметилпенициллин",
                "ампициллин"
            ]
        },
        {
            "qID": 64,
            "qName": "Механизм антимикробного действия пенициллинов заключается в том, что они нарушают в микробной клетке:",
            "rA": [
                "синтез клеточной стенки"
            ],
            "wA": [
                "проницаемость цитоплазматической мембраны",
                "внутриклеточный синтез белка",
                "синтез РНК"
            ]
        },
        {
            "qID": 65,
            "qName": "Ототоксическими свойствами обладают:",
            "rA": [
                "аминогликозиды"
            ],
            "wA": [
                "тетрациклины",
                "макролиды",
                "хлорамфеникол (левомицетин)"
            ]
        },
        {
            "qID": 66,
            "qName": "Пенициллины и цефалоспорины нарушают у бактерий:",
            "rA": [
                "синтез клеточной стенки"
            ],
            "wA": [
                "проницаемость цитоплазматической мембраны",
                "внутриклеточный синтез белка",
                "синтез РНК"
            ]
        },
        {
            "qID": 67,
            "qName": "Побочное действие пенициллинов проявляется:",
            "rA": [
                "аллергическими реакциями"
            ],
            "wA": [
                "угнетением кроветворения",
                "угнетением функции почек",
                "нарушениями слуха и вестибулярными расстройствами"
            ]
        },
        {
            "qID": 68,
            "qName": "Полимиксины нарушают:",
            "rA": [
                "проницаемость цитоплазматической мембраны бактерий"
            ],
            "wA": [
                "синтез клеточной стенки бактерий",
                "синтез РНК",
                "синтез белка на рибосомах"
            ]
        },
        {
            "qID": 69,
            "qName": "При сифилисе применяют:",
            "rA": [
                "препараты бензилпенициллина"
            ],
            "wA": [
                "стрептомицин",
                "канамицин"
            ]
        },
        {
            "qID": 70,
            "qName": "Рациональная комбинация антибиотиков:",
            "rA": [
                "ампициллиноксациллин"
            ],
            "wA": [
                "стрептомицинамикацин",
                "пенициллинытетрациклин"
            ]
        },
        {
            "qID": 71,
            "qName": "Тетрациклины могут оказывать:",
            "rA": [
                "гепатотоксическое действие"
            ],
            "wA": [
                "нефротоксическое действие",
                "ототоксическое действие"
            ]
        },
        {
            "qID": 72,
            "qName": "Эритромицин:",
            "rA": [
                "макролид"
            ],
            "wA": [
                "аминогликозид",
                "полимиксин",
                "цефалоспорин"
            ]
        },
        {
            "qID": 73,
            "qName": "Кислота налидиксовая действует преимущественно на:",
            "rA": [
                "грамотрицательные бактерии"
            ],
            "wA": [
                "грамположительные бактерии",
                "имеет широкий спектр действия"
            ]
        },
        {
            "qID": 74,
            "qName": "Офлоксацин относится к:",
            "rA": [
                "фторхинолонам"
            ],
            "wA": [
                "сульфаниламидам",
                "нитрофуранам"
            ]
        },
        {
            "qID": 75,
            "qName": "Ципрофлоксацин относится к производным:",
            "rA": [
                "фторхинолона"
            ],
            "wA": [
                "нитрофурана",
                "8-оксихинолина"
            ]
        },
        {
            "qID": 76,
            "qName": "Изониазид является производным:",
            "rA": [
                "ГИНК"
            ],
            "wA": [
                "сульфаниламида",
                "нитрофурана"
            ]
        },
        {
            "qID": 77,
            "qName": "Какой препарат может вызывать невриты:",
            "rA": [
                "изониазид"
            ],
            "wA": [
                "рифампицин"
            ]
        },
        {
            "qID": 78,
            "qName": "Какой препарат эффективен в отношении как внутриклеточно, так и внеклеточно расположенных микобактерий туберкулеза:",
            "rA": [
                "изониазид"
            ],
            "wA": [
                "стрептомицин"
            ]
        },
        {
            "qID": 79,
            "qName": "Механизм действия препаратов ГИНК обусловлен:",
            "rA": [
                "подавлением синтеза миколевых кислот"
            ],
            "wA": [
                "изменением проницаемости цитоплазматической мембраны",
                "подавлением синтеза белка",
                "нарушением использования пабк"
            ]
        },
        {
            "qID": 80,
            "qName": "Механизм действия стрептомицина на микобактерии туберкулеза обусловлен:",
            "rA": [
                "угнетением внутриклеточного синтеза белка"
            ],
            "wA": [
                "угнетением синтеза РНК",
                "антагонизмом с пара-аминобензойном кислотой",
                "нарушением синтеза клеточной оболочки микобактерий"
            ]
        },
        {
            "qID": 81,
            "qName": "Рифампицин нарушает:",
            "rA": [
                "синтез РНК"
            ],
            "wA": [
                "синтез клеточной стенки бактерий",
                "проницаемость цитоплазматической мембраны бактерий",
                "синтез белка на рибосомах"
            ]
        },
        {
            "qID": 82,
            "qName": "Угнетение внутриклеточного синтеза белка у микобактерий туберкулеза вызывает:",
            "rA": [
                "стрептомицин"
            ],
            "wA": [
                "рифампицин",
                "этамбутол"
            ]
        },
        {
            "qID": 83,
            "qName": "Угнетение функции почек может вызывать:",
            "rA": [
                "стрептомицин"
            ],
            "wA": [
                "рифампицин"
            ]
        },
        {
            "qID": 84,
            "qName": "Выберите противогрибковый препарат из группы аллиламинов:",
            "rA": [
                "тербинафин"
            ],
            "wA": [
                "нистатин",
                "леворин",
                "амфотерицин В",
                "кетоконазол"
            ]
        },
        {
            "qID": 85,
            "qName": "К нистатину чувствительны:",
            "rA": [
                "возбудитель кандидозов"
            ],
            "wA": [
                "возбудители системных микозов (гистоплазмоза и др.)",
                "возбудители дерматомикозов"
            ]
        },
        {
            "qID": 86,
            "qName": "Кетоконазол вызывает:",
            "rA": [
                "нарушение проницаемости цитоплазматических мембран грибов"
            ],
            "wA": [
                "нарушение синтеза клеточной оболочки грибов",
                "угнетение синтеза нуклеиновых кислот"
            ]
        },
        {
            "qID": 87,
            "qName": "Механизм фунгицидного действия гризеофульвина возможно обусловлен:",
            "rA": [
                "угнетением синтеза нуклеиновых кислот"
            ],
            "wA": [
                "нарушением синтеза клеточной оболочки грибов",
                "нарушением проницаемости цитоплазматических мембран"
            ]
        },
        {
            "qID": 88,
            "qName": "Нистатин вызывает:",
            "rA": [
                "нарушение проницаемости цитоплазматических мембран грибов"
            ],
            "wA": [
                "нарушение синтеза клеточной оболочки грибов",
                "угнетение синтеза нуклеиновых кислот"
            ]
        },
        {
            "qID": 89,
            "qName": "Ацикловир эффективен при:",
            "rA": [
                "герпетической инфекции"
            ],
            "wA": [
                "гриппе",
                "ВИЧ-инфекции (СПИД)"
            ]
        },
        {
            "qID": 90,
            "qName": "Каков механизм действия римантадина:",
            "rA": [
                "блокада ионных М2-каналов вируса"
            ],
            "wA": [
                "ингибирование нейраминидазы",
                "подавление синтеза ДНК",
                "подавление синтеза РНК",
                "подавление синтеза ГМФ"
            ]
        },
        {
            "qID": 91,
            "qName": "Отметить показание к применению римантадина:",
            "rA": [
                "профилактика гриппа А2"
            ],
            "wA": [
                "лечение гриппа",
                "лечение герпетических инфекций кожи и слизистых оболочек",
                "профилактика оспы"
            ]
        },
        {
            "qID": 92,
            "qName": "Проникновение вируса в клетку и процесс высвобождения вирусного генома нарушают:",
            "rA": [
                "римантадин (ремантадин)"
            ],
            "wA": [
                "ацикловир"
            ]
        },
        {
            "qID": 93,
            "qName": "Синтез нуклеиновых кислот нарушает:",
            "rA": [
                "ацикловир"
            ],
            "wA": [
                "римантадин (ремантадин)"
            ]
        },
        {
            "qID": 94,
            "qName": "Как противоамебное средство метронидазол применяют:",
            "rA": [
                "при любых формах амебиаза"
            ],
            "wA": [
                "только при кишечном амебиазе",
                "только при внекишечном амебиазе"
            ]
        },
        {
            "qID": 95,
            "qName": "При лямблиозе применяют:",
            "rA": [
                "фуразолидон"
            ],
            "wA": [
                "празиквантель",
                "нитроксолин"
            ]
        },
        {
            "qID": 96,
            "qName": "Эффективен при амебиазе любой локализации:",
            "rA": [
                "метронидазол"
            ],
            "wA": [
                "тетрациклин",
                "хиниофон",
                "эметин"
            ]
        },
        {
            "qID": 97,
            "qName": "Малый иммунодепрессант, противоаритмический препарат применяемый в качестве гематошизотропного средства при всех формах малярии:",
            "rA": [
                "хлорохин (хингамин)"
            ],
            "wA": [
                "мономицин",
                "фуразолидон",
                "хинин",
                "мепакрин (акрихин)"
            ]
        },
        {
            "qID": 98,
            "qName": "Противоглистный препарат, обладающий высокой активностью в отношении всех кишечных тениидозов, но противопоказанный при тениозе во избежание развития цистицеркоза:",
            "rA": [
                "никлозамид (фенасал)"
            ],
            "wA": [
                "албендазол",
                "празиквантел",
                "инвермектин",
                "ивермектин"
            ]
        },
        {
            "qID": 99,
            "qName": "Средство для лечения трихомонадоза из группы нитроимидозолов:",
            "rA": [
                "метронидазол"
            ],
            "wA": [
                "трихомонацид",
                "аминитразол (нитазол)",
                "фуразолидон",
                "аминохинол"
            ]
        },
        {
            "qID": 100,
            "qName": "Анаболический стероид:",
            "rA": [
                "нандролон (ретаболил)"
            ],
            "wA": [
                "преднизолон",
                "дексаметазон",
                "гидрокортизон"
            ]
        }
    ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Ух, ты! Пасхалка найдена! Значит ты сдашь!";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' );
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html" });
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
