var tests = {
  "tests": [
      {
          "qID": 501,
          "qName": "Гистологические варианты эпулиса …",
          "rA": [
              "гигантоклеточный",
              "ангиоматозный",
              "фиброматозный"
          ],
          "wA": [
              "воспалительный",
              "диспластический"
          ]
      },
      {
          "qID": 502,
          "qName": "Для ангиоматозного эпулиса характерно …",
          "rA": [
              "формирование большого количества новообразованных сосудов"
          ],
          "wA": [
              "наличие выраженного фиброза",
              "появление гигантских многоядерных клеток типа остеокластов",
              "инвазивный рост в ткань челюсти"
          ]
      },
      {
          "qID": 503,
          "qName": "Для фиброматозного эпулиса характерно …",
          "rA": [
              "наличие выраженного фиброза"
          ],
          "wA": [
              "формирование большого количества новообразованных сосудов",
              "появление гигантских многоядерных клеток типа остеокластов",
              "инвазивный рост в ткань челюсти"
          ]
      },
      {
          "qID": 504,
          "qName": "Для гигантоклеточного эпулиса характерно …",
          "rA": [
              "появление гигантских многоядерных клеток типа остеокластов"
          ],
          "wA": [
              "наличие выраженного фиброза",
              "формирование большого количества новообразованных сосудов",
              "инвазивный рост в ткань челюсти"
          ]
      },
      {
          "qID": 505,
          "qName": "Характерные признаки герпетического стоматита …",
          "rA": [
              "склонность к рецидивированию",
              "персистенция вируса в нервных ганглиях",
              "часто сопровождается лимфаденитом"
          ],
          "wA": [
              "часто сопровождается конъюнктивитом"
          ]
      },
      {
          "qID": 506,
          "qName": "Преобладающий элемент сыпи при герпетическом стоматите - …",
          "rA": [
              "везикула"
          ],
          "wA": [
              "папула",
              "пустула",
              "розеола"
          ]
      },
      {
          "qID": 507,
          "qName": "К специфическим проявлениям ВИЧ-инфекции со стороны полости рта относятся …",
          "rA": [
              "саркома Капоши",
              "волосовидная лейкоплакия"
          ],
          "wA": [
              "«ангина» Людвига",
              "язвенно-некротический гингивостоматит Венсана",
              "гунтеровский глоссит"
          ]
      },
      {
          "qID": 508,
          "qName": "Специфические инфекционные стоматиты возможны при таких инфекциях, как …",
          "rA": [
              "туберкулез",
              "сифилис"
          ],
          "wA": [
              "герпес",
              "скарлатина"
          ]
      },
      {
          "qID": 509,
          "qName": "Клинико-морфологические проявления простого кандидоза (молочницы) слизистой оболочки полости рта - …",
          "rA": [
              "слизистая оболочка гиперемирована",
              "на поверхности слизистой оболочки рыхлый белесоватый налет"
          ],
          "wA": [
              "на поверхности слизистой оболочки множественные эрозии и язвы",
              "на поверхности слизистой оболочки множественные пузырьки с серозным содержимым"
          ]
      },
      {
          "qID": 510,
          "qName": "К поражениям слизистой оболочки полости рта токсико-аллергического характера относятся …",
          "rA": [
              "синдром Лайелла",
              "синдром Стивенса-Джонсона",
              "полиморфная экссудативная эритема"
          ],
          "wA": [
              "синдром Шегрена",
              "синдром Микулича"
          ]
      },
      {
          "qID": 511,
          "qName": "Клинико-морфологические проявления полиморфной экссудативной эритемы …",
          "rA": [
              "сыпь представлена разнообразим элементов",
              "сопровождается выраженными общими проявлениями",
              "микроскопически – гидропическая дистрофия эпителиоцитов и межклеточный отек"
          ],
          "wA": [
              "элементы сыпи всегда однообразны и представлены папулами",
              "элементы сыпи всегда однообразны и представлены везикулами"
          ]
      },
      {
          "qID": 512,
          "qName": "Клинико-морфологические проявления синдрома Лайелла …",
          "rA": [
              "является наиболее тяжелой формой токсико-аллергического поражения",
              "возникает при опосредованном действии аллергена",
              "характеризуется массивной отслойкой эпителия"
          ],
          "wA": [
              "возникает только при прямом контактном действии аллергена",
              "характеризуется специфическим гранулематозным поражением"
          ]
      },
      {
          "qID": 513,
          "qName": "Для афтозного стоматита характерны следующие признаки …",
          "rA": [
              "аутоиммунный компонент патогенеза",
              "проявляется поверхностными изъязвлениями слизистой оболочки"
          ],
          "wA": [
              "токсико-аллергический компонент патогенеза",
              "проявляется папулезно-везикулезными высыпаниями"
          ]
      },
      {
          "qID": 514,
          "qName": "К предраковым заболевания для слизистой оболочки полости рта относятся …",
          "rA": [
              "лейкоплакия",
              "папилломатоз",
              "постлучевой стоматит"
          ],
          "wA": [
              "афтозный стоматит"
          ]
      },
      {
          "qID": 515,
          "qName": "К предраковым заболеваниям для красной каймы губ относятся …",
          "rA": [
              "хейлит Манганотти",
              "лейкоплакия"
          ],
          "wA": [
              "кандидозный хейлит",
              "герпетический хейлит"
          ]
      },
      {
          "qID": 516,
          "qName": "Формирование очагов патологического ороговения слизистой оболочки полости рта с воспалительной субэпителиальной инфильтрацией – это …",
          "rA": [
              "лейкоплакия"
          ],
          "wA": [
              "афтозный стоматит",
              "папилломатоз",
              "ксеростомия"
          ]
      },
      {
          "qID": 517,
          "qName": "Характерные признаки хейлита Манганотти …",
          "rA": [
              "поражает обычно нижнюю губу",
              "представлен эрозивным поражением с формированием корок"
          ],
          "wA": [
              "представлен множественными пузырьками с геморрагическим содержимым",
              "представлен очагами патологического ороговения эпителия"
          ]
      },
      {
          "qID": 518,
          "qName": "Рак слизистой оболочки полости рта и нижней губы чаще представлен …",
          "rA": [
              "плоскоклеточным раком"
          ],
          "wA": [
              "железистым раком (аденокарциномой)",
              "базальноклеточным раком",
              "слизистым раком"
          ]
      },
      {
          "qID": 519,
          "qName": "Рак кожи лица чаще представлен …",
          "rA": [
              "базальноклеточным раком"
          ],
          "wA": [
              "железистым раком (аденокарциномой)",
              "плоскоклеточным раком",
              "слизистым раком"
          ]
      },
      {
          "qID": 520,
          "qName": "Возможные пути лимфогенного метастазирования для рака нижней губы …",
          "rA": [
              "глубокие шейные лимфоузлы",
              "надключичные лимфоузлы"
          ],
          "wA": [
              "забрюшинные лимфоузлы",
              "затылочные лимфоузлы"
          ]
      },
      {
          "qID": 521,
          "qName": "К воспалительным заболеваниям челюстей относятся …",
          "rA": [
              "периостит",
              "остеомиелит"
          ],
          "wA": [
              "периодонтит",
              "пародонтоз",
              "десмодонтоз"
          ]
      },
      {
          "qID": 522,
          "qName": "Воспаление надкостницы – это …",
          "rA": [
              "периостит"
          ],
          "wA": [
              "пародонтит",
              "периодонтит",
              "остит",
              "остеомиелит"
          ]
      },
      {
          "qID": 523,
          "qName": "Сочетанное воспаление костной ткани и костного мозга – это …",
          "rA": [
              "остеомиелит"
          ],
          "wA": [
              "пародонтит",
              "периодонтит",
              "периостит",
              "остит"
          ]
      },
      {
          "qID": 524,
          "qName": "К клинико-морфологическим формам острого периостита относятся …",
          "rA": [
              "серозный",
              "очаговый гнойный",
              "диффузный гнойный"
          ],
          "wA": [
              "гранулематозный",
              "геморрагический"
          ]
      },
      {
          "qID": 525,
          "qName": "К клинико-морфологическим формам хронического периостита относятся …",
          "rA": [
              "фиброзный",
              "оссифицирующий"
          ],
          "wA": [
              "гранулематозный",
              "серозный",
              "гнойный"
          ]
      },
      {
          "qID": 526,
          "qName": "Основные причины развития острого периостита - …",
          "rA": [
              "осложнение острого периодонтита",
              "обострение хронического периодонтита",
              "нагноение челюстных кист"
          ],
          "wA": [
              "пародонтоз тяжелой степени"
          ]
      },
      {
          "qID": 527,
          "qName": "Патоморфологическая картина острого серозного периостита - …",
          "rA": [
              "гиперемия и отек со слабой лейкоцитарной инфильтрацией"
          ],
          "wA": [
              "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти",
              "распространение лейкоцитарного инфильтрата на периост тела челюсти",
              "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью",
              "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
          ]
      },
      {
          "qID": 528,
          "qName": "Патоморфологическая картина очагового гнойного периостита - …",
          "rA": [
              "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти"
          ],
          "wA": [
              "гиперемия и отек со слабой лейкоцитарной инфильтрацией",
              "распространение лейкоцитарного инфильтрата на периост тела челюсти",
              "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью",
              "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
          ]
      },
      {
          "qID": 529,
          "qName": "Патоморфологическая картина диффузного гнойного периостита - …",
          "rA": [
              "распространение лейкоцитарного инфильтрата на периост тела челюсти"
          ],
          "wA": [
              "гиперемия и отек со слабой лейкоцитарной инфильтрацией",
              "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти",
              "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью",
              "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
          ]
      },
      {
          "qID": 530,
          "qName": "Патоморфологическая картина хронического фиброзного периостита - …",
          "rA": [
              "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью"
          ],
          "wA": [
              "гиперемия и отек со слабой лейкоцитарной инфильтрацией",
              "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти",
              "распространение лейкоцитарного инфильтрата на периост тела челюсти",
              "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
          ]
      },
      {
          "qID": 531,
          "qName": "Патоморфологическая картина хронического оссифицирующего периостита - …",
          "rA": [
              "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
          ],
          "wA": [
              "гиперемия и отек со слабой лейкоцитарной инфильтрацией",
              "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти",
              "распространение лейкоцитарного инфильтрата на периост тела челюсти",
              "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью"
          ]
      },
      {
          "qID": 532,
          "qName": "Для острого остеомиелита челюсти характерны следующие признаки …",
          "rA": [
              "некроз костной ткани с образованием секвестров",
              "формирование гнойных свищей"
          ],
          "wA": [
              "постепенное расшатывание и выпадение зубов",
              "разрушение зубных корней"
          ]
      },
      {
          "qID": 533,
          "qName": "Факторы, способствующие развитию хронического остеомиелита …",
          "rA": [
              "сенсибилизация бактериальными антигенами",
              "снижение общей резистентности организма",
              "несанированные очаги одонтогенной инфекции"
          ],
          "wA": [
              "недостаточная реминерализующая активность слюны"
          ]
      },
      {
          "qID": 534,
          "qName": "Осложнения острого остеомиелита челюсти - …",
          "rA": [
              "свищи и флегмоны мягких тканей лица и шеи",
              "одонтогенный сепсис",
              "лимфадениты"
          ],
          "wA": [
              "быстропрогрессирующий пародонтоз"
          ]
      },
      {
          "qID": 535,
          "qName": "Осложнения хронического остеомиелита челюсти - …",
          "rA": [
              "лимфадениты",
              "амилоидоз внутренних органов",
              "патологические переломы челюсти"
          ],
          "wA": [
              "жировая эмболия"
          ]
      },
      {
          "qID": 536,
          "qName": "К проявлениям одонтогенной инфекции относятся …",
          "rA": [
              "периостит челюсти",
              "остеомиелит челюсти",
              "лимфадениты челюстно-лицевой области",
              "абсцессы и флегмоны челюстно-лицевой области"
          ],
          "wA": [
              "гингивиты"
          ]
      },
      {
          "qID": 537,
          "qName": "Осложнения одонтогенной инфекции …",
          "rA": [
              "тромбоз синусов твердой мозговой оболочки",
              "гнойный менингит",
              "гнойный медиастинит"
          ],
          "wA": [
              "жировая эмболия"
          ]
      },
      {
          "qID": 538,
          "qName": "Основные особенности сепсиса …",
          "rA": [
              "полиэтиологичен",
              "не заразен",
              "не формируется иммунный ответ"
          ],
          "wA": [
              "имеет строго циклическое течение",
              "обязательно сопровождается бактериемией"
          ]
      },
      {
          "qID": 539,
          "qName": "Клинико-морфологическими формами сепсиса являются …",
          "rA": [
              "инфекционный эндокардит",
              "септицемия",
              "септикопиемия"
          ],
          "wA": [
              "инфекционный миокардит",
              "бактериемия"
          ]
      },
      {
          "qID": 540,
          "qName": "Общие изменения при сепсисе представлены …",
          "rA": [
              "дистрофией и межуточным воспалением паренхиматозных органов",
              "васкулитами",
              "гиперплазией лимфоидной и кроветворной тканей"
          ],
          "wA": [
              "инфекционным эндокардитом",
              "тромбофлебитом в области септического очага"
          ]
      },
      {
          "qID": 541,
          "qName": "Характерными признаками септицемии являются …",
          "rA": [
              "выраженная гиперергическая реакция",
              "острое или молниеносное течение",
              "общие изменения преобладают над местными"
          ],
          "wA": [
              "множественные метастатические абсцессы внутренних органов",
              "тромбобактериальная эмболия"
          ]
      },
      {
          "qID": 542,
          "qName": "Характерными признаками септикопиемии являются …",
          "rA": [
              "множественные метастатические абсцессы внутренних органов",
              "тромбобактериальная эмболия"
          ],
          "wA": [
              "выраженная гиперергическая реакция",
              "острое или молниеносное течение",
              "общие изменения преобладают над местными"
          ]
      },
      {
          "qID": 543,
          "qName": "Морфологическая картина септического эндокардита характеризуется … эндокардитом",
          "rA": [
              "полипозно-язвенным"
          ],
          "wA": [
              "возвратно-бородавчатым",
              "фибропластическим",
              "флегмонозно-язвенным"
          ]
      },
      {
          "qID": 544,
          "qName": "К одонтогенным кистам челюстей относятся …",
          "rA": [
              "радикулярная киста",
              "фолликулярная киста"
          ],
          "wA": [
              "глобуломаксиллярная киста",
              "киста резцового канала"
          ]
      },
      {
          "qID": 545,
          "qName": "К неодонтогенным кистам челюстей относятся …",
          "rA": [
              "глобуломаксиллярная киста",
              "киста резцового канала"
          ],
          "wA": [
              "радикулярная киста",
              "фолликулярная киста"
          ]
      },
      {
          "qID": 546,
          "qName": "Клинико-морфологические признаки радикулярной кисты …",
          "rA": [
              "встречается гораздо чаще других челюстных кист",
              "имеет воспалительное происхождение",
              "стенка выстлана многослойным плоским эпителием"
          ],
          "wA": [
              "имеет дизонтогенетическое происхождение"
          ]
      },
      {
          "qID": 547,
          "qName": "Морфологические проявления радикулярной кисты …",
          "rA": [
              "толщина фиброзной стенки зависит от активности воспаления",
              "стенка выстлана многослойным плоским эпителием",
              "эпителий формирует сетевидные отростки погружного роста"
          ],
          "wA": [
              "стенка выстлана одонтогенным эпителием"
          ]
      },
      {
          "qID": 548,
          "qName": "Морфологические проявления фолликулярной кисты …",
          "rA": [
              "эпителиальная выстилка тонкая – в 2-3 слоя клеток",
              "в просвете может содержать зачатки зубов",
              "в выстилке встречаются островки одонтогенного эпителия"
          ],
          "wA": [
              "эпителиальная выстилка толстая с элементами погружного роста"
          ]
      },
      {
          "qID": 549,
          "qName": "Клинико-морфологические признаки первичной кисты (кератокисты) …",
          "rA": [
              "внутренняя поверхность выстлана многослойным плоским эпителием",
              "может распространяться по длиннику челюсти",
              "имеет дизонтогенетическое происхождение"
          ],
          "wA": [
              "имеет воспалительное происхождение",
              "встречается гораздо чаще других челюстных кист"
          ]
      },
      {
          "qID": 550,
          "qName": "К общим признакам одонтогенных опухолей челюсти относятся …",
          "rA": [
              "чаще являются доброкачественными",
              "рост преимущественно местнодеструирующий",
              "носят органоспецифический характер"
          ],
          "wA": [
              "чаще являются злокачественными"
          ]
      },
      {
          "qID": 551,
          "qName": "К одонтогенным опухолям челюстей относятся …",
          "rA": [
              "амелобластома",
              "первичная внутрикостная карцинома",
              "цементома"
          ],
          "wA": [
              "гигантоклеточная опухоль (остеобластокластома)",
              "остеосаркома челюсти"
          ]
      },
      {
          "qID": 552,
          "qName": "К одонтогенным эпителиальным опухолям относятся …",
          "rA": [
              "амелобластома",
              "первичная карцинома челюсти"
          ],
          "wA": [
              "цементома",
              "дентинома",
              "одонтогенная саркома"
          ]
      },
      {
          "qID": 553,
          "qName": "К одонтогенным мезенхимальным опухолям относятся …",
          "rA": [
              "цементома",
              "дентинома",
              "одонтогенная саркома"
          ],
          "wA": [
              "амелобластома",
              "первичная карцинома челюсти"
          ]
      },
      {
          "qID": 554,
          "qName": "Клинико-морфологические признаки амелобластомы …",
          "rA": [
              "доброкачественная одонтогенная опухоль",
              "чаще поражает нижнюю челюсть",
              "построена из островков одонтогенного эпителия"
          ],
          "wA": [
              "злокачественная одонтогенная опухоль",
              "построена из одонтогенной мезенхимы"
          ]
      },
      {
          "qID": 555,
          "qName": "Клинико-морфологические признаки дентиномы …",
          "rA": [
              "доброкачественная одонтогенная опухоль",
              "развивается из одонтогенной мезенхимы"
          ],
          "wA": [
              "злокачественная одонтогенная опухоль",
              "развивается из одонтогенного эпителия"
          ]
      },
      {
          "qID": 556,
          "qName": "К неодонтогенным опухолям челюстей относятся …",
          "rA": [
              "остеома",
              "гигантоклеточная опухоль (остеобластокластома)"
          ],
          "wA": [
              "амелобластома",
              "дентинома"
          ]
      },
      {
          "qID": 557,
          "qName": "Остеома челюсти – это …",
          "rA": [
              "доброкачественная неодонтогенная опухоль"
          ],
          "wA": [
              "доброкачественная одонтогенная опухоль",
              "злокачественная одонтогенная опухоль",
              "злокачественная неодонтогенная опухоль"
          ]
      },
      {
          "qID": 558,
          "qName": "Остеобластокластома (гигантоклеточная опухоль) – это …",
          "rA": [
              "неодонтогенная опухоль челюсти"
          ],
          "wA": [
              "доброкачественная одонтогенная опухоль челюсти",
              "злокачественная одонтогенная опухоль челюсти",
              "разновидность фиброзной дисплазии челюсти"
          ]
      },
      {
          "qID": 559,
          "qName": "Для фиброзной дисплазии челюстей характерны следующие признаки …",
          "rA": [
              "чаще поражает верхнюю челюсть",
              "вызывает выраженную деформацию лица",
              "характеризуется разрастанием примитивной костно-волокнистой ткани"
          ],
          "wA": [
              "чаще поражает нижнюю челюсть",
              "характеризуется избыточным окостенением челюстей"
          ]
      },
      {
          "qID": 560,
          "qName": "Херувизм – это …",
          "rA": [
              "разновидность фиброзной дисплазии челюсти"
          ],
          "wA": [
              "доброкачественная одонтогенная опухоль челюсти",
              "злокачественная одонтогенная опухоль челюсти",
              "неодонтогенная опухоль челюсти"
          ]
      },
      {
          "qID": 561,
          "qName": "Сиаладенит – это воспаление … слюнной железы",
          "rA": [
              "любой"
          ],
          "wA": [
              "околоушной",
              "подъязычной",
              "подчелюстной"
          ]
      },
      {
          "qID": 562,
          "qName": "Паротит – это воспаление … слюнной железы",
          "rA": [
              "околоушной"
          ],
          "wA": [
              "подъязычной",
              "подчелюстной",
              "любой"
          ]
      },
      {
          "qID": 563,
          "qName": "К путям попадания инфекта в слюнные железы относятся …",
          "rA": [
              "интрадуктальный",
              "гематогенный",
              "лимфогенный"
          ],
          "wA": [
              "одонтогенный"
          ]
      },
      {
          "qID": 564,
          "qName": "Особенности эпидемического паротита …",
          "rA": [
              "воздушно-капельный тип передачи",
              "интерстициальный характер воспаления",
              "возможно поражение поджелудочной железы, яичек"
          ],
          "wA": [
              "алиментарный тип передачи",
              "поражение всегда одностороннее"
          ]
      },
      {
          "qID": 565,
          "qName": "К возможным осложнениям острого бактериального сиаладенита относятся …",
          "rA": [
              "аррозионные кровотечения",
              "свищи и флегмоны окружающих мягких тканей",
              "абсцесс слюнной железы"
          ],
          "wA": [
              "одонтогенный сепсис"
          ]
      },
      {
          "qID": 566,
          "qName": "Выберите морфологические формы хронического бактериального сиаладенита …",
          "rA": [
              "межуточный продуктивный",
              "протоковый"
          ],
          "wA": [
              "паренхиматозный",
              "цирротический"
          ]
      },
      {
          "qID": 567,
          "qName": "Последствиями хронического сиаладенита могут являться …",
          "rA": [
              "цирроз слюнной железы",
              "опухоли слюнной железы",
              "кисты слюнной железы",
              "слюнокаменная болезнь (сиалолитиаз)"
          ],
          "wA": []
      },
      {
          "qID": 568,
          "qName": "Слюнокаменная болезнь чаще всего поражает … слюнную железу",
          "rA": [
              "подчелюстную"
          ],
          "wA": [
              "околоушную",
              "подъязычную"
          ]
      },
      {
          "qID": 569,
          "qName": "К факторам камнеобразования в слюнной железе относятся …",
          "rA": [
              "дискинезия протоковой системы",
              "органические расстройства проходимости протоков",
              "хронические воспаление",
              "изменение состава слюны"
          ],
          "wA": [
              "одонтогенная инфекция"
          ]
      },
      {
          "qID": 570,
          "qName": "Укажите возможные осложнения слюнокаменной болезни …",
          "rA": [
              "кисты слюнной железы",
              "цирроз слюнной железы",
              "ксеростомия"
          ],
          "wA": [
              "эпидемический паротит"
          ]
      },
      {
          "qID": 571,
          "qName": "Заболевание, сопровождающееся сочетанным аутоиммунным поражением слюнных, слезных желез и суставов – это …",
          "rA": [
              "болезнь Шегрена"
          ],
          "wA": [
              "болезнь Хашимото",
              "болезнь Бехтерева",
              "болезнь Микулича"
          ]
      },
      {
          "qID": 572,
          "qName": "Основными проявлениями болезни Шегрена являются …",
          "rA": [
              "ксеростомия",
              "ксерофтальмия",
              "полиартрит"
          ],
          "wA": [
              "сиалолитиаз",
              "атрофический гастрит"
          ]
      },
      {
          "qID": 573,
          "qName": "Морфологические изменения слюнной железы при болезни Шегрена …",
          "rA": [
              "массивная миграция в железу активированных лимфоцитов",
              "деструкция паренхиматозных элементов",
              "разрастание соединительной ткани"
          ],
          "wA": [
              "диффузная инфильтрация стромы нейтрофильными лейкоцитами"
          ]
      },
      {
          "qID": 574,
          "qName": "К доброкачественным эпителиальным опухолям (аденомам) слюнных желез относятся …",
          "rA": [
              "смешанная опухоль",
              "опухоль Уортина"
          ],
          "wA": [
              "мукоэпидермоидная опухоль",
              "аденокистозная опухоль",
              "ациноклеточная опухоль"
          ]
      },
      {
          "qID": 575,
          "qName": "К злокачественным эпителиальным опухолям (карциномам) слюнных желез относятся …",
          "rA": [
              "мукоэпидермоидная опухоль",
              "аденокистозная опухоль",
              "ациноклеточная опухоль"
          ],
          "wA": [
              "смешанная опухоль",
              "опухоль Уортина"
          ]
      },
      {
          "qID": 576,
          "qName": "Самая частая опухоль слюнных желез - …",
          "rA": [
              "плеоморфная аденома (смешанная опухоль)"
          ],
          "wA": [
              "мономорфная аденома",
              "мукоэпидермоидная карцинома",
              "цилиндрома"
          ]
      },
      {
          "qID": 577,
          "qName": "Плеоморфная аденома (смешанная опухоль) чаще всего поражает … слюнные железы",
          "rA": [
              "околоушные"
          ],
          "wA": [
              "малые",
              "подъязычные",
              "подчелюстные"
          ]
      },
      {
          "qID": 578,
          "qName": "Плеоморфную аденому (смешанную опухоль) слюнной железы характеризуют …",
          "rA": [
              "экспансивный рост",
              "частая локализация в околоушной железе",
              "гистологическая гетерогенность",
              "склонность к рецидивированию"
          ],
          "wA": [
              "инвазивный рост"
          ]
      },
      {
          "qID": 579,
          "qName": "Гистологические компоненты плеоморфной аденомы (смешанной опухоли) слюнной железы - …",
          "rA": [
              "эпителиальный",
              "мукоидный",
              "хондроидный"
          ],
          "wA": [
              "остеоидный",
              "одонтогенный"
          ]
      },
      {
          "qID": 580,
          "qName": "Опухоль слюнной железы, построенная из железистых и кистозных структур, между которыми располагаются лимфоидные фолликулы – это …",
          "rA": [
              "аденолимфома (опухоль Уортина)"
          ],
          "wA": [
              "плеоморфная аденома",
              "миоэпителиома",
              "базальноклеточная аденома"
          ]
      },
      {
          "qID": 581,
          "qName": "Самой распространенной злокачественной опухолью слюнных желез является …",
          "rA": [
              "мукоэпидермоидная опухоль"
          ],
          "wA": [
              "смешанная опухоль",
              "ациноклеточная опухоль",
              "аденокистозная опухоль"
          ]
      },
      {
          "qID": 582,
          "qName": "Мукоэпидермоидный рак чаще всего поражает … слюнные железы",
          "rA": [
              "околоушные"
          ],
          "wA": [
              "малые",
              "подъязычные",
              "подчелюстные"
          ]
      },
      {
          "qID": 583,
          "qName": "Клинико-морфологические признаки мукоэпидермоидного рака …",
          "rA": [
              "инвазивный рост",
              "клеточный полиморфизм слабо выражен",
              "чаще поражаются околоушные железы",
              "гистологическая гетерогенность"
          ],
          "wA": [
              "экспансивный рост"
          ]
      },
      {
          "qID": 584,
          "qName": "Основные популяции опухолевых клеток в мукоэпидермоидном раке …",
          "rA": [
              "эпидермоидные",
              "мукоидные (слизьпродуцирующие)",
              "промежуточные"
          ],
          "wA": [
              "хондроидные",
              "базальные"
          ]
      },
      {
          "qID": 585,
          "qName": "Клинико-морфологические признаки аденокистозного рака слюнных желез …",
          "rA": [
              "часто поражает малые слюнные железы",
              "характерна инвазия по ходу нервных волокон",
              "признаки клеточного атипизма выражены слабо"
          ],
          "wA": [
              "часто поражает подчелюстные слюнные железы",
              "экспансивный рост"
          ]
      },
      {
          "qID": 586,
          "qName": "Клинико-морфологические признаки ациноклеточного рака слюнных желез - …",
          "rA": [
              "часто поражает околоушные слюнные железы",
              "построен из клеток, напоминающих серозные клетки ацинусов"
          ],
          "wA": [
              "часто поражает малые слюнные железы",
              "характерна инвазия по ходу нервных волокон"
          ]
      },
      {
          "qID": 587,
          "qName": "К кистам шеи специфической локализации относятся …",
          "rA": [
              "боковая киста",
              "срединная киста"
          ],
          "wA": [
              "эпидермальная киста",
              "дермоидная киста",
              "киста сальной железы"
          ]
      },
      {
          "qID": 588,
          "qName": "К кистам шеи неспецифической локализации относятся …",
          "rA": [
              "эпидермальная киста",
              "дермоидная киста",
              "киста сальной железы"
          ],
          "wA": [
              "боковая киста",
              "срединная киста"
          ]
      },
      {
          "qID": 589,
          "qName": "Признаки эпидермальной кисты …",
          "rA": [
              "стенка образована соединительной тканью",
              "выстлана многослойным плоским ороговевающим эпителием",
              "в просвете содержит роговые массы"
          ],
          "wA": [
              "эпителиальной выстилки не имеет",
              "выстлана однослойным призматическим эпителием"
          ]
      },
      {
          "qID": 590,
          "qName": "Признаки дермоидной кисты …",
          "rA": [
              "стенка образована соединительной тканью",
              "в толще стенки имеются придатки кожи",
              "выстлана многослойным плоским ороговевающим эпителием",
              "в просвете содержит роговые массы, волосы, секрет сальных желез"
          ],
          "wA": [
              "выстлана однослойным призматическим эпителием"
          ]
      },
      {
          "qID": 591,
          "qName": "Если в толще стенки шейной кисты имеются островки ткани щитовидной железы, то это … киста",
          "rA": [
              "срединная"
          ],
          "wA": [
              "эпидермальная",
              "дермоидная",
              "боковая"
          ]
      },
      {
          "qID": 592,
          "qName": "Если в толще стенки шейной кисты имеются островки лимфоидной ткани, то это … киста",
          "rA": [
              "боковая"
          ],
          "wA": [
              "эпидермальная",
              "дермоидная",
              "срединная"
          ]
      },
      {
          "qID": 593,
          "qName": "Осложнения шейных кист …",
          "rA": [
              "нагноение",
              "сдавление прилежащих органов"
          ],
          "wA": [
              "инвазия в окружающие ткани"
          ]
      },
      {
          "qID": 594,
          "qName": "Увеличение лимфоузла может быть следствием следующих патологических процессов …",
          "rA": [
              "реактивной гиперплазии",
              "лимфаденита",
              "опухоли",
              "метастазирования"
          ],
          "wA": []
      },
      {
          "qID": 595,
          "qName": "Характерные изменения лимфоузлов в терминальной стадии ВИЧ-инфекции (стадия СПИДа) …",
          "rA": [
              "диффузная атрофия",
              "диффузный фиброз",
              "уменьшение числа и размеров фолликулов"
          ],
          "wA": [
              "резко выраженная гиперплазия",
              "массивная инфильтрация лейкоцитами"
          ]
      },
      {
          "qID": 596,
          "qName": "Для острого одонтогенного лимфаденита характерны следующие признаки …",
          "rA": [
              "увеличение в размерах лимфоузла",
              "болезненность лимфоузла"
          ],
          "wA": [
              "сморщивание лимфоузла",
              "диффузный склероз лимфоузла"
          ]
      },
      {
          "qID": 597,
          "qName": "При остром одонтогенном лимфадените воспаление может носить … характер",
          "rA": [
              "серозный",
              "гнойный"
          ],
          "wA": [
              "гранулематозный",
              "катаральный"
          ]
      },
      {
          "qID": 598,
          "qName": "Хронические специфические лимфадениты характерны для …",
          "rA": [
              "туберкулеза",
              "сифилиса"
          ],
          "wA": [
              "хронического периодонтита",
              "хронического сиаладенита"
          ]
      },
      {
          "qID": 599,
          "qName": "К особым формам лимфаденитов относится …",
          "rA": [
              "аденофлегмона"
          ],
          "wA": [
              "аденолимфома",
              "лимфогранулематоз",
              "лимфома Беркитта"
          ]
      },
      {
          "qID": 600,
          "qName": "Наиболее частое опухолевое поражение шейных лимфоузлов - …",
          "rA": [
              "лимфома Ходжкина (лимфогранулематоз)"
          ],
          "wA": [
              "лимфома Беркитта",
              "фолликулярная В-клеточная лимфома",
              "аденолимфома"
          ]
      }
  ]
};
var test = 0;
var amountTest = 0;
var iterGlobal = 0;
var exit = 0;
var key = [];
var selected = [];
var right = 0;
var wrongAnswers = [];
document.querySelector(".button").addEventListener("click", startQuiz);


var oToday = new Date();

function getDaysLeft(oDeadLineDate, oToday){
  return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
}

function MkDaysLeft(sDeadLineDate, sDeadLineText){
  var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
  var oDeadLineDate = new Date(sTime);
  var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
  if (nDaysLeft){
    var sDaysLeft = String(nDaysLeft);
    var sDaysText = "дней";
    var nDaysLeftLength = sDaysLeft.length;
    if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
      if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
      else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
    }
    var sLeftText = sDaysText == "день" ? "остался" : "осталось";
    return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
  }else return "Хорош учить. Пока ты грызешь гранит науки, мимо тебя проходит жизнь полная радостей и наслаждений. Зачем тебе ПАТАН? Наслаждайся жизнью, выпей чай ";
}
window.onload = function() {
document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
}


function startQuiz() {
	document.querySelector(".status").style.display = "block";
	document.querySelector(".status-timer").style.display = "none";
	document.querySelector(".checkbox-wrapper").style.display = "none";
	var variant = document.querySelector('.select').selectedIndex;
	console.log(variant);
	var varfile;
	switch(variant) {
		case 0:
			varfile = 'pulm.json';
			break;
		case 1:
			varfile = 'ibs.json';
			break;
		case 2:
			varfile = 'gbreum.json';
			break;
		case 3:
			varfile = 'klsn.json';
			break;
		case 4:
			varfile = 'gdcp.json';
			break;
		case 5:
			varfile = 'hep.json';
			break;
		case 6:
			varfile = 'nephr.json';
			break;
	}
	var xhr = new XMLHttpRequest();
	var xhrre;
	xhr.open('GET', varfile, false);
	xhr.send();
	if (xhr.status != 200) {
	  test = tests.tests;
	  alert( 'Нажми для продолжения' ); // пример вывода: 404: Not Found
	} else {
	  xhrre = JSON.parse(xhr.responseText);
	  test = xhrre.tests;
	}
	if (document.querySelector(".checkbox").checked === true) {
	test = shuffle(test);
	}
	amountTest = test.length;
	iterGlobal = 0;
	exit = 0;
	key = [];
	selected = [];
	right = 0;
	wrongAnswers = [];
	document.querySelector(".button").removeEventListener("click", startQuiz);
	newQuestion();
	startTimer();
}
function newQuestion() {
	drawStatus();
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	} // Очищаем предыдущие варианты	
	currentQuestion = test[iterGlobal]; // Текущий вопрос
	key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
	drawQuestion(currentQuestion, key);

	document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
	document.querySelector(".button").addEventListener("click", compare);
	document.querySelector(".button").removeEventListener("click", newQuestion);
	if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');

}
function compare() {
	for (var i= 0; i < key.length; i++) {
		if (key[i] == 1) {
			document.getElementById(i + 1).className += " answers__answer_right";
		}
	}
	if (key.join(";") == selected.join(";")) {
		right++;
	} else {
		wrongAnswers.push(iterGlobal);
	}
	iterGlobal++;
  	if (iterGlobal < amountTest) {
 		document.querySelector(".button").innerHTML = "ДАЛЕЕ";
 		document.querySelector(".button").addEventListener("click", newQuestion);
 		document.querySelector(".button").removeEventListener("click", compare);
	} else {
		document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
 		document.querySelector(".button").addEventListener("click", drawEnd);
  		document.querySelector(".button").addEventListener("click", drawStatus);
 		document.querySelector(".button").removeEventListener("click", compare);
	}
}

function drawStatus() {
	var iter = iterGlobal + 1;
	if (iterGlobal == amountTest) iter = iterGlobal;
	var accuracy = right * 100 / iterGlobal;
	if (right == 0) {
		accuracy = 0;
	}
	var wrong = iterGlobal - right;
	document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
	document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
}


function drawQuestion(currentQuestion, key) {
	document.querySelector('.question__name').innerHTML = currentQuestion.qName;
	rA = shuffle(currentQuestion.rA);
	rAi = 0;
	wA = shuffle(currentQuestion.wA);
	wAi = 0;
	selected = [];
	amountAnswers = rA.length + wA.length;
	for (var i = 0; i < amountAnswers; i++) {
		if (key[i] == 0) {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = wA[wAi];
			wAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
			selected.push(0);
		} else {
			var answer = document.createElement('div');
			answer.className = "answers__answer answers__answer_unselected";
			answer.id = i + 1;
			answer.innerHTML = rA[rAi];
			rAi++;
			document.querySelector('.answers').appendChild(answer);
			document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
			selected.push(0);		
		}
	}
}

function drawEnd() {
	stopTimer();
	while (document.querySelector('.answers').hasChildNodes()) {
    document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}
	document.querySelector(".button").setAttribute('hidden', 'true');
	document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
	document.querySelector(".result").removeAttribute('hidden');
	document.querySelector(".bblock").removeAttribute('hidden');
	document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html"});
	document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
	var accuracy = right * 100 / iterGlobal;
	document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
	if (wrongAnswers.length > 0) {
		document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
	} else {
		document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
	}
}

function reMatch() {
	startTimer();
	var newTest = [];
	for (var i=0; i < wrongAnswers.length; i++) {
		var iTest = wrongAnswers[i];
		newTest.push(test[iTest]);
	}
	test = newTest;
	iterGlobal = 0;
	amountTest = test.length;
	right = 0;
	key = [];
	selected = [];
	wrongAnswers = [];
	document.querySelector(".button").removeAttribute('hidden', 'true');
	document.querySelector(".result").setAttribute('hidden', 'true');
	document.querySelector(".bblock").setAttribute('hidden', 'true');
 	document.querySelector(".button").removeEventListener("click", drawEnd);
 	document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
	newQuestion();
}
function getSelected(elem) {
	selected[elem.target.id - 1] = 1;
	elem.target.className = "answers__answer answers__answer_selected";
	elem.target.removeEventListener("click", getSelected);
	elem.target.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.target.id - 1] = 0;
	elem.target.className = "answers__answer answers__answer_unselected";
	elem.target.removeEventListener("click", getUnSelected);
	elem.target.addEventListener("click", getSelected);
}
var timer;
function startTimer() {
	if (timer) clearInterval(timer);
	secs = 0;
	min = 0;
	document.querySelector('.status__time').innerHTML = min + ":0" + secs;
	timer = setInterval(
		function () {
			secs++;
			if (secs == 60) {
				secs = 0;
				min++;
			}
			if (secs < 10) {
				document.querySelector('.status__time').innerHTML = min + ":0" + secs;
			} else {
				document.querySelector('.status__time').innerHTML = min + ":" + secs;
			}
		},
		1000
	);
}
function stopTimer() {
    if (timer) clearInterval(timer); 	
}
function shuffle(array) {
  var currentIndex = array.length, temporaryValue, randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {

    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}
function getKey(rAL, wAL) {
	arr = [];
	for (rAL; rAL > 0; rAL--) {
		arr.push(1);
	}
	for (wAL; wAL > 0; wAL--) {
		arr.push(0);
	}
	shuffle(arr);
	return(arr);
}
/*
function newQuestion(i) {
	var currentTest = test[i];
	var amountAnswers = currentTest.rA.length + currentTest.wA.length;
	var key = getKey(currentTest.rA.length, currentTest.wA.length);
	var iterKey = 0;
	var iterWA = 0;
	var iterRA = 0;
	var allAnswers = [];
	for (iterKey; iterKey < amountAnswers; iterKey++) {
		if (key[iterKey] == 0) {
			allAnswers.push(currentTest.wA[iterWA]);
			iterWA++;
		} else {
			allAnswers.push(currentTest.rA[iterRA]);
			iterRA++;
		}
	}
	document.querySelector('.question__name').innerHTML = currentTest.qName;
	var amountAnswersIter = amountAnswers;
	var iter = 0;
	while (document.querySelector('.answers').hasChildNodes()) {
    	document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
	}	
	for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
		var answer = document.createElement('div');
		answer.className = "answers__answer answers__answer_unselected";
		answer.id = iter + 1;
		answer.innerHTML = allAnswers[iter];
		document.querySelector('.answers').appendChild(answer);
		document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
		selected.push(0);
		iter++;
	}
	iter = 0;
	function compare(elem) {
		var iter = 0;
		console.log(key);
		for (iter; iter < key.length; iter++) {
			if (key[iter] == 1) {
				console.log(iter);
				document.getElementById(iter + 1).className += " answers__answer_right";
			}
		}
		if (selected == key) right++;
		elem.toElement.removeEventListener("click", compare);
		elem.toElement.addEventListener("click", goToNext);	
		elem.toElement.innerHTML = "ДАЛЕЕ";
	}
	function goToNext(elem) {
	newQuestion(2)
	elem.toElement.removeEventListener("click", goToNext);
	elem.toElement.addEventListener("click", compare);
	elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
	}
	document.querySelector('.button').addEventListener("click", compare);

}
newQuestion(1)
function getSelected(elem) {
	selected[elem.toElement.id - 1] = 1;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_selected";
	elem.toElement.removeEventListener("click", getSelected);
	elem.toElement.addEventListener("click", getUnSelected);
}
function getUnSelected(elem) {
	selected[elem.toElement.id - 1] = 0;
	console.log(selected);
	elem.toElement.className = "answers__answer answers__answer_unselected";
	elem.toElement.removeEventListener("click", getUnSelected);
	elem.toElement.addEventListener("click", getSelected);
}
*/
