var tests = {
    "tests": [
        {
            "qID": 1,
            "qName": "Патологический процесс, в основе которого лежат нарушения тканевого (клеточного) метаболизма, ведущие к структурным изменениям – это …",
            "rA": [
                "дистрофия"
            ],
            "wA": [
                "апоптоз",
                "гипоксия",
                "гиперемия",
                "опухоль"
            ]
        },
        {
            "qID": 2,
            "qName": "К нелетальным повреждениям клеток и тканей относятся …",
            "rA": [
                "дистрофия"
            ],
            "wA": [
                "некроз",
                "апоптоз",
                "гангрена"
            ]
        },
        {
            "qID": 3,
            "qName": "К летальным повреждениям клеток и тканей относятся …",
            "rA": [
                "некроз",
                "апоптоз"
            ],
            "wA": [
                "дистрофия",
                "атрофия"
            ]
        },
        {
            "qID": 4,
            "qName": "В зависимости от локализации выделяют патологические накопления (дистрофии) …",
            "rA": [
                "внутриклеточные (паренхиматозные)",
                "внеклеточные (стромально-сосудистые)"
            ],
            "wA": [
                "минеральные",
                "врожденные"
            ]
        },
        {
            "qID": 5,
            "qName": "Патологические накопления (дистрофии), при которых отложения продуктов нарушенного обмена наблюдаются и в паренхиме, и в строме пораженной ткани, называются …",
            "rA": [
                "смешанными"
            ],
            "wA": [
                "стромально-сосудистыми",
                "паренхиматозными",
                "наследственными"
            ]
        },
        {
            "qID": 6,
            "qName": "По химической природе накапливающихся веществ дистрофии бывают …",
            "rA": [
                "белковые",
                "жировые",
                "углеводные",
                "минеральные"
            ],
            "wA": [
                "гормональные"
            ]
        },
        {
            "qID": 7,
            "qName": "Морфогенетическим механизмами патологических накоплений (дистрофий) являются …",
            "rA": [
                "инфильтрация",
                "декомпозиция",
                "трансформация",
                "извращенный синтез"
            ],
            "wA": [
                "экссудация"
            ]
        },
        {
            "qID": 8,
            "qName": "Избыточное проникновение продуктов обмена из крови и лимфы в клетки и межклеточное вещество с последующим их накоплением – это …",
            "rA": [
                "инфильтрация"
            ],
            "wA": [
                "трансформация",
                "декомпозиция (фанероз)",
                "извращенный синтез"
            ]
        },
        {
            "qID": 9,
            "qName": "Распад ультраструктур клеток и межклеточного вещества – это …",
            "rA": [
                "декомпозиция (фанероз)"
            ],
            "wA": [
                "трансформация",
                "инфильтрация",
                "извращенный синтез"
            ]
        },
        {
            "qID": 10,
            "qName": "Образование несвойственных организму веществ – это …",
            "rA": [
                "извращенный синтез"
            ],
            "wA": [
                "трансформация",
                "декомпозиция (фанероз)",
                "инфильтрация"
            ]
        },
        {
            "qID": 11,
            "qName": "Превращение продуктов одного вида обмена в другой – это …",
            "rA": [
                "трансформация"
            ],
            "wA": [
                "декомпозиция",
                "инфильтрация",
                "извращенный синтез"
            ]
        },
        {
            "qID": 12,
            "qName": "К внутриклеточным накоплениям приводят:",
            "rA": [
                "недостаточное выведение метаболитов",
                "невозможность выведения экзогенных веществ",
                "ускорение образования естественных метаболитов"
            ],
            "wA": [
                "ускоренное выведение экзогенных веществ",
                "ускоренное выделение продуктов метаболизма"
            ]
        },
        {
            "qID": 13,
            "qName": "Вакуоли с жидкостью в цитоплазме клеток появляются при … дистрофии",
            "rA": [
                "гидропической"
            ],
            "wA": [
                "зернистой",
                "гиалиново-капельной",
                "роговой"
            ]
        },
        {
            "qID": 14,
            "qName": "Для \"тигрового\" сердца характерно накопление в цитоплазме кардиомиоцитов …",
            "rA": [
                "жиров"
            ],
            "wA": [
                "белков",
                "солей кальция",
                "липофусцина",
                "углеводов"
            ]
        },
        {
            "qID": 15,
            "qName": "Для макроскопической картины жировой дистрофии миокарда характерны … сердца",
            "rA": [
                "увеличение размеров",
                "на разрезе глинистый вид",
                "расширение полостей"
            ],
            "wA": [
                "плотная консистенция"
            ]
        },
        {
            "qID": 16,
            "qName": "Жировая дистрофия печени чаще развивается по механизму …",
            "rA": [
                "инфильтрации",
                "трансформации"
            ],
            "wA": [
                "декомпозиции",
                "извращённого синтеза"
            ]
        },
        {
            "qID": 17,
            "qName": "К стромально-сосудистым белковым дистрофиям относятся …",
            "rA": [
                "мукоидное набухание",
                "фибриноидное набухание",
                "гиалиноз"
            ],
            "wA": [
                "некроз"
            ]
        },
        {
            "qID": 18,
            "qName": "Гиалиноз является исходом …",
            "rA": [
                "прогрессирующей дезорганизации соединительной ткани"
            ],
            "wA": [
                "жировой дистрофии клеток",
                "колликвационного некроза",
                "жировой инфильтрации стромы"
            ]
        },
        {
            "qID": 19,
            "qName": "Видами внеклеточных (стромально-сосудистых) патологических накоплений являются …",
            "rA": [
                "гиалиноз",
                "амилоидоз"
            ],
            "wA": [
                "гидропическая дистрофия",
                "фанероз"
            ]
        },
        {
            "qID": 20,
            "qName": "Ожирение сердца характеризует …",
            "rA": [
                "ожирение стромы миокарда",
                "ожирение субэпикардиальной клетчатки"
            ],
            "wA": [
                "выявление жира в цитоплазме кардиомиоцитов",
                "«тигровое» сердце"
            ]
        },
        {
            "qID": 21,
            "qName": "При смешанных дистрофиях продукты нарушенного обмена откладываются …",
            "rA": [
                "в паренхиме органов",
                "в строме органов",
                "в стенках сосудов",
                "в капсуле органов"
            ],
            "wA": []
        },
        {
            "qID": 22,
            "qName": "По смешанному типу обычно откладываются …",
            "rA": [
                "пигменты",
                "минералы"
            ],
            "wA": [
                "липиды",
                "углеводы"
            ]
        },
        {
            "qID": 23,
            "qName": "К гемоглобиногенным пигментам относятся …",
            "rA": [
                "гемосидерин",
                "билирубин",
                "солянокислый гематин"
            ],
            "wA": [
                "меланин",
                "липофусцин"
            ]
        },
        {
            "qID": 24,
            "qName": "При гемохроматозе отмечается избыточное накопление в тканях …",
            "rA": [
                "гемосидерина"
            ],
            "wA": [
                "гемомеланина",
                "билирубина",
                "липофусцина",
                "холестерина"
            ]
        },
        {
            "qID": 25,
            "qName": "Гемосидерин придает органам (тканям) … цвет",
            "rA": [
                "бурый"
            ],
            "wA": [
                "черный",
                "желтый",
                "красный",
                "серый"
            ]
        },
        {
            "qID": 26,
            "qName": "К протеиногенным (тирозиногенным) пигментам относятся …",
            "rA": [
                "адренохром",
                "меланин"
            ],
            "wA": [
                "липофусцин",
                "липохром",
                "билирубин"
            ]
        },
        {
            "qID": 27,
            "qName": "Местный гипермеланоз развивается при …",
            "rA": [
                "меланоме",
                "невусе"
            ],
            "wA": [
                "альбинизме",
                "аддисоновой болезни"
            ]
        },
        {
            "qID": 28,
            "qName": "Аддисонова (бронзовая) болезнь – это проявление …",
            "rA": [
                "общего гипермеланоза"
            ],
            "wA": [
                "общего гипомеланоза",
                "местного гипермеланоза",
                "местного гипермеланоза"
            ]
        },
        {
            "qID": 29,
            "qName": "Альбинизм – это проявление …",
            "rA": [
                "общего гипомеланоза"
            ],
            "wA": [
                "общего гипермеланоза",
                "местного гипермеланоза",
                "местного гипермеланоза"
            ]
        },
        {
            "qID": 30,
            "qName": "Видами патологического обызвествления являются …",
            "rA": [
                "дистрофическое",
                "метастатическое"
            ],
            "wA": [
                "некротическое",
                "атрофическое",
                "гипертрофическое"
            ]
        },
        {
            "qID": 31,
            "qName": "Некроз – это …",
            "rA": [
                "гибель клеток в живом организме"
            ],
            "wA": [
                "запрограмированная смерть клеток",
                "накопление продуктов нарушенного обмена веществ",
                "бесконтрольное размножение клеток"
            ]
        },
        {
            "qID": 32,
            "qName": "К изменениям клетки при некрозе относят …",
            "rA": [
                "кариопикноз",
                "кариорексис",
                "кариолизис",
                "плазмокоагуляцию"
            ],
            "wA": [
                "плазматическое пропитывание"
            ]
        },
        {
            "qID": 33,
            "qName": "Главным признаком мертвой клетки является …",
            "rA": [
                "отсутствие ядра"
            ],
            "wA": [
                "наличие в цитоплазме вакуолей с жидкостью",
                "разрушение межклеточных контактов",
                "зернистость цитоплазмы и ядра"
            ]
        },
        {
            "qID": 34,
            "qName": "Морфологическим подтверждением прижизненности некротических изменений является …",
            "rA": [
                "наличие демаркационной воспалительной реакции"
            ],
            "wA": [
                "исчезновение в мертвых клетках ядер",
                "распад цитоплазмы",
                "отложение солей кальция",
                "формирование апоптозных телец"
            ]
        },
        {
            "qID": 35,
            "qName": "Виды некроза в зависимости от причин …",
            "rA": [
                "травматический",
                "сосудистый",
                "аллергический"
            ],
            "wA": [
                "воспалительный",
                "дистрофический"
            ]
        },
        {
            "qID": 36,
            "qName": "Клинико-морфологическими формами некроза являются …",
            "rA": [
                "секвестр",
                "гангрена",
                "инфаркт"
            ],
            "wA": [
                "киста",
                "флегмона"
            ]
        },
        {
            "qID": 37,
            "qName": "Видами сухого некроза являются …",
            "rA": [
                "творожистый",
                "восковидный"
            ],
            "wA": [
                "колликвационный",
                "очаг серого размягчения"
            ]
        },
        {
            "qID": 38,
            "qName": "Типичной локализацией колликвационного некроза является …",
            "rA": [
                "головной мозг"
            ],
            "wA": [
                "сердце",
                "селезенка",
                "почка"
            ]
        },
        {
            "qID": 39,
            "qName": "Некроз тканей, соприкасающихся с внешней средой – это …",
            "rA": [
                "гангрена"
            ],
            "wA": [
                "апоптоз",
                "инфаркт",
                "секвестр"
            ]
        },
        {
            "qID": 40,
            "qName": "Участок мертвой ткани, не подвергающийся аутолизу – это …",
            "rA": [
                "секвестр"
            ],
            "wA": [
                "апоптоз",
                "инфаркт",
                "гангрена",
                "пролежень"
            ]
        },
        {
            "qID": 41,
            "qName": "Инфаркт – это …",
            "rA": [
                "ишемический некроз"
            ],
            "wA": [
                "трофоневротический некроз",
                "травматический некроз",
                "токсический некроз",
                "аллергический некроз"
            ]
        },
        {
            "qID": 42,
            "qName": "Непосредственной причиной инфаркта являются …",
            "rA": [
                "тромбоз сосудов",
                "эмболия сосудов",
                "длительный спазм сосудов"
            ],
            "wA": [
                "артериальная гиперемия",
                "«разъедание» сосудистой стенки"
            ]
        },
        {
            "qID": 43,
            "qName": "По морфологии инфаркт бывает …",
            "rA": [
                "белый (ишемический)",
                "красный (геморрагический)",
                "белый с геморрагическим венчиком"
            ],
            "wA": [
                "красный с ишемическим венчиком"
            ]
        },
        {
            "qID": 44,
            "qName": "Белый (ишемический) инфаркт чаще возникает в …",
            "rA": [
                "головном мозге"
            ],
            "wA": [
                "сердце",
                "почках",
                "легких",
                "кишечнике"
            ]
        },
        {
            "qID": 45,
            "qName": "Красный (геморрагический) инфаркт чаще возникает в …",
            "rA": [
                "легких",
                "кишечнике"
            ],
            "wA": [
                "сердце",
                "головном мозге",
                "почках"
            ]
        },
        {
            "qID": 46,
            "qName": "Белый (ишемический) инфаркт с геморрагическим венчиком чаще возникает в …",
            "rA": [
                "сердце",
                "почках"
            ],
            "wA": [
                "головном мозге",
                "легких",
                "кишечнике"
            ]
        },
        {
            "qID": 47,
            "qName": "Благоприятными исходами некроза являются …",
            "rA": [
                "оссификация",
                "инкапсуляция",
                "петрификация"
            ],
            "wA": [
                "гнойное расплавление"
            ]
        },
        {
            "qID": 48,
            "qName": "Исходом влажного некроза головного мозга может быть …",
            "rA": [
                "киста"
            ],
            "wA": [
                "петрификация",
                "оссификация",
                "рубцевание",
                "инкапсуляция"
            ]
        },
        {
            "qID": 49,
            "qName": "Организация - это исход некроза, характеризующийся …",
            "rA": [
                "замещением соединительной тканью"
            ],
            "wA": [
                "гнойным расплавлением",
                "отложением солей кальция",
                "образованием кисты"
            ]
        },
        {
            "qID": 50,
            "qName": "Апоптоз – это …",
            "rA": [
                "запрограмированная смерть клеток"
            ],
            "wA": [
                "гибель клеток в живом организме",
                "накопление продуктов нарушенного обмена веществ",
                "бесконтрольное размножение клеток"
            ]
        },
        {
            "qID": 51,
            "qName": "К нарушениям кровенаполнения органов (тканей) относятся …",
            "rA": [
                "гиперемия",
                "ишемия"
            ],
            "wA": [
                "тромбоз",
                "диапедез",
                "эмболия"
            ]
        },
        {
            "qID": 52,
            "qName": "Основной причиной артериального полнокровия является …",
            "rA": [
                "усиление притока крови"
            ],
            "wA": [
                "уменьшение притока крови",
                "затруднение оттока крови",
                "увеличение оттока крови",
                "остановка кровотока"
            ]
        },
        {
            "qID": 53,
            "qName": "Основной причиной венозного полнокровия является …",
            "rA": [
                "затруднение оттока крови"
            ],
            "wA": [
                "уменьшение притока крови",
                "усиление притока крови",
                "увеличение оттока крови",
                "остановка кровотока"
            ]
        },
        {
            "qID": 54,
            "qName": "Морфологическим проявлением острого венозного полнокровия в малом круге кровообращения является …",
            "rA": [
                "отек легких"
            ],
            "wA": [
                "бурая индурация легких",
                "анасарка",
                "гидроторакс"
            ]
        },
        {
            "qID": 55,
            "qName": "Фазы отека легких …",
            "rA": [
                "интерстициальная",
                "альвеолярная"
            ],
            "wA": [
                "интермедиарная",
                "паренхиматозная",
                "бронхиальная"
            ]
        },
        {
            "qID": 56,
            "qName": "При хроническом венозном полнокровии внутренние органы …",
            "rA": [
                "имеют плотную консистенцию",
                "увеличены в размерах",
                "имеют синюшный цвет"
            ],
            "wA": [
                "уменьшены в размерах",
                "имеют дряблую консистенцию"
            ]
        },
        {
            "qID": 57,
            "qName": "При хроническом венозном полнокровии легкие становятся … и …",
            "rA": [
                "плотными",
                "бурыми"
            ],
            "wA": [
                "темно-красными",
                "дряблыми"
            ]
        },
        {
            "qID": 58,
            "qName": "Причины изменения цвета и консистенции легких при бурой индурации …",
            "rA": [
                "склероз",
                "гемосидероз"
            ],
            "wA": [
                "амилоидоз",
                "некроз",
                "гипермеланоз"
            ]
        },
        {
            "qID": 59,
            "qName": "Признаками хронического венозного застоя в большом круге кровообращения являются …",
            "rA": [
                "анасарка",
                "асцит",
                "мускатная печень"
            ],
            "wA": [
                "легочная гипертензия",
                "кровохарканье"
            ]
        },
        {
            "qID": 60,
            "qName": "Признаками хронического венозного застоя в малом круге кровообращения являются …",
            "rA": [
                "легочная гипертензия",
                "кровохарканье"
            ],
            "wA": [
                "анасарка",
                "асцит",
                "мускатная печень"
            ]
        },
        {
            "qID": 61,
            "qName": "Образное название вида печени при хроническом венозном полнокровии …",
            "rA": [
                "мускатная"
            ],
            "wA": [
                "сальная",
                "саговая",
                "бурая",
                "глазурная"
            ]
        },
        {
            "qID": 62,
            "qName": "Для мускатной печени характерно …",
            "rA": [
                "полнокровие центральных отделов долек",
                "жировая дистрофия гепатоцитов на периферии долек"
            ],
            "wA": [
                "полнокровие периферических отделов долек",
                "жировая дистрофия гепатоцитов в центре долек"
            ]
        },
        {
            "qID": 63,
            "qName": "Кожные покровы при общем венозном полнокровии …",
            "rA": [
                "синюшные"
            ],
            "wA": [
                "ярко красные",
                "бледные",
                "желтушные"
            ]
        },
        {
            "qID": 64,
            "qName": "Асцит – это …",
            "rA": [
                "скопление отечной жидкости в брюшной полости"
            ],
            "wA": [
                "массивный распространенный отек подкожной клетчатки",
                "скопление отечной жидкости в плевральной полости",
                "скопление отечной жидкости в полости черепа"
            ]
        },
        {
            "qID": 65,
            "qName": "Анасарка – это …",
            "rA": [
                "массивный распространенный отек подкожной клетчатки"
            ],
            "wA": [
                "скопление отечной жидкости в брюшной полости",
                "скопление отечной жидкости в плевральной полости",
                "скопление отечной жидкости в полости черепа"
            ]
        },
        {
            "qID": 66,
            "qName": "Основной причиной местного малокровия (ишемии) является …",
            "rA": [
                "уменьшение притока крови"
            ],
            "wA": [
                "затруднение оттока крови",
                "усиление притока крови",
                "увеличение оттока крови"
            ]
        },
        {
            "qID": 67,
            "qName": "К ишемии могут привести …",
            "rA": [
                "закупорка артерии тромбом или эмболом",
                "длительный спазм сосудов",
                "перераспределение крови"
            ],
            "wA": [
                "усиление коллатерального кровотока"
            ]
        },
        {
            "qID": 68,
            "qName": "Острая ишемия ведет к …",
            "rA": [
                "инфаркту"
            ],
            "wA": [
                "кровотечению",
                "атрофии",
                "эмболии"
            ]
        },
        {
            "qID": 69,
            "qName": "Длительная (хроническая) ишемия ведет к …",
            "rA": [
                "атрофии"
            ],
            "wA": [
                "кровотечению",
                "инфаркту",
                "эмболии"
            ]
        },
        {
            "qID": 70,
            "qName": "Кровотечения по механизму разрыва сосуда характерны для …",
            "rA": [
                "ранения",
                "цереброваскулярных заболеваний"
            ],
            "wA": [
                "авитаминоза С",
                "гемофилии",
                "хронической язвы желудка"
            ]
        },
        {
            "qID": 71,
            "qName": "Кровотечение по механизму разъедания стенки сосуда характерно для …",
            "rA": [
                "хронической язвы желудка",
                "туберкулеза легких"
            ],
            "wA": [
                "авитаминоза С",
                "нарушения свертываемости крови",
                "родовой травмы"
            ]
        },
        {
            "qID": 72,
            "qName": "Диапедезное кровотечение развивается при …",
            "rA": [
                "повышении проницаемости сосудистой стенки"
            ],
            "wA": [
                "огнестрельном ранении",
                "раке легкого",
                "хронической язве желудка"
            ]
        },
        {
            "qID": 73,
            "qName": "Виды кровотечения в зависимости от вида поврежденного сосуда …",
            "rA": [
                "артериальное",
                "капиллярное",
                "венозное"
            ],
            "wA": [
                "аортальное",
                "лимфангиальное"
            ]
        },
        {
            "qID": 74,
            "qName": "Скопление свернувшейся крови в тканях с нарушением их целостности – это …",
            "rA": [
                "гематома"
            ],
            "wA": [
                "геморрагическое пропитывание",
                "экхимоз",
                "петехии"
            ]
        },
        {
            "qID": 75,
            "qName": "Скопление свернувшейся крови в тканях с сохранением их целостности – это …",
            "rA": [
                "геморрагическое пропитывание"
            ],
            "wA": [
                "гематома",
                "мелена",
                "гемоптоэ"
            ]
        },
        {
            "qID": 76,
            "qName": "Макроскопические характеристики тромба – …",
            "rA": [
                "шероховатая поверхность",
                "плотная консистенция"
            ],
            "wA": [
                "эластическая консистенция",
                "блестящая поверхность",
                "отсутствие связи с сосудистой стенкой"
            ]
        },
        {
            "qID": 77,
            "qName": "Макроскопические характеристики посмертного кровяного сгустка – …",
            "rA": [
                "эластическая консистенция",
                "блестящая поверхность",
                "отсутствие связи с сосудистой стенкой"
            ],
            "wA": [
                "шероховатая поверхность",
                "плотная консистенция"
            ]
        },
        {
            "qID": 78,
            "qName": "К местным факторам тромбообразования относятся …",
            "rA": [
                "замедление кровотока",
                "повреждение сосудистой стенки"
            ],
            "wA": [
                "усиление кровотока",
                "повышение сосудистой проницаемости",
                "нарушение свертываемости крови"
            ]
        },
        {
            "qID": 79,
            "qName": "К общим факторам тромбообразования относятся …",
            "rA": [
                "изменение состава крови",
                "нарушение свертываемости крови"
            ],
            "wA": [
                "усиление кровотока",
                "замедление кровотока",
                "повышение сосудистой проницаемости"
            ]
        },
        {
            "qID": 80,
            "qName": "Тромбы по составу делятся на …",
            "rA": [
                "красные",
                "белые",
                "смешанные"
            ],
            "wA": [
                "пристеночные",
                "обтурирующие"
            ]
        },
        {
            "qID": 81,
            "qName": "По отношению к просвету сосуда тромбы делятся на …",
            "rA": [
                "обтурирующие",
                "пристеночные"
            ],
            "wA": [
                "смешанные",
                "внутрисердечные",
                "флотирующие"
            ]
        },
        {
            "qID": 82,
            "qName": "Благоприятными исходами тромбоза являются …",
            "rA": [
                "организация",
                "асептический лизис"
            ],
            "wA": [
                "секвестрация",
                "тромбоэмболия",
                "септический лизис"
            ]
        },
        {
            "qID": 83,
            "qName": "Неблагоприятными исходами тромбоза являются …",
            "rA": [
                "отрыв тромба и тромбоэмболия",
                "септический лизис"
            ],
            "wA": [
                "организация",
                "канализация",
                "асептический лизис"
            ]
        },
        {
            "qID": 84,
            "qName": "Циркуляция в крови (лимфе) не встречающихся в норме частиц и закупорка ими сосудов – это …",
            "rA": [
                "эмболия"
            ],
            "wA": [
                "стаз",
                "тромбоз",
                "плазморрагия"
            ]
        },
        {
            "qID": 85,
            "qName": "Виды эмболии в зависимости от природы эмболов …",
            "rA": [
                "жировая",
                "тканевая"
            ],
            "wA": [
                "гемолитическая",
                "механическая",
                "паренхиматозная"
            ]
        },
        {
            "qID": 86,
            "qName": "Источником тромбоэмболии легочной артерии могут быть тромбы …",
            "rA": [
                "вен нижних конечностей",
                "вен малого таза",
                "ушка правого предсердия"
            ],
            "wA": [
                "воротной вены",
                "легочных вен"
            ]
        },
        {
            "qID": 87,
            "qName": "Причиной внезапной смерти при тромбоэмболии легочной артерии является …",
            "rA": [
                "пульмонокоронарный рефлекс"
            ],
            "wA": [
                "недостаточность коллатерального кровотока",
                "застой крови в большом круге кровообращения",
                "снижение минутного выброса левого желудочка"
            ]
        },
        {
            "qID": 88,
            "qName": "Пульмонокоронарный рефлекс при тромбоэмболии легочной артерии включает в себя …",
            "rA": [
                "спазм мускулатуры мелких бронхов",
                "спазм ветвей легочной артерии",
                "спазм коронарный артерий"
            ],
            "wA": [
                "спазм мускулатуры желудочно-кишечного тракта",
                "спазм легочных вен"
            ]
        },
        {
            "qID": 89,
            "qName": "Фазами воспаления являются …",
            "rA": [
                "пролиферация",
                "экссудация",
                "альтерация"
            ],
            "wA": [
                "транссудация",
                "организация"
            ]
        },
        {
            "qID": 90,
            "qName": "Фаза альтерации характеризуется …",
            "rA": [
                "дистрофией и некрозом тканей",
                "выделением медиаторов воспаления"
            ],
            "wA": [
                "накоплением экссудата",
                "выраженной гиперемией",
                "разрастанием соединительной ткани"
            ]
        },
        {
            "qID": 91,
            "qName": "В фазу экссудации отмечается …",
            "rA": [
                "воспалительная гиперемия",
                "повышение сосудистой проницаемости",
                "диапедез эритроцитов",
                "миграция лейкоцитов"
            ],
            "wA": [
                "размножение клеток гистиогенного и гематогенного происхождения"
            ]
        },
        {
            "qID": 92,
            "qName": "Фаза пролиферации характеризуется …",
            "rA": [
                "размножением клеток в зоне воспаления"
            ],
            "wA": [
                "повреждением ткани",
                "нарушением кровообращения",
                "образованием экссудата"
            ]
        },
        {
            "qID": 93,
            "qName": "Виды острого (экссудативного) воспаления …",
            "rA": [
                "серозное",
                "фибринозное",
                "гнойное"
            ],
            "wA": [
                "гранулематозное",
                "межуточное"
            ]
        },
        {
            "qID": 94,
            "qName": "Характерными особенностями серозного воспаления являются:",
            "rA": [
                "полная регенерация (реституция) в исходе",
                "незначительное количество клеточных элементов в экссудате"
            ],
            "wA": [
                "преобладание фибрина в составе экссудата",
                "неполная регенерация (субституция) в исходе",
                "частое образование свищей"
            ]
        },
        {
            "qID": 95,
            "qName": "Исходом серозного воспаления является …",
            "rA": [
                "рассасывание экссудата"
            ],
            "wA": [
                "цирроз органов",
                "обызвествление",
                "некроз",
                "ослизнение"
            ]
        },
        {
            "qID": 96,
            "qName": "Состав фибринозного экссудата …",
            "rA": [
                "большое количество белка",
                "небольшое количество лейкоцитов"
            ],
            "wA": [
                "большое количество жидкости",
                "небольшое количество белка",
                "большое количество лейкоцитов"
            ]
        },
        {
            "qID": 97,
            "qName": "Основными признаками фибринозного воспаления являются …",
            "rA": [
                "образование плёнки на воспалённой поверхности",
                "преобладание фибрина в экссудате"
            ],
            "wA": [
                "наличие слизи в экссудате",
                "скопление эритроцитов в экссудате",
                "стекание экссудата с воспалённой поверхности"
            ]
        },
        {
            "qID": 98,
            "qName": "Фибринозное воспаление в слизистой оболочке полости рта обычно носит характер …",
            "rA": [
                "дифтеритического"
            ],
            "wA": [
                "флегмонозного",
                "крупозного",
                "геморрагического",
                "гнилостного"
            ]
        },
        {
            "qID": 99,
            "qName": "Фибринозное воспаление в слизистой оболочке гортани и трахеи обычно носит характер …",
            "rA": [
                "крупозного"
            ],
            "wA": [
                "флегмонозного",
                "геморрагического",
                "гнилостного",
                "дифтеритического"
            ]
        },
        {
            "qID": 100,
            "qName": "Образное название сердца при фибринозном перикардите – …",
            "rA": [
                "волосатое"
            ],
            "wA": [
                "тигровое",
                "бычье",
                "мускатное",
                "панцирное"
            ]
        },
        {
            "qID": 101,
            "qName": "Исходами фибринозного перикардита могут быть …",
            "rA": [
                "облитерация полости перикарда",
                "«панцирное» сердце",
                "рассасывание экссудата"
            ],
            "wA": [
                "разрыв стенки сердца",
                "инфаркт миокарда"
            ]
        },
        {
            "qID": 102,
            "qName": "В состав гнойного экссудата входят",
            "rA": [
                "нейтрофилы",
                "белки",
                "продукты распада тканей",
                "плазма и электролиты"
            ],
            "wA": [
                "эритроциты"
            ]
        },
        {
            "qID": 103,
            "qName": "Виды гнойного воспаления …",
            "rA": [
                "абсцесс",
                "флегмона",
                "эмпиема"
            ],
            "wA": [
                "гранулема",
                "гангрена"
            ]
        },
        {
            "qID": 104,
            "qName": "Очаговая форма гнойного воспаления с образованием полости – это …",
            "rA": [
                "абсцесс"
            ],
            "wA": [
                "флегмона",
                "гранулема",
                "эмпиема",
                "гангрена"
            ]
        },
        {
            "qID": 105,
            "qName": "Разлитое гнойное воспаление с диффузным пропитыванием тканей – это …",
            "rA": [
                "флегмона"
            ],
            "wA": [
                "абсцесс",
                "гранулема",
                "эмпиема",
                "гангрена"
            ]
        },
        {
            "qID": 106,
            "qName": "Образование свищей чаще осложняет … воспаление",
            "rA": [
                "гнойное"
            ],
            "wA": [
                "катаральное",
                "фибринозное",
                "интерстициальное"
            ]
        },
        {
            "qID": 107,
            "qName": "Гнойное воспаление характеризуется …",
            "rA": [
                "преобладанием нейтрофилов в экссудате",
                "участками гистолиза"
            ],
            "wA": [
                "образованием кожистоподобной пленки",
                "наличием слизи в экссудате",
                "преобладанием эритроцитов в экссудате"
            ]
        },
        {
            "qID": 108,
            "qName": "Хроническое (продуктивное) воспаление характеризуется …",
            "rA": [
                "прогрессирующим склерозом",
                "атрофией тканевых элементов",
                "размножением клеток гистиогенного и гематогенного происхождения"
            ],
            "wA": [
                "образованием фибринозного экссудата",
                "распадом тканей"
            ]
        },
        {
            "qID": 109,
            "qName": "Виды хронического (продуктивного) воспаления …",
            "rA": [
                "интерстициальное",
                "гранулематозное"
            ],
            "wA": [
                "дифтеритическое",
                "крупозное",
                "серозное"
            ]
        },
        {
            "qID": 110,
            "qName": "К хроническому (продуктивному) воспалению приводят …",
            "rA": [
                "аутоиммунные болезни",
                "персистирующие инфекции",
                "длительное воздействие токсичных веществ"
            ],
            "wA": [
                "артериальная гипертензия",
                "хроническое венозное полнокровие"
            ]
        },
        {
            "qID": 111,
            "qName": "В очаге продуктивного воспаления макрофаги трансформируются в …",
            "rA": [
                "гигантские клетки",
                "эпителиоидные клетки"
            ],
            "wA": [
                "лимфоциты",
                "фибробласты",
                "плазматические клетки"
            ]
        },
        {
            "qID": 112,
            "qName": "Характерные особенности гигантской клетки Пирогова-Лангханса …",
            "rA": [
                "большое количество ядер",
                "ядра располагаются по периферии клетки в виде подковы или кольца",
                "отсутствие первичных лизосом"
            ],
            "wA": [
                "ядра располагаются в центре клетки",
                "активный фагоцитоз"
            ]
        },
        {
            "qID": 113,
            "qName": "Гранулёма – это …",
            "rA": [
                "стойкое скопление способных к фагоцитозу клеток"
            ],
            "wA": [
                "скопление нейтрофильных лейкоцитов",
                "скопление крови",
                "наличие фибринозной плёнки"
            ]
        },
        {
            "qID": 114,
            "qName": "При гранулематозном воспалении преобладающей является … тканевая реакция",
            "rA": [
                "продуктивная"
            ],
            "wA": [
                "экссудативная",
                "альтеративная",
                "катаральная"
            ]
        },
        {
            "qID": 115,
            "qName": "Туберкулезную гранулему характеризуют …",
            "rA": [
                "преобладание эпителиоидных клеток",
                "наличие казеозного некроза",
                "наличие гигантских клеток Пирогова-Лангханса"
            ],
            "wA": [
                "наличие нейтрофильных лейкоцитов",
                "обилие сосудов с явлениями эндоваскулита"
            ]
        },
        {
            "qID": 116,
            "qName": "Туберкулёзную гранулёму формируют …",
            "rA": [
                "эпителиоидные клетки",
                "лимфоциты",
                "гигантские клетки Пирогова-Лангханса"
            ],
            "wA": [
                "лейкоциты",
                "эритроциты"
            ]
        },
        {
            "qID": 117,
            "qName": "Для сифилитической гуммы характерны …",
            "rA": [
                "наличие сосудов",
                "преобладание плазматических клеток",
                "наличие некроза в центре",
                "эндоваскулиты"
            ],
            "wA": [
                "большое количество гигантских клеток Пирогова Лангханса"
            ]
        },
        {
            "qID": 118,
            "qName": "Особенностями гранулем вокруг инородных тел являются …",
            "rA": [
                "продуктивная тканевая реакция",
                "преобладание гигантских клеток инородных тел"
            ],
            "wA": [
                "формирование абсцессов",
                "экссудативная тканевая реакция",
                "преобладание гигантских клеток Пирогова-Лангханса"
            ]
        },
        {
            "qID": 119,
            "qName": "Благоприятными исходами воспаления являются …",
            "rA": [
                "полная регенерация",
                "склероз"
            ],
            "wA": [
                "некроз",
                "генерализация"
            ]
        },
        {
            "qID": 120,
            "qName": "Неблагоприятными исходами воспаления являются …",
            "rA": [
                "хронизация",
                "генерализация"
            ],
            "wA": [
                "полная регенерация",
                "склероз"
            ]
        },
        {
            "qID": 121,
            "qName": "Приспособительные процессы …",
            "rA": [
                "охватывают как здоровье, так и болезнь",
                "направлены на сохранение вида"
            ],
            "wA": [
                "встречаются только при патологии",
                "направлены на «сохранение себя»"
            ]
        },
        {
            "qID": 122,
            "qName": "Приспособление (адаптация) может проявляться …",
            "rA": [
                "атрофией",
                "гипертрофией",
                "организацией"
            ],
            "wA": [
                "дистрофией",
                "некрозом"
            ]
        },
        {
            "qID": 123,
            "qName": "Компенсаторные процессы …",
            "rA": [
                "встречаются только при патологии",
                "направлены на «сохранение себя»"
            ],
            "wA": [
                "охватывают как здоровье, так и болезнь",
                "направлены на сохранение вида"
            ]
        },
        {
            "qID": 124,
            "qName": "Компенсация может проявляться …",
            "rA": [
                "гипертрофией"
            ],
            "wA": [
                "атрофией",
                "дистрофией",
                "некрозом",
                "организацией"
            ]
        },
        {
            "qID": 125,
            "qName": "Фазами развития компенсаторного процесса являются …",
            "rA": [
                "фазы становления",
                "фазы закрепления",
                "фазы истощения"
            ],
            "wA": [
                "фазы репарации"
            ]
        },
        {
            "qID": 126,
            "qName": "Атрофия – это …",
            "rA": [
                "прижизненное уменьшение объема клеток, тканей, органов"
            ],
            "wA": [
                "увеличение объема клеток, тканей, органов",
                "замещение соединительной тканью",
                "переход одного вида ткани в другой, родственный ей вид"
            ]
        },
        {
            "qID": 127,
            "qName": "Проявлениями местной атрофии являются …",
            "rA": [
                "атрофия от давления",
                "нейротическая атрофия",
                "дисфункциональная атрофия"
            ],
            "wA": [
                "алиментарное истощение"
            ]
        },
        {
            "qID": 128,
            "qName": "Внешний вид органа при атрофии …",
            "rA": [
                "размеры обычно уменьшены",
                "цвет бурый",
                "возможно сморщивание"
            ],
            "wA": [
                "размеры резко увеличены"
            ]
        },
        {
            "qID": 129,
            "qName": "Гипертрофия – это …",
            "rA": [
                "увеличение объема клеток, тканей, органов"
            ],
            "wA": [
                "прижизненное уменьшение объема клеток, тканей, органов",
                "замещение соединительной тканью",
                "переход одного вида ткани в другой, родственный ей вид"
            ]
        },
        {
            "qID": 130,
            "qName": "Видами приспособительной (адаптивной) гипертрофии являются …",
            "rA": [
                "гипертрофические разрастания",
                "нейрогуморальная"
            ],
            "wA": [
                "викарная",
                "алиментарная",
                "рабочая"
            ]
        },
        {
            "qID": 131,
            "qName": "Видами компенсаторной гипертрофии являются …",
            "rA": [
                "викарная",
                "рабочая"
            ],
            "wA": [
                "гипертрофические разрастания",
                "нейрогуморальная",
                "алиментарная"
            ]
        },
        {
            "qID": 132,
            "qName": "Примерами компенсаторной гипертрофии являются …",
            "rA": [
                "гипертрофия сердца при пороках клапанов",
                "гипертрофия стенки мочевого пузыря при нодулярной гиперплазии простаты"
            ],
            "wA": [
                "гипертрофия беременной матки",
                "гипертрофия молочных желёз при лактации",
                "гинекомастия"
            ]
        },
        {
            "qID": 133,
            "qName": "Организация – это …",
            "rA": [
                "замещение соединительной тканью"
            ],
            "wA": [
                "прижизненное уменьшение объема клеток, тканей, органов",
                "увеличение объема клеток, тканей, органов",
                "переход одного вида ткани в другой, родственный ей вид"
            ]
        },
        {
            "qID": 134,
            "qName": "Организация является благоприятным исходом …",
            "rA": [
                "тромбоза",
                "некроза"
            ],
            "wA": [
                "патологических накоплений (дистрофий)",
                "амилоидоза"
            ]
        },
        {
            "qID": 135,
            "qName": "Метаплазия – это …",
            "rA": [
                "переход одного вида ткани в другой, родственный ей вид"
            ],
            "wA": [
                "прижизненное уменьшение объема клеток, тканей, органов",
                "увеличение объема клеток, тканей, органов",
                "замещение соединительной тканью"
            ]
        },
        {
            "qID": 136,
            "qName": "Видами регенерации являются …",
            "rA": [
                "репаративная",
                "патологическая",
                "физиологическая"
            ],
            "wA": [
                "старческая",
                "воспалительная"
            ]
        },
        {
            "qID": 137,
            "qName": "Формами регенерации являются …",
            "rA": [
                "клеточная",
                "внутриклеточная"
            ],
            "wA": [
                "органная",
                "викарная",
                "заместительная"
            ]
        },
        {
            "qID": 138,
            "qName": "Проявлениями репаративной регенерации являются …",
            "rA": [
                "возникновение рубца на месте кожной раны",
                "регенерационная гипертрофия миокарда"
            ],
            "wA": [
                "обновление клеточных элементов крови",
                "образование узлов - регенератов при циррозе печени"
            ]
        },
        {
            "qID": 139,
            "qName": "Регенерационная гипертрофия миокарда осуществляется путем …",
            "rA": [
                "гиперплазии внутриклеточных ультраструктур",
                "гиперплазии волокнистых структур стромы",
                "гиперплазии интрамуральных сосудов"
            ],
            "wA": [
                "гиперплазии кардиомиоцитов"
            ]
        },
        {
            "qID": 140,
            "qName": "Основную массу созревающей грануляционной ткани составляют …",
            "rA": [
                "фибробласты",
                "коллагеновые волокна"
            ],
            "wA": [
                "лейкоциты",
                "эритроциты"
            ]
        },
        {
            "qID": 141,
            "qName": "Атипизм опухоли бывает …",
            "rA": [
                "морфологическим",
                "биохимическим",
                "антигенным",
                "функциональным"
            ],
            "wA": [
                "физическим"
            ]
        },
        {
            "qID": 142,
            "qName": "Морфологический атипизм опухоли может быть …",
            "rA": [
                "тканевым",
                "клеточным"
            ],
            "wA": [
                "биохимическим",
                "антигенным",
                "функциональным"
            ]
        },
        {
            "qID": 143,
            "qName": "Тканевой атипизм выражается в …",
            "rA": [
                "нарушении соотношения паренхимы и стромы"
            ],
            "wA": [
                "изменении формы и размеров клеток",
                "гиперхромии ядер",
                "появлении патологических митозов",
                "гипохромии ядер"
            ]
        },
        {
            "qID": 144,
            "qName": "Клеточный атипизм выражается в …",
            "rA": [
                "изменении формы и размеров клеток",
                "гиперхромии ядер",
                "появлении патологических митозов"
            ],
            "wA": [
                "нарушении соотношения паренхимы и стромы",
                "гипохромии ядер"
            ]
        },
        {
            "qID": 145,
            "qName": "Видами роста опухоли по отношению к окружающим тканям являются …",
            "rA": [
                "экспансивный",
                "инвазивный"
            ],
            "wA": [
                "прогрессивный",
                "эндофитный",
                "экзофитный"
            ]
        },
        {
            "qID": 146,
            "qName": "Видами роста опухоли по отношению к просвету полого органа являются …",
            "rA": [
                "эндофитный",
                "экзофитный"
            ],
            "wA": [
                "экспансивный",
                "прогрессивный",
                "инвазивный"
            ]
        },
        {
            "qID": 147,
            "qName": "К признакам экспансивного роста опухоли относятся …",
            "rA": [
                "рост с оттеснением соседних тканей",
                "образование капсулы вокруг узла"
            ],
            "wA": [
                "инфильтрирующий рост",
                "прорастание базальной мембраны",
                "отсутствие четкой границы от неопухолевой ткани"
            ]
        },
        {
            "qID": 148,
            "qName": "Признаками инфильтрирующего роста опухолей являются …",
            "rA": [
                "прорастание опухолью капсулы органов и стенки сосудов",
                "проникновение опухолевых клеток в соседние органы"
            ],
            "wA": [
                "наличие капсулы",
                "четкие границы опухолевой ткани"
            ]
        },
        {
            "qID": 149,
            "qName": "Возможными путями метастазирования злокачественных  опухолей из эпителия являются …",
            "rA": [
                "гематогенный",
                "лимфогенный",
                "имплантационный"
            ],
            "wA": [
                "ликворогенный"
            ]
        },
        {
            "qID": 150,
            "qName": "Доброкачественную опухоль характеризуют …",
            "rA": [
                "высокая дифференцировка опухолевых клеток",
                "экспансивный рост"
            ],
            "wA": [
                "низкая дифференцировка опухолевых клеток",
                "способность к метастазированию",
                "инфильтративный рост"
            ]
        },
        {
            "qID": 151,
            "qName": "Злокачественную опухоль характеризует …",
            "rA": [
                "низкая дифференцировка опухолевых клеток",
                "способность к метастазированию",
                "инфильтративный рост"
            ],
            "wA": [
                "высокая дифференцировка опухолевых клеток",
                "экспансивный рост"
            ]
        },
        {
            "qID": 152,
            "qName": "К вторичным изменениям в опухолях относятся …",
            "rA": [
                "некроз и кровоизлияния",
                "ослизнение",
                "гиалиноз стромы",
                "кальциноз"
            ],
            "wA": [
                "метастазирование"
            ]
        },
        {
            "qID": 153,
            "qName": "Местное влияние опухоли на организм выражается в …",
            "rA": [
                "сдавлении и разрушении окружающих тканей",
                "обтурации полого органа"
            ],
            "wA": [
                "кахексии",
                "паранеопластических синдромах"
            ]
        },
        {
            "qID": 154,
            "qName": "Общее влияние опухоли на организм выражается в …",
            "rA": [
                "кахексии",
                "паранеопластических синдромах"
            ],
            "wA": [
                "сдавлении и разрушении окружающих тканей",
                "обтурации полого органа"
            ]
        },
        {
            "qID": 155,
            "qName": "Для сарком характерно:",
            "rA": [
                "чаще встречаются у детей",
                "метастазируют преимущественно гематогенно"
            ],
            "wA": [
                "чаще встречаются у взрослых",
                "метастазируют преимущественно лимфогенно"
            ]
        },
        {
            "qID": 156,
            "qName": "Для карцином (рака) характерно …",
            "rA": [
                "чаще встречаются у взрослых",
                "метастазируют преимущественно лимфогенно"
            ],
            "wA": [
                "чаще встречаются у детей",
                "метастазируют преимущественно гематогенно"
            ]
        },
        {
            "qID": 157,
            "qName": "К доброкачественным (зрелым) опухолям мезенхимального происхождения относятся …",
            "rA": [
                "остеома",
                "ангиома"
            ],
            "wA": [
                "меланома",
                "карцинома",
                "флегмона"
            ]
        },
        {
            "qID": 158,
            "qName": "К злокачественным (незрелым) опухолям мезенхимального происхождения относятся …",
            "rA": [
                "липосаркома"
            ],
            "wA": [
                "меланома",
                "атерома",
                "аденокарцинома",
                "рабдомиома"
            ]
        },
        {
            "qID": 159,
            "qName": "Злокачественная опухоль костной ткани …",
            "rA": [
                "остеосаркома"
            ],
            "wA": [
                "остеома",
                "хондросаркома",
                "ангиосаркома"
            ]
        },
        {
            "qID": 160,
            "qName": "К злокачественным опухолям соединительнотканного происхождения относятся …",
            "rA": [
                "злокачественная гистиоцитома",
                "фибросаркома"
            ],
            "wA": [
                "фиброма",
                "липосаркома"
            ]
        },
        {
            "qID": 161,
            "qName": "Источником сарком могут быть … ткани",
            "rA": [
                "костная",
                "мышечная",
                "жировая"
            ],
            "wA": [
                "нервная",
                "эпителиальная"
            ]
        },
        {
            "qID": 162,
            "qName": "Саркому характеризует …",
            "rA": [
                "преимущественно гематогенное метастазирование",
                "развитие из ткани мезенхимального происхождения"
            ],
            "wA": [
                "опухолевые клетки формируют железы",
                "возникновение, большей частью, в пожилом и старческом возрасте",
                "развитие из эпителиальной ткани"
            ]
        },
        {
            "qID": 163,
            "qName": "К доброкачественным эпителиальным опухолям относятся …",
            "rA": [
                "аденома",
                "папиллома"
            ],
            "wA": [
                "ангиома",
                "саркома",
                "меланома"
            ]
        },
        {
            "qID": 164,
            "qName": "Папиллома может развиваться из …",
            "rA": [
                "многослойного ороговевающего эпителия",
                "многослойного неороговевающего эпителия",
                "переходного эпителия"
            ],
            "wA": [
                "однослойного эпителия слизистых оболочек",
                "железистой паренхимы органов"
            ]
        },
        {
            "qID": 165,
            "qName": "Папиллома может возникать …",
            "rA": [
                "на коже",
                "в полости рта",
                "в мочевом пузыре"
            ],
            "wA": [
                "в желудке",
                "в печени"
            ]
        },
        {
            "qID": 166,
            "qName": "Микроскопическая характеристика папилломы …",
            "rA": [
                "толщина пласта опухолевой паренхимы неравномерная",
                "сохраняется полярность и комплексность",
                "базальная мембрана целостная",
                "часто наблюдается гиперкератоз"
            ],
            "wA": [
                "базальная мембрана разрушена"
            ]
        },
        {
            "qID": 167,
            "qName": "Аденома может развиваться из …",
            "rA": [
                "однослойного эпителия слизистых оболочек",
                "железистой паренхимы органов"
            ],
            "wA": [
                "многослойного ороговевающего эпителия",
                "многослойного неороговевающего эпителия",
                "переходного эпителия"
            ]
        },
        {
            "qID": 168,
            "qName": "Характерные признаки аденомы …",
            "rA": [
                "развивается из железистого эпителия",
                "тканевой атипизм"
            ],
            "wA": [
                "часто развивается на коже",
                "клеточный атипизм",
                "инвазивный рост"
            ]
        },
        {
            "qID": 169,
            "qName": "Микроскопическая характеристика аденомы …",
            "rA": [
                "построена из многочисленных желез",
                "железы могут иметь различную величину и форму",
                "каждая железа имеет непрерывную базальную мембрану"
            ],
            "wA": [
                "часто встречаются «раковые жемчужины»",
                "выстилка желез образована атипичными полиморфными клетками"
            ]
        },
        {
            "qID": 170,
            "qName": "Термином «рак» (карцинома) обозначают …",
            "rA": [
                "злокачественные эпителиальные опухоли"
            ],
            "wA": [
                "все злокачественные опухоли",
                "все эпителиальные опухоли",
                "доброкачественные эпителиальные опухоли"
            ]
        },
        {
            "qID": 171,
            "qName": "К злокачественным эпителиальным опухолям относятся …",
            "rA": [
                "плоскоклеточный рак",
                "аденокарцинома",
                "слизистый рак"
            ],
            "wA": [
                "остеосаркома",
                "меланома"
            ]
        },
        {
            "qID": 172,
            "qName": "Характерные признаки рака (карциномы) …",
            "rA": [
                "имеет эпителиальное происхождение",
                "первые метастазы лимфогенные",
                "чаще встречается у взрослых"
            ],
            "wA": [
                "имеет мезенхимальное происхождение",
                "первые метастазы гематогенные"
            ]
        },
        {
            "qID": 173,
            "qName": "«Рак на месте» (carcinoma in situ) – это …",
            "rA": [
                "неинвазивный рак"
            ],
            "wA": [
                "инвазивный рак без метастазирования",
                "инвазивный рак с метастазированием в лимфоузлы",
                "инвазивный рак с гематогенными метастазами"
            ]
        },
        {
            "qID": 174,
            "qName": "Плоскоклеточный рак первично может локализоваться в …",
            "rA": [
                "шейке матки",
                "нижней губе",
                "пищеводе",
                "легком"
            ],
            "wA": [
                "печени"
            ]
        },
        {
            "qID": 175,
            "qName": "«Раковые жемчужины» характерны для …",
            "rA": [
                "плоскоклеточного рака"
            ],
            "wA": [
                "аденокарциномы",
                "меланомы",
                "остеосаркомы",
                "переходноклеточного рака"
            ]
        },
        {
            "qID": 176,
            "qName": "Аденокарцинома первично может локализоваться в …",
            "rA": [
                "желудке",
                "легком",
                "толстой кишке",
                "эндометрии"
            ],
            "wA": [
                "миокарде"
            ]
        },
        {
            "qID": 177,
            "qName": "Характерные признаки аденокарциномы …",
            "rA": [
                "развивается из железистого эпителия",
                "инвазивный рост",
                "выраженный тканевой атипизм",
                "выраженный клеточный атипизм"
            ],
            "wA": [
                "экспансивный рост"
            ]
        },
        {
            "qID": 178,
            "qName": "Первые метастазы рака локализуются в …",
            "rA": [
                "регионарных лимфоузлах"
            ],
            "wA": [
                "легких",
                "костях",
                "головном мозге",
                "печени"
            ]
        },
        {
            "qID": 179,
            "qName": "Гистогенез недифференцированных опухолей помогает установить …",
            "rA": [
                "иммуногистохимическое исследование"
            ],
            "wA": [
                "электронная микроскопия",
                "морфометрия",
                "цитологическое исследование",
                "биохимическое исследование"
            ]
        },
        {
            "qID": 180,
            "qName": "Зрелыми (доброкачественными) опухолями головного мозга являются …",
            "rA": [
                "астроцитома",
                "эпендимома"
            ],
            "wA": [
                "глиобластома",
                "невринома",
                "медуллобластома"
            ]
        },
        {
            "qID": 181,
            "qName": "Особенности опухолей ЦНС …",
            "rA": [
                "метастазируют обычно в пределах ЦНС по току ликвора",
                "головной мозг поражается чаще, чем спинной",
                "клинически всегда протекают злокачественно"
            ],
            "wA": [
                "встречаются исключительно у детей",
                "всегда имеют зрелое (дифференцированное) строение"
            ]
        },
        {
            "qID": 182,
            "qName": "Характерные признаки глиобластомы …",
            "rA": [
                "выраженный полиморфизм клеток и ядер",
                "пестрый вид на разрезе",
                "имеет глиальное происхождение"
            ],
            "wA": [
                "всегда связана с мозговыми оболочками",
                "не метастазирует"
            ]
        },
        {
            "qID": 183,
            "qName": "Характерные признаки менингиомы …",
            "rA": [
                "всегда имеет связь с мозговой оболочкой",
                "не метастазирует",
                "экспансивный рост"
            ],
            "wA": [
                "локализуется в белом веществе головного мозга",
                "выраженный тканевой и клеточный атипизм"
            ]
        },
        {
            "qID": 184,
            "qName": "Характерные признаки невриномы (шванномы) …",
            "rA": [
                "растет из оболочек нервов",
                "тканевой атипизм"
            ],
            "wA": [
                "растет непосредственно из нервного волокна",
                "инвазивный рост",
                "клеточный атипизм"
            ]
        },
        {
            "qID": 185,
            "qName": "К разновидностям невусов относятся …",
            "rA": [
                "пограничный",
                "внутридермальный",
                "сложный"
            ],
            "wA": [
                "простой",
                "составной"
            ]
        },
        {
            "qID": 186,
            "qName": "Меланома первично может локализоваться в …",
            "rA": [
                "коже",
                "глазном яблоке",
                "надпочечнике"
            ],
            "wA": [
                "щитовидной железе",
                "гипофизе"
            ]
        },
        {
            "qID": 187,
            "qName": "Характерные признаки меланомы …",
            "rA": [
                "инвазивный (инфильтрирующий) рост",
                "может возникать в результате малигнизации невуса",
                "выраженный клеточный полиморфизм"
            ],
            "wA": [
                "экспансивный рост",
                "может возникать в результате малигнизации папилломы"
            ]
        },
        {
            "qID": 188,
            "qName": "Анемия может проявляться … в крови",
            "rA": [
                "снижением концентрации гемоглобина",
                "снижением количества эритроцитов",
                "повышением цветового показателя",
                "снижением цветового показателя"
            ],
            "wA": [
                "появлением бластных клеток"
            ]
        },
        {
            "qID": 189,
            "qName": "Этиологическими факторами анемии могут быть …",
            "rA": [
                "кровопотеря",
                "эритропоэтическая гипофункция костного мозга",
                "повышенное кроверазрушение (гемолиз)"
            ],
            "wA": [
                "эритропоэтическая гиперфункция костного мозга"
            ]
        },
        {
            "qID": 190,
            "qName": "Для железодефицитной анемии характерны … эритроцитов",
            "rA": [
                "гипохромия",
                "микроцитоз"
            ],
            "wA": [
                "гиперхромия",
                "макроцитоз"
            ]
        },
        {
            "qID": 191,
            "qName": "Для В12-дефицитной (пернициозной) анемии характерно развитие …",
            "rA": [
                "атрофического гастрита",
                "гунтеровского глоссита",
                "фуникулярного миелоза"
            ],
            "wA": [
                "пневмосклероза",
                "гидронефроза"
            ]
        },
        {
            "qID": 192,
            "qName": "Общим проявлением хронических анемий могут являться …",
            "rA": [
                "гиперплазия костного мозга",
                "ретикулоцитоз периферической крови",
                "патологические включения в эритроцитах",
                "дистрофические изменения внутренних органов"
            ],
            "wA": [
                "появление бластных клеток в периферической крови"
            ]
        },
        {
            "qID": 193,
            "qName": "Причинами наследственных гемолитических анемий могут быть …",
            "rA": [
                "мембранопатии",
                "ферментопатии",
                "гемоглобинопатии"
            ],
            "wA": [
                "бластопатии"
            ]
        },
        {
            "qID": 194,
            "qName": "К опухолевым заболеваниям гемопоэтической ткани относятся …",
            "rA": [
                "лейкозы",
                "лимфомы"
            ],
            "wA": [
                "апластические синдромы",
                "гемангиомы",
                "лейкемоидные реакции"
            ]
        },
        {
            "qID": 195,
            "qName": "Для лейкозов характерно …",
            "rA": [
                "первичное поражение костного мозга",
                "первично системный характер поражения"
            ],
            "wA": [
                "первичное поражение внекостномозговой ткани",
                "первично очаговый характер поражения"
            ]
        },
        {
            "qID": 196,
            "qName": "Для лимфом характерно …",
            "rA": [
                "первичное поражение внекостномозговой ткани",
                "первично очаговый характер поражения"
            ],
            "wA": [
                "первичное поражение костного мозга",
                "первично системный характер поражения"
            ]
        },
        {
            "qID": 197,
            "qName": "Лейкозы по степени зрелости лейкозных клеток делятся на …",
            "rA": [
                "острые",
                "хронические"
            ],
            "wA": [
                "подострые",
                "моноклоновые",
                "поликлоновые"
            ]
        },
        {
            "qID": 198,
            "qName": "Общими проявлениями острых лейкозов являются …",
            "rA": [
                "бластоз периферической крови и костного мозга",
                "гипопластическая анемия",
                "лейкопения"
            ],
            "wA": [
                "тромбоцитоз",
                "ретикулоцитоз"
            ]
        },
        {
            "qID": 199,
            "qName": "Признаками недифференцированного лейкоза являются …",
            "rA": [
                "клетки в пунктатах костного мозга не поддаются морфологической идентификации",
                "некротический гингивит и тонзиллит",
                "геморрагический диатез",
                "сепсис"
            ],
            "wA": [
                "лейкемические инфильтраты состоят из клеток миелоцитов"
            ]
        },
        {
            "qID": 200,
            "qName": "При остром миелобластном лейкозе в органах кроветворения разрастаются …",
            "rA": [
                "миелобласты"
            ],
            "wA": [
                "миеломные клетки",
                "миелоциты",
                "плазмобласты",
                "эритробласты"
            ]
        },
        {
            "qID": 201,
            "qName": "Причинами смерти больных острыми лейкозами могут стать …",
            "rA": [
                "бластный криз",
                "инфекционно-некротические осложнения",
                "геморрагический синдром"
            ],
            "wA": [
                "тромбоэмболический синдром",
                "кишечная непроходимость"
            ]
        },
        {
            "qID": 202,
            "qName": "К основным проявлениям хронических лейкозов относятся …",
            "rA": [
                "лейкозная инфильтрация костного мозга",
                "лейкемические инфильтраты в почках",
                "спленомегалия",
                "гепатомегалия"
            ],
            "wA": [
                "инфаркты головного мозга"
            ]
        },
        {
            "qID": 203,
            "qName": "К хроническим миелоцитарным лейкозам относится …",
            "rA": [
                "хронический гранулоцитарный лейкоз"
            ],
            "wA": [
                "хронический лимфолейкоз",
                "миеломная болезнь",
                "болезнь Ходжкина"
            ]
        },
        {
            "qID": 204,
            "qName": "Хронический миелолейкоз сопровождается …",
            "rA": [
                "вторичным иммунодефицитом",
                "геморрагическим синдромом",
                "вытеснением нормальных гемопоэтических элементов",
                "первичным поражением костного мозга"
            ],
            "wA": [
                "первичным поражением лимфатических узлов"
            ]
        },
        {
            "qID": 205,
            "qName": "Для хронического лимфолейкоза в период ремиссии характерно …",
            "rA": [
                "инфильтраты во внутренних органах из лимфоцитов",
                "увеличение лимфоузлов",
                "увеличение количества лимфоцитов в периферической крови",
                "увеличение селезенки, печени"
            ],
            "wA": [
                "пиоидный костный мозг"
            ]
        },
        {
            "qID": 206,
            "qName": "К хроническим лимфоцитарным лейкозам относятся …",
            "rA": [
                "хронический лимфолейкоз",
                "миеломная болезнь"
            ],
            "wA": [
                "хронический миелолейкоз",
                "болезнь Ходжкина"
            ]
        },
        {
            "qID": 207,
            "qName": "К осложнениям лейкозов относятся …",
            "rA": [
                "сепсис",
                "пневмония",
                "некротическая ангина",
                "кровоизлияние в головной мозг"
            ],
            "wA": [
                "гломерулонефрит"
            ]
        },
        {
            "qID": 208,
            "qName": "К лимфомам относится …",
            "rA": [
                "лимфогранулематоз",
                "грибовидный микоз"
            ],
            "wA": [
                "миелобластный лейкоз",
                "миеломная болезнь"
            ]
        },
        {
            "qID": 209,
            "qName": "Клинико-морфологическими формами болезни Ходжкина являются …",
            "rA": [
                "лимфоидное преобладание",
                "лимфоидное истощение",
                "смешанно-клеточный вариант",
                "нодулярный склероз"
            ],
            "wA": [
                "нодулярная гиперплазия"
            ]
        },
        {
            "qID": 210,
            "qName": "При болезни Ходжкина в лимфатических узлах появляются клетки …",
            "rA": [
                "Рид-Березовского-Штернберга",
                "Ходжкина"
            ],
            "wA": [
                "Гумпрехта",
                "Пирогова-Лангханса"
            ]
        },
        {
            "qID": 211,
            "qName": "При болезни Ходжкина происходит …",
            "rA": [
                "стирание структуры лимфоузла",
                "пролиферация опухолевых В-лимфоцитов",
                "пролиферация лимфоцитов и соединительной ткани"
            ],
            "wA": [
                "пролиферация опухолевых Т-лимфоцитов",
                "увеличение числа лимфоидных фолликулов"
            ]
        },
        {
            "qID": 212,
            "qName": "К факторам риска развития атеросклероза относятся …",
            "rA": [
                "артериальная гипертензия",
                "сахарный диабет",
                "курение",
                "увеличение содержания ЛПНП в крови"
            ],
            "wA": [
                "увеличение содержания ЛПВП в крови"
            ]
        },
        {
            "qID": 213,
            "qName": "Атеросклероз преимущественно поражает …",
            "rA": [
                "артерии эластического типа",
                "артерии мышечно-эластического типа"
            ],
            "wA": [
                "артерии мышечного типа",
                "артериолы",
                "венулы"
            ]
        },
        {
            "qID": 214,
            "qName": "Наиболее выраженные изменения при атеросклерозе аорты отмечаются в ее …",
            "rA": [
                "брюшном отделе"
            ],
            "wA": [
                "дуге",
                "восходящей части",
                "грудном отделе"
            ]
        },
        {
            "qID": 215,
            "qName": "К макроскопическим стадиям атеросклероза относятся …",
            "rA": [
                "жировые пятна и полоски",
                "фиброзные бляшки",
                "осложнённые поражения (изъязвления, тромбоз, кровоизлияния)"
            ],
            "wA": [
                "мезаортит",
                "доклинические изменения"
            ]
        },
        {
            "qID": 216,
            "qName": "К микроскопическим стадиям атеросклероза относятся …",
            "rA": [
                "липоидоз",
                "липосклероз",
                "атероматоз"
            ],
            "wA": [
                "гиалиноз",
                "липоматоз"
            ]
        },
        {
            "qID": 217,
            "qName": "Стадии атеросклероза, сопровождающиеся сужением просвета артерии …",
            "rA": [
                "липосклероз",
                "атероматоз",
                "кальциноз"
            ],
            "wA": [
                "долипидная",
                "липоидоз"
            ]
        },
        {
            "qID": 218,
            "qName": "К клинико-морфологическим формам атеросклероза относятся …",
            "rA": [
                "атеросклероз аорты",
                "атеросклероз почечных артерий",
                "атеросклероз артерий нижних конечностей",
                "атеросклероз коронарных артерий"
            ],
            "wA": [
                "атеросклероз печеночной артерии"
            ]
        },
        {
            "qID": 219,
            "qName": "При артериальной гипертензии уровень артериального давления …",
            "rA": [
                "140/90 мм рт.ст. и более"
            ],
            "wA": [
                "120/80 мм рт.ст. и более",
                "130/90 мм рт.ст. и более",
                "150/100 мм рт.ст. и более",
                "160/100 мм рт.ст. и более"
            ]
        },
        {
            "qID": 220,
            "qName": "Видами гипертонической болезни, в зависимости от характера течения являются …",
            "rA": [
                "доброкачественная",
                "злокачественная"
            ],
            "wA": [
                "мозговая",
                "сердечная"
            ]
        },
        {
            "qID": 221,
            "qName": "Клинико-морфологическими формами гипертонической болезни являются …",
            "rA": [
                "почечная",
                "мозговая",
                "сердечная"
            ],
            "wA": [
                "брыжеечная",
                "печеночная"
            ]
        },
        {
            "qID": 222,
            "qName": "О гипертрофии сердца взрослого человека говорят, когда его масса превышает …",
            "rA": [
                "350 г"
            ],
            "wA": [
                "100 г",
                "200 г",
                "600 г",
                "750 г"
            ]
        },
        {
            "qID": 223,
            "qName": "О гипертрофии левого желудочка сердца взрослого человека говорят, когда толщина его стенки превышает ...",
            "rA": [
                "1,2 см"
            ],
            "wA": [
                "0,3 см",
                "0,5 см",
                "2,0 см",
                "1,8 см"
            ]
        },
        {
            "qID": 224,
            "qName": "Основные изменения при гипертонической болезни возникают в …",
            "rA": [
                "артериолах"
            ],
            "wA": [
                "аорте",
                "крупных магистральных артериях",
                "венулах",
                "крупных венах"
            ]
        },
        {
            "qID": 225,
            "qName": "В стенках артериол при гипертонической болезни возникает …",
            "rA": [
                "гиалиноз",
                "плазматическое пропитывание",
                "фибриноидный некроз"
            ],
            "wA": [
                "амилоидоз"
            ]
        },
        {
            "qID": 226,
            "qName": "При гипертонической болезни в почках развивается …",
            "rA": [
                "первичное сморщивание"
            ],
            "wA": [
                "вторичное сморщивание",
                "гидронефроз",
                "амилоидоз",
                "некротический нефроз"
            ]
        },
        {
            "qID": 227,
            "qName": "Формами острой ишемической болезни сердца являются …",
            "rA": [
                "инфаркт миокарда",
                "внезапная коронарная смерть"
            ],
            "wA": [
                "кардиосклероз",
                "жировая дистрофия миокарда",
                "ожирение миокарда"
            ]
        },
        {
            "qID": 228,
            "qName": "Непосредственные причины инфаркта миокарда …",
            "rA": [
                "тромбоз коронарных артерий",
                "тромбоэмболия коронарных артерий",
                "длительный спазм коронарных артерий",
                "функциональное перенапряжение миокарда"
            ],
            "wA": [
                "избыточное развитие коллатералей"
            ]
        },
        {
            "qID": 229,
            "qName": "Макроскопически в миокарде обычно формируется …",
            "rA": [
                "белый инфаркт с геморрагическим венчиком"
            ],
            "wA": [
                "белый инфаркт",
                "красный инфаркт",
                "гангрена",
                "секвестр"
            ]
        },
        {
            "qID": 230,
            "qName": "Микроскопическими признаками инфаркта миокарда являются …",
            "rA": [
                "плазмокоагуляция",
                "кариопикноз, кариорексис"
            ],
            "wA": [
                "жировая дистрофия",
                "мукоидное набухание",
                "вакуолизация цитоплазмы"
            ]
        },
        {
            "qID": 231,
            "qName": "Морфологические признаки некроза появляются в миокарде спустя … от начала острой ишемии",
            "rA": [
                "18 часов"
            ],
            "wA": [
                "1 час",
                "6 часов",
                "12 часов",
                "48 часов"
            ]
        },
        {
            "qID": 232,
            "qName": "К осложнениям инфаркта миокарда относятся …",
            "rA": [
                "нарушения ритма",
                "разрыв сердца",
                "тромбоэмболический синдром"
            ],
            "wA": [
                "пневмосклероз",
                "гидронефроз"
            ]
        },
        {
            "qID": 233,
            "qName": "Повторным называется инфаркт миокарда, формирующийся … после предыдущего",
            "rA": [
                "спустя 28 дней и более"
            ],
            "wA": [
                "спустя 7 дней и более",
                "спустя 14 дней и более",
                "спустя 6 месяцев и более",
                "спустя 1 год и более"
            ]
        },
        {
            "qID": 234,
            "qName": "К хроническим формам ишемической болезни сердца относятся …",
            "rA": [
                "мелкоочаговый кардиосклероз",
                "крупноочаговый кардиосклероз"
            ],
            "wA": [
                "инфаркт миокарда",
                "гипертрофия миокарда",
                "пороки сердца"
            ]
        },
        {
            "qID": 235,
            "qName": "К цереброваскулярным заболеваниям относятся …",
            "rA": [
                "инфаркт головного мозга",
                "внутримозговые кровоизлияния",
                "субарахноидальные кровоизлияния"
            ],
            "wA": [
                "гидроцефалия",
                "энцефаломиелит"
            ]
        },
        {
            "qID": 236,
            "qName": "Причиной развития инфаркта головного мозга может быть стенозирующий атеросклероз … артерий",
            "rA": [
                "внутрицеребральных",
                "позвоночных",
                "внутренних сонных"
            ],
            "wA": [
                "наружных сонных"
            ]
        },
        {
            "qID": 237,
            "qName": "Осложнениями инфаркта головного мозга являются …",
            "rA": [
                "гипостатическая пневмония",
                "отёк мозга",
                "дислокация мозговых структур"
            ],
            "wA": [
                "тромбоэмболия лёгочной артерии",
                "инфаркт миокарда"
            ]
        },
        {
            "qID": 238,
            "qName": "Возможными причинами смерти больных с инфарктом головного мозга могут быть …",
            "rA": [
                "отек мозга",
                "дислокация мозговых структур"
            ],
            "wA": [
                "прорыв крови в желудочки мозга",
                "гнойный менингоэнцефалит"
            ]
        },
        {
            "qID": 239,
            "qName": "Возможным исходом крупного инфаркта головного мозга может быть …",
            "rA": [
                "киста"
            ],
            "wA": [
                "рубцевание",
                "полное рассасывание",
                "обызвествление"
            ]
        },
        {
            "qID": 240,
            "qName": "Осложнениями гематомы головного мозга могут быть …",
            "rA": [
                "прорыв крови в желудочки мозга",
                "гипостатическая пневмония",
                "отёк и дислокация мозга"
            ],
            "wA": [
                "геморрагический шок",
                "ДВС-синдром"
            ]
        },
        {
            "qID": 241,
            "qName": "Общие признаки для всех ревматических болезней …",
            "rA": [
                "системная прогрессирующая дезорганизация соединительной ткани",
                "иммунопатологические процессы",
                "хроническое волнообразное течение"
            ],
            "wA": [
                "обязательное поражение сердца",
                "обязательное поражение суставов"
            ]
        },
        {
            "qID": 242,
            "qName": "Этапы дезорганизации соединительной ткани при ревматизме …",
            "rA": [
                "гиалиноз",
                "мукоидное набухание",
                "фибриноидное набухание"
            ],
            "wA": [
                "амилоидоз",
                "гнойная инфильтрация"
            ]
        },
        {
            "qID": 243,
            "qName": "Мукоидное набухание характеризуется …",
            "rA": [
                "накоплением гликозаминогликанов в основном веществе соединительной ткани",
                "повышением сосудистой проницаемости",
                "набуханием волокон соединительной ткани"
            ],
            "wA": [
                "набуханием клеток соединительной ткани",
                "пропитыванием соединительной ткани фибрином"
            ]
        },
        {
            "qID": 244,
            "qName": "Для фибриноидного набухания характерно …",
            "rA": [
                "деструкция коллагеновых волокон и протеогликанов основного вещества",
                "значительное повышение сосудистой проницаемости",
                "исходом является гиалиноз"
            ],
            "wA": [
                "поверхностная, обратимая стадия дезорганизации соединительной ткани",
                "обязательно сопровождается некрозом"
            ]
        },
        {
            "qID": 245,
            "qName": "Для гиалиноза характерно …",
            "rA": [
                "накопление в ткани полупрозрачных плотных масс, напоминающих гиалиновый хрящ",
                "может возникать в стенках сосудов"
            ],
            "wA": [
                "поверхностная, обратимая стадия дезорганизации соединительной ткани",
                "обширный некроз соединительной ткани",
                "исходом является амилоидоз"
            ]
        },
        {
            "qID": 246,
            "qName": "К клинико-морфологическим формам ревматизма относятся …",
            "rA": [
                "церебральная",
                "полиартритическая",
                "нодозная",
                "кардиоваскулярная"
            ],
            "wA": [
                "почечная"
            ]
        },
        {
            "qID": 247,
            "qName": "Эндокардит при ревматизме может встречаться в форме …",
            "rA": [
                "диффузного вальвулита",
                "возвратно-бородавчатого"
            ],
            "wA": [
                "полипозно-язвенного",
                "острого язвенного",
                "кальцифицирующего"
            ]
        },
        {
            "qID": 248,
            "qName": "При первой атаке ревматизма эндокардит может носить характер …",
            "rA": [
                "острого диффузного",
                "острого бородавчатого"
            ],
            "wA": [
                "фибропластического",
                "возвратно-бородавчатого"
            ]
        },
        {
            "qID": 249,
            "qName": "При ремиссии ревматизма эндокардит может носить характер …",
            "rA": [
                "фибропластического"
            ],
            "wA": [
                "острого диффузного",
                "острого бородавчатого",
                "возвратно-бородавчатого"
            ]
        },
        {
            "qID": 250,
            "qName": "При повторных атаках ревматизма эндокардит может носить характер …",
            "rA": [
                "возвратно-бородавчатого"
            ],
            "wA": [
                "острого диффузного",
                "острого бородавчатого",
                "фибропластического"
            ]
        },
        {
            "qID": 251,
            "qName": "Тромбоэмболический синдром может осложнять течение … при ревматизме",
            "rA": [
                "острого бородавчатого эндокардита",
                "возвратно-бородавчатого эндокардита"
            ],
            "wA": [
                "острого диффузного эндокардита",
                "фибропластического эндокардита"
            ]
        },
        {
            "qID": 252,
            "qName": "Исходом ревматического эндокардита может быть …",
            "rA": [
                "недостаточность клапана",
                "стеноз клапанного отверстия"
            ],
            "wA": [
                "фибриноидный некроз",
                "мукоидное набухание",
                "кардиосклероз"
            ]
        },
        {
            "qID": 253,
            "qName": "Миокардит при ревматизме может встречаться в форме …",
            "rA": [
                "узелкового продуктивного (гранулематозного)",
                "диффузного межуточного экссудативного",
                "очагового межуточного экссудативного"
            ],
            "wA": [
                "возвратно-бородавчатого",
                "фибропластического"
            ]
        },
        {
            "qID": 254,
            "qName": "В состав ревматической гранулемы входят …",
            "rA": [
                "клетки Аничкова",
                "фибробласты",
                "лимфоциты"
            ],
            "wA": [
                "нейтрофильные лейкоциты",
                "клетки Пирогова-Лангханса"
            ]
        },
        {
            "qID": 255,
            "qName": "Исходом ревматического миокардита является…",
            "rA": [
                "мелкоочаговый кардиосклероз"
            ],
            "wA": [
                "порок сердца",
                "бурая атрофия сердца",
                "ожирение сердца",
                "крупноочаговый кардиосклероз"
            ]
        },
        {
            "qID": 256,
            "qName": "Перикардит при ревматизме может встречаться в форме …",
            "rA": [
                "серозного",
                "серозно-фибринозного",
                "фибринозного"
            ],
            "wA": [
                "фибринозно-гнойного",
                "геморрагического"
            ]
        },
        {
            "qID": 257,
            "qName": "«Волосатое сердце» формируется при …",
            "rA": [
                "фибринозном перикардите"
            ],
            "wA": [
                "возвратно-бородавчатом эндокардите",
                "гранулематозном миокардите",
                "диффузном вальвулите"
            ]
        },
        {
            "qID": 258,
            "qName": "Исходом ревматического перикардита может быть …",
            "rA": [
                "облитерация полости перикарда",
                "«панцирное сердце»"
            ],
            "wA": [
                "недостаточность митрального клапана",
                "диффузный кардиосклероз",
                "ожирение сердца"
            ]
        },
        {
            "qID": 259,
            "qName": "Сочетанное ревматическое поражение эндокарда и миокарда носит название …",
            "rA": [
                "ревмокардит"
            ],
            "wA": [
                "перикардит",
                "миокардит",
                "панкардит",
                "эндокардит"
            ]
        },
        {
            "qID": 260,
            "qName": "Сочетанное ревматическое поражение всех оболочек сердца носит название …",
            "rA": [
                "панкардит"
            ],
            "wA": [
                "перикардит",
                "ревмокардит",
                "миокардит",
                "эндокардит"
            ]
        },
        {
            "qID": 261,
            "qName": "К приобретенным порокам сердца относятся …",
            "rA": [
                "митральный стеноз",
                "аортальная недостаточность",
                "стеноз трехстворчатого клапана"
            ],
            "wA": [
                "тетрада Фалло",
                "дефект межжелудочковой перегородки"
            ]
        },
        {
            "qID": 262,
            "qName": "При одновременном развитии стеноза и недостаточности клапана порок называют …",
            "rA": [
                "комбинированным"
            ],
            "wA": [
                "сочетанным",
                "сложным",
                "комплексным",
                "изолированным"
            ]
        },
        {
            "qID": 263,
            "qName": "При одновременном поражении двух и более клапанов порок называют …",
            "rA": [
                "сочетанным"
            ],
            "wA": [
                "комбинированным",
                "сложным",
                "комплексным",
                "изолированным"
            ]
        },
        {
            "qID": 264,
            "qName": "При компенсированном пороке сердца наблюдается …",
            "rA": [
                "концентрическая гипертрофия миокарда"
            ],
            "wA": [
                "ожирение сердца",
                "жировая дистрофия миокарда",
                "диффузный кардиосклероз",
                "дилатация полостей сердца"
            ]
        },
        {
            "qID": 265,
            "qName": "При декомпенсированном пороке сердца наблюдается …",
            "rA": [
                "жировая дистрофия миокарда",
                "диффузный кардиосклероз",
                "дилатация полостей сердца"
            ],
            "wA": [
                "концентрическая гипертрофия миокарда",
                "ожирение сердца"
            ]
        },
        {
            "qID": 266,
            "qName": "Характерные изменения почек при системной красной волчанке (СКВ) …",
            "rA": [
                "гломерулонефрит",
                "феномен «проволочных петель» в капиллярах клубочка"
            ],
            "wA": [
                "межуточный экссудативный нефрит",
                "некротический нефроз",
                "гидронефроз"
            ]
        },
        {
            "qID": 267,
            "qName": "Важные особенности крупозной пневмонии …",
            "rA": [
                "долевой характер поражения",
                "экссудат носит фибринозный характер",
                "обязательно сопровождается плевритом"
            ],
            "wA": [
                "очаговый характер поражения",
                "обязательно сопровождается бронхитом (бронхиолитом)"
            ]
        },
        {
            "qID": 268,
            "qName": "Стадиями крупозной пневмонии являются ...",
            "rA": [
                "стадия прилива",
                "стадия красного опеченения",
                "стадия разрешения"
            ],
            "wA": [
                "стадия абсцедирования",
                "стадия карнификации"
            ]
        },
        {
            "qID": 269,
            "qName": "Основными возбудителями крупозной пневмонии являются …",
            "rA": [
                "пневмококки"
            ],
            "wA": [
                "протеи",
                "аденовирусы",
                "микобактерии",
                "стафилококки"
            ]
        },
        {
            "qID": 270,
            "qName": "Резкая гиперемия и «микробный отек» пораженной доли легкого при крупозной пневмонии характерен для стадии …",
            "rA": [
                "прилива"
            ],
            "wA": [
                "красного опеченения",
                "серого опеченения",
                "разрешения"
            ]
        },
        {
            "qID": 271,
            "qName": "Заполнение альвеол фибринозным экссудатом и большим количеством эритроцитов при крупозной пневмонии характерно для стадии …",
            "rA": [
                "красного опеченения"
            ],
            "wA": [
                "прилива",
                "серого опеченения",
                "разрешения"
            ]
        },
        {
            "qID": 272,
            "qName": "Накопление в альвеолах фибрина и лейкоцитов при крупозной пневмонии характерно для стадии …",
            "rA": [
                "серого опеченения"
            ],
            "wA": [
                "прилива",
                "красного опеченения",
                "разрешения"
            ]
        },
        {
            "qID": 273,
            "qName": "Резорбция экссудата в просвете альвеол при крупозной пневмонии характерна для стадии …",
            "rA": [
                "разрешения"
            ],
            "wA": [
                "прилива",
                "красного опеченения",
                "серого опеченения"
            ]
        },
        {
            "qID": 274,
            "qName": "Фибринозный экссудат в альвеолах при крупозной пневмонии может подвергаться …",
            "rA": [
                "рассасыванию",
                "организации",
                "абсцедированию"
            ],
            "wA": [
                "секвестрации"
            ]
        },
        {
            "qID": 275,
            "qName": "К лёгочным осложнениям крупозной пневмонии относятся …",
            "rA": [
                "абсцесс лёгкого",
                "эмпиема плевры",
                "карнификация"
            ],
            "wA": [
                "рак лёгкого",
                "бронхит"
            ]
        },
        {
            "qID": 276,
            "qName": "Карнификация легкого – это …",
            "rA": [
                "организация экссудата в просвете альвеол"
            ],
            "wA": [
                "нагноение экссудата в просвете альвеол",
                "распространение воспаления на бронхи",
                "некроз легочной ткани"
            ]
        },
        {
            "qID": 277,
            "qName": "Полиэтиологическое воспаление легких очагового характера, развивающееся в связи с бронхитом (бронхиолитом) носит название …",
            "rA": [
                "бронхопневмония"
            ],
            "wA": [
                "хронический бронхит",
                "бронхоэктатическая болезнь",
                "эмфизема легких",
                "пневмосклероз"
            ]
        },
        {
            "qID": 278,
            "qName": "Важные особенности бронхопневмонии …",
            "rA": [
                "очаговый характер поражения",
                "широкий спектр возбудителей",
                "обязательно сопровождается бронхитом (бронхиолитом)"
            ],
            "wA": [
                "долевой характер поражения",
                "обязательно сопровождается плевритом"
            ]
        },
        {
            "qID": 279,
            "qName": "В группу хронических обструктивных болезней легких входят …",
            "rA": [
                "хронический бронхит",
                "бронхиальная астма",
                "эмфизема легких"
            ],
            "wA": [
                "хроническая пневмония",
                "фиброзирующий альвеолит"
            ]
        },
        {
            "qID": 280,
            "qName": "В группу хронических рестриктивных болезней легких входят …",
            "rA": [
                "хроническая пневмония",
                "фиброзирующий альвеолит"
            ],
            "wA": [
                "хронический бронхит",
                "бронхиальная астма",
                "эмфизема легких"
            ]
        },
        {
            "qID": 281,
            "qName": "Основными морфологическими признаками хронического бронхита являются …",
            "rA": [
                "гиперплазия слизистых желез",
                "диффузная лимфогистиоцитарная инфильтрация стенки бронхов",
                "склероз стенки бронхов"
            ],
            "wA": [
                "накопление экссудата в просвете альвеол"
            ]
        },
        {
            "qID": 282,
            "qName": "Бронхоэктаз – это …",
            "rA": [
                "очаговое расширение просвета бронха"
            ],
            "wA": [
                "очаговое сужение просвета бронха",
                "закупорка просвета бронха",
                "склероз стенки бронха"
            ]
        },
        {
            "qID": 283,
            "qName": "В зависимости от формы различают бронхоэктазы …",
            "rA": [
                "мешотчатые",
                "цилиндрические"
            ],
            "wA": [
                "деструктивные",
                "веретеновидные"
            ]
        },
        {
            "qID": 284,
            "qName": "Основными разновидностями бронхиальной астмы являются …",
            "rA": [
                "экзогенная",
                "эндогенная"
            ],
            "wA": [
                "гетерогенная",
                "бронхитогенная"
            ]
        },
        {
            "qID": 285,
            "qName": "Для острого периода бронхиальной астмы характерно …",
            "rA": [
                "диффузный спазм мелких бронхов",
                "острая обструктивная эмфизема"
            ],
            "wA": [
                "заполнение альвеол фибринозным экссудатом",
                "очаговые некрозы легочной ткани"
            ]
        },
        {
            "qID": 286,
            "qName": "При повторяющихся приступах бронхиальной астмы в легких формируются …",
            "rA": [
                "склероз и гиалиноз стенки бронхов",
                "хроническая обструктивная эмфизема",
                "легочная гипертензия"
            ],
            "wA": [
                "абсцессы",
                "крупозная пневмония"
            ]
        },
        {
            "qID": 287,
            "qName": "Стойкое расширение воздухоносных пространств дистальнее терминальных бронхиол это …",
            "rA": [
                "эмфизема"
            ],
            "wA": [
                "бронхоэктаз",
                "пневмоторакс",
                "ателектаз",
                "пневмоторакс"
            ]
        },
        {
            "qID": 288,
            "qName": "Основными причинами смерти больных хроническими обструктивными заболеваниями легких являются …",
            "rA": [
                "легочно-сердечная недостаточность",
                "почечная недостаточность (амилоидоз)",
                "дыхательная недостаточность"
            ],
            "wA": [
                "анемия",
                "крупозная пневмония"
            ]
        },
        {
            "qID": 289,
            "qName": "При развитии лёгочного сердца наблюдается гипертрофия …",
            "rA": [
                "правого желудочка"
            ],
            "wA": [
                "левого желудочка",
                "левого предсердия",
                "правого предсердия"
            ]
        },
        {
            "qID": 290,
            "qName": "В зависимости от локализации выделяют рак легкого …",
            "rA": [
                "центральный",
                "периферический",
                "массивный"
            ],
            "wA": [
                "экзофитный",
                "эндофитный"
            ]
        },
        {
            "qID": 291,
            "qName": "Гистологические варианты рака легкого …",
            "rA": [
                "плоскоклеточный рак",
                "железистый рак (аденокарцинома)",
                "мелкоклеточный рак"
            ],
            "wA": [
                "папиллярный рак",
                "светлоклеточный рак"
            ]
        },
        {
            "qID": 292,
            "qName": "Первые метастазы при раке легкого обнаруживаются в …",
            "rA": [
                "регионарных лимфоузлах"
            ],
            "wA": [
                "печени",
                "контрлатеральном легком",
                "телах грудных позвонков"
            ]
        },
        {
            "qID": 293,
            "qName": "Осложнения рака легкого …",
            "rA": [
                "легочное кровотечение",
                "деструктивно-нагноительные процессы в легком",
                "ателектазы"
            ],
            "wA": [
                "крупозная пневмония",
                "бронхиальная астма"
            ]
        },
        {
            "qID": 294,
            "qName": "Группа болезней почек с первичным и преимущественным поражением клубочков – это …",
            "rA": [
                "гломерулопатии"
            ],
            "wA": [
                "тубулопатии",
                "интерстициальные болезни почек",
                "нефросклероз",
                "амилоидоз почек"
            ]
        },
        {
            "qID": 295,
            "qName": "Группа болезней почек с первичным и преимущественным поражением канальцев – это …",
            "rA": [
                "тубулопатии"
            ],
            "wA": [
                "гломерулопатии",
                "интерстициальные болезни почек",
                "нефросклероз",
                "амилоидоз почек"
            ]
        },
        {
            "qID": 296,
            "qName": "В зависимости от топографии процесса гломерулонефриты бывают …",
            "rA": [
                "интракапиллярные",
                "экстракапиллярные"
            ],
            "wA": [
                "экссудативные",
                "пролиферативные",
                "смешанные"
            ]
        },
        {
            "qID": 297,
            "qName": "В зависимости от характера воспаления гломерулонефриты бывают …",
            "rA": [
                "экссудативные",
                "пролиферативные",
                "смешанные"
            ],
            "wA": [
                "интракапиллярные",
                "экстракапиллярные"
            ]
        },
        {
            "qID": 298,
            "qName": "Характерные морфологические признаки острого гломерулонефрита …",
            "rA": [
                "пролиферация клеток клубочка",
                "фибриноидный некроз гломерулярных капилляров"
            ],
            "wA": [
                "фокальный склероз клубочка",
                "выраженное утолщение базальных мембран капилляров",
                "облитерация капсул клубочков с формированием «полулуний»"
            ]
        },
        {
            "qID": 299,
            "qName": "Подострый гломерулонефрит является …",
            "rA": [
                "экстракапилларным",
                "пролиферативным"
            ],
            "wA": [
                "интракапиллярным",
                "экссудативным",
                "мезангиальным"
            ]
        },
        {
            "qID": 300,
            "qName": "Образно название почек при подостром гломерулонефрите …",
            "rA": [
                "большие красные почки",
                "большие пестрые почки"
            ],
            "wA": [
                "большие серые почки",
                "большие сальные почки",
                "амилоидно-сморщенные почки"
            ]
        },
        {
            "qID": 301,
            "qName": "Характерные морфологические признаки подострого гломерулонефрита …",
            "rA": [
                "пролиферация подоцитов и нефротелия наружного листка капсул клубочков",
                "облитерация капсул клубочков с формированием «полулуний»"
            ],
            "wA": [
                "пролиферация клеток клубочка",
                "фибриноидный некроз гломерулярных капилляров",
                "выраженное утолщение базальных мембран капилляров"
            ]
        },
        {
            "qID": 302,
            "qName": "Морфологические типы хронического гломерулонефрита …",
            "rA": [
                "мезангиокапиллярный",
                "мезангиопролиферативный",
                "фибропластический"
            ],
            "wA": [
                "иммунокомплексный",
                "экстракапиллярный"
            ]
        },
        {
            "qID": 303,
            "qName": "Пиелонефрит относится к группе …",
            "rA": [
                "интерстициальных болезней почки"
            ],
            "wA": [
                "воспалительных гломерулопатий",
                "невоспалительных гломерулопатий",
                "тубулопатий"
            ]
        },
        {
            "qID": 304,
            "qName": "Факторы, способствующие развитию пиелонефрита …",
            "rA": [
                "камни в мочевых путях",
                "гиперплазия предстательной железы",
                "беременность",
                "сахарный диабет"
            ],
            "wA": [
                "атеросклероз почечных артерий"
            ]
        },
        {
            "qID": 305,
            "qName": "Для острого пиелонефрита характерно",
            "rA": [
                "диффузная лейкоцитарная инфильтрация",
                "резкая гиперемия и отек стромы"
            ],
            "wA": [
                "атрофия паренхимы почки",
                "склероз стромы",
                "диффузная лимфомакрофагальная инфильтрация"
            ]
        },
        {
            "qID": 306,
            "qName": "Для хронического пиелонефрита характерно",
            "rA": [
                "атрофия паренхимы почки",
                "склероз стромы",
                "диффузная лимфомакрофагальная инфильтрация"
            ],
            "wA": [
                "диффузная лейкоцитарная инфильтрация",
                "резкая гиперемия и отек стромы"
            ]
        },
        {
            "qID": 307,
            "qName": "Осложнением пиелонефрита могут являться …",
            "rA": [
                "пионефроз",
                "паранефрит",
                "артериальная гипертензия"
            ],
            "wA": [
                "некротический нефроз",
                "гломерулонефрит"
            ]
        },
        {
            "qID": 308,
            "qName": "Стадиями острой почечной недостаточности являются:",
            "rA": [
                "шоковая",
                "олигоанурическая",
                "восстановления диуреза"
            ],
            "wA": [
                "уремическая",
                "латентная"
            ]
        },
        {
            "qID": 309,
            "qName": "Патологический процесс, характеризующийся разрастанием соединительной ткани с деформацией и уменьшением размеров почки называется:",
            "rA": [
                "нефросклероз"
            ],
            "wA": [
                "гипоплазия",
                "гипертрофия",
                "аплазия",
                "гидронефроз"
            ]
        },
        {
            "qID": 310,
            "qName": "Характерными морфологическими признаками уремии являются …",
            "rA": [
                "фибринозный перикардит",
                "катаральный гастрит"
            ],
            "wA": [
                "жировой гепатоз",
                "гнойный плеврит",
                "крупозная пневмония"
            ]
        },
        {
            "qID": 311,
            "qName": "Первично-сморщенная почка формируется при …",
            "rA": [
                "гипертонической болезни",
                "атеросклерозе почечных артерий"
            ],
            "wA": [
                "хроническом гломерулонефрите",
                "хроническом пиелонефрите",
                "амилоидозе почек"
            ]
        },
        {
            "qID": 312,
            "qName": "Вторично-сморщенная почка формируется при …",
            "rA": [
                "хроническом гломерулонефрите",
                "хроническом пиелонефрите",
                "амилоидозе почек"
            ],
            "wA": [
                "гипертонической болезни",
                "атеросклерозе почечных артерий"
            ]
        },
        {
            "qID": 313,
            "qName": "Для сахарного диабета I типа характерно …",
            "rA": [
                "связан с абсолютной недостаточностью инсулина",
                "наблюдается аутоиммунное повреждение островкового аппарата",
                "возникает обычно в детском и молодом возрасте"
            ],
            "wA": [
                "связан с относительной недостаточностью инсулина",
                "наблюдается нарушение усвоения инсулина клетками"
            ]
        },
        {
            "qID": 314,
            "qName": "Для сахарного диабета II типа характерно …",
            "rA": [
                "связан с относительной недостаточностью инсулина",
                "наблюдается нарушение усвоения инсулина клетками"
            ],
            "wA": [
                "связан с абсолютной недостаточностью инсулина",
                "наблюдается аутоиммунное повреждение островкового аппарата",
                "возникает обычно в детском и молодом возрасте"
            ]
        },
        {
            "qID": 315,
            "qName": "При сахарном диабете в поджелудочной железе наиболее часто определяются …",
            "rA": [
                "атрофия островкового аппарата",
                "аутоиммунный инсулит",
                "склероз"
            ],
            "wA": [
                "некроз",
                "гнойное воспаление"
            ]
        },
        {
            "qID": 316,
            "qName": "Диабетическую микроангиопатию характеризуют …",
            "rA": [
                "плазматическое пропитывание",
                "изменения артериол и капилляров",
                "гиалиноз"
            ],
            "wA": [
                "атеросклероз",
                "изменения в крупных артериях"
            ]
        },
        {
            "qID": 317,
            "qName": "При диабетической микроангиопатии наиболее часто страдают …",
            "rA": [
                "почки",
                "сетчатка глаз"
            ],
            "wA": [
                "печень",
                "головной мозг",
                "суставы"
            ]
        },
        {
            "qID": 318,
            "qName": "Диабетическую макроангиопатию характеризуют …",
            "rA": [
                "атеросклероз",
                "изменения в крупных артериях"
            ],
            "wA": [
                "плазматическое пропитывание",
                "изменения артериол и капилляров",
                "гиалиноз"
            ]
        },
        {
            "qID": 319,
            "qName": "Осложнения сахарного диабета …",
            "rA": [
                "хроническая почечная недостаточность",
                "гангрена стопы",
                "кетоацидоз",
                "инфаркт миокарда"
            ],
            "wA": [
                "амилоидоз"
            ]
        },
        {
            "qID": 320,
            "qName": "Макроскопически различают зоб …",
            "rA": [
                "узловатый",
                "диффузный",
                "смешанный"
            ],
            "wA": [
                "паренхиматозный",
                "коллоидный"
            ]
        },
        {
            "qID": 321,
            "qName": "Микроскопически различают зоб …",
            "rA": [
                "паренхиматозный",
                "коллоидный"
            ],
            "wA": [
                "узловатый",
                "диффузный",
                "смешанный"
            ]
        },
        {
            "qID": 322,
            "qName": "Для диффузного токсического зоба характерны …",
            "rA": [
                "увеличение размеров щитовидной железы",
                "уменьшение количества коллоида в фолликулах"
            ],
            "wA": [
                "уменьшение размеров щитовидной железы",
                "увеличение количества коллоида в фолликулах"
            ]
        },
        {
            "qID": 323,
            "qName": "Причиной развития эндемического зоба является …",
            "rA": [
                "дефицит йода"
            ],
            "wA": [
                "избыток йода",
                "избыток калия",
                "дефицит фтора",
                "избыток фтора"
            ]
        },
        {
            "qID": 324,
            "qName": "Фолликулы щитовидной железы при макро-микрофолликулярном (коллоидном) зобе …",
            "rA": [
                "имеют различные размеры и форму",
                "переполнены коллоидом"
            ],
            "wA": [
                "разрушены и склерозированы",
                "опустошены"
            ]
        },
        {
            "qID": 325,
            "qName": "Морфологическими формами хронического гастрита являются …",
            "rA": [
                "поверхностный",
                "атрофический"
            ],
            "wA": [
                "катаральный",
                "фибринозный",
                "гнойный"
            ]
        },
        {
            "qID": 326,
            "qName": "В зависимости от патогенеза выделяют типы хронического гастрита …",
            "rA": [
                "аутоиммунный",
                "неимунный (инфекционный)",
                "рефлюкс-гастрит"
            ],
            "wA": [
                "сосудистый"
            ]
        },
        {
            "qID": 327,
            "qName": "Для аутоиммунного гастрита характерными признаками являются …",
            "rA": [
                "поражается преимущественно фундальный отдел желудка",
                "выявляются антитела к париетальным клеткам желудочных желез"
            ],
            "wA": [
                "поражается преимущественно антральный отдел желудка",
                "не выявляются антитела к париетальным клеткам желудочным желез",
                "ассоциирован с хеликобактерной инфекцией"
            ]
        },
        {
            "qID": 328,
            "qName": "Для неиммунного (инфекционного) гастрита характерными признаками являются …",
            "rA": [
                "поражается преимущественно антральный отдел желудка",
                "не выявляются антитела к париетальным клеткам желудочным желез",
                "ассоциирован с хеликобактерной инфекцией"
            ],
            "wA": [
                "поражается преимущественно фундальный отдел желудка",
                "выявляются антитела к париетальным клеткам желудочных желез"
            ]
        },
        {
            "qID": 329,
            "qName": "Морфологические признаки хронического поверхностного гастрита …",
            "rA": [
                "дистрофические изменения ямочного эпителия",
                "лимфоплазмоцитарная инфильтрация слизистой оболочки"
            ],
            "wA": [
                "некрозы слизистой оболочки",
                "энтеролизация слизистой оболочки (кишечная метаплазия)",
                "уменьшение количества желез слизистой оболочки"
            ]
        },
        {
            "qID": 330,
            "qName": "Морфологические признаки хронического атрофического гастрита …",
            "rA": [
                "лимфоплазмоцитарная инфильтрация слизистой оболочки",
                "энтеролизация слизистой оболочки (кишечная метаплазия)",
                "уменьшение количества желез слизистой оболочки"
            ],
            "wA": [
                "эрозии и изъязвления слизистой оболочки",
                "некрозы слизистой оболочки"
            ]
        },
        {
            "qID": 331,
            "qName": "В этиологии язвенной болезни могут играть роль …",
            "rA": [
                "наследственные факторы",
                "алиментарные факторы",
                "неврогенные факторы",
                "гормональные факторы",
                "инфекционные факторы"
            ],
            "wA": []
        },
        {
            "qID": 332,
            "qName": "Местные факторы в патогенезе язвенной болезни желудка включают нарушение …",
            "rA": [
                "кислотно-пептического равновесия",
                "слизистого барьера"
            ],
            "wA": [
                "эндокринной регуляции",
                "нервной регуляции",
                "иммунных реакций"
            ]
        },
        {
            "qID": 333,
            "qName": "Общие факторы в патогенезе язвенной болезни желудка включают нарушение …",
            "rA": [
                "эндокринной регуляции",
                "нервной регуляции"
            ],
            "wA": [
                "кислотно-пептического равновесия",
                "слизистого барьера",
                "иммунных реакций"
            ]
        },
        {
            "qID": 334,
            "qName": "К стадиям морфогенеза язвенной болезни относят …",
            "rA": [
                "стадию эрозии",
                "стадию острой язвы",
                "стадию хронической язвы"
            ],
            "wA": [
                "стадию некроза",
                "стадию атрофии"
            ]
        },
        {
            "qID": 335,
            "qName": "Эрозия желудка – это …",
            "rA": [
                "дефект стенки, не проникающий за пределы слизистой оболочки"
            ],
            "wA": [
                "дефект стенки, проникающий за пределы слизистой оболочки, без явлений склероза",
                "дефект стенки, проникающий за пределы слизистой оболочки, с явлениями склероза",
                "сквозной дефект стенки желудка"
            ]
        },
        {
            "qID": 336,
            "qName": "Острая язва желудка – это …",
            "rA": [
                "дефект стенки, проникающий за пределы слизистой оболочки, без явлений склероза"
            ],
            "wA": [
                "дефект стенки, не проникающий за пределы слизистой оболочки",
                "дефект стенки, проникающий за пределы слизистой оболочки, с явлениями склероза",
                "сквозной дефект стенки желудка"
            ]
        },
        {
            "qID": 337,
            "qName": "Хроническая язва желудка – это …",
            "rA": [
                "дефект стенки, проникающий за пределы слизистой оболочки, с явлениями склероза"
            ],
            "wA": [
                "дефект стенки, не проникающий за пределы слизистой оболочки",
                "дефект стенки, проникающий за пределы слизистой оболочки, без явлений склероза",
                "сквозной дефект стенки желудка"
            ]
        },
        {
            "qID": 338,
            "qName": "Микроскопически в дне хронической язвы в стадии обострения определяются …",
            "rA": [
                "фибринозно-гнойный экссудат",
                "фибриноидный некроз",
                "грануляционная ткань",
                "фиброзная ткань"
            ],
            "wA": [
                "гиперпластические изменения эпителия"
            ]
        },
        {
            "qID": 339,
            "qName": "Микроскопически в дне хронической язвы в стадии ремиссии определяются …",
            "rA": [
                "грануляционная ткань",
                "фиброзная ткань"
            ],
            "wA": [
                "фибринозно-гнойный экссудат",
                "гиперпластические изменения эпителия",
                "фибриноидный некроз"
            ]
        },
        {
            "qID": 340,
            "qName": "Среди осложнений язвенной болезни желудка и двенадцатиперстной кишки выделяют …",
            "rA": [
                "малигнизацию",
                "воспалительные",
                "язвенно-рубцовые",
                "язвенно-деструктивные"
            ],
            "wA": [
                "инфекционные"
            ]
        },
        {
            "qID": 341,
            "qName": "К осложнениям язвенной болезни желудка относят …",
            "rA": [
                "кровотечение",
                "пенетрацию",
                "перфорацию",
                "рубцовую деформацию"
            ],
            "wA": [
                "атрофию"
            ]
        },
        {
            "qID": 342,
            "qName": "Проникновение язвенно-деструктивного процесса за пределы стенки желудка (двенадцатиперстной кишки) в соседние органы – это …",
            "rA": [
                "пенетрация"
            ],
            "wA": [
                "перфорация",
                "рубцовый стеноз",
                "полипоз",
                "малигнизация"
            ]
        },
        {
            "qID": 343,
            "qName": "Формирование сквозного дефекта стенки желудка (двенадцатиперстной кишки) в результате язвенно-деструктивного процесса – это …",
            "rA": [
                "перфорация"
            ],
            "wA": [
                "пенетрация",
                "рубцовый стеноз",
                "полипоз",
                "малигнизация"
            ]
        },
        {
            "qID": 344,
            "qName": "Для рака желудка предопухолевыми заболеваниями могут явиться …",
            "rA": [
                "хронический атрофический гастрит",
                "хроническая язва желудка",
                "аденоматозные полипы желудка"
            ],
            "wA": [
                "синдром Золлингера-Эллисона",
                "синдром Мэллори-Вейса"
            ]
        },
        {
            "qID": 345,
            "qName": "Гистологические типы рака желудка …",
            "rA": [
                "железистый (аденокарцинома)",
                "слизистый (перстневидноклеточный)",
                "фиброзный рак (скирр)"
            ],
            "wA": [
                "овсяноклеточный",
                "светлоклеточный"
            ]
        },
        {
            "qID": 346,
            "qName": "Морфологическими формами аппендицита являются …",
            "rA": [
                "острый поверхностный",
                "острый деструктивный",
                "хронический"
            ],
            "wA": [
                "гранулематозный",
                "некротический"
            ]
        },
        {
            "qID": 347,
            "qName": "К деструктивным формам острого аппендицита относятся …",
            "rA": [
                "флегмонозный",
                "гангренозный",
                "апостематозный"
            ],
            "wA": [
                "катаральный",
                "гранулематозный"
            ]
        },
        {
            "qID": 348,
            "qName": "Характерными признаками острого аппендицита являются …",
            "rA": [
                "инфильтрация стенки лейкоцитами",
                "наличие гнойного экссудата в просвете отростка",
                "гиперпластические процессы в лимфоидном аппарате отростка"
            ],
            "wA": [
                "склероз стенок сосудов",
                "склероз стенки отростка"
            ]
        },
        {
            "qID": 349,
            "qName": "Осложнениями аппендицита являются …",
            "rA": [
                "перфорация",
                "перитонит",
                "абсцессы печени"
            ],
            "wA": [
                "парапроктит",
                "панкреатит"
            ]
        },
        {
            "qID": 350,
            "qName": "В кишечнике рак наиболее часто поражает …",
            "rA": [
                "ободочную кишку",
                "прямую кишку"
            ],
            "wA": [
                "двенадцатиперстную кишку",
                "тощую кишку",
                "подвздошную кишку"
            ]
        },
        {
            "qID": 351,
            "qName": "Группу болезней, в основе которых лежат дистрофические и некротические изменения печеночной паренхимы, называют …",
            "rA": [
                "гепатозы"
            ],
            "wA": [
                "гепатиты",
                "циррозы печени",
                "желтухи",
                "поликистоз"
            ]
        },
        {
            "qID": 352,
            "qName": "Группу болезней, в основе которых лежат диффузные воспалительные изменения печени, называют …",
            "rA": [
                "гепатиты"
            ],
            "wA": [
                "гепатозы",
                "циррозы печени",
                "желтухи",
                "поликистоз"
            ]
        },
        {
            "qID": 353,
            "qName": "Группу болезней печени, в основе которых лежит необратимая структурная перестройка органа, называют …",
            "rA": [
                "циррозы печени"
            ],
            "wA": [
                "гепатозы",
                "гепатиты",
                "желтухи",
                "поликистоз"
            ]
        },
        {
            "qID": 354,
            "qName": "Массивный прогрессирующий некроз (токсическая дистрофия) печени может возникать при …",
            "rA": [
                "отравлении суррогатами алкоголя",
                "пищевых интоксикациях",
                "гестозах",
                "тиреотоксикозе"
            ],
            "wA": [
                "сердечной недостаточности"
            ]
        },
        {
            "qID": 355,
            "qName": "К стадиям массивного прогрессирующего некроза (токсической дистрофии) печени относятся …",
            "rA": [
                "стадия желтой дистрофии",
                "стадия красной дистрофии"
            ],
            "wA": [
                "стадия некроза",
                "стадия рубцевания",
                "стадия красного опеченения"
            ]
        },
        {
            "qID": 356,
            "qName": "Для стадии желтой дистрофии при массивном прогрессирующем некрозе печени характерно …",
            "rA": [
                "острая жировая дистрофия гепатоцитов",
                "жировой некроз гепатоцитов"
            ],
            "wA": [
                "обнажение и коллапс ретикулярной стромы",
                "резорбция жиробелкового детрита",
                "массивное разрастание соединительной ткани"
            ]
        },
        {
            "qID": 357,
            "qName": "Для стадии красной дистрофии при массивном прогрессирующем некрозе печени характерно …",
            "rA": [
                "обнажение и коллапс ретикулярной стромы",
                "резорбция жиробелкового детрита"
            ],
            "wA": [
                "острая жировая дистрофия гепатоцитов",
                "жировой некроз гепатоцитов",
                "массивное разрастание соединительной ткани"
            ]
        },
        {
            "qID": 358,
            "qName": "При жировом гепатозе печень …",
            "rA": [
                "увеличена",
                "дряблая",
                "желтая"
            ],
            "wA": [
                "уменьшена",
                "плотная"
            ]
        },
        {
            "qID": 359,
            "qName": "Микроскопические при жировом гепатозе обнаруживаются …",
            "rA": [
                "капли жира в цитоплазме гепатоцитов",
                "гибель отдельных гепатоцитов"
            ],
            "wA": [
                "массивные центролобулярные некрозы",
                "обязательное полнокровие центральных отделов долек",
                "лейкоцитарные инфильтраты в портальных трактах"
            ]
        },
        {
            "qID": 360,
            "qName": "Образное название печени при остром вирусном гепатите …",
            "rA": [
                "большая красная печень"
            ],
            "wA": [
                "гусиная печень",
                "мускатная печень",
                "большая желтая печень",
                "сморщенная печень"
            ]
        },
        {
            "qID": 361,
            "qName": "Характерные микроскопические признаки острого вирусного гепатита …",
            "rA": [
                "тельца Каунсильмена",
                "мостовидные некрозы гепатоцитов"
            ],
            "wA": [
                "ложные дольки",
                "перипортальный и междольковый фиброз",
                "жировая дистрофия гепатоцитов"
            ]
        },
        {
            "qID": 362,
            "qName": "Возможные исходы острого вирусного гепатита …",
            "rA": [
                "полное выздоровление",
                "носительство вируса",
                "переход в хроническую форму",
                "смерть от острой печеночной недостаточности"
            ],
            "wA": [
                "переход в цирроз печени"
            ]
        },
        {
            "qID": 363,
            "qName": "Формами хронического гепатита являются …",
            "rA": [
                "персистирующий",
                "активный"
            ],
            "wA": [
                "молниеносный",
                "безжелтушный",
                "бессимптомный"
            ]
        },
        {
            "qID": 364,
            "qName": "Основными гистологическими признаками хронического активного гепатита являются …",
            "rA": [
                "ступенчатые некрозы гепатоцитов",
                "мостовидные некрозы гепатоцитов",
                "повреждение пограничной пластинки дольки",
                "проникновение воспалительного инфильтрата внутрь печеночных долек"
            ],
            "wA": [
                "наличие воспалительного инфильтрата только в пределах портальных трактов"
            ]
        },
        {
            "qID": 365,
            "qName": "Основными гистологическим признаками персистирующего гепатита являются …",
            "rA": [
                "чёткая граница пограничной пластинки дольки",
                "наличие воспалительного инфильтрата только в пределах портальных трактов"
            ],
            "wA": [
                "некроз гепатоцитов",
                "выраженный меж- и внутридольковый фиброз",
                "проникновение воспалительного инфильтрата внутрь печеночных долек"
            ]
        },
        {
            "qID": 366,
            "qName": "К морфогенетическим типам цирроза печени относятся …",
            "rA": [
                "постнекротический",
                "портальный",
                "смешанный"
            ],
            "wA": [
                "крупноузловой",
                "мелкоузловой"
            ]
        },
        {
            "qID": 367,
            "qName": "К макроскопическим типам цирроза печени относятся …",
            "rA": [
                "крупноузловой",
                "мелкоузловой",
                "смешанный"
            ],
            "wA": [
                "постнекротический",
                "портальный"
            ]
        },
        {
            "qID": 368,
            "qName": "Макроскопически печень при циррозе …",
            "rA": [
                "плотная",
                "бугристая",
                "рыжего цвета"
            ],
            "wA": [
                "дряблая",
                "гладкая"
            ]
        },
        {
            "qID": 369,
            "qName": "Микроскопически цирроз печени характеризуется …",
            "rA": [
                "формированием соединительнотканных септ",
                "некрозом гепатоцитов",
                "появлением ложных долек",
                "нарушением гистоархитектоники печени"
            ],
            "wA": [
                "клеточным атипизмом гепатоцитов"
            ]
        },
        {
            "qID": 370,
            "qName": "Внепечёночные изменения при циррозе печени включают в себя …",
            "rA": [
                "геморрагический диатез",
                "асцит",
                "желтуху",
                "расширение порто-кавальных анастомозов"
            ],
            "wA": [
                "расширение печеночных вен"
            ]
        },
        {
            "qID": 371,
            "qName": "Осложнениями цирроза печени могут явиться …",
            "rA": [
                "печеночная кома",
                "пищеводное кровотечение",
                "асцит-перитонит",
                "развитие рака печени"
            ],
            "wA": [
                "гемолитическая анемия"
            ]
        },
        {
            "qID": 372,
            "qName": "К основным клинико-морфологическим формам туберкулеза относят …",
            "rA": [
                "первичный",
                "вторичный",
                "гематогенный"
            ],
            "wA": [
                "третичный",
                "лимфогенный"
            ]
        },
        {
            "qID": 373,
            "qName": "Первичный туберкулезный комплекс может локализоваться в …",
            "rA": [
                "легком",
                "кишечнике"
            ],
            "wA": [
                "головном мозге",
                "печени",
                "селезенке"
            ]
        },
        {
            "qID": 374,
            "qName": "Компонентами первичного туберкулезного комплекса являются …",
            "rA": [
                "лимфангит",
                "первичный аффект",
                "лимфаденит"
            ],
            "wA": [
                "каверна",
                "туберкулема"
            ]
        },
        {
            "qID": 375,
            "qName": "Варианты течения первичного туберкулеза …",
            "rA": [
                "затухание процесса и заживление первичных очагов",
                "прогрессирование процесса с генерализацией инфекции",
                "хроническое течение"
            ],
            "wA": [
                "переход в гематогенный туберкулез",
                "переход во вторичный туберкулез"
            ]
        },
        {
            "qID": 376,
            "qName": "Формы прогрессирования первичного туберкулеза …",
            "rA": [
                "лимфогенная генерализация",
                "гематогенная генерализация",
                "рост первичного аффекта",
                "смешанная форма"
            ],
            "wA": [
                "абсцедирование"
            ]
        },
        {
            "qID": 377,
            "qName": "Для гематогенного туберкулеза характерны …",
            "rA": [
                "преобладание продуктивных (гранулематозных) изменений",
                "склонность только к гематогенной генерализации"
            ],
            "wA": [
                "развивается в период инфицирования (при первой встрече с инфектом)",
                "преобладание экссудативно-некротических изменений",
                "склонность к гематогенной и лимфогенной генерализации"
            ]
        },
        {
            "qID": 378,
            "qName": "Разновидностями гематогенного туберкулёза являются …",
            "rA": [
                "генерализованный туберкулез",
                "туберкулез с преимущественно внелегочными поражениями"
            ],
            "wA": [
                "казеозная пневмония",
                "острый кавернозный туберкулёз",
                "инфильтративный туберкулёз"
            ]
        },
        {
            "qID": 379,
            "qName": "Милиарный туберкулез – это проявление …",
            "rA": [
                "генерализации первичного туберкулеза",
                "гематогенного туберкулеза"
            ],
            "wA": [
                "первичного туберкулезного комплекса",
                "хронически текущего первичного туберкулеза",
                "вторичного туберкулеза"
            ]
        },
        {
            "qID": 380,
            "qName": "Для вторичного туберкулеза характерны …",
            "rA": [
                "избирательно легочная локализация процесса",
                "контактный и интраканаликулярный путь распространения",
                "возникает в организме человека, перенесшего ранее первичный туберкулез"
            ],
            "wA": [
                "генерализованный характер поражения",
                "гематогенный путь распространения"
            ]
        },
        {
            "qID": 381,
            "qName": "Формами-фазами вторичного туберкулёза являются …",
            "rA": [
                "инфильтративный",
                "цирротический",
                "кавернозный"
            ],
            "wA": [
                "некротический",
                "туберкулезный сепсис"
            ]
        },
        {
            "qID": 382,
            "qName": "Для инфильтративного туберкулеза характерны …",
            "rA": [
                "преобладает экссудативно-некротическая тканевая реакция",
                "перифокальные изменения преобладают над казеозными",
                "при прогрессировании переходит в острую кавернозную форму"
            ],
            "wA": [
                "преобладает продуктивная тканевая реакция",
                "сопровождается казеозным лимфаденитом"
            ]
        },
        {
            "qID": 383,
            "qName": "Для острого кавернозного туберкулеза характерны …",
            "rA": [
                "быстрый распад легочной ткани с образованием полости",
                "частая локализация изменений в I-II сегментах легких",
                "бронхогенное обсеменение легких"
            ],
            "wA": [
                "массивный фиброзный процесс по периферии очагов",
                "лимфогенная генерализация процесса"
            ]
        },
        {
            "qID": 384,
            "qName": "К характерным осложнениям первичного туберкулеза относятся …",
            "rA": [
                "туберкулезный менингит",
                "плеврит"
            ],
            "wA": [
                "легочное кровотечение",
                "секвестрация, деформация костей и суставов",
                "крупозная пневмония"
            ]
        },
        {
            "qID": 385,
            "qName": "К характерным осложнениям гематогенного туберкулеза относятся …",
            "rA": [
                "туберкулезный менингит",
                "туберкулезный сепсис",
                "секвестрация, деформация костей и суставов"
            ],
            "wA": [
                "легочное кровотечение",
                "крупозная пневмония"
            ]
        },
        {
            "qID": 386,
            "qName": "К характерным осложнениям вторичного туберкулеза относятся …",
            "rA": [
                "легочное кровотечение",
                "эмпиема плевры",
                "пневмоторакс"
            ],
            "wA": [
                "туберкулезный менингит",
                "секвестрация, деформация костей и суставов"
            ]
        },
        {
            "qID": 387,
            "qName": "Для первичного сифилиса характерны …",
            "rA": [
                "формирование твердого шанкра во входных воротах инфекции",
                "регионарный лимфаденит"
            ],
            "wA": [
                "появление высыпаний (сифилидов) на коже и слизистых оболочках",
                "хроническое диффузное интерстициальное воспаление внутренних органов",
                "образование гумм"
            ]
        },
        {
            "qID": 388,
            "qName": "Морфологические характеристики твердого шанкра …",
            "rA": [
                "язва с плотными краями и лакированным дном",
                "лимфоплазмоцитарная инфильтрация",
                "пролиферация эндотелия мелких сосудов вплоть до облитерации их просвета"
            ],
            "wA": [
                "разрыхление ткани с массивными грануляциями на поверхности",
                "массивная нейтрофильная инфильтрация"
            ]
        },
        {
            "qID": 389,
            "qName": "Для вторичного сифилиса характерны …",
            "rA": [
                "появление высыпаний (сифилидов) на коже и слизистых оболочках"
            ],
            "wA": [
                "формирование твердого шанкра во входных воротах инфекции",
                "регионарный лимфаденит",
                "хроническое диффузное интерстициальное воспаление внутренних органов",
                "образование гумм"
            ]
        },
        {
            "qID": 390,
            "qName": "Для третичного сифилиса характерны …",
            "rA": [
                "хроническое диффузное интерстициальное воспаление внутренних органов",
                "образование гумм"
            ],
            "wA": [
                "формирование твердого шанкра во входных воротах инфекции",
                "регионарный лимфаденит",
                "появление высыпаний (сифилидов) на коже и слизистых оболочках"
            ]
        },
        {
            "qID": 391,
            "qName": "Характерные проявления висцерального сифилиса – …",
            "rA": [
                "сифилитический цирроз внутренних органов",
                "сифилитический мезаортит",
                "прогрессивный паралич",
                "спинная сухотка"
            ],
            "wA": [
                "твердый шанкр"
            ]
        },
        {
            "qID": 392,
            "qName": "Характерные признаки раннего врожденного сифилиса …",
            "rA": [
                "специфическая интерстициальная пневмония («белая пневмония»)",
                "специфический интерстициальный гепатит («кремниевая печень»)",
                "папулезные и пустулезные высыпания на коже"
            ],
            "wA": [
                "триада Гетчинсона (отверткообразные зубы, паренхиматозный кератит, глухота)",
                "абсцессы Дюбуа в тимусе"
            ]
        },
        {
            "qID": 393,
            "qName": "Характерные признаки позднего врожденного сифилиса …",
            "rA": [
                "триада Гетчинсона (отверткообразные зубы, паренхиматозный кератит, глухота)",
                "абсцессы Дюбуа в тимусе"
            ],
            "wA": [
                "специфическая интерстициальная пневмония («белая пневмония»)",
                "специфический интерстициальный гепатит («кремниевая печень»)",
                "папулезные и пустулезные высыпания на коже"
            ]
        },
        {
            "qID": 394,
            "qName": "Острые респираторные вирусные инфекции вызываются …",
            "rA": [
                "вирусом гриппа",
                "вирусом парагриппа",
                "респираторно-синцитиальным вирусом",
                "аденовирусом"
            ],
            "wA": [
                "вирусом Коксаки"
            ]
        },
        {
            "qID": 395,
            "qName": "Местные изменения при гриппе легкой степени тяжести характеризуются поражением …",
            "rA": [
                "носоглотки",
                "трахеи"
            ],
            "wA": [
                "терминальных бронхиол",
                "альвеол",
                "желудка"
            ]
        },
        {
            "qID": 396,
            "qName": "Воспаление в дыхательных путях при легкой форме гриппа носит … характер",
            "rA": [
                "серозный"
            ],
            "wA": [
                "гнойный",
                "гранулематозный",
                "геморрагический"
            ]
        },
        {
            "qID": 397,
            "qName": "Пневмония развивается при … формах гриппа",
            "rA": [
                "средней тяжести",
                "тяжелой"
            ],
            "wA": [
                "легкой",
                "латентной",
                "токсической"
            ]
        },
        {
            "qID": 398,
            "qName": "Характерными признаками пневмонии при гриппе средней тяжести являются:",
            "rA": [
                "интерстициальный характер",
                "лимфомакрофагальная инфильтрация"
            ],
            "wA": [
                "вирусно-бактериальная этиология",
                "гнойное воспаление",
                "гранулематозное воспаление"
            ]
        },
        {
            "qID": 399,
            "qName": "Вариантами тяжелой формы гриппа являются …",
            "rA": [
                "токсическая",
                "с легочными осложнениями"
            ],
            "wA": [
                "кардиоваскулярная",
                "почечная",
                "церебральная"
            ]
        },
        {
            "qID": 400,
            "qName": "Токсический вариант тяжелой формы гриппа характеризуется …",
            "rA": [
                "кровоизлияниями",
                "геморрагическим отеком легких"
            ],
            "wA": [
                "гнойным воспалением",
                "некротическим нефрозом",
                "катаральным воспалением"
            ]
        },
        {
            "qID": 401,
            "qName": "Характерными признаками пневмонии при тяжелой форме гриппа с легочными осложнениями являются …",
            "rA": [
                "вирусно-бактериальная этиология",
                "бронхопневмония",
                "гнойно-геморрагическое воспаление"
            ],
            "wA": [
                "интерстициальный характер",
                "гранулематозное воспаление"
            ]
        },
        {
            "qID": 402,
            "qName": "Образное название легкого при тяжелой форме гриппа с легочными осложнениями –  … легкое",
            "rA": [
                "«большое пестрое»"
            ],
            "wA": [
                "«большое красное»",
                "«большое сальное»",
                "«большое белое»"
            ]
        },
        {
            "qID": 403,
            "qName": "Ложный круп при парагриппе у детей связан с …",
            "rA": [
                "отеком гортани"
            ],
            "wA": [
                "бронхоспазмом",
                "обтурацией дыхательных путей фибринозными пленками",
                "обтурации дыхательных путей слизью"
            ]
        },
        {
            "qID": 404,
            "qName": "Коревую сыпь (экзантему) морфологически характеризует …",
            "rA": [
                "гиперемия",
                "лимфогистиоцитарная инфильтрация"
            ],
            "wA": [
                "гиалиноз дермы",
                "атрофия эпидермиса",
                "гигантские многоядерные клетки Пирогова-Лангханса"
            ]
        },
        {
            "qID": 405,
            "qName": "Пятна Филатова-Коплика обнаруживаются на …",
            "rA": [
                "внутренней поверхности щёк"
            ],
            "wA": [
                "ладонях и стопах",
                "разгибательных поверхностях предплечий",
                "языке",
                "голове"
            ]
        },
        {
            "qID": 406,
            "qName": "Периодами ГЛПС являются …",
            "rA": [
                "олигоанурический",
                "полиурический"
            ],
            "wA": [
                "протеинурический",
                "гематурический",
                "нефротический"
            ]
        },
        {
            "qID": 407,
            "qName": "Поражение почек при ГЛПС чаще наблюдается с … дня болезни",
            "rA": [
                "5-7"
            ],
            "wA": [
                "1-2",
                "10-12",
                "14-15"
            ]
        },
        {
            "qID": 408,
            "qName": "Макроскопические изменения почек при ГЛПС …",
            "rA": [
                "резкое увеличение размеров и массы",
                "пирамиды багрово-синюшные",
                "кора бледно-серая"
            ],
            "wA": [
                "сморщивание и уменьшение массы",
                "пирамиды бледно-серые"
            ]
        },
        {
            "qID": 409,
            "qName": "Микроскопические изменения почек при ГЛПС …",
            "rA": [
                "кровоизлияние и отек в строме пирамид",
                "дистрофия, некробиоз и десквамация эпителия канальцев",
                "острый гидронефроз в коре"
            ],
            "wA": [
                "диффузный гломерулосклероз",
                "лейкоцитарная инфильтрация стромы с формированием микроабсцессов"
            ]
        },
        {
            "qID": 410,
            "qName": "Характерные изменения гипофиза у умерших при ГЛПС …",
            "rA": [
                "некроз",
                "кровоизлияние"
            ],
            "wA": [
                "гиперплазия передней доли",
                "гиперплазия задней доли",
                "атрофия"
            ]
        },
        {
            "qID": 411,
            "qName": "Синдром Шихана при ГЛПС - это острая…недостаточность",
            "rA": [
                "гипофизарная"
            ],
            "wA": [
                "надпочечниковая",
                "почечная",
                "печеночная",
                "сердечная"
            ]
        },
        {
            "qID": 412,
            "qName": "Типовыми осложнениями ГЛПС являются …",
            "rA": [
                "инфекционно-токсический шок",
                "острая почечная недостаточность",
                "синдром ДВС"
            ],
            "wA": [
                "острая дыхательная недостаточность",
                "тромбоэмболический синдром"
            ]
        },
        {
            "qID": 413,
            "qName": "Основные особенности сепсиса …",
            "rA": [
                "полиэтиологичен",
                "не заразен",
                "не формируется иммунный ответ"
            ],
            "wA": [
                "имеет строго циклическое течение",
                "обязательно сопровождается бактериемией"
            ]
        },
        {
            "qID": 414,
            "qName": "Клинико-морфологическими формами сепсиса являются …",
            "rA": [
                "инфекционный эндокардит",
                "септицемия",
                "септикопиемия"
            ],
            "wA": [
                "инфекционный миокардит",
                "бактериемия"
            ]
        },
        {
            "qID": 415,
            "qName": "Общие изменения при сепсисе представлены …",
            "rA": [
                "дистрофией и межуточным воспалением паренхиматозных органов",
                "васкулитами",
                "гиперплазией лимфоидной и кроветворной тканей"
            ],
            "wA": [
                "инфекционным эндокардитом",
                "тромбофлебитом в области септического очага"
            ]
        },
        {
            "qID": 416,
            "qName": "Характерными признаками септицемии являются …",
            "rA": [
                "выраженная гиперергическая реакция",
                "острое или молниеносное течение",
                "общие изменения преобладают над местными"
            ],
            "wA": [
                "множественные метастатические абсцессы внутренних органов",
                "тромбобактериальная эмболия"
            ]
        },
        {
            "qID": 417,
            "qName": "Характерными признаками септикопиемии являются …",
            "rA": [
                "множественные метастатические абсцессы внутренних органов",
                "тромбобактериальная эмболия"
            ],
            "wA": [
                "выраженная гиперергическая реакция",
                "острое или молниеносное течение",
                "общие изменения преобладают над местными"
            ]
        },
        {
            "qID": 418,
            "qName": "Морфологическая картина септического эндокардита характеризуется … эндокардитом",
            "rA": [
                "полипозно-язвенным"
            ],
            "wA": [
                "возвратно-бородавчатым",
                "фибропластическим",
                "флегмонозно-язвенным"
            ]
        },
        {
            "qID": 419,
            "qName": "Септическую селезенку характеризуют …",
            "rA": [
                "увеличение размеров",
                "гиперплазия лимфоидного аппарата"
            ],
            "wA": [
                "уменьшение размеров",
                "атрофия лимфоидного аппарата",
                "множественные абсцессы"
            ]
        },
        {
            "qID": 420,
            "qName": "Во входных воротах при дифтерии воспаление имеет … характер",
            "rA": [
                "фибринозный"
            ],
            "wA": [
                "продуктивный",
                "гнойный",
                "геморрагический",
                "гнилостный"
            ]
        },
        {
            "qID": 421,
            "qName": "Для дифтерии зева характерны …",
            "rA": [
                "дифтеритическое воспаление",
                "образование массивных фибринозных пленок, прочно связанных с подлежащей тканью"
            ],
            "wA": [
                "крупозное воспаление",
                "образование рыхлых фибринозных пленок, легко отходящих от подлежащей ткани",
                "развитие истинного крупа"
            ]
        },
        {
            "qID": 422,
            "qName": "Для дифтерии дыхательных путей характерны …",
            "rA": [
                "крупозное воспаление",
                "образование рыхлых фибринозных пленок, легко отходящих от подлежащей ткани",
                "развитие истинного крупа"
            ],
            "wA": [
                "дифтеритическое воспаление",
                "образование массивных фибринозных пленок, прочно связанных с подлежащей тканью"
            ]
        },
        {
            "qID": 423,
            "qName": "Типичным местом локализации местных изменений при скарлатине является …",
            "rA": [
                "слизистая оболочка зева"
            ],
            "wA": [
                "бронхиолы",
                "кожа",
                "кишечник"
            ]
        },
        {
            "qID": 424,
            "qName": "Характерные местные проявления скарлатины …",
            "rA": [
                "резкая гиперемия зева и миндалин («пылающий зев»)",
                "катаральная и некротическая ангина",
                "регионарный лимфаденит"
            ],
            "wA": [
                "крупозный ларингит",
                "гнойно-геморрагическая пневмония"
            ]
        },
        {
            "qID": 425,
            "qName": "Характерные признаки сыпи при скарлатине …",
            "rA": [
                "мелкоточечная сыпь ярко-красного цвета",
                "покрывает всю поверхность тела, кроме носогубного треугольника",
                "в исходе – пластинчатое шелушение"
            ],
            "wA": [
                "крупнопятнистая папулезная сыпь",
                "покрывает лицо, шею, туловище и разгибательные поверхности конечностей"
            ]
        },
        {
            "qID": 426,
            "qName": "Второй период скарлатины может проявляться развитием …",
            "rA": [
                "гломерулонефрита",
                "ревматизма",
                "васкулита"
            ],
            "wA": [
                "крупозной пневмонии",
                "менингита"
            ]
        },
        {
            "qID": 427,
            "qName": "Формами менингококковой инфекции являются …",
            "rA": [
                "назофарингит",
                "менингит",
                "менингококцемия"
            ],
            "wA": [
                "аллергическая",
                "токсическая"
            ]
        },
        {
            "qID": 428,
            "qName": "Изменения при менингококковом менингите …",
            "rA": [
                "мозговые оболочки мутные, утолщены, покрыты гнойным налетом",
                "ткань мозга полнокровна, отечна"
            ],
            "wA": [
                "мозговые оболочки пропитаны кровью",
                "ткань мозга обильно инфильтрирована лейкоцитами",
                "в ткани мозга формируются множественные кисты"
            ]
        },
        {
            "qID": 429,
            "qName": "Характерные признаки сыпи при менингококковой инфекции …",
            "rA": [
                "возникает только при менингококцемии",
                "имеет геморрагический звездчатый характер",
                "располагается преимущественно на ягодицах, нижних конечностях, веках"
            ],
            "wA": [
                "возникает при любых формах менингококковой инфекции",
                "имеет крупнопятнистый папулезный вид"
            ]
        },
        {
            "qID": 430,
            "qName": "Синдром Уотерхауса-Фридериксена связан с …",
            "rA": [
                "массивными некрозами и кровоизлияниями в надпочечники"
            ],
            "wA": [
                "массивными некрозами и кровоизлияниями в гипофиз",
                "массивными некрозами и кровоизлияниями в головной мозг",
                "массивным гнойным менингитом",
                "острой почечной недостаточностью"
            ]
        },
        {
            "qID": 431,
            "qName": "При брюшном тифе чаще поражается …",
            "rA": [
                "подвздошная кишка"
            ],
            "wA": [
                "сигмовидная кишка",
                "двенадцатиперстная кишка",
                "слепая кишка",
                "прямая кишка"
            ]
        },
        {
            "qID": 432,
            "qName": "Для брюшного тифа характерны следующие изменения пейеровых бляшек …",
            "rA": [
                "мозговидное набухание",
                "некроз",
                "изъязвление",
                "в исходе процесса – склероз"
            ],
            "wA": [
                "атрофия"
            ]
        },
        {
            "qID": 433,
            "qName": "К осложнениям брюшного тифа относятся:",
            "rA": [
                "брюшнотифозный сепсис",
                "перитонит",
                "кишечное кровотечение"
            ],
            "wA": [
                "пилефлебитические абсцессы печени",
                "крупозная пневмония"
            ]
        },
        {
            "qID": 434,
            "qName": "При дизентерии (шигеллезе) чаще поражается …",
            "rA": [
                "сигмовидная кишка",
                "прямая кишка"
            ],
            "wA": [
                "пейеровы бляшки подвздошной кишки",
                "червеобразный отросток толстой кишки",
                "двенадцатиперстная кишка"
            ]
        },
        {
            "qID": 435,
            "qName": "При дизентерии (шигеллезе) выделяют стадии …",
            "rA": [
                "катарального колита",
                "фибринозного колита",
                "язвенного колита"
            ],
            "wA": [
                "мозговоидного набухания пейеровых бляшек",
                "некроза"
            ]
        },
        {
            "qID": 436,
            "qName": "При дизентерии (шигеллезе) в первой стадии имеет место … воспаление",
            "rA": [
                "катаральное"
            ],
            "wA": [
                "фибринозное",
                "геморрагическое",
                "гнойное",
                "продуктивное"
            ]
        },
        {
            "qID": 437,
            "qName": "Для второй стадии дизентерийного колита характерны … кишки.",
            "rA": [
                "фибринозное воспаление слизистой оболочки",
                "распространённые очаги некроза слизистой оболочки",
                "дистрофические и некротические изменения в нервно-мышечном аппарате"
            ],
            "wA": [
                "мозговидное набухание пейеровых бляшек",
                "образование глубоких язв в стенке кишки"
            ]
        },
        {
            "qID": 438,
            "qName": "Третья стадия дизентерийного колита характеризуется …",
            "rA": [
                "формированием язв"
            ],
            "wA": [
                "катаральным воспалением слизистой оболочки",
                "крупозным воспалением слизистой оболочки",
                "дифтеритическим воспалением слизистой оболочки",
                "рубцовыми изменениями в стенке кишки"
            ]
        },
        {
            "qID": 439,
            "qName": "Клинико-морфологическими формами сальмонеллеза являются:",
            "rA": [
                "брюшнотифозная",
                "интестинальная",
                "септическая"
            ],
            "wA": [
                "гепаторенальная",
                "лимфоидная"
            ]
        },
        {
            "qID": 440,
            "qName": "Стадиями холеры являются …",
            "rA": [
                "гастроэнтерит",
                "алгид",
                "серозный энтерит"
            ],
            "wA": [
                "проктит",
                "сигмоидит"
            ]
        },
        {
            "qID": 441,
            "qName": "В основе кариеса зубов лежит процесс …",
            "rA": [
                "дис- и деминерализации"
            ],
            "wA": [
                "воспаления",
                "венозного полнокровия",
                "образования репаративной гранулемы",
                "стаза"
            ]
        },
        {
            "qID": 442,
            "qName": "Кариесом чаще всего поражаются …",
            "rA": [
                "моляры"
            ],
            "wA": [
                "резцы",
                "клыки",
                "премоляры"
            ]
        },
        {
            "qID": 443,
            "qName": "В развитии кариеса активно участвуют …",
            "rA": [
                "лактобациллы",
                "оральные стрептококки"
            ],
            "wA": [
                "синегнойные палочки",
                "микобактерии туберкулеза",
                "золотистые стафилококки"
            ]
        },
        {
            "qID": 444,
            "qName": "К местным кариесогенным факторам относят …",
            "rA": [
                "зубной налет",
                "микроорганизмы полости рта"
            ],
            "wA": [
                "дефицит фтора в организме",
                "кариесогенную диету"
            ]
        },
        {
            "qID": 445,
            "qName": "К общим кариесогенным факторам относят …",
            "rA": [
                "дефицит фтора в организме",
                "кариесогенную диету"
            ],
            "wA": [
                "зубной налет",
                "микроорганизмы полости рта"
            ]
        },
        {
            "qID": 446,
            "qName": "К зубным отложениям относят:",
            "rA": [
                "зубной налет",
                "зубную бляшку",
                "зубной камень"
            ],
            "wA": [
                "зубной нарост"
            ]
        },
        {
            "qID": 447,
            "qName": "Кариес дентина протекает быстрее, чем кариес, эмали вследствие …",
            "rA": [
                "быстрого распространения микроорганизмов по дентинным канальцам"
            ],
            "wA": [
                "худшего кровоснабжения дентина",
                "менее активной репарации дентина",
                "более высокой концентрации в дентине неорганических солей"
            ]
        },
        {
            "qID": 448,
            "qName": "Стадиями кариеса являются …",
            "rA": [
                "начальная",
                "поверхностная",
                "глубокая"
            ],
            "wA": [
                "доклиническая",
                "терминальная"
            ]
        },
        {
            "qID": 449,
            "qName": "Макроскопически начальный кариес может быть представлен …",
            "rA": [
                "белым пятном",
                "пигментированным пятном"
            ],
            "wA": [
                "эрозией эмали",
                "образованием полостного дефекта в пределах эмали"
            ]
        },
        {
            "qID": 450,
            "qName": "Морфологические изменения при начальном кариесе представлены …",
            "rA": [
                "дис- и деминерализацией эмали",
                "нечеткостью границ эмалевых призм",
                "расширением межпризменных пространств"
            ],
            "wA": [
                "дистрофией и некрозом отростков одонтобластов",
                "формированием полостного дефекта с проникновением в дентин"
            ]
        },
        {
            "qID": 451,
            "qName": "Поверхностный кариес характеризуется ….",
            "rA": [
                "формированием полостного дефекта в пределах эмали"
            ],
            "wA": [
                "отсутствием макроскопических проявлений",
                "появлением белого пятна",
                "формированием полостного дефекта с распространением в дентин"
            ]
        },
        {
            "qID": 452,
            "qName": "Изменения дентина при поверхностном кариесе представлены …",
            "rA": [
                "появлением «мертвых путей»"
            ],
            "wA": [
                "деструкцией органической матрицы",
                "формированием полостного дефекта",
                "вскрытием зубной полости"
            ]
        },
        {
            "qID": 453,
            "qName": "Средний кариес характеризуется …",
            "rA": [
                "формированием полостного дефекта с распространением в дентин"
            ],
            "wA": [
                "отсутствием макроскопических проявлений",
                "появлением белого пятна",
                "формированием полостного дефекта в пределах эмали"
            ]
        },
        {
            "qID": 454,
            "qName": "В дне кариозной полости при среднем кариесе выделяют зоны …",
            "rA": [
                "размягченого дентина",
                "репаративного (заместительного) дентина",
                "прозрачного дентина"
            ],
            "wA": [
                "дистрофированного дентина",
                "нагноившегося дентина"
            ]
        },
        {
            "qID": 455,
            "qName": "Размягченный дентин характеризуется …",
            "rA": [
                "практически полным отсутствием минеральных веществ",
                "разрушением отростков одонтобластов"
            ],
            "wA": [
                "склерозом дентина",
                "формированием дентиклей",
                "наличием большого количества одонтобластов"
            ]
        },
        {
            "qID": 456,
            "qName": "Прозрачный (склерозированный) дентин характеризуется …",
            "rA": [
                "высокой степенью минерализации",
                "перитубулярным склерозом дентина",
                "интратубулярным склерозом дентина"
            ],
            "wA": [
                "разрушением отростков одонтобластов",
                "наличием большого количества одонтобластов"
            ]
        },
        {
            "qID": 457,
            "qName": "Репаративный (заместительный) дентин характеризуется …",
            "rA": [
                "слабой степенью минерализации",
                "наличием большого количества одонтобластов",
                "отсутствием дентинных трубочек"
            ],
            "wA": [
                "высокой степенью минерализации"
            ]
        },
        {
            "qID": 458,
            "qName": "Осложнениями кариеса являются …",
            "rA": [
                "пульпит",
                "периапикальный периодонтит"
            ],
            "wA": [
                "гингивит",
                "эпулис"
            ]
        },
        {
            "qID": 459,
            "qName": "К клинико-морфологическим формам острого пульпита относятся …",
            "rA": [
                "серозный",
                "гнойный"
            ],
            "wA": [
                "инфекционный",
                "фиброзный",
                "диффузный"
            ]
        },
        {
            "qID": 460,
            "qName": "К клинико-морфологическим формам хронического пульпита относятся …",
            "rA": [
                "гранулирующий",
                "фиброзный"
            ],
            "wA": [
                "гранулематозный",
                "диффузный гнойный"
            ]
        },
        {
            "qID": 461,
            "qName": "Воспалительная гиперемия и отек пульпы в проекции кариозной полости характерны для … пульпита",
            "rA": [
                "острого очагового серозного"
            ],
            "wA": [
                "острого очагового гнойного",
                "острого диффузного гнойного",
                "острого гангренозного"
            ]
        },
        {
            "qID": 462,
            "qName": "Массивная инфильтрация пульпы лейкоцитами в проекции кариозной полости характерна для … пульпита",
            "rA": [
                "острого очагового гнойного"
            ],
            "wA": [
                "острого очагового серозного",
                "острого диффузного гнойного",
                "острого гангренозного"
            ]
        },
        {
            "qID": 463,
            "qName": "Распространение лейкоцитарного инфильтрата по всей пульпе характерно для … пульпита",
            "rA": [
                "острого диффузного гнойного"
            ],
            "wA": [
                "острого очагового серозного",
                "острого очагового гнойного",
                "острого гангренозного"
            ]
        },
        {
            "qID": 464,
            "qName": "Некроз и гнилостное расплавление пульпы характерно для … пульпита",
            "rA": [
                "острого гангренозного"
            ],
            "wA": [
                "острого очагового серозного",
                "острого очагового гнойного",
                "острого диффузного гнойного"
            ]
        },
        {
            "qID": 465,
            "qName": "К морфологическим проявлениям острого периапикального периодонтита относятся …",
            "rA": [
                "точечные кровоизлияния в периапикальном периодонте",
                "выраженный отек периапикального периодонта",
                "лейкоцитарная инфильтрация периапикального периодонта"
            ],
            "wA": [
                "формирование гранулем в периапикальной области",
                "формирование кист в периапикальной области"
            ]
        },
        {
            "qID": 466,
            "qName": "К клинико-морфологическим формам острого периапикального периодонтита относятся …",
            "rA": [
                "серозный периодонтит",
                "гнойный периодонтит"
            ],
            "wA": [
                "гранулематозный периодонтит",
                "фиброзный периодонтит",
                "гранулирующий периодонтит"
            ]
        },
        {
            "qID": 467,
            "qName": "К морфологическим проявлениям острого гнойного периодонтита относятся …",
            "rA": [
                "воспалительная гиперемия верхушечного периодонта",
                "отек верхушечного периодонта",
                "массивная лейкоцитарная инфильтрация верхушечного периодонта"
            ],
            "wA": [
                "деструкция тканей костной лунки челюсти"
            ]
        },
        {
            "qID": 468,
            "qName": "К клинико-морфологическим формам хронического периапикального периодонтита относятся …",
            "rA": [
                "гранулематозный периодонтит",
                "фиброзный периодонтит",
                "гранулирующий периодонтит"
            ],
            "wA": [
                "серозный периодонтит",
                "гнойный периодонтит"
            ]
        },
        {
            "qID": 469,
            "qName": "Для хронического гранулирующего периодонтита характерно …",
            "rA": [
                "разрастание грануляционной ткани в области верхушки зуба"
            ],
            "wA": [
                "гнойная деструкция костной ткани зубной лунки",
                "гнойное расплавление тканей верхушечного периодонта",
                "формирование гранулем в области верхушки зуба"
            ]
        },
        {
            "qID": 470,
            "qName": "Для хронического гранулематозного периодонтита характерно …",
            "rA": [
                "формирование гранулем в области верхушки зуба"
            ],
            "wA": [
                "гнойная деструкция костной ткани зубной лунки",
                "гнойное расплавление тканей верхушечного периодонта",
                "разрастание грануляционной ткани в области верхушки зуба"
            ]
        },
        {
            "qID": 471,
            "qName": "Виды гранулем при хроническом гранулематозном периодонтите …",
            "rA": [
                "простая",
                "эпителиальная",
                "кистогранулема"
            ],
            "wA": [
                "воспалительная",
                "фиброзирующая"
            ]
        },
        {
            "qID": 472,
            "qName": "Для простой гранулемы периодонта характерно …",
            "rA": [
                "наличие островка грануляционной ткани, окруженного фиброзной капсулой"
            ],
            "wA": [
                "образование полости, выстланной многослойным плоским эпителием",
                "наличие островка грануляционной ткани, пронизанной тяжами многослойного плоского эпителия"
            ]
        },
        {
            "qID": 473,
            "qName": "Для сложной (эпителиальной) гранулемы периодонта характерно …",
            "rA": [
                "наличие островка грануляционной ткани, пронизанной тяжами многослойного плоского эпителия"
            ],
            "wA": [
                "образование полости, выстланной многослойным плоским эпителием",
                "наличие островка грануляционной ткани, окруженного фиброзной капсулой"
            ]
        },
        {
            "qID": 474,
            "qName": "Для кистогранулемы периодонта характерно …",
            "rA": [
                "образование полости, выстланной многослойным плоским эпителием"
            ],
            "wA": [
                "наличие островка грануляционной ткани, окруженного фиброзной капсулой",
                "наличие островка грануляционной ткани, пронизанной тяжами многослойного плоского эпителия"
            ]
        },
        {
            "qID": 475,
            "qName": "К осложнениям периапикального периодонтита относятся …",
            "rA": [
                "периостит челюсти",
                "остеомиелит челюсти",
                "регионарный лимфаденит",
                "одонтогенный гайморит"
            ],
            "wA": [
                "патологические переломы челюсти"
            ]
        },
        {
            "qID": 476,
            "qName": "К некариозным поражениям зубов относятся …",
            "rA": [
                "кислотный некроз зубов",
                "флюороз",
                "клиновидные дефекты"
            ],
            "wA": [
                "десмодонтоз",
                "эпулис"
            ]
        },
        {
            "qID": 477,
            "qName": "Развитие флюороза связано с избыточным поступлением в организм …",
            "rA": [
                "фтора"
            ],
            "wA": [
                "фосфора",
                "кальция",
                "натрия",
                "йода"
            ]
        },
        {
            "qID": 478,
            "qName": "Для второй степени одонтопатии при флюорозе характерно …",
            "rA": [
                "наличие пятен, занимающих до половины поверхности эмали"
            ],
            "wA": [
                "наличие пятен, занимающих более половины поверхности эмали",
                "наличие эрозий эмали"
            ]
        },
        {
            "qID": 479,
            "qName": "Для третьей степени одонтопатии при флюорозе характерно …",
            "rA": [
                "наличие пятен, занимающих более половины поверхности эмали"
            ],
            "wA": [
                "наличие пятен, занимающих до половины поверхности эмали",
                "наличие эрозий эмали"
            ]
        },
        {
            "qID": 480,
            "qName": "Главным признаком четвертой степени одонтопатии при флюорозе является …",
            "rA": [
                "наличие эрозий эмали"
            ],
            "wA": [
                "наличие пятен, занимающих до половины поверхности эмали",
                "наличие пятен, занимающих более половины поверхности эмали"
            ]
        },
        {
            "qID": 481,
            "qName": "К пародонтопатиям относятся …",
            "rA": [
                "пародонтоз",
                "эпулис",
                "гингивит"
            ],
            "wA": [
                "пульпит",
                "остеомиелит челюсти"
            ]
        },
        {
            "qID": 482,
            "qName": "Местными факторами риска развития пародонтопатий являются …",
            "rA": [
                "аномалии прикуса",
                "дефекты протезирования",
                "недостаточный уход за полостью рта"
            ],
            "wA": [
                "недостаток в организме фтора",
                "авитаминоз С"
            ]
        },
        {
            "qID": 483,
            "qName": "Общими факторами риска развития пародонтопатий являются …",
            "rA": [
                "сахарный диабет",
                "авитаминоз С"
            ],
            "wA": [
                "аномалии прикуса",
                "недостаточный уход за полостью рта",
                "дефекты протезирования"
            ]
        },
        {
            "qID": 484,
            "qName": "К неминерализованным зубным отложениям относятся …",
            "rA": [
                "зубной налет",
                "зубная бляшка"
            ],
            "wA": [
                "наддесневой зубной камень",
                "поддесневой зубной камень"
            ]
        },
        {
            "qID": 485,
            "qName": "К минерализованным зубным отложениям относятся …",
            "rA": [
                "наддесневой зубной камень",
                "поддесневой зубной камень"
            ],
            "wA": [
                "зубной налет",
                "зубная бляшка"
            ]
        },
        {
            "qID": 486,
            "qName": "Гингивитом называется …",
            "rA": [
                "воспалительное заболевание десны без нарушения целостности зубодесневого соединения"
            ],
            "wA": [
                "воспалительное заболевание десны с нарушением целостности зубодесневого соединения",
                "воспаление тканей пародонта с их прогрессирующей деструкцией",
                "дистрофические изменения в тканях пародонта без предшествующего воспаления",
                "опухолевидное поражения пародонта"
            ]
        },
        {
            "qID": 487,
            "qName": "Пародонтитом называется …",
            "rA": [
                "воспаление тканей пародонта с их прогрессирующей деструкцией"
            ],
            "wA": [
                "воспалительное заболевание десны без нарушения целостности зубодесневого соединения",
                "воспалительное заболевание десны с нарушением целостности зубодесневого соединения",
                "дистрофические изменения в тканях пародонта без предшествующего воспаления",
                "опухолевидные поражения пародонта"
            ]
        },
        {
            "qID": 488,
            "qName": "Пародонтозом называются …",
            "rA": [
                "дистрофические изменения в тканях пародонта без предшествующего воспаления"
            ],
            "wA": [
                "воспалительное заболевание десны без нарушения целостности зубодесневого соединения",
                "воспалительное заболевание десны с нарушением целостности зубодесневого соединения",
                "воспаление тканей пародонта с их прогрессирующей деструкцией",
                "опухолевидные поражения пародонта"
            ]
        },
        {
            "qID": 489,
            "qName": "Диагностическими признаками гингивита являются …",
            "rA": [
                "кровоточивость десны",
                "положительная проба Шиллера-Писарева"
            ],
            "wA": [
                "альвеолярная пиорея",
                "болезненность при надавливании на зуб",
                "деструкция межзубных перегородок на рентгенограмме челюсти"
            ]
        },
        {
            "qID": 490,
            "qName": "К клинико-морфологическим формам гингивита относятся …",
            "rA": [
                "катаральный",
                "язвенный",
                "гипертрофический"
            ],
            "wA": [
                "серозный",
                "гнойный"
            ]
        },
        {
            "qID": 491,
            "qName": "Характерные морфологические признаки язвенного гингивита …",
            "rA": [
                "поверхность десны покрыта фибринозным налетом",
                "часто сопровождается регионарным лимфаденитом"
            ],
            "wA": [
                "десна гладкая, блестящая, гиперемированная",
                "десна утолщена, плотная, синюшная"
            ]
        },
        {
            "qID": 492,
            "qName": "Характерные морфологические признаки гипертрофического гингивита …",
            "rA": [
                "десна утолщена, гладкая, блестящая",
                "десневые сосочки увеличены в размерах, набухшие"
            ],
            "wA": [
                "множественные кровоизлияния и эрозии в десне",
                "целостность зубодесневого соединения нарушена"
            ]
        },
        {
            "qID": 493,
            "qName": "Диагностические критерии пародонтита …",
            "rA": [
                "формирование зубодесневых карманов",
                "формирование пародонтальных карманов",
                "деструкция межзубных перегородок на рентгенограмме челюсти",
                "расшатывание и выпадение зубов"
            ],
            "wA": [
                "целостность зубодесневого соединения не нарушена"
            ]
        },
        {
            "qID": 494,
            "qName": "Характеристика пародонтального кармана …",
            "rA": [
                "заполняется остатками пищевых масс, микроорганизмами, слущенным эпителием",
                "при обострении может наблюдаться выделение гноя",
                "формируется в результате деструкции периодонтальной связки"
            ],
            "wA": [
                "формируется в результате атрофических изменений десны",
                "формируется в результате деструкции костной ткани челюсти"
            ]
        },
        {
            "qID": 495,
            "qName": "Критерии первой (легкой) степени тяжести пародонтита …",
            "rA": [
                "зубы неподвижны",
                "убыль костных краев зубной лунки не более трети величины корня зуба"
            ],
            "wA": [
                "глубина пародонтального кармана от 3,5 до 5 мм",
                "убыль костных краев зубной лунки не более четверти величины корня зуба"
            ]
        },
        {
            "qID": 496,
            "qName": "Критерии второй (среднетяжелой) степени тяжести пародонтита …",
            "rA": [
                "глубина пародонтального кармана от 3,5 до 5 мм",
                "убыль костных краев зубной лунки не более половины величины корня зуба"
            ],
            "wA": [
                "зубы неподвижны",
                "убыль костных краев зубной лунки не более трети величины корня зуба"
            ]
        },
        {
            "qID": 497,
            "qName": "Критерии третьей (тяжелой) степени тяжести пародонтита …",
            "rA": [
                "расшатывание и выпадение зубов",
                "убыль костных краев зубной лунки свыше половины величины корня зуба"
            ],
            "wA": [
                "глубина пародонтального кармана от 3,5 до 5 мм",
                "убыль костных краев зубной лунки не более половины величины корня зуба"
            ]
        },
        {
            "qID": 498,
            "qName": "Характерные признаки пародонтоза …",
            "rA": [
                "первичные изменения возникают в костной ткани челюсти",
                "воспалительные изменения в тканях пародонта отсутствуют",
                "сопровождается дистрофическими и деструктивными изменениями зубов"
            ],
            "wA": [
                "всегда начинается с острого или хронического гингивита",
                "сопровождается периоститом челюсти"
            ]
        },
        {
            "qID": 499,
            "qName": "Морфологические проявления пародонтоза …",
            "rA": [
                "истончение костных пластинок челюсти с расширением костно-мозговых пространств",
                "уплотнение и склероз тканей десны"
            ],
            "wA": [
                "секвестрация костной ткани челюсти",
                "отслоение надкостницы с формированием поднадкостничных абсцессов"
            ]
        },
        {
            "qID": 500,
            "qName": "К пародонтомам относятся …",
            "rA": [
                "пародонтальные кисты",
                "фиброматоз десен",
                "эпулисы"
            ],
            "wA": [
                "пародонтоз",
                "фиброзная дисплазия челюсти"
            ]
        },
        {
            "qID": 501,
            "qName": "Гистологические варианты эпулиса …",
            "rA": [
                "гигантоклеточный",
                "ангиоматозный",
                "фиброматозный"
            ],
            "wA": [
                "воспалительный",
                "диспластический"
            ]
        },
        {
            "qID": 502,
            "qName": "Для ангиоматозного эпулиса характерно …",
            "rA": [
                "формирование большого количества новообразованных сосудов"
            ],
            "wA": [
                "наличие выраженного фиброза",
                "появление гигантских многоядерных клеток типа остеокластов",
                "инвазивный рост в ткань челюсти"
            ]
        },
        {
            "qID": 503,
            "qName": "Для фиброматозного эпулиса характерно …",
            "rA": [
                "наличие выраженного фиброза"
            ],
            "wA": [
                "формирование большого количества новообразованных сосудов",
                "появление гигантских многоядерных клеток типа остеокластов",
                "инвазивный рост в ткань челюсти"
            ]
        },
        {
            "qID": 504,
            "qName": "Для гигантоклеточного эпулиса характерно …",
            "rA": [
                "появление гигантских многоядерных клеток типа остеокластов"
            ],
            "wA": [
                "наличие выраженного фиброза",
                "формирование большого количества новообразованных сосудов",
                "инвазивный рост в ткань челюсти"
            ]
        },
        {
            "qID": 505,
            "qName": "Характерные признаки герпетического стоматита …",
            "rA": [
                "склонность к рецидивированию",
                "персистенция вируса в нервных ганглиях",
                "часто сопровождается лимфаденитом"
            ],
            "wA": [
                "часто сопровождается конъюнктивитом"
            ]
        },
        {
            "qID": 506,
            "qName": "Преобладающий элемент сыпи при герпетическом стоматите - …",
            "rA": [
                "везикула"
            ],
            "wA": [
                "папула",
                "пустула",
                "розеола"
            ]
        },
        {
            "qID": 507,
            "qName": "К специфическим проявлениям ВИЧ-инфекции со стороны полости рта относятся …",
            "rA": [
                "саркома Капоши",
                "волосовидная лейкоплакия"
            ],
            "wA": [
                "«ангина» Людвига",
                "язвенно-некротический гингивостоматит Венсана",
                "гунтеровский глоссит"
            ]
        },
        {
            "qID": 508,
            "qName": "Специфические инфекционные стоматиты возможны при таких инфекциях, как …",
            "rA": [
                "туберкулез",
                "сифилис"
            ],
            "wA": [
                "герпес",
                "скарлатина"
            ]
        },
        {
            "qID": 509,
            "qName": "Клинико-морфологические проявления простого кандидоза (молочницы) слизистой оболочки полости рта - …",
            "rA": [
                "слизистая оболочка гиперемирована",
                "на поверхности слизистой оболочки рыхлый белесоватый налет"
            ],
            "wA": [
                "на поверхности слизистой оболочки множественные эрозии и язвы",
                "на поверхности слизистой оболочки множественные пузырьки с серозным содержимым"
            ]
        },
        {
            "qID": 510,
            "qName": "К поражениям слизистой оболочки полости рта токсико-аллергического характера относятся …",
            "rA": [
                "синдром Лайелла",
                "синдром Стивенса-Джонсона",
                "полиморфная экссудативная эритема"
            ],
            "wA": [
                "синдром Шегрена",
                "синдром Микулича"
            ]
        },
        {
            "qID": 511,
            "qName": "Клинико-морфологические проявления полиморфной экссудативной эритемы …",
            "rA": [
                "сыпь представлена разнообразим элементов",
                "сопровождается выраженными общими проявлениями",
                "микроскопически – гидропическая дистрофия эпителиоцитов и межклеточный отек"
            ],
            "wA": [
                "элементы сыпи всегда однообразны и представлены папулами",
                "элементы сыпи всегда однообразны и представлены везикулами"
            ]
        },
        {
            "qID": 512,
            "qName": "Клинико-морфологические проявления синдрома Лайелла …",
            "rA": [
                "является наиболее тяжелой формой токсико-аллергического поражения",
                "возникает при опосредованном действии аллергена",
                "характеризуется массивной отслойкой эпителия"
            ],
            "wA": [
                "возникает только при прямом контактном действии аллергена",
                "характеризуется специфическим гранулематозным поражением"
            ]
        },
        {
            "qID": 513,
            "qName": "Для афтозного стоматита характерны следующие признаки …",
            "rA": [
                "аутоиммунный компонент патогенеза",
                "проявляется поверхностными изъязвлениями слизистой оболочки"
            ],
            "wA": [
                "токсико-аллергический компонент патогенеза",
                "проявляется папулезно-везикулезными высыпаниями"
            ]
        },
        {
            "qID": 514,
            "qName": "К предраковым заболевания для слизистой оболочки полости рта относятся …",
            "rA": [
                "лейкоплакия",
                "папилломатоз",
                "постлучевой стоматит"
            ],
            "wA": [
                "афтозный стоматит"
            ]
        },
        {
            "qID": 515,
            "qName": "К предраковым заболеваниям для красной каймы губ относятся …",
            "rA": [
                "хейлит Манганотти",
                "лейкоплакия"
            ],
            "wA": [
                "кандидозный хейлит",
                "герпетический хейлит"
            ]
        },
        {
            "qID": 516,
            "qName": "Формирование очагов патологического ороговения слизистой оболочки полости рта с воспалительной субэпителиальной инфильтрацией – это …",
            "rA": [
                "лейкоплакия"
            ],
            "wA": [
                "афтозный стоматит",
                "папилломатоз",
                "ксеростомия"
            ]
        },
        {
            "qID": 517,
            "qName": "Характерные признаки хейлита Манганотти …",
            "rA": [
                "поражает обычно нижнюю губу",
                "представлен эрозивным поражением с формированием корок"
            ],
            "wA": [
                "представлен множественными пузырьками с геморрагическим содержимым",
                "представлен очагами патологического ороговения эпителия"
            ]
        },
        {
            "qID": 518,
            "qName": "Рак слизистой оболочки полости рта и нижней губы чаще представлен …",
            "rA": [
                "плоскоклеточным раком"
            ],
            "wA": [
                "железистым раком (аденокарциномой)",
                "базальноклеточным раком",
                "слизистым раком"
            ]
        },
        {
            "qID": 519,
            "qName": "Рак кожи лица чаще представлен …",
            "rA": [
                "базальноклеточным раком"
            ],
            "wA": [
                "железистым раком (аденокарциномой)",
                "плоскоклеточным раком",
                "слизистым раком"
            ]
        },
        {
            "qID": 520,
            "qName": "Возможные пути лимфогенного метастазирования для рака нижней губы …",
            "rA": [
                "глубокие шейные лимфоузлы",
                "надключичные лимфоузлы"
            ],
            "wA": [
                "забрюшинные лимфоузлы",
                "затылочные лимфоузлы"
            ]
        },
        {
            "qID": 521,
            "qName": "К воспалительным заболеваниям челюстей относятся …",
            "rA": [
                "периостит",
                "остеомиелит"
            ],
            "wA": [
                "периодонтит",
                "пародонтоз",
                "десмодонтоз"
            ]
        },
        {
            "qID": 522,
            "qName": "Воспаление надкостницы – это …",
            "rA": [
                "периостит"
            ],
            "wA": [
                "пародонтит",
                "периодонтит",
                "остит",
                "остеомиелит"
            ]
        },
        {
            "qID": 523,
            "qName": "Сочетанное воспаление костной ткани и костного мозга – это …",
            "rA": [
                "остеомиелит"
            ],
            "wA": [
                "пародонтит",
                "периодонтит",
                "периостит",
                "остит"
            ]
        },
        {
            "qID": 524,
            "qName": "К клинико-морфологическим формам острого периостита относятся …",
            "rA": [
                "серозный",
                "очаговый гнойный",
                "диффузный гнойный"
            ],
            "wA": [
                "гранулематозный",
                "геморрагический"
            ]
        },
        {
            "qID": 525,
            "qName": "К клинико-морфологическим формам хронического периостита относятся …",
            "rA": [
                "фиброзный",
                "оссифицирующий"
            ],
            "wA": [
                "гранулематозный",
                "серозный",
                "гнойный"
            ]
        },
        {
            "qID": 526,
            "qName": "Основные причины развития острого периостита - …",
            "rA": [
                "осложнение острого периодонтита",
                "обострение хронического периодонтита",
                "нагноение челюстных кист"
            ],
            "wA": [
                "пародонтоз тяжелой степени"
            ]
        },
        {
            "qID": 527,
            "qName": "Патоморфологическая картина острого серозного периостита - …",
            "rA": [
                "гиперемия и отек со слабой лейкоцитарной инфильтрацией"
            ],
            "wA": [
                "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти",
                "распространение лейкоцитарного инфильтрата на периост тела челюсти",
                "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью",
                "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
            ]
        },
        {
            "qID": 528,
            "qName": "Патоморфологическая картина очагового гнойного периостита - …",
            "rA": [
                "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти"
            ],
            "wA": [
                "гиперемия и отек со слабой лейкоцитарной инфильтрацией",
                "распространение лейкоцитарного инфильтрата на периост тела челюсти",
                "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью",
                "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
            ]
        },
        {
            "qID": 529,
            "qName": "Патоморфологическая картина диффузного гнойного периостита - …",
            "rA": [
                "распространение лейкоцитарного инфильтрата на периост тела челюсти"
            ],
            "wA": [
                "гиперемия и отек со слабой лейкоцитарной инфильтрацией",
                "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти",
                "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью",
                "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
            ]
        },
        {
            "qID": 530,
            "qName": "Патоморфологическая картина хронического фиброзного периостита - …",
            "rA": [
                "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью"
            ],
            "wA": [
                "гиперемия и отек со слабой лейкоцитарной инфильтрацией",
                "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти",
                "распространение лейкоцитарного инфильтрата на периост тела челюсти",
                "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
            ]
        },
        {
            "qID": 531,
            "qName": "Патоморфологическая картина хронического оссифицирующего периостита - …",
            "rA": [
                "диффузное продуктивное воспаление с замещением периоста пластинчатой костной тканью"
            ],
            "wA": [
                "гиперемия и отек со слабой лейкоцитарной инфильтрацией",
                "массивная лейкоцитарная инфильтрация периоста альвеолярного отростка челюсти",
                "распространение лейкоцитарного инфильтрата на периост тела челюсти",
                "продуктивное воспаление с замещением периоста грубоволокнистой соединительной тканью"
            ]
        },
        {
            "qID": 532,
            "qName": "Для острого остеомиелита челюсти характерны следующие признаки …",
            "rA": [
                "некроз костной ткани с образованием секвестров",
                "формирование гнойных свищей"
            ],
            "wA": [
                "постепенное расшатывание и выпадение зубов",
                "разрушение зубных корней"
            ]
        },
        {
            "qID": 533,
            "qName": "Факторы, способствующие развитию хронического остеомиелита …",
            "rA": [
                "сенсибилизация бактериальными антигенами",
                "снижение общей резистентности организма",
                "несанированные очаги одонтогенной инфекции"
            ],
            "wA": [
                "недостаточная реминерализующая активность слюны"
            ]
        },
        {
            "qID": 534,
            "qName": "Осложнения острого остеомиелита челюсти - …",
            "rA": [
                "свищи и флегмоны мягких тканей лица и шеи",
                "одонтогенный сепсис",
                "лимфадениты"
            ],
            "wA": [
                "быстропрогрессирующий пародонтоз"
            ]
        },
        {
            "qID": 535,
            "qName": "Осложнения хронического остеомиелита челюсти - …",
            "rA": [
                "лимфадениты",
                "амилоидоз внутренних органов",
                "патологические переломы челюсти"
            ],
            "wA": [
                "жировая эмболия"
            ]
        },
        {
            "qID": 536,
            "qName": "К проявлениям одонтогенной инфекции относятся …",
            "rA": [
                "периостит челюсти",
                "остеомиелит челюсти",
                "лимфадениты челюстно-лицевой области",
                "абсцессы и флегмоны челюстно-лицевой области"
            ],
            "wA": [
                "гингивиты"
            ]
        },
        {
            "qID": 537,
            "qName": "Осложнения одонтогенной инфекции …",
            "rA": [
                "тромбоз синусов твердой мозговой оболочки",
                "гнойный менингит",
                "гнойный медиастинит"
            ],
            "wA": [
                "жировая эмболия"
            ]
        },
        {
            "qID": 538,
            "qName": "Основные особенности сепсиса …",
            "rA": [
                "полиэтиологичен",
                "не заразен",
                "не формируется иммунный ответ"
            ],
            "wA": [
                "имеет строго циклическое течение",
                "обязательно сопровождается бактериемией"
            ]
        },
        {
            "qID": 539,
            "qName": "Клинико-морфологическими формами сепсиса являются …",
            "rA": [
                "инфекционный эндокардит",
                "септицемия",
                "септикопиемия"
            ],
            "wA": [
                "инфекционный миокардит",
                "бактериемия"
            ]
        },
        {
            "qID": 540,
            "qName": "Общие изменения при сепсисе представлены …",
            "rA": [
                "дистрофией и межуточным воспалением паренхиматозных органов",
                "васкулитами",
                "гиперплазией лимфоидной и кроветворной тканей"
            ],
            "wA": [
                "инфекционным эндокардитом",
                "тромбофлебитом в области септического очага"
            ]
        },
        {
            "qID": 541,
            "qName": "Характерными признаками септицемии являются …",
            "rA": [
                "выраженная гиперергическая реакция",
                "острое или молниеносное течение",
                "общие изменения преобладают над местными"
            ],
            "wA": [
                "множественные метастатические абсцессы внутренних органов",
                "тромбобактериальная эмболия"
            ]
        },
        {
            "qID": 542,
            "qName": "Характерными признаками септикопиемии являются …",
            "rA": [
                "множественные метастатические абсцессы внутренних органов",
                "тромбобактериальная эмболия"
            ],
            "wA": [
                "выраженная гиперергическая реакция",
                "острое или молниеносное течение",
                "общие изменения преобладают над местными"
            ]
        },
        {
            "qID": 543,
            "qName": "Морфологическая картина септического эндокардита характеризуется … эндокардитом",
            "rA": [
                "полипозно-язвенным"
            ],
            "wA": [
                "возвратно-бородавчатым",
                "фибропластическим",
                "флегмонозно-язвенным"
            ]
        },
        {
            "qID": 544,
            "qName": "К одонтогенным кистам челюстей относятся …",
            "rA": [
                "радикулярная киста",
                "фолликулярная киста"
            ],
            "wA": [
                "глобуломаксиллярная киста",
                "киста резцового канала"
            ]
        },
        {
            "qID": 545,
            "qName": "К неодонтогенным кистам челюстей относятся …",
            "rA": [
                "глобуломаксиллярная киста",
                "киста резцового канала"
            ],
            "wA": [
                "радикулярная киста",
                "фолликулярная киста"
            ]
        },
        {
            "qID": 546,
            "qName": "Клинико-морфологические признаки радикулярной кисты …",
            "rA": [
                "встречается гораздо чаще других челюстных кист",
                "имеет воспалительное происхождение",
                "стенка выстлана многослойным плоским эпителием"
            ],
            "wA": [
                "имеет дизонтогенетическое происхождение"
            ]
        },
        {
            "qID": 547,
            "qName": "Морфологические проявления радикулярной кисты …",
            "rA": [
                "толщина фиброзной стенки зависит от активности воспаления",
                "стенка выстлана многослойным плоским эпителием",
                "эпителий формирует сетевидные отростки погружного роста"
            ],
            "wA": [
                "стенка выстлана одонтогенным эпителием"
            ]
        },
        {
            "qID": 548,
            "qName": "Морфологические проявления фолликулярной кисты …",
            "rA": [
                "эпителиальная выстилка тонкая – в 2-3 слоя клеток",
                "в просвете может содержать зачатки зубов",
                "в выстилке встречаются островки одонтогенного эпителия"
            ],
            "wA": [
                "эпителиальная выстилка толстая с элементами погружного роста"
            ]
        },
        {
            "qID": 549,
            "qName": "Клинико-морфологические признаки первичной кисты (кератокисты) …",
            "rA": [
                "внутренняя поверхность выстлана многослойным плоским эпителием",
                "может распространяться по длиннику челюсти",
                "имеет дизонтогенетическое происхождение"
            ],
            "wA": [
                "имеет воспалительное происхождение",
                "встречается гораздо чаще других челюстных кист"
            ]
        },
        {
            "qID": 550,
            "qName": "К общим признакам одонтогенных опухолей челюсти относятся …",
            "rA": [
                "чаще являются доброкачественными",
                "рост преимущественно местнодеструирующий",
                "носят органоспецифический характер"
            ],
            "wA": [
                "чаще являются злокачественными"
            ]
        },
        {
            "qID": 551,
            "qName": "К одонтогенным опухолям челюстей относятся …",
            "rA": [
                "амелобластома",
                "первичная внутрикостная карцинома",
                "цементома"
            ],
            "wA": [
                "гигантоклеточная опухоль (остеобластокластома)",
                "остеосаркома челюсти"
            ]
        },
        {
            "qID": 552,
            "qName": "К одонтогенным эпителиальным опухолям относятся …",
            "rA": [
                "амелобластома",
                "первичная карцинома челюсти"
            ],
            "wA": [
                "цементома",
                "дентинома",
                "одонтогенная саркома"
            ]
        },
        {
            "qID": 553,
            "qName": "К одонтогенным мезенхимальным опухолям относятся …",
            "rA": [
                "цементома",
                "дентинома",
                "одонтогенная саркома"
            ],
            "wA": [
                "амелобластома",
                "первичная карцинома челюсти"
            ]
        },
        {
            "qID": 554,
            "qName": "Клинико-морфологические признаки амелобластомы …",
            "rA": [
                "доброкачественная одонтогенная опухоль",
                "чаще поражает нижнюю челюсть",
                "построена из островков одонтогенного эпителия"
            ],
            "wA": [
                "злокачественная одонтогенная опухоль",
                "построена из одонтогенной мезенхимы"
            ]
        },
        {
            "qID": 555,
            "qName": "Клинико-морфологические признаки дентиномы …",
            "rA": [
                "доброкачественная одонтогенная опухоль",
                "развивается из одонтогенной мезенхимы"
            ],
            "wA": [
                "злокачественная одонтогенная опухоль",
                "развивается из одонтогенного эпителия"
            ]
        },
        {
            "qID": 556,
            "qName": "К неодонтогенным опухолям челюстей относятся …",
            "rA": [
                "остеома",
                "гигантоклеточная опухоль (остеобластокластома)"
            ],
            "wA": [
                "амелобластома",
                "дентинома"
            ]
        },
        {
            "qID": 557,
            "qName": "Остеома челюсти – это …",
            "rA": [
                "доброкачественная неодонтогенная опухоль"
            ],
            "wA": [
                "доброкачественная одонтогенная опухоль",
                "злокачественная одонтогенная опухоль",
                "злокачественная неодонтогенная опухоль"
            ]
        },
        {
            "qID": 558,
            "qName": "Остеобластокластома (гигантоклеточная опухоль) – это …",
            "rA": [
                "неодонтогенная опухоль челюсти"
            ],
            "wA": [
                "доброкачественная одонтогенная опухоль челюсти",
                "злокачественная одонтогенная опухоль челюсти",
                "разновидность фиброзной дисплазии челюсти"
            ]
        },
        {
            "qID": 559,
            "qName": "Для фиброзной дисплазии челюстей характерны следующие признаки …",
            "rA": [
                "чаще поражает верхнюю челюсть",
                "вызывает выраженную деформацию лица",
                "характеризуется разрастанием примитивной костно-волокнистой ткани"
            ],
            "wA": [
                "чаще поражает нижнюю челюсть",
                "характеризуется избыточным окостенением челюстей"
            ]
        },
        {
            "qID": 560,
            "qName": "Херувизм – это …",
            "rA": [
                "разновидность фиброзной дисплазии челюсти"
            ],
            "wA": [
                "доброкачественная одонтогенная опухоль челюсти",
                "злокачественная одонтогенная опухоль челюсти",
                "неодонтогенная опухоль челюсти"
            ]
        },
        {
            "qID": 561,
            "qName": "Сиаладенит – это воспаление … слюнной железы",
            "rA": [
                "любой"
            ],
            "wA": [
                "околоушной",
                "подъязычной",
                "подчелюстной"
            ]
        },
        {
            "qID": 562,
            "qName": "Паротит – это воспаление … слюнной железы",
            "rA": [
                "околоушной"
            ],
            "wA": [
                "подъязычной",
                "подчелюстной",
                "любой"
            ]
        },
        {
            "qID": 563,
            "qName": "К путям попадания инфекта в слюнные железы относятся …",
            "rA": [
                "интрадуктальный",
                "гематогенный",
                "лимфогенный"
            ],
            "wA": [
                "одонтогенный"
            ]
        },
        {
            "qID": 564,
            "qName": "Особенности эпидемического паротита …",
            "rA": [
                "воздушно-капельный тип передачи",
                "интерстициальный характер воспаления",
                "возможно поражение поджелудочной железы, яичек"
            ],
            "wA": [
                "алиментарный тип передачи",
                "поражение всегда одностороннее"
            ]
        },
        {
            "qID": 565,
            "qName": "К возможным осложнениям острого бактериального сиаладенита относятся …",
            "rA": [
                "аррозионные кровотечения",
                "свищи и флегмоны окружающих мягких тканей",
                "абсцесс слюнной железы"
            ],
            "wA": [
                "одонтогенный сепсис"
            ]
        },
        {
            "qID": 566,
            "qName": "Выберите морфологические формы хронического бактериального сиаладенита …",
            "rA": [
                "межуточный продуктивный",
                "протоковый"
            ],
            "wA": [
                "паренхиматозный",
                "цирротический"
            ]
        },
        {
            "qID": 567,
            "qName": "Последствиями хронического сиаладенита могут являться …",
            "rA": [
                "цирроз слюнной железы",
                "опухоли слюнной железы",
                "кисты слюнной железы",
                "слюнокаменная болезнь (сиалолитиаз)"
            ],
            "wA": []
        },
        {
            "qID": 568,
            "qName": "Слюнокаменная болезнь чаще всего поражает … слюнную железу",
            "rA": [
                "подчелюстную"
            ],
            "wA": [
                "околоушную",
                "подъязычную"
            ]
        },
        {
            "qID": 569,
            "qName": "К факторам камнеобразования в слюнной железе относятся …",
            "rA": [
                "дискинезия протоковой системы",
                "органические расстройства проходимости протоков",
                "хронические воспаление",
                "изменение состава слюны"
            ],
            "wA": [
                "одонтогенная инфекция"
            ]
        },
        {
            "qID": 570,
            "qName": "Укажите возможные осложнения слюнокаменной болезни …",
            "rA": [
                "кисты слюнной железы",
                "цирроз слюнной железы",
                "ксеростомия"
            ],
            "wA": [
                "эпидемический паротит"
            ]
        },
        {
            "qID": 571,
            "qName": "Заболевание, сопровождающееся сочетанным аутоиммунным поражением слюнных, слезных желез и суставов – это …",
            "rA": [
                "болезнь Шегрена"
            ],
            "wA": [
                "болезнь Хашимото",
                "болезнь Бехтерева",
                "болезнь Микулича"
            ]
        },
        {
            "qID": 572,
            "qName": "Основными проявлениями болезни Шегрена являются …",
            "rA": [
                "ксеростомия",
                "ксерофтальмия",
                "полиартрит"
            ],
            "wA": [
                "сиалолитиаз",
                "атрофический гастрит"
            ]
        },
        {
            "qID": 573,
            "qName": "Морфологические изменения слюнной железы при болезни Шегрена …",
            "rA": [
                "массивная миграция в железу активированных лимфоцитов",
                "деструкция паренхиматозных элементов",
                "разрастание соединительной ткани"
            ],
            "wA": [
                "диффузная инфильтрация стромы нейтрофильными лейкоцитами"
            ]
        },
        {
            "qID": 574,
            "qName": "К доброкачественным эпителиальным опухолям (аденомам) слюнных желез относятся …",
            "rA": [
                "смешанная опухоль",
                "опухоль Уортина"
            ],
            "wA": [
                "мукоэпидермоидная опухоль",
                "аденокистозная опухоль",
                "ациноклеточная опухоль"
            ]
        },
        {
            "qID": 575,
            "qName": "К злокачественным эпителиальным опухолям (карциномам) слюнных желез относятся …",
            "rA": [
                "мукоэпидермоидная опухоль",
                "аденокистозная опухоль",
                "ациноклеточная опухоль"
            ],
            "wA": [
                "смешанная опухоль",
                "опухоль Уортина"
            ]
        },
        {
            "qID": 576,
            "qName": "Самая частая опухоль слюнных желез - …",
            "rA": [
                "плеоморфная аденома (смешанная опухоль)"
            ],
            "wA": [
                "мономорфная аденома",
                "мукоэпидермоидная карцинома",
                "цилиндрома"
            ]
        },
        {
            "qID": 577,
            "qName": "Плеоморфная аденома (смешанная опухоль) чаще всего поражает … слюнные железы",
            "rA": [
                "околоушные"
            ],
            "wA": [
                "малые",
                "подъязычные",
                "подчелюстные"
            ]
        },
        {
            "qID": 578,
            "qName": "Плеоморфную аденому (смешанную опухоль) слюнной железы характеризуют …",
            "rA": [
                "экспансивный рост",
                "частая локализация в околоушной железе",
                "гистологическая гетерогенность",
                "склонность к рецидивированию"
            ],
            "wA": [
                "инвазивный рост"
            ]
        },
        {
            "qID": 579,
            "qName": "Гистологические компоненты плеоморфной аденомы (смешанной опухоли) слюнной железы - …",
            "rA": [
                "эпителиальный",
                "мукоидный",
                "хондроидный"
            ],
            "wA": [
                "остеоидный",
                "одонтогенный"
            ]
        },
        {
            "qID": 580,
            "qName": "Опухоль слюнной железы, построенная из железистых и кистозных структур, между которыми располагаются лимфоидные фолликулы – это …",
            "rA": [
                "аденолимфома (опухоль Уортина)"
            ],
            "wA": [
                "плеоморфная аденома",
                "миоэпителиома",
                "базальноклеточная аденома"
            ]
        },
        {
            "qID": 581,
            "qName": "Самой распространенной злокачественной опухолью слюнных желез является …",
            "rA": [
                "мукоэпидермоидная опухоль"
            ],
            "wA": [
                "смешанная опухоль",
                "ациноклеточная опухоль",
                "аденокистозная опухоль"
            ]
        },
        {
            "qID": 582,
            "qName": "Мукоэпидермоидный рак чаще всего поражает … слюнные железы",
            "rA": [
                "околоушные"
            ],
            "wA": [
                "малые",
                "подъязычные",
                "подчелюстные"
            ]
        },
        {
            "qID": 583,
            "qName": "Клинико-морфологические признаки мукоэпидермоидного рака …",
            "rA": [
                "инвазивный рост",
                "клеточный полиморфизм слабо выражен",
                "чаще поражаются околоушные железы",
                "гистологическая гетерогенность"
            ],
            "wA": [
                "экспансивный рост"
            ]
        },
        {
            "qID": 584,
            "qName": "Основные популяции опухолевых клеток в мукоэпидермоидном раке …",
            "rA": [
                "эпидермоидные",
                "мукоидные (слизьпродуцирующие)",
                "промежуточные"
            ],
            "wA": [
                "хондроидные",
                "базальные"
            ]
        },
        {
            "qID": 585,
            "qName": "Клинико-морфологические признаки аденокистозного рака слюнных желез …",
            "rA": [
                "часто поражает малые слюнные железы",
                "характерна инвазия по ходу нервных волокон",
                "признаки клеточного атипизма выражены слабо"
            ],
            "wA": [
                "часто поражает подчелюстные слюнные железы",
                "экспансивный рост"
            ]
        },
        {
            "qID": 586,
            "qName": "Клинико-морфологические признаки ациноклеточного рака слюнных желез - …",
            "rA": [
                "часто поражает околоушные слюнные железы",
                "построен из клеток, напоминающих серозные клетки ацинусов"
            ],
            "wA": [
                "часто поражает малые слюнные железы",
                "характерна инвазия по ходу нервных волокон"
            ]
        },
        {
            "qID": 587,
            "qName": "К кистам шеи специфической локализации относятся …",
            "rA": [
                "боковая киста",
                "срединная киста"
            ],
            "wA": [
                "эпидермальная киста",
                "дермоидная киста",
                "киста сальной железы"
            ]
        },
        {
            "qID": 588,
            "qName": "К кистам шеи неспецифической локализации относятся …",
            "rA": [
                "эпидермальная киста",
                "дермоидная киста",
                "киста сальной железы"
            ],
            "wA": [
                "боковая киста",
                "срединная киста"
            ]
        },
        {
            "qID": 589,
            "qName": "Признаки эпидермальной кисты …",
            "rA": [
                "стенка образована соединительной тканью",
                "выстлана многослойным плоским ороговевающим эпителием",
                "в просвете содержит роговые массы"
            ],
            "wA": [
                "эпителиальной выстилки не имеет",
                "выстлана однослойным призматическим эпителием"
            ]
        },
        {
            "qID": 590,
            "qName": "Признаки дермоидной кисты …",
            "rA": [
                "стенка образована соединительной тканью",
                "в толще стенки имеются придатки кожи",
                "выстлана многослойным плоским ороговевающим эпителием",
                "в просвете содержит роговые массы, волосы, секрет сальных желез"
            ],
            "wA": [
                "выстлана однослойным призматическим эпителием"
            ]
        },
        {
            "qID": 591,
            "qName": "Если в толще стенки шейной кисты имеются островки ткани щитовидной железы, то это … киста",
            "rA": [
                "срединная"
            ],
            "wA": [
                "эпидермальная",
                "дермоидная",
                "боковая"
            ]
        },
        {
            "qID": 592,
            "qName": "Если в толще стенки шейной кисты имеются островки лимфоидной ткани, то это … киста",
            "rA": [
                "боковая"
            ],
            "wA": [
                "эпидермальная",
                "дермоидная",
                "срединная"
            ]
        },
        {
            "qID": 593,
            "qName": "Осложнения шейных кист …",
            "rA": [
                "нагноение",
                "сдавление прилежащих органов"
            ],
            "wA": [
                "инвазия в окружающие ткани"
            ]
        },
        {
            "qID": 594,
            "qName": "Увеличение лимфоузла может быть следствием следующих патологических процессов …",
            "rA": [
                "реактивной гиперплазии",
                "лимфаденита",
                "опухоли",
                "метастазирования"
            ],
            "wA": []
        },
        {
            "qID": 595,
            "qName": "Характерные изменения лимфоузлов в терминальной стадии ВИЧ-инфекции (стадия СПИДа) …",
            "rA": [
                "диффузная атрофия",
                "диффузный фиброз",
                "уменьшение числа и размеров фолликулов"
            ],
            "wA": [
                "резко выраженная гиперплазия",
                "массивная инфильтрация лейкоцитами"
            ]
        },
        {
            "qID": 596,
            "qName": "Для острого одонтогенного лимфаденита характерны следующие признаки …",
            "rA": [
                "увеличение в размерах лимфоузла",
                "болезненность лимфоузла"
            ],
            "wA": [
                "сморщивание лимфоузла",
                "диффузный склероз лимфоузла"
            ]
        },
        {
            "qID": 597,
            "qName": "При остром одонтогенном лимфадените воспаление может носить … характер",
            "rA": [
                "серозный",
                "гнойный"
            ],
            "wA": [
                "гранулематозный",
                "катаральный"
            ]
        },
        {
            "qID": 598,
            "qName": "Хронические специфические лимфадениты характерны для …",
            "rA": [
                "туберкулеза",
                "сифилиса"
            ],
            "wA": [
                "хронического периодонтита",
                "хронического сиаладенита"
            ]
        },
        {
            "qID": 599,
            "qName": "К особым формам лимфаденитов относится …",
            "rA": [
                "аденофлегмона"
            ],
            "wA": [
                "аденолимфома",
                "лимфогранулематоз",
                "лимфома Беркитта"
            ]
        },
        {
            "qID": 600,
            "qName": "Наиболее частое опухолевое поражение шейных лимфоузлов - …",
            "rA": [
                "лимфома Ходжкина (лимфогранулематоз)"
            ],
            "wA": [
                "лимфома Беркитта",
                "фолликулярная В-клеточная лимфома",
                "аденолимфома"
            ]
        }
    ]
  };
  var test = 0;
  var amountTest = 50;
  var iterGlobal = 0;
  var exit = 0;
  var key = [];
  var selected = [];
  var right = 0;
  var wrongAnswers = [];
  document.querySelector(".button").addEventListener("click", startQuiz);
  
  
  var oToday = new Date();
  
  function getDaysLeft(oDeadLineDate, oToday){
    return oDeadLineDate > oToday ? Math.ceil((oDeadLineDate - oToday) / (1000 * 60 * 60 * 24)) : null;
  }
  
  function MkDaysLeft(sDeadLineDate, sDeadLineText){
    var sTime = sDeadLineDate + " " + oToday.getHours() + ":" + oToday.getMinutes() + ":" + oToday.getSeconds();
    var oDeadLineDate = new Date(sTime);
    var nDaysLeft = getDaysLeft(oDeadLineDate, oToday);
    if (nDaysLeft){
      var sDaysLeft = String(nDaysLeft);
      var sDaysText = "дней";
      var nDaysLeftLength = sDaysLeft.length;
      if (sDaysLeft.charAt(nDaysLeftLength - 2) != "1"){
        if (sDaysLeft.charAt(nDaysLeftLength - 1) == "2" || sDaysLeft.charAt(nDaysLeftLength - 1) == "3" || sDaysLeft.charAt(nDaysLeftLength - 1) == "4") sDaysText = "дня";
        else if (sDaysLeft.charAt(nDaysLeftLength - 1) == "1") sDaysText = "день";
      }
      var sLeftText = sDaysText == "день" ? "остался" : "осталось";
      return sDeadLineText + " " + sLeftText + " " + nDaysLeft + " " + sDaysText + ".";
    }else return "СНАЧАЛА ЧАЙ, ПОТОМ ТЕСТЫ";
  }
  window.onload = function() {
  document.querySelector(".status-timer").innerHTML = MkDaysLeft("May 25, 2018", "До тестов");
  }
  
  
  function startQuiz() {
      document.querySelector(".status").style.display = "block";
      document.querySelector(".status-timer").style.display = "none";
      document.querySelector(".checkbox-wrapper").style.display = "none";
      var variant = document.querySelector('.select').selectedIndex;
      console.log(variant);
      var varfile;
      switch(variant) {
          case 0:
              varfile = 'pulm.json';
              break;
          case 1:
              varfile = 'ibs.json';
              break;
          case 2:
              varfile = 'gbreum.json';
              break;
          case 3:
              varfile = 'klsn.json';
              break;
          case 4:
              varfile = 'gdcp.json';
              break;
          case 5:
              varfile = 'hep.json';
              break;
          case 6:
              varfile = 'nephr.json';
              break;
      }
      var xhr = new XMLHttpRequest();
      var xhrre;
      xhr.open('GET', varfile, false);
      xhr.send();
      if (xhr.status != 200) {
        test = tests.tests;
        alert( 'Нажми для продолжения' ); // пример вывода: 404: Not Found
      } else {
        xhrre = JSON.parse(xhr.responseText);
        test = xhrre.tests;
      }
      if (document.querySelector(".checkbox").checked === true) {
      test = shuffle(test);
      }
      amountTest = 50;
      iterGlobal = 0;
      exit = 0;
      key = [];
      selected = [];
      right = 0;
      wrongAnswers = [];
      document.querySelector(".button").removeEventListener("click", startQuiz);
      newQuestion();
      startTimer();
  }
  function newQuestion() {
      drawStatus();
      while (document.querySelector('.answers').hasChildNodes()) {
          document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
      } // Очищаем предыдущие варианты	
      currentQuestion = test[iterGlobal]; // Текущий вопрос
      key = getKey(currentQuestion.rA.length, currentQuestion.wA.length); // Ключ к вопросу
      drawQuestion(currentQuestion, key);
  
      document.querySelector(".button").innerHTML = "ПОДТВЕРДИТЬ";
      document.querySelector(".button").addEventListener("click", compare);
      document.querySelector(".button").removeEventListener("click", newQuestion);
      if (document.querySelector(".select").getAttribute('hidden') == null) document.querySelector(".select").setAttribute('hidden', 'true');
  
  }
  function compare() {
      for (var i= 0; i < key.length; i++) {
          if (key[i] == 1) {
              document.getElementById(i + 1).className += " answers__answer_right";
          }
      }
      if (key.join(";") == selected.join(";")) {
          right++;
      } else {
          wrongAnswers.push(iterGlobal);
      }
      iterGlobal++;
        if (iterGlobal < amountTest) {
           document.querySelector(".button").innerHTML = "ДАЛЕЕ";
           document.querySelector(".button").addEventListener("click", newQuestion);
           document.querySelector(".button").removeEventListener("click", compare);
      } else {
          document.querySelector(".button").innerHTML = "ЗАКОНЧИТЬ";
           document.querySelector(".button").addEventListener("click", drawEnd);
            document.querySelector(".button").addEventListener("click", drawStatus);
           document.querySelector(".button").removeEventListener("click", compare);
      }
  }
  
  function drawStatus() {
      var iter = iterGlobal + 1;
      if (iterGlobal == amountTest) iter = iterGlobal;
      var accuracy = right * 100 / iterGlobal;
      if (right == 0) {
          accuracy = 0;
      }
      var wrong = iterGlobal - right;
      document.querySelector(".status__index").innerHTML = iter + " / " + amountTest;
      document.querySelector(".status__accuracy").innerHTML = Math.round(accuracy) + "% | " + wrong + " неверно";
  }
  
  
  function drawQuestion(currentQuestion, key) {
      document.querySelector('.question__name').innerHTML = currentQuestion.qName;
      rA = shuffle(currentQuestion.rA);
      rAi = 0;
      wA = shuffle(currentQuestion.wA);
      wAi = 0;
      selected = [];
      amountAnswers = rA.length + wA.length;
      for (var i = 0; i < amountAnswers; i++) {
          if (key[i] == 0) {
              var answer = document.createElement('div');
              answer.className = "answers__answer answers__answer_unselected";
              answer.id = i + 1;
              answer.innerHTML = wA[wAi];
              wAi++;
              document.querySelector('.answers').appendChild(answer);
              document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
              selected.push(0);
          } else {
              var answer = document.createElement('div');
              answer.className = "answers__answer answers__answer_unselected";
              answer.id = i + 1;
              answer.innerHTML = rA[rAi];
              rAi++;
              document.querySelector('.answers').appendChild(answer);
              document.querySelector('.answers').lastChild.addEventListener("click", getSelected);	
              selected.push(0);		
          }
      }
  }
  
  function drawEnd() {
      stopTimer();
      while (document.querySelector('.answers').hasChildNodes()) {
      document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
      }
      document.querySelector(".button").setAttribute('hidden', 'true');
      document.querySelector('.question__name').innerHTML = "РЕЗУЛЬТАТ";
      document.querySelector(".result").removeAttribute('hidden');
      document.querySelector(".bblock").removeAttribute('hidden');
      document.querySelector(".bblcok__button1").addEventListener("click", function() {window.location.href = "index.html"});
      document.querySelector(".bblcok__button3").addEventListener("click", function() {window.location.reload(false) });
      var accuracy = right * 100 / iterGlobal;
      document.querySelector('.result').innerHTML = Math.round(accuracy) + "%";
      if (wrongAnswers.length > 0) {
          document.querySelector(".bblcok__button2").addEventListener("click", reMatch);
      } else {
          document.querySelector(".bblcok__button2").className += " bblcok__button2_inactive";
      }
  }
  
  function reMatch() {
      startTimer();
      var newTest = [];
      for (var i=0; i < wrongAnswers.length; i++) {
          var iTest = wrongAnswers[i];
          newTest.push(test[iTest]);
      }
      test = newTest;
      iterGlobal = 0;
      amountTest = 50;
      right = 0;
      key = [];
      selected = [];
      wrongAnswers = [];
      document.querySelector(".button").removeAttribute('hidden', 'true');
      document.querySelector(".result").setAttribute('hidden', 'true');
      document.querySelector(".bblock").setAttribute('hidden', 'true');
       document.querySelector(".button").removeEventListener("click", drawEnd);
       document.querySelector(".bblcok__button2").removeEventListener("click", reMatch);
      newQuestion();
  }
  function getSelected(elem) {
      selected[elem.target.id - 1] = 1;
      elem.target.className = "answers__answer answers__answer_selected";
      elem.target.removeEventListener("click", getSelected);
      elem.target.addEventListener("click", getUnSelected);
  }
  function getUnSelected(elem) {
      selected[elem.target.id - 1] = 0;
      elem.target.className = "answers__answer answers__answer_unselected";
      elem.target.removeEventListener("click", getUnSelected);
      elem.target.addEventListener("click", getSelected);
  }
  var timer;
  function startTimer() {
      if (timer) clearInterval(timer);
      secs = 0;
      min = 0;
      document.querySelector('.status__time').innerHTML = min + ":0" + secs;
      timer = setInterval(
          function () {
              secs++;
              if (secs == 60) {
                  secs = 0;
                  min++;
              }
              if (secs < 10) {
                  document.querySelector('.status__time').innerHTML = min + ":0" + secs;
              } else {
                  document.querySelector('.status__time').innerHTML = min + ":" + secs;
              }
          },
          1000
      );
  }
  function stopTimer() {
      if (timer) clearInterval(timer); 	
  }
  function shuffle(array) {
    var currentIndex = array.length, temporaryValue, randomIndex;
  
    // While there remain elements to shuffle...
    while (0 !== currentIndex) {
  
      // Pick a remaining element...
      randomIndex = Math.floor(Math.random() * currentIndex);
      currentIndex -= 1;
  
      // And swap it with the current element.
      temporaryValue = array[currentIndex];
      array[currentIndex] = array[randomIndex];
      array[randomIndex] = temporaryValue;
    }
  
    return array;
  }
  function getKey(rAL, wAL) {
      arr = [];
      for (rAL; rAL > 0; rAL--) {
          arr.push(1);
      }
      for (wAL; wAL > 0; wAL--) {
          arr.push(0);
      }
      shuffle(arr);
      return(arr);
  }
  /*
  function newQuestion(i) {
      var currentTest = test[i];
      var amountAnswers = currentTest.rA.length + currentTest.wA.length;
      var key = getKey(currentTest.rA.length, currentTest.wA.length);
      var iterKey = 0;
      var iterWA = 0;
      var iterRA = 0;
      var allAnswers = [];
      for (iterKey; iterKey < amountAnswers; iterKey++) {
          if (key[iterKey] == 0) {
              allAnswers.push(currentTest.wA[iterWA]);
              iterWA++;
          } else {
              allAnswers.push(currentTest.rA[iterRA]);
              iterRA++;
          }
      }
      document.querySelector('.question__name').innerHTML = currentTest.qName;
      var amountAnswersIter = amountAnswers;
      var iter = 0;
      while (document.querySelector('.answers').hasChildNodes()) {
          document.querySelector('.answers').removeChild(document.querySelector('.answers').lastChild);
      }	
      for (amountAnswersIter; amountAnswersIter > 0; amountAnswersIter--) {
          var answer = document.createElement('div');
          answer.className = "answers__answer answers__answer_unselected";
          answer.id = iter + 1;
          answer.innerHTML = allAnswers[iter];
          document.querySelector('.answers').appendChild(answer);
          document.querySelector('.answers').lastChild.addEventListener("click", getSelected);
          selected.push(0);
          iter++;
      }
      iter = 0;
      function compare(elem) {
          var iter = 0;
          console.log(key);
          for (iter; iter < key.length; iter++) {
              if (key[iter] == 1) {
                  console.log(iter);
                  document.getElementById(iter + 1).className += " answers__answer_right";
              }
          }
          if (selected == key) right++;
          elem.toElement.removeEventListener("click", compare);
          elem.toElement.addEventListener("click", goToNext);	
          elem.toElement.innerHTML = "ДАЛЕЕ";
      }
      function goToNext(elem) {
      newQuestion(2)
      elem.toElement.removeEventListener("click", goToNext);
      elem.toElement.addEventListener("click", compare);
      elem.toElement.innerHTML = "ПОДТВЕРДИТЬ";
      }
      document.querySelector('.button').addEventListener("click", compare);
  
  }
  newQuestion(1)
  function getSelected(elem) {
      selected[elem.toElement.id - 1] = 1;
      console.log(selected);
      elem.toElement.className = "answers__answer answers__answer_selected";
      elem.toElement.removeEventListener("click", getSelected);
      elem.toElement.addEventListener("click", getUnSelected);
  }
  function getUnSelected(elem) {
      selected[elem.toElement.id - 1] = 0;
      console.log(selected);
      elem.toElement.className = "answers__answer answers__answer_unselected";
      elem.toElement.removeEventListener("click", getUnSelected);
      elem.toElement.addEventListener("click", getSelected);
  }
  */
  